{
  "title": "تحليل التباين المشروط (ANCOVA)",
  "navigation": "تحليل التباين المشروط",
  "response": "المتغير التابع",
  "Fixed": "عامل ثابت",
  "Block": "متغير مصاحب",
  "Summary": "ملخص النموذج",
  "Scatter_plot": "مخطط مبعثر لكل مستوى من مستويات المتغير العامل",
  "Residual": "مخطط المتبقيات مقابل القيم المتوقعة",
  "Histogram": "مخطط هيستوجرام للمتبقيات",
  "help": {
    "title": "تحليل التباين المشروط (ANCOVA)",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>الوصف</b></br>\nتحليل التباين المشروط (ANCOVA) يجمع بين ميزات كل من ANOVA والانحدار. إنه يعزز نموذج ANOVA بواحد أو أكثر من المتغيرات الكمية الإضافية، والتي تُسمى المتغيرات المصاحبة، والتي ترتبط بالمتغير التابع. يتم تضمين المتغيرات المصاحبة لتقليل التباين في مصطلحات الخطأ وتوفير قياس أكثر دقة لتأثيرات العلاج.</br> يتم استخدام ANCOVA لاختبار التأثيرات الرئيسية والتفاعلية للعوامل، مع التحكم في تأثيرات المتغير المصاحب.</br>\nنقوم أولاً بإنشاء جدول Anova مع مصطلح التفاعل. الهدف هو فحص ما إذا كان مصطلح التفاعل غير مهم، أي أن انحدارات المتغير التابع مقابل المتغير المصاحب لكل مستوى من مستويات العامل الثابت ليست مختلفة. نستخدم حزمة Anova في حزمة car لإنشاء هذا الجدول.</br>\nثم نقوم بإعادة إنشاء جدول Anova مع التحكم في مصطلح التفاعل لتحديد ما إذا كانت التقاطعات للمتغير التابع مقابل المتغير المصاحب لكل مستوى من مستويات العامل الثابت مختلفة.</br> \nنقدم الخيار لإنشاء مخطط مبعثر للمتغير التابع مقابل المتغير المصاحب لكل مستوى من مستويات العامل الثابت.</br>\nنقدم الخيار لرسم المتبقيات مقابل المخطط الملائم للنموذج حيث قمنا بالتحكم في مصطلح التفاعل. يجب أن تكون المتبقيات غير متحيزة ومتجانسة.</br>\nنقدم الخيار لإنشاء هيستوجرام للمتبقيات للنموذج حيث قمنا بالتحكم في مصطلح التفاعل. (يجب أن يكون التوزيع تقريبًا طبيعيًا).</br>\nنقدم لك الخيار لتلخيص النموذج</br>\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nlm(formula, data)\n</code> <br/>\n<b>المتغيرات</b><br/>\n<ul>\n<li>\nformula: كائن من فئة \"formula\" (أو واحد يمكن تحويله إلى تلك الفئة): وصف رمزي للنموذج الذي سيتم ملاءمته. يتم إعطاء تفاصيل تحديد النموذج تحت ‘التفاصيل’.\n</li>\n<li>\ndata: إطار بيانات اختياري، قائمة أو بيئة (أو كائن يمكن تحويله بواسطة as.data.frame إلى إطار بيانات) يحتوي على المتغيرات في النموذج. إذا لم يتم العثور عليها في البيانات، يتم أخذ المتغيرات من البيئة(formula)، عادةً البيئة التي تم استدعاء lm منها.\n</li>\n</ul>\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nAnova(mod, , type=c(\"II\"))\n</code> <br/>\n<b>المتغيرات</b><br/>\n<ul>\n<li>\nmod :lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm، أو كائن نموذج مناسب آخر.​\n</li>\n<li>\ntype: نوع الاختبار، \"II\"، \"III\"، 2، أو 3.\n</li>\n</ul>\n<b>الحزمة</b></br>\nAnova</br>\n<b>المساعدة</b></br>\nhelp(Anova, package ='car')\n    "
  }
}