{
  "title": "اختبار ANOVA ونسبة الاحتمالات",
  "navigation": "اختبار ANOVA ونسبة الاحتمالات",
  "label1": "يتم إجراء ANOVA للنماذج ذات الفئات التالية (فئات R بين قوسين) النماذج الخطية (lm)، النماذج الخطية المعممة (glm)، نموذج السجل السلبي الخطي (negbin)، نموذج خطي باستخدام المربعات الصغرى المعممة (gls)، نموذج الانحدار البقائي (survreg)، نموذج المخاطر النسبية (coxph)، الانحدار Loess (loess)",
  "label2": "**ملاحظة: اختبار الاحتمالات غير مدعوم للنماذج التي تم إنشاؤها عبر ضبط النموذج (فئة train)،",
  "modelselector1": "اختر نموذجًا",
  "help": {
    "title": "اختبار ANOVA ونسبة الاحتمالات",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>الوصف</b></br>\nجداول ANOVA: تحسب جداول تحليل التباين وتقوم بإجراء اختبارات نسبة الاحتمالات لكائن نموذج ملائم. بالنسبة للنماذج ذات التأثيرات المختلطة، يتم عرض جدول مشابه لـ ANOVA للتأثيرات العشوائية. \n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nobject: كائن يحتوي على النتائج التي تم إرجاعها بواسطة دالة ملائمة النموذج (مثل lm أو glm).\n</li>\n</ul>\n<b>القيمة</b><br/>\nترجع هذه الدالة (العامة) كائنًا من فئة anova. تمثل هذه الكائنات جداول تحليل التباين وتحليل الانحراف. عند إعطائها حجة واحدة، تنتج جدولًا يختبر ما إذا كانت مصطلحات النموذج ذات دلالة. عند إعطائها تسلسل من الكائنات، تختبر anova النماذج ضد بعضها البعض بالترتيب المحدد.<br/>\nتقوم طريقة الطباعة لكائنات anova بطباعة الجداول بشكل \"جميل\".<br/>\n<b>تحذير</b><br/>\nستكون المقارنة بين نموذجين أو أكثر صالحة فقط إذا تم ملاءمتها لنفس مجموعة البيانات. قد تكون هذه مشكلة إذا كانت هناك قيم مفقودة وتم استخدام الإعداد الافتراضي لـ R na.action = na.omit.<br/>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي في محرر بناء جملة R help(anova,package='stats')</br></br>\n<b>الوصف</b></br>\nاختبار نسبة الاحتمالات للنماذج المتداخلة: lrtest هي دالة عامة لإجراء اختبارات نسبة الاحتمالات. يمكن استخدام الطريقة الافتراضية لمقارنة النماذج الخطية المتداخلة (المعممة) (انظر التفاصيل أدناه).\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## الطريقة الافتراضية S3:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## طريقة S3 لفئة 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nobject: كائن. انظر أدناه للحصول على التفاصيل.\n</li>\n<li>\n...: مزيد من مواصفات الكائنات المرسلة إلى الطرق. انظر أدناه للحصول على التفاصيل.\n</li>\n<li>\nname: دالة لاستخراج اسم/وصف مناسب من كائن نموذج ملائم. بشكل افتراضي، يتم استعلام الاسم عن طريق استدعاء الصيغة.\n</li>\n<li>\ndata: إطار بيانات يحتوي على المتغيرات في النموذج.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nlrtest تهدف إلى أن تكون دالة عامة لمقارنات النماذج عبر اختبارات نسبة الاحتمالات التقريبية. تقارن الطريقة الافتراضية بشكل متتالي كائن النموذج الملائم مع النماذج المرسلة في .... بدلاً من تمرير كائنات النموذج الملائمة في ...، يمكن أن تكون هناك عدة مواصفات أخرى ممكنة. آلية التحديث هي نفسها بالنسبة لـ waldtest: يمكن تحديد النماذج في ... كأعداد صحيحة، أو أحرف (كلاهما للمصطلحات التي يجب إزالتها من النموذج السابق)، أو صيغ التحديث أو كائنات النموذج الملائم. باستثناء الحالة الأخيرة، يُفترض وجود طريقة تحديث. انظر waldtest للحصول على التفاصيل.<br/>\nبعد ذلك، يتم إجراء اختبار نسبة الاحتمالات التقريبية لكل نموذجين متتاليين: يتم مقارنة مرتين الفرق في لوغاريتم الاحتمالات (كما تم اشتقاقه بواسطة طرق logLik) مع توزيع كاي-تربيع.<br/>\nتقوم طريقة \"الصيغة\" بملاءمة lm أولاً ثم تستدعي الطريقة الافتراضية.<br/>\n<b>القيمة</b><br/>\nكائن من فئة \"anova\" يحتوي على لوغاريتم الاحتمالات، ودرجات الحرية، والفرق في درجات الحرية، وإحصائية كاي-تربيع لنسبة الاحتمالات والقيمة p المقابلة.\n<b>أمثلة</b><br/>\n<code> \n## مع بيانات من Greene (1993):<br/>\n## تحميل البيانات وحساب التأخيرات<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## مواصفات مختلفة مكافئة لاختبار LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>الوصف</b></br>\nجدول مشابه لـ ANOVA للتأثيرات العشوائية: احسب جدولًا مشابهًا لـ ANOVA مع اختبارات لمصطلحات التأثيرات العشوائية في النموذج. يتم تقليل أو إزالة كل مصطلح تأثير عشوائي وتقديم اختبارات نسبة الاحتمالات لتقليل النموذج في شكل مشابه لـ drop1. rand هو اسم مستعار لـ ranova.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nmodel: نموذج تأثير مختلط خطي تم ملاءمته باستخدام lmer() (يرث من فئة lmerMod).\n</li>\n<li>\nreduce.terms: إذا كانت TRUE (افتراضي)، يتم تقليل مصطلحات التأثيرات العشوائية (إذا كان ذلك ممكنًا). إذا كانت FALSE، تتم إزالة مصطلحات التأثيرات العشوائية ببساطة.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nإذا تم ملاءمة النموذج باستخدام REML، فإن الاختبارات هي اختبارات نسبة الاحتمالات REML.<br/>\nيتم تقليل مصطلح تأثير عشوائي من الشكل (f1 + f2 | gr) إلى مصطلحات من الشكل (f2 | gr) و(f1 | gr) ويتم مقارنة هذه النماذج المخفضة مع النموذج الأصلي. إذا كانت reduce.terms FALSE، يتم إزالة (f1 + f2 | gr) بدلاً من ذلك.<br/>\nيتم تقليل مصطلح تأثير عشوائي من الشكل (f1 | gr) إلى (1 | gr) (ما لم تكن reduce.terms FALSE).<br/>\nلا يتم تقليل مصطلح تأثير عشوائي من الشكل (1 | gr) ولكن يتم إزالته ببساطة.<br/>\nيتم تقليل مصطلح تأثير عشوائي من الشكل (0 + f1 | gr) أو (-1 + f1 | gr) (إذا كانت reduce.terms = TRUE) إلى (1 | gr).<br/>\nيتم توسيع مصطلح تأثير عشوائي من الشكل (1 | gr1/gr2) تلقائيًا إلى مصطلحين: (1 | gr2:gr1) و(1 | gr1) باستخدام findbars.<br/>\nفي هذا العرض، لا يهم ما إذا كانت f1 و f2 عوامل أو متغيرات مستمرة.<br/>\n<b>القيمة</b><br/>\nجدول مشابه لـ ANOVA مع حذف مصطلح واحد من التأثيرات العشوائية يرث من فئة anova وإطار بيانات مع الأعمدة:</br>\nnpar: عدد معلمات النموذج.</br>\nlogLik: لوغاريتم الاحتمالات للنموذج. لاحظ أن هذا هو logLik REML إذا تم ملاءمة النموذج باستخدام REML.</br>\nAIC: AIC للنموذج يتم تقييمه كـ -2*(logLik - npar). كلما كان أصغر كان أفضل.</br>\nLRT: إحصائية اختبار نسبة الاحتمالات؛ مرتين الفرق في لوغاريتم الاحتمالات، والذي يتوزع تقريبًا كاي-تربيع.</br>\nDf: درجات الحرية لاختبار نسبة الاحتمالات: الفرق في عدد معلمات النموذج.</br>\nPr(>Chisq) :القيمة p.</br>\n<b>تحذير</b></br>\nفي بعض الحالات، قد يتم توليد اختبارات للنماذج غير المتداخلة. مثال على ذلك هو عندما يتم تقليل (0 + poly(x, 2) | gr) (الافتراضي) إلى (1 | gr). وفقًا لأفضل معرفتنا، يتم توليد مقارنات للنماذج غير المتداخلة فقط في الحالات التي تكون فيها إحصائيًا هراء على أي حال (مثل هذا المثال حيث يتم قمع التقاطع العشوائي).</br>\nملاحظة: لاحظ أن anova يمكن استخدامها لمقارنة نموذجين وغالبًا ما ستكون قادرة على إنتاج نفس الاختبارات مثل ranova. ومع ذلك، فإن هذا ليس دائمًا هو الحال كما هو موضح في الأمثلة.</br>\n<b>أمثلة</b><br/>\n<code> \n# اختبار تقليل (Days | Subject) إلى (1 | Subject):<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # اختبار 2 df<br/>\n# يمكن أيضًا تحقيق هذا الاختبار باستخدام anova():<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# توضيح حجة reduce.test:<br/>\n# اختبار إزالة (Days | Subject):<br/>\nranova(fm1, reduce.terms = FALSE) # اختبار 3 df<br/>\n# إحصائية اختبار نسبة الاحتمالات في هذه الحالة:<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() ليست دائمًا قادرة على إجراء نفس الاختبارات مثل ranova(),<br/>\n# على سبيل المثال:<br/>\nanova(fm1, fm3, refit=FALSE) # يقارن REML مع ML ويجب عدم استخدامه<br/>\nanova(fm1, fm3, refit=TRUE) # هو اختبار لملاءمات ML وليس ما نسعى إليه<br/>\n# لاحظ أيضًا أن lmer-fit يحتاج إلى أن يأتي أولاً - ليس an lm-fit:<br/>\n# anova(fm3, fm1) # لا يعمل ويعطي خطأ<br/>\n# قد لا تولد ranova() جميع الاختبارات ذات الصلة:<br/>\n# بالنسبة للنموذج التالي، تشير ranova() إلى أنه يجب علينا عدم التقليل<br/>\n# (TVset | Assessor):\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Assessor), data=TVbo)<br/>\nranova(fm)<br/>\n# ومع ذلك، فإن النموذج الأكثر ملاءمة هو:<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Assessor), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm و fm2 لهما في الأساس نفس الملاءمة للبيانات ولكن fm يستخدم 5 معلمات أكثر من fm.<br/>\n</code> <br/>\n<b>الحزمة</b></br>\nlmerTest</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي في محرر بناء جملة R help(ranova, package ='lmerTest')\n                "
  }
}