{
  "title": "ANOVA، طريقة واحدة مع كتل",
  "navigation": "ANOVA، 1 طريقة مع كتل",
  "tvarbox1": "متغير الاستجابة (واحد)",
  "tvarbox2": "أثر ثابت",
  "blockVar": "متغير (متغيرات) الحجب",
  "chk1": "مخطط توزيع البقايا",
  "chk2": "تحليل ما بعد hoc",
  "help": {
    "title": "ANOVA، طريقة واحدة مع كتل",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>الوصف</b></br>\nجداول ANOVA لنماذج إحصائية متنوعة​\nتحسب جداول تحليل التباين من النوع الثاني أو الثالث لأجسام النموذج التي تنتجها lm و glm و multinom (في حزمة nnet) و polr (في حزمة MASS) و coxph (في حزمة البقاء) و coxme (في حزمة coxme) و svyglm (في حزمة المسح) و rlm (في حزمة MASS) و lmer في حزمة lme4 و lme في حزمة nlme، و (بواسطة الطريقة الافتراضية) لمعظم النماذج التي تحتوي على متنبئ خطي ومعاملات طبيعية تقريبا (انظر التفاصيل أدناه). بالنسبة للنماذج الخطية، يتم حساب اختبارات F؛ بالنسبة للنماذج الخطية العامة، يتم حساب نسبة الاحتمالات، واختبارات كاي-تربيع و F؛ بالنسبة لنماذج اللوجيت المتعددة ونماذج اللوجيت ذات الأرجحية النسبية، يتم حساب اختبارات نسبة الاحتمالات. يتم توفير إحصائيات اختبار متنوعة للنماذج الخطية المتعددة التي تنتجها lm أو manova. يتم توفير اختبارات نسبة الاحتمالات الجزئية أو اختبارات وولد لنماذج كوك. يتم توفير اختبارات كاي-تربيع وولد للأثر الثابت في نماذج التأثيرات المختلطة الخطية والعامة. يتم توفير اختبارات كاي-تربيع أو F في الحالة الافتراضية.​\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nmod: lm، aov، glm، multinom، polr mlm، coxph، coxme، lme، mer، merMod، svyglm، rlm، أو أي جسم نموذج مناسب آخر.​\n</li>\n<li>\ntype: نوع الاختبار، \"II\"، \"III\"، 2، أو 3.​\n</li>\n</ul>\n<b>التفاصيل</b></br>\nالتسميات \"النوع الثاني\" و \"النوع الثالث\" مأخوذة من SAS، لكن التعريفات المستخدمة هنا لا تتوافق بدقة مع تلك المستخدمة من قبل SAS. يتم حساب اختبارات النوع الثاني وفقًا لمبدأ الهامشية، حيث يتم اختبار كل مصطلح بعد جميع الآخرين، باستثناء تجاهل الأقارب من الدرجة الأعلى للمصطلح؛ اختبارات النوع الثالث تنتهك الهامشية، حيث يتم اختبار كل مصطلح في النموذج بعد جميع الآخرين. يتوافق هذا التعريف لاختبارات النوع الثاني مع الاختبارات التي تنتجها SAS لنماذج تحليل التباين، حيث تكون جميع المتنبئات عوامل، ولكن ليس بشكل عام (أي، عندما تكون هناك متنبئات كمية). كن حذرًا جدًا في صياغة النموذج لاختبارات النوع الثالث، أو لن تكون الفرضيات المختبرة منطقية.​</br>\nكما تم تنفيذها هنا، تعتبر اختبارات وولد من النوع الثاني تعميمًا للفرضيات الخطية المستخدمة لتوليد هذه الاختبارات في النماذج الخطية.​</br>\nللاختبارات الخاصة بالنماذج الخطية، والنماذج الخطية المتعددة، واختبارات وولد للنماذج الخطية العامة، ونماذج كوك، والنماذج المختلطة، والنماذج الخطية العامة الملائمة لبيانات المسح، وفي الحالة الافتراضية، تجد Anova إحصائيات الاختبار دون إعادة ضبط النموذج. ببساطة تستدعي طريقة svyglm الطريقة الافتراضية وبالتالي يمكن أن تأخذ نفس المعلمات.​</br>\n<b>القيمة</b><br/>\nكائن من فئة \"anova\"، أو \"Anova.mlm\"، والذي عادة ما يتم طباعته. بالنسبة لكائنات فئة \"Anova.mlm\"، هناك أيضًا طريقة ملخص، والتي توفر المزيد من التفاصيل عن MANOVA، بما في ذلك اختبارات F التقليدية للنماذج المختلطة مع تصحيحات Greenhouse-Geisser و Huynh-Feldt.​​</br>\n<b>الحزمة</b></br>\nAnova</br>\n<b>المساعدة</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>الوصف</b></br>\nاختبارات فصل المتوسطات بعد hoc. لإجراء اختبارات فصل المتوسطات بعد hoc لكل متغير عامل رئيسي سنستخدم حزمة emmeans. النموذج الخطي الذي يتم النظر فيه يسمى النموذج، الذي تم إنشاؤه بواسطة وظيفة lm أعلاه.  \n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>الحزمة</b></br>\nFSA؛ car؛ emmeans؛ ggplot2؛ multcomp</br>\n<b>المساعدة</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
  }
}