{
  "title": "ARIMA الآلي",
  "navigation": "ARIMA الآلي",
  "destination": "المتغير الذي سيتم التنبؤ به",
  "firstObservation": "وقت أول ملاحظة مثل 1: أدخل 1961,1 لشهر يناير 1961، مثل 2: أدخل 1961,3 للربع الثالث من 1961، مثل 3: أدخل 1 لسلسلة مستمرة",
  "frequency": "عدد الملاحظات لكل وحدة زمنية مثل 1: أدخل 12 لملاحظة واحدة لكل شهر من السنة، مثل 2: أدخل 4 لملاحظة واحدة لكل ربع، مثل 3: أدخل 1 لسلسلة مستمرة.",
  "criteria": "معايير النموذج",
  "label1": "الرسوم البيانية",
  "plotSeries": "رسم السلاسل",
  "yaxisLabel": "تسمية المحور Y",
  "mainTitle": "العنوان الرئيسي",
  "label2": "خيارات للقيم الملائمة",
  "saveFitted": "حفظ القيم الملائمة",
  "fittedValsDatasetName": "حدد اسم مجموعة البيانات لتخزين القيم الملائمة",
  "oriVsFitted": "رسم الأصلي مقابل الملائم",
  "plotResiduals": "رسم المتبقيات",
  "label3": "التنبؤ باستخدام النموذج",
  "predict": "قم بعمل تنبؤات باستخدام النموذج",
  "periodToPredict": "حدد عدد الفترات للتنبؤ",
  "confInterval": "حدد فترة الثقة بالنسب المئوية مثل 95 لـ 95%",
  "savePredictedVals": "حفظ القيم المتنبأ بها",
  "predictedValsDatasetName": "حدد اسم مجموعة البيانات لتخزين القيم المتنبأ بها",
  "plotPredicted": "رسم القيم المتنبأ بها",
  "correlogram": "إنشاء مصفوفة الارتباط",
  "maxlag": "أدخل الحد الأقصى للتأخير",
  "Boxtest": "اختبار Ljung-Box",
  "advanced_lbl": "متقدم",
  "help": {
    "title": "ARIMA الآلي",
    "r_help": "help(auto.arima, package=forecast)",
    "body": "\n            <b>الوصف</b></br>\nيعيد أفضل نموذج ARIMA وفقًا لقيمة AIC أو AICc أو BIC. تقوم الدالة بإجراء بحث عن النموذج الممكن ضمن قيود الترتيب المقدمة. تستدعي داخليًا auto.arima في حزمة التنبؤ\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nBSkyRes <-BSkyAutoArima (vars, start, frequency, main , ylab, ic, plotSeries=TRUE, plotResiduals=FALSE, predict=FALSE, savePredictedVals=FALSE, plotPredictedValues=FALSE, correlogram=FALSE, dataset)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nvars: المتغيرات المختارة لبناء نموذج ARIMA تلقائي.\n</li>\n<li>\nstart: يجب إدخال وقت أول ملاحظة بالتنسيق السنة،الشهر أو السنة،الربع مثل (إذا كانت بياناتك منظمة بالشهور 1992,1 لشهر يناير 1992 أو إذا كانت بياناتك منظمة بالأرباع فإن 1992,1 تشير إلى الربع الأول من 1992.\n</li>\n<li>\nfrequency: عدد الملاحظات في وحدة الزمن. مثال: للشهرية هناك 12 ملاحظة في السنة. للربع هناك 4 ملاحظات في السنة.\n</li>\n<li>\nic: معيار المعلومات الذي سيتم استخدامه في اختيار النموذج. يجب أن يكون واحدًا من \"aic\" أو \"aicc\" أو \"bic\"\n</li>\n<li>\nplotSeries: إذا كانت TRUE سيتم أيضًا إنشاء رسم بياني للسلاسل الزمنية.\n</li>\n<li>\nplotResiduals: إذا كانت TRUE سيتم أيضًا رسم المتبقيات.\n</li>\n<li>\npredict: إذا كانت TRUE سيتم أيضًا توليد القيم المتنبأ بها.\n</li>\n<li>\nsavePredictedVals: سيتم حفظ القيم المتنبأ بها.\n</li>\n<li>\nPlotPredictedValues: سيتم أيضًا رسم القيم المتنبأ بها.\n</li>\n<li>\ncorrelogram: إذا كانت TRUE سيتم إنشاء مصفوفة الارتباط.\n</li>\n<li>\nmain: العنوان الرئيسي للرسم\n</li>\n<li>\nylab: عنوان المحور Y\n</li>\n<li>\ndataset: اسم مجموعة البيانات التي تم اختيار المتغيرات منها.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nتم تصميم المعلمات الافتراضية لتقدير سريع للنماذج للعديد من السلاسل الزمنية. إذا كنت تحلل سلسلة زمنية واحدة فقط، ويمكنك تحمل بعض الوقت الإضافي، يُوصى بتعيين stepwise=FALSE و approximation=FALSE.</br>\nيمكن أن يكون الاختيار غير الخطوي بطيئًا، خاصة للبيانات الموسمية. يتم استخدام خوارزمية خطوة بخطوة كما هو موضح في Hyndman & Khandakar (2008) باستثناء أن الطريقة الافتراضية لاختيار الفروقات الموسمية تعتمد الآن على تقدير قوة الموسمية (Wang, Smith & Hyndman, 2006) بدلاً من اختبار Canova-Hansen. هناك أيضًا بعض التغييرات الطفيفة الأخرى على الخوارزمية الموضحة في Hyndman و Khandakar (2008).</br>\n<b>القيمة</b><br/>\nقائمة من فئة \"Arima\" مع المكونات:<br/>\ncoef: متجه من معاملات AR و MA والانحدار، والتي يمكن استخراجها بواسطة طريقة coef.<br/>\nsigma2: تقدير MLE لتباين الابتكارات.<br/>\nvar.coef: مصفوفة التباين المقدرة للمعاملات coef، والتي يمكن استخراجها بواسطة طريقة vcov.<br/>\nloglik: أقصى احتمال لوغاريتمي (للبيانات المفرقعة)، أو التقريب المستخدم.<br/>\narma: شكل مضغوط من المواصفات، كمتجه يعطي عدد معاملات AR و MA و AR الموسمية و MA الموسمية، بالإضافة إلى الفترة وعدد الفروقات غير الموسمية والموسمية.<br/>\naic: قيمة AIC المقابلة لاحتمال اللوغاريتمي. صالحة فقط للطريقة = \"ML\" fits.<br/>\nresiduals: الابتكارات الملائمة.<br/>\nseries: اسم السلسلة x.<br/>\ncode: قيمة التقارب التي تم إرجاعها بواسطة optim.<br/>\nn.cond\t: عدد الملاحظات الأولية غير المستخدمة في الملاءمة.<br/>\nnobs: عدد الملاحظات \"المستخدمة\" في الملاءمة، يمكن أيضًا استخراجها عبر nobs() وتستخدم بواسطة BIC.<br/>\nmodel: قائمة تمثل مرشح كالمان المستخدم في الملاءمة. انظر KalmanLike.<br/>\n<b>الحزمة</b></br>\nالتنبؤ</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي في محرر صيغة R help(auto.arima, package=forecast)\n\t\t\t"
  }
}