{
  "title": "BIC",
  "navigation": "BIC",
  "modelselector1": "اختر نموذجًا من الفئات التالية (الفئة بين قوسين) نموذج خطي (lm) نماذج خطية عامة (glm) انحدار لوجستي مرتب أو انحدار بروبيت (polr) نماذج لوج-خطية متعددة الحدود (multinom)",
  "help": {
    "title": "BIC",
    "r_help": "help(BIC,package='stats')",
    "body": "\n                <b>الوصف</b></br>\nدالة عامة تحسب معيار أكايكي 'معلومات معيار' لنموذج واحد أو عدة نماذج ملائمة يمكن الحصول على قيمة الاحتمالية اللوغاريتمية لها، وفقًا للصيغة -2*الاحتمالية اللوغاريتمية + k*npar، حيث تمثل npar عدد المعلمات في النموذج الملائم، و k = 2 لمعيار AIC المعتاد، أو k = log(n) (حيث n هو عدد الملاحظات) لما يسمى BIC أو SBC (معيار بايزيان لشوارز).\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nAIC(object, ..., k = 2)\nBIC(object, ...)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nobject: كائن نموذج ملائم يوجد له طريقة logLik لاستخراج الاحتمالية اللوغاريتمية المقابلة، أو كائن يرث من فئة logLik.\n</li>\n<li>\n... اختياريًا المزيد من كائنات النموذج الملائم.\n</li>\n<li>\nk: عدد، العقوبة لكل معلمة يجب استخدامها؛ القيمة الافتراضية k = 2 هي AIC الكلاسيكية.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nعند مقارنة النماذج الملائمة بواسطة الاحتمالية القصوى لنفس البيانات، كلما كانت AIC أو BIC أصغر، كانت الملاءمة أفضل.\nتتطلب نظرية AIC أن تكون الاحتمالية اللوغاريتمية قد تم تعظيمها: بينما يمكن حساب AIC للنماذج غير الملائمة بواسطة الاحتمالية القصوى، يجب عدم مقارنة قيم AIC الخاصة بها.</br>\nأمثلة على النماذج التي لم يتم 'تكييفها مع نفس البيانات' هي حيث يتم تحويل الاستجابة (تُركب نماذج الحياة المعجلة على الأوقات اللوغاريتمية) وحيث تم استخدام جداول الطوارئ لتلخيص البيانات.</br>\nهذه دوال عامة (مع تعريفات S4 العامة في حزمة stats4): ومع ذلك، يجب تعريف الطرق لوظيفة الاحتمالية اللوغاريتمية logLik بدلاً من هذه الدوال: الإجراء الخاص بأساليبها الافتراضية هو استدعاء logLik على جميع الكائنات المقدمة وتجميع النتائج. لاحظ أنه في عدة حالات شائعة، لا تعيد logLik القيمة عند MLE: انظر صفحة المساعدة الخاصة بها.</br>\nالاحتمالية اللوغاريتمية وبالتالي AIC/BIC محددة فقط حتى ثابت إضافي. تم استخدام ثوابت مختلفة تقليديًا لأغراض مختلفة، لذا قد تعطي extractAIC و AIC قيمًا مختلفة (وتفعل ذلك لنماذج من فئة \"lm\": انظر المساعدة لـ extractAIC). يلزم توخي الحذر الخاص عند مقارنة الملاءمات من فئات مختلفة (مع، على سبيل المثال، مقارنة GLM بواسون و غاما تكون بلا معنى حيث أن أحدهما لديه استجابة متقطعة، والآخر مستمر).</br>\nBIC محدد كـ AIC(object, ..., k = log(nobs(object))). هذا يحتاج إلى معرفة عدد الملاحظات: تبحث الطريقة الافتراضية أولاً عن سمة \"nobs\" على القيمة المرجعة من طريقة logLik، ثم تحاول النمط العام nobs، وإذا لم ينجح أي منهما، تعيد BIC كـ NA.</br>\n<b>القيمة</b><br/>\nإذا تم توفير كائن واحد فقط، قيمة عددية مع AIC المقابل (أو BIC، أو ...، اعتمادًا على k).\nإذا تم توفير كائنات متعددة، data.frame مع صفوف تتوافق مع الكائنات وأعمدة تمثل عدد المعلمات في النموذج (df) و AIC أو BIC.<br/>\n<b>أمثلة</b><br/>\n<code> \nlm1 <- lm(Fertility ~ . , data = swiss)</br>\nAIC(lm1)</br>\nstopifnot(all.equal(AIC(lm1),<br/>\n                    AIC(logLik(lm1))))<br/>\nBIC(lm1)</br>\nlm2 <- update(lm1, . ~ . -Examination)</br>\nAIC(lm1, lm2)</br>\nBIC(lm1, lm2)</br>\n</code> <br/>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي في محرر بناء جملة R help(BIC,package='stats')\n                "
  }
}