{
  "title": "اختبار القيم الشاذة بونفيروني",
  "navigation": "اختبار القيم الشاذة",
  "label1": "اختر نموذجًا من الفئات التالية (الفئة بين قوسين) - نموذج خطي (lm)، نموذج خطي عام (glm)",
  "modelselector1": "اختر نموذجًا",
  "help": {
    "title": "اختبار القيم الشاذة بونفيروني",
    "r_help": "help(outlierTest, package='car')",
    "body": "\n                <b>الوصف</b></br>\nتقارير القيم p بونفيروني لاختبار كل ملاحظة بالتتابع لتكون قيمة شاذة متوسطة، بناءً على المتبقيات المعادلة في النماذج الخطية (اختبارات t)، والنماذج الخطية العامة (اختبارات طبيعية)، والنماذج المختلطة الخطية.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## طريقة S3 لفئة 'lm'<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## طريقة S3 لفئة 'lmerMod'<br/>\noutlierTest(model, ...)<br/>\n## طريقة S3 لفئة 'outlierTest'<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>المعطيات</b><br/>\n<ul>\n<li>\nmodel: كائن نموذج lm أو glm أو lmerMod؛ طريقة \"lmerMod\" تستدعي طريقة \"lm\" ويمكن أن تأخذ نفس المعطيات.\n</li>\n<li>\ncutoff: الملاحظات التي تتجاوز قيم p بونفيروني الحد لا يتم الإبلاغ عنها، ما لم يتم ترشيح أي ملاحظات، وفي هذه الحالة يتم الإبلاغ عن الملاحظة ذات أكبر متبقي معادلة.\n</li>\n<li>\nn.max: الحد الأقصى لعدد الملاحظات للإبلاغ عنها (افتراضي، 10).\n</li>\n<li>\norder: هل يتم الإبلاغ عن المتبقيات المعادلة بترتيب تنازلي من حيث الحجم؟ (افتراضي، TRUE).\n</li>\n<li>\nlabels: متجه اختياري لأسماء الملاحظات.\n</li>\n<li>\n...: المعطيات المرسلة إلى وظائف الطرق.\n</li>\n<li>\nx: كائن outlierTest.\n</li>\n<li>\ndigits: عدد الأرقام للقيم p المبلغ عنها.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nبالنسبة لنموذج خطي، يتم استخدام قيم p المبلغ عنها باستخدام توزيع t مع درجات حرية أقل بمقدار واحد من درجات حرية المتبقي للنموذج. بالنسبة لنموذج خطي عام، يتم استناد قيم p إلى توزيع طبيعي قياسي. تعدل بونفيروني القيمة p الثنائية المعتادة بعدد الملاحظات. تعمل طريقة lm على كائنات glm. لإظهار جميع الملاحظات، قم بتعيين cutoff=Inf و n.max=Inf.<br/>\n<b>القيمة</b><br/>\nكائن من فئة outlierTest، والذي يتم طباعته عادةً.<br/>\n<b>أمثلة</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>الحزمة</b></br>\ncar</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العليا اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي في محرر صيغة R help(outlierTest, package=\"car\")\n                "
  }
}