{
  "title": "مخطط الصندوق مع تجميع متعدد المتغيرات",
  "navigation": "مخطط الصندوق، متعدد المتغيرات",
  "response": "المتغير المستخدم لمخطط الصندوق (متغير عددي)",
  "YaxisGroup": "متغير Y (فئة) لمتغير المحور Y",
  "XaxisGroup": "متغير X (فئة) لمتغير المحور X",
  "withinXaxisGroup": "واحد أو أكثر من المتغيرات الفئوية للتجميع لتجميع مخططات الصندوق داخل مجموعة المحور X",
  "connectMeanPointsChk": "ربط نقاط المتوسط",
  "showMinMaxNumberChk": "عرض القيمة الدنيا والقصوى لكل قيمة فئة على المحور Y في المخطط",
  "showMeanNumberChk": "عرض قيمة المتوسط في المخطط",
  "showMedianNumberChk": "عرض قيمة الوسيط في المخطط",
  "showQuantileNumberChk": "عرض قيمة الكوانتيل (Q1 و Q3) في المخطط",
  "showStatTableChk": "طباعة جميع الإحصائيات في جدول",
  "chartTitle": "أدخل عنوانًا",
  "x_title": "تسمية المحور X",
  "y_title": "تسمية المحور Y",
  "meanPointColor": "اختر لونًا لنقاط المتوسط (بعد اختيار اللون، انقر خارج التحكم لتطبيقه)",
  "meanPointSize": "حجم نقطة المتوسط (افتراضي = 1.15)",
  "boxPlotWidth": "عرض مخطط الصندوق العمودي (افتراضي = 0.4)",
  "factorLevelOccuranceOrderChk": "إعادة ترتيب جميع مستويات المتغير الفئوي حسب ترتيب حدوثها للرسم",
  "legends": "عرض الأساطير وإذا كان الأمر كذلك، موضع الأساطير (الافتراضي هو اليمين)",
  "help": {
    "title": "مخطط الصندوق مع تجميع خاص (متعدد المتغيرات)",
    "body": "\n\t\t\t\t<b>الوصف</b></br>\n\t\t\t\tتنظيم المجموعات الفرعية (أي مجموعة العينة) لتحليل قدرة العملية وتحليل المجموعات الفرعية الأخرى\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tتحليل مثل تحليل قدرة العملية يفترض أن البيانات تم إدخالها بالترتيب الذي تم جمعها به (ترتيب زمني). وهذا يعني أن جميع الملاحظات من نفس المجموعة الفرعية يجب أن تظهر في صفوف متتالية من مجموعة البيانات. عادةً ما يتم استخدام عمود معرف المجموعة الفرعية لتحديد الصفوف التي تنتمي إلى نفس المجموعة الفرعية.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tإذا لم يتم الوفاء بهذا الشرط (على سبيل المثال، إذا كانت الصفوف من نفس المجموعة الفرعية متفرقة في مجموعة البيانات وليست بجوار بعضها البعض)، فإن معرفات المجموعة الفرعية تحتاج إلى إعادة معايرة.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tإعادة المعايرة تعني:\n\t\t\t\t<br/>\n\t\t\t\tيتم تعيين رقم مجموعة فرعية جديدة كلما تغير معرف المجموعة الفرعية من صف إلى آخر.\n\t\t\t\t<br/>\n\t\t\t\tإذا ظهر نفس معرف المجموعة الفرعية لاحقًا ولكنه ليس مجاورًا لحدوثه السابق، فسيتم اعتباره مجموعة فرعية جديدة.\n\t\t\t\t<br/>\n\t\t\t\tبعبارة أخرى، تعتبر القيم المتطابقة التي تظهر بجوار بعضها البعض جزءًا من نفس المجموعة الفرعية فقط. سيتم تقسيم القيم المتطابقة التي تفصلها مجموعات فرعية أخرى إلى مجموعات فرعية منفصلة أثناء إعادة المعايرة.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tالمتغير المعاير لعدد العينات في مجموعة البيانات ضروري لأداء العديد من التحليلات مثل قدرة العملية، ومخططات شيوهارت مثل xbar، R، S، إلخ \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}