{
  "title": "مخطط الصندوق",
  "navigation": "مخطط الصندوق",
  "x": "المتغير X، حدد متغير الفئة",
  "y": "المتغير (المتغيرات) Y، حدد متغير رقمي (متغيرات)",
  "Fill": "حدد متغير المجموعة (الفئة)",
  "flipaxis": "عكس المحور",
  "dataPoints": "اختر خيارًا لرسم نقاط البيانات",
  "alpha": "الشفافية (0-1)",
  "notch": "شق",
  "outliers": "عرض القيم الشاذة (باللون الأحمر)",
  "barcolor": "اختر لونًا للخطوط حول الصناديق (بعد اختيار اللون، انقر خارج التحكم لتطبيق)",
  "showCountsChk": "عرض القيم على الصندوق (1Q، الوسيط، 3Q)",
  "drawSignificanceChk": "إضافة دلالة (قيم p) لمقارنة المتوسطات بين كل زوج من الصناديق (حدد الوجه لتجميع التحليل). بالنسبة لـ tukey_hsd و games_howell_test، تم تعديل قيم p بالفعل. يتم تجاهل طريقة تعديل قيمة p الإضافية.",
  "methodForMeanDiffSignificance": "طريقة الاختبار المستخدمة لمقارنة المتوسطات",
  "adjPvalue": "تعديل قيم p من مقارنة المتوسطات",
  "pValueFromatting": "تنسيق قيم p (الدلالة) المعروضة",
  "specify_a_title": "أدخل عنوانًا",
  "x_title": "تسمية المحور X",
  "y_title": "تسمية المحور Y",
  "legends": "عرض الأساطير وإذا كان الأمر كذلك، موضع الأساطير (الافتراضي هو اليمين)",
  "angleXaxis_text": "زاوية لإمالة قيم نص المحور x (الافتراضي 0 لعدم الإمالة)",
  "angleYaxis_text": "زاوية لإمالة قيم نص المحور y (الافتراضي 0 لعدم الإمالة)",
  "axisTickmarksCount": "عدد قيم المحور (أي علامات الت tick) التي سيتم عرضها (الافتراضي 10)",
  "positionJitterWidth": "انتشار نقاط الاهتزاز (اختر قيمة بين 0 إلى 1. الافتراضي هو 0.2)",
  "Facetrow": "صف الوجه",
  "Facetcolumn": "عمود الوجه",
  "Facetwrap": "لف الوجه (إذا تم اختياره، سيتم تجاهل أي اختيار لصف الوجه وعمود الوجه)",
  "Facetscale": "مقياس الوجه",
  "label1": "خطوط أفقية",
  "plotMeanLineChk": "رسم خط أفقي للوسيط للمتغير Y (الرقمي) المحدد",
  "yIntercept": "أدخل قيم التقاطع Y مفصولة بفواصل للخطوط الأفقية، مثل 100، 200، 300",
  "hLineColor": "اختر لونًا للخطوط و التسميات (بعد اختيار اللون، انقر خارج التحكم لتطبيق)",
  "lineType": "اختر نوع الخط",
  "horizontalLinelabel": "حدد تسميات مفصولة بفواصل (بدون اقتباسات محيطة) للخطوط الأفقية",
  "horizontalLinelabel_angle_text": "زاوية لإمالة نص تسمية الخط الأفقي (الافتراضي 0 لعدم الإمالة)",
  "label2": "ملاحظة: القيم الأكبر تحرك النص لأسفل، والقيم الأصغر تحرك النص لأعلى",
  "addHoriRefLines": "إضافة خطوط مرجعية",
  "xyLimits": "حدود المحورين X و Y",
  "label5": "حدد نطاقًا لقيم المحورين X و Y",
  "rangeYValues": "حدد نطاق المحور Y، على سبيل المثال 0،100",
  "labelHori_HorizontalJustification": "ملاحظة: القيم الأكبر تضع النص إلى اليسار، والقيم الأصغر تحرك النص إلى اليمين",
  "verticalJustification": "تحكم في التبرير العمودي للتسمية",
  "hori_HorizontalJustification": "تحكم في التبرير الأفقي للتسمية",
  "addlLabelHlineTextPositionOffset": "تعديلات إضافية لوضع نص التسمية للخطوط الأفقية",
  "horiMovementHReflineLabel": "تحريك النص أفقيًا لليسار أو اليمين - استخدم أي رقم مع علامة + أو - (اترك 0 لمحور الفئات)",
  "nobreaklineHRefLabelandValueChk": "حدد هذا المربع لإزالة فاصل السطر بين قيمة التسمية ونص التسمية",
  "vertiMovementHReflineLabel": "تحريك النص عموديًا لأعلى أو لأسفل - استخدم أي رقم مع علامة + أو - (اترك 0 لمحور الفئات)",
  "facets_lbl": "الوجوه",
  "help": {
    "title": "مخطط الصندوق",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>الوصف</b></br>\n        في الإحصاءات الوصفية، يعد مخطط الصندوق أو boxplot وسيلة مريحة لتصوير مجموعات من البيانات العددية من خلال أرباعها. قد تحتوي مخططات الصندوق أيضًا على خطوط تمتد عموديًا من الصناديق (الشعيرات) تشير إلى التباين خارج الأرباع العليا والسفلى، ومن ثم مصطلحات مخطط الصندوق والشعيرات. يمكن رسم القيم الشاذة كنقاط فردية. تكون مخططات الصندوق والشعيرات موحدة في استخدام الصندوق: الجزء السفلي والعلوي من الصندوق دائمًا هما الربع الأول والثالث، والشريط داخل الصندوق هو دائمًا الربع الثاني (الوسيط). تمتد الشعيرة العليا من المفصل إلى أعلى قيمة تكون ضمن 1.5 * IQR من المفصل، حيث IQR هو النطاق بين الربعين، أو المسافة بين الربع الأول والثالث. تمتد الشعيرة السفلى من المفصل إلى أدنى قيمة ضمن 1.5 * IQR من المفصل. البيانات التي تتجاوز نهاية الشعيرات هي قيم شاذة وترسم كنقاط (كما هو محدد بواسطة توكي).​</br>\n        يمكن إنشاء الوجوه اختياريًا عن طريق تحديد متغير عامل. يمكنك أيضًا تحديد السمات بشكل اختياري، وتحديد عنوان وتسميات للمحورين x و y​</br>\n        عند اختيار خيار رسم نقاط البيانات، نقوم بذلك باستخدام geom_dotplot</br>\n        بشكل افتراضي، يتم عرض القيم الشاذة بنقاط سوداء، عندما تختار خيار عرض القيم الشاذة (باللون الأحمر) عبر مربع الاختيار، تصبح القيم الشاذة أكثر بروزًا.\n        <br/>\n        <b>الاستخدام</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>المعلمات</b><br/>\n        <ul>\n        <li>\n        data: مجموعة البيانات الافتراضية​\n        </li>\n        <li>\n        x: متغير عامل/فئوي يحدد تجميع المتغير y​\n        </li>\n        <li>\n        y: متغير رقمي يتم حساب مخطط الصندوق له​\n        </li>\n        <li>\n        fill: متغير عامل/فئوي اختياري لمزيد من تجميع المجموعات الموجودة. سيتم عرض كل مجموعة فرعية بلون مميز.​\n        </li>\n        <li>\n        aes():    توليد تخطيطات جمالية تصف كيفية ربط المتغيرات في البيانات بالخصائص المرئية (الجماليات) لل geoms.​\n        </li>\n        <li>\n        geom_boxplot(): ينشئ مخطط الصندوق. تتوافق \"المفاصل\" العليا والسفلى مع الربعين الأول والثالث (النسب المئوية 25 و 75).​\n        </li>\n        <li>\n        geom_dotplot: يرسم نقاط البيانات\n        </li>\n        <li>\n        Labs(): تغيير تسميات المحاور وعناوين الأسطورة (هذا اختياري)​\n        </li>\n        <li>\n        facet_grid(): ترتيب الألواح في شبكة (هذا اختياري)​\n        </li>\n        <li>\n        theme_calc(): يحدد سمة الآلة الحاسبة (هذا اختياري)​\n        </li>\n        <li>\n        coord_flip(): عكس المحور (هذا اختياري)​\n        </li>\n        <li>\n        notch: تطبق مخططات الصندوق المشقوقة \"شقًا\" أو تضييقًا للصندوق حول الوسيط. تعتبر الشقوق مفيدة في تقديم دليل تقريبي على دلالة الفرق بين الوسيطين؛ إذا لم تتداخل الشقوق بين صندوقين، فإن هذا يقدم دليلًا على وجود فرق دال إحصائيًا بين الوسيطين. في مخطط صندوق مشقوق، تمتد الشقوق 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tإذا تم اختيار 'إضافة دلالة (قيم p) لمقارنة المتوسطات بين كل زوج من الصناديق'، فإن الرموز لقيم p على المخطط هي كما يلي\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tطرق تعديل قيمة P:\n\t\t<br/>\n\t\tتشمل طرق تعديل قيمة P تصحيح بونفيروني (\"bonferroni\") حيث يتم ضرب قيم p في عدد المقارنات. تشمل التصحيحات الأقل تحفظًا أيضًا من هولم (1979) (\"holm\")، هوشبرغ (1988) (\"hochberg\")، هوميل (1988) (\"hommel\")، بنجاميني وهوتشبرغ (1995) (\"BH\" أو مرادفها \"fdr\")، وبنجاميني ويكوتيلي (2001) (\"BY\")، على التوالي. كما تتضمن خيار تمرير (\"none\"). تحتوي مجموعة الطرق على متجه p.adjust.methods لفائدة الطرق التي تحتاج إلى أن تكون الطريقة كخيار وتمريرها إلى p.adjust.\n\t\t<br />\n\t\t<br />\n\t\tتم تصميم الطرق الأربعة الأولى لتوفير تحكم قوي في معدل الخطأ العائلي. لا يبدو أن هناك سببًا لاستخدام تصحيح بونفيروني غير المعدل لأنه يهيمن عليه طريقة هولم، والتي تكون أيضًا صالحة تحت افتراضات تعسفية.\n\t\t<br />\n\t\t<br />\n\t\tتكون طرق هوشبرغ وهوميل صالحة عندما تكون اختبارات الفرضيات مستقلة أو عندما تكون مرتبطة بشكل غير سلبي (ساركار، 1998؛ ساركار وتشانغ، 1997). تعتبر طريقة هوميل أكثر قوة من هوشبرغ، لكن الفرق عادة ما يكون صغيرًا وتكون قيم p من هوشبرغ أسرع في الحساب.\n\t\t<br />\n\t\t<br />\n\t\tتتحكم طرق \"BH\" (المعروفة أيضًا باسم \"fdr\") و\"BY\" لبنجاميني وهوتشبرغ ويكوتيلي في معدل الاكتشاف الكاذب، النسبة المتوقعة للاكتشافات الكاذبة بين الفرضيات المرفوضة. يعتبر معدل الاكتشاف الكاذب شرطًا أقل صرامة من معدل الخطأ العائلي، لذا فإن هذه الطرق أكثر قوة من الأخرى.\n\t\t<br />\n\t\t<br />\n\t\tانظر أيضًا \n\t\t<br />\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br />\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br />\n\t\t<br />\n        <b>الحزمة</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>المساعدة</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        انقر على زر مساعدة R للحصول على مساعدة مفصلة في R. يمكنك أيضًا إدخال help(geom_boxplot)، help(labs)، help(aes)، help(facet_grid)، help(theme_calc)، help(coord_flip)، help(geom_dotplot)\n        "
  }
}