{
  "title": "مخطط الصندوق",
  "dropna": "إزالة القيم المفقودة",
  "navigation": "مخطط الصندوق",
  "x": "المتغير X، حدد متغير عامل",
  "y": "المتغير(ات) Y، حدد متغير(ات) عددية",
  "fill": "التعبئة، حدد متغير عامل",
  "dataPoints": "اختر خيارًا لرسم نقاط البيانات",
  "alpha": "الشفافية (0-1)",
  "flip": "عكس المحور",
  "notch": "شق",
  "outliers": "عرض القيم الشاذة (بالأحمر)",
  "specify_a_title": "أدخل عنوانًا",
  "x_title": "تسمية المحور X",
  "y_title": "تسمية المحور Y",
  "barcolor": "اختر لونًا للخطوط حول الصناديق (بعد اختيار اللون، انقر خارج التحكم لتطبيق)",
  "Facetrow": "صف الوجه",
  "Facetcolumn": "عمود الوجه",
  "Facetwrap": "لف الوجه",
  "Facetscale": "مقياس الوجه",
  "facets_lbl": "الوجوه",
  "help": {
    "title": "مخطط الصندوق",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>الوصف</b></br>\n        في الإحصاءات الوصفية، يعد مخطط الصندوق أو boxplot وسيلة ملائمة لتمثيل مجموعات من البيانات العددية رسوميًا من خلال أرباعها. قد تحتوي مخططات الصندوق أيضًا على خطوط تمتد عموديًا من الصناديق (الشوارب) تشير إلى التباين خارج الأرباع العليا والسفلى، ومن هنا جاءت مصطلحات مخطط الصندوق والشوارب ومخطط الصندوق والشوارب. يمكن رسم القيم الشاذة كنقاط فردية. مخططات الصندوق والشوارب متسقة في استخدام الصندوق: الجزء السفلي والعلوي من الصندوق هما دائمًا الربع الأول والثالث، والشريط داخل الصندوق هو دائمًا الربع الثاني (الوسيط). يمتد الشارب العلوي من المفصل إلى أعلى قيمة تكون ضمن 1.5 * IQR من المفصل، حيث IQR هو النطاق بين الربعين، أو المسافة بين الربع الأول والثالث. يمتد الشارب السفلي من المفصل إلى أدنى قيمة ضمن 1.5 * IQR من المفصل. البيانات التي تتجاوز نهاية الشوارب هي قيم شاذة وترسم كنقاط (كما حددها توكي).​</br>\n        يمكن إنشاء الوجوه بشكل اختياري عن طريق تحديد متغير عامل. يمكنك أيضًا تحديد الموضوعات بشكل اختياري، وتحديد عنوان وتسميات للمحاور x و y​</br>\n        عند تحديد خيار رسم نقاط البيانات، نقوم بذلك باستخدام geom_dotplot</br>\n        بشكل افتراضي، يتم عرض القيم الشاذة بنقاط سوداء، وعند تحديد خيار عرض القيم الشاذة (بالأحمر) عبر مربع الاختيار، تصبح القيم الشاذة أكثر بروزًا.\n        <br/>\n        <b>الاستخدام</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>المعلمات</b><br/>\n        <ul>\n        <li>\n        data: مجموعة البيانات الافتراضية​\n        </li>\n        <li>\n        x: متغير عامل/فئوي يحدد تجميع المتغير y​\n        </li>\n        <li>\n        y: متغير عددي يتم حساب مخطط الصندوق له​\n        </li>\n        <li>\n        fill: متغير عامل/فئوي اختياري لمزيد من تجميع المجموعات الموجودة. سيتم عرض كل مجموعة فرعية بلون مميز.​\n        </li>\n        <li>\n        aes():    توليد خرائط جمالية تصف كيفية ربط المتغيرات في البيانات بالخصائص المرئية (الجمالية) للجيومات.​\n        </li>\n        <li>\n        geom_boxplot(): ينشئ مخطط الصندوق. \"المفاصل\" العليا والسفلى تتوافق مع الربع الأول والثالث (الـ 25 والـ 75 من المئة).​\n        </li>\n        <li>\n        geom_dotplot: يرسم نقاط البيانات\n        </li>\n        <li>\n        Labs(): تغيير تسميات المحاور وعناوين الأسطورة (هذا اختياري)​\n        </li>\n        <li>\n        facet_grid(): ترتيب الألواح في شبكة (هذا اختياري)​\n        </li>\n        <li>\n        theme_calc(): يحدد موضوع الآلة الحاسبة (هذا اختياري)​\n        </li>\n        <li>\n        coord_flip(): عكس المحور (هذا اختياري)​\n        </li>\n        <li>\n        notch: مخططات الصندوق المنقوشة تطبق \"شق\" أو تضييق الصندوق حول الوسيط. تعتبر الشقوق مفيدة في تقديم دليل تقريبي على أهمية الفرق بين الوسيطين؛ إذا لم تتداخل الشقوق لصندوقين، فإن ذلك يقدم دليلًا على وجود فرق ذو دلالة إحصائية بين الوسيطين. في مخطط صندوق منقوش، تمتد الشقوق بمقدار 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n        <b>الحزمة</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>المساعدة</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        انقر على زر مساعدة R للحصول على مساعدة مفصلة في R. يمكنك أيضًا إدخال help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}