{
  "title": "الاتفاق الفئوي",
  "navigation": "الاتفاق الفئوي",
  "ratervars": "متغيرات المقيم:",
  "cilevel": "مستوى الثقة:",
  "options": "متقدم",
  "categLabels": "حدد اختياريًا جميع التقييمات الممكنة مفصولة بـ ، على سبيل المثال 1،2،3،4،5 أو \"منخفض\"، \"متوسط\"، \"مرتفع\" ",
  "weightschkbox": "عرض أوزان الفئات",
  "weights": "اختر أوزان الفئات",
  "N": "حجم السكان المحدود (إن وجد)",
  "help": {
    "title": "الاتفاق الفئوي",
    "r_help": "help(fleiss.kappa.raw, package=irrCAC)",
    "body": "\n<b>الوصف</b></br>\nتحسب نسبة الاتفاق، كابا كونجر/كابا كوهين، كابا فليس، AC1/AC2 لجويت، ألفا كريبندورف، ومعامل برينان-بريدجر بين عدة مقيمين (2، 3، +) عندما تمثل بيانات الإدخال التقييمات الخام المبلغ عنها لكل موضوع ولكل مقيم. تتوفر نسخ غير موزونة وموزونة من هذه الإحصائيات، مع طرق وزن فئات مختلفة.</br>\nتُدرج القيم المفقودة في حسابات اتفاق الفرصة وفقًا لجويت (2014).</br>\nنحن نقدم أيضًا خيار عرض أوزان فئات التقييم.</br>\nلمزيد من المعلومات، انظر: </br></br>جويت، ك.ل. (2014، ISBN:978-0970806284). “دليل موثوقية المقيمين،” الطبعة الرابعة. التحليلات المتقدمة، LLC\n</br></br>كلين، د. (2018) doi:https://doi.org/10.1177/1536867X1801800408. “تنفيذ إطار عام لتقييم اتفاق المقيمين في ستاتا،” مجلة ستاتا المجلد 18، العدد 4، الصفحات 871-901.</br></br> \n<b>الاستخدام</b>\n<br/>\n<br/>\n<ul>\n<li>\n<b>متغيرات المقيم:</b>  المتغيرات التي تتوافق مع كل مقيم حيث يمثل كل عمود مقيمًا واحدًا ويمثل كل صف موضوعًا واحدًا. يمكن أن تكون متغيرات عددية أو عاملية أو ترتيبية أو حرفية.</br>\n</li>\n<li>\n<b>مستوى الثقة:</b>  مستوى الثقة المرتبط بفترة الثقة. القيمة الافتراضية لها هي 0.95.</br>\n</li>\n<li>\n<b>عرض أوزان الفئات:</b> يعرض الأوزان العددية لفئات المقيم وفقًا للأوزان المحددة. يجب أن تتوافق الأوزان المحددة مع القرب المطلوب بين الفئات.\n</li>\n<li>\n<b>اختر أوزان الفئات:</b> معلمة إلزامية تكون إما متغير سلسلة أو مصفوفة. تصف السلسلة واحدة من الأوزان المحددة مسبقًا ويجب أن تأخذ واحدة من القيم (\"غير موزون\"، \"تربيعي\"، \"ترتيبي\"، \"خطّي\"، \"جذري\"، \"نسبة\"، \"دائري\"، \"ثنائي القطب\"). </br>\nإذا كانت هذه المعلمة مصفوفة، فيجب أن تكون مصفوفة مربعة qxq حيث q هو عدد الفئات الممكنة التي يمكن تصنيف موضوع ما إليها. إذا لم يتم استخدام بعض الفئات الممكنة q، فمن المستحسن بشدة تحديد القائمة الكاملة للفئات الممكنة. خلاف ذلك، قد لا يعمل البرنامج.</br>\nملاحظة: تحديد مصفوفة غير مدعوم في الصيغة. تحتاج إلى لصق الكود وتحريره لتحديد مصفوفة.</br>\n</li>\n<li>\n<b>حجم السكان المحدود (إن وجد):</b> معلمة اختيارية تمثل حجم السكان (إن وجد). يمكن استخدامها لإجراء تصحيح حجم السكان المحدود على التباين. القيمة الافتراضية لها هي اللانهاية.\n</li>\n<li>\n<b>حدد اختياريًا جميع التقييمات الممكنة:</b> قائمة اختيارية تستخدم في الحالة التي لا يستخدم فيها أي مقيم فئة ممكنة. إذا لم يتم تحديد أي شيء، يُفترض أن الفئات الملاحظة هي مجموعة الفئات الكاملة.\n</li>\n</ul>\n<b>حزمة R</b></br>\nirrCAC</br>\n<b>المساعدة</b></br>\nتستخدم هذه النافذة الوظائف pa.coeff.raw، conger.kappa.raw، fleiss.kappa.raw، gwet.ac1.raw، krippen.alpha.raw، و bp.coeff.raw.\nللحصول على مساعدة مفصلة، انظر مساعدة حزمة irrCAC في القائمة الثلاثية النقاط > مساعدة > مساعدة حزمة R.\n"
  }
}