{
  "title": "اختبار كاي تربيع",
  "navigation": "اختبار كاي تربيع",
  "target": "المتغيرات المحددة",
  "proportions": "اختبر ضد النسب المتساوية أو أدخل النسب للاختبار. إذا كان متغيرك هو الجنس، اترك هذا التحكم فارغًا لاختبار النسب المتساوية. لاختبار 20% إناث، 80% ذكور، أدخل 0.2,0.8. أدخل نسبة لكل مستوى. يجب أن تكون النسب مجموعها 1.",
  "help": {
    "title": "اختبار كاي تربيع",
    "r_help": "help(chisq.test, package=stats)",
    "body": "\n<b>الوصف</b></br>\nتقوم chisq.test بإجراء اختبارات جدول الطوارئ كاي تربيع واختبارات ملاءمة التوزيع.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code>\nchisq.test(x, y = NULL, correct = TRUE,\n            p = rep(1/length(x), length(x)), rescale.p = FALSE,\n            simulate.p.value = FALSE, B = 2000)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nx: متجه عددي أو مصفوفة. يمكن أن تكون x و y أيضًا عوامل.\n</li>\n<li>\ny: متجه عددي؛ يتم تجاهله إذا كانت x مصفوفة. إذا كانت x عاملًا، يجب أن تكون y عاملًا بنفس الطول.\n</li>\n<li>\ncorrect: منطق يشير إلى ما إذا كان يجب تطبيق تصحيح الاستمرارية عند حساب إحصائية الاختبار لجدول 2 في 2: يتم طرح نصف من جميع الفروقات |O - E|؛ ومع ذلك، لن يكون التصحيح أكبر من الفروقات نفسها. لا يتم إجراء أي تصحيح إذا كانت simulate.p.value = TRUE.\n</li>\n<li>\np: متجه من الاحتمالات بنفس طول x. يتم إعطاء خطأ إذا كانت أي إدخال من p سلبية.\n</li>\n<li>\nrescale.p: عدد منطقي؛ إذا كانت TRUE، يتم إعادة قياس p (إذا لزم الأمر) ليكون مجموعها 1. إذا كانت rescale.p FALSE، و p لا يجمع إلى 1، يتم إعطاء خطأ.\n</li>\n<li>\nsimulate.p.value: منطق يشير إلى ما إذا كان يجب حساب قيم p بواسطة محاكاة مونت كارلو.\n</li>\n<li>\nB: عدد صحيح يحدد عدد النسخ المستخدمة في اختبار مونت كارلو.\n</li>\n</ul>\n<b>الوصف</b><br/>\nإذا كانت x مصفوفة تحتوي على صف أو عمود واحد، أو إذا كانت x متجهًا و y غير معطاة، يتم إجراء اختبار ملاءمة التوزيع (تُعتبر x جدول طوارئ أحادي الأبعاد). يجب أن تكون إدخالات x أعدادًا صحيحة غير سالبة. في هذه الحالة، الفرضية المختبرة هي ما إذا كانت احتمالات السكان تساوي تلك الموجودة في p، أو كلها متساوية إذا لم يتم إعطاء p.\nإذا كانت x مصفوفة تحتوي على صفين على الأقل وأعمدة، يتم اعتبارها جدول طوارئ ثنائي الأبعاد: يجب أن تكون إدخالات x أعدادًا صحيحة غير سالبة. خلاف ذلك، يجب أن تكون x و y متجهات أو عوامل بنفس الطول؛ يتم إزالة الحالات ذات القيم المفقودة، ويتم تحويل الكائنات إلى عوامل، ويتم حساب جدول الطوارئ من هذه. ثم يتم إجراء اختبار كاي تربيع لبييرسون للفرضية الصفرية بأن التوزيع المشترك لعدد الخلايا في جدول الطوارئ ثنائي الأبعاد هو ناتج الهامشين الصف والعمود.<br/>\nإذا كانت simulate.p.value FALSE، يتم حساب قيمة p من توزيع كاي تربيع التقريبي لإحصائية الاختبار؛ يتم استخدام تصحيح الاستمرارية فقط في حالة 2 في 2 (إذا كانت correct TRUE، وهي القيمة الافتراضية). خلاف ذلك، يتم حساب قيمة p لاختبار مونت كارلو (Hope، 1968) مع B نسخ.\nفي حالة جدول الطوارئ، يتم إجراء المحاكاة عن طريق أخذ عينات عشوائية من مجموعة جميع جداول الطوارئ ذات الهامشين المعطاة، وتعمل فقط إذا كانت الهامشين إيجابية بشكل صارم. لا يتم استخدام تصحيح الاستمرارية أبدًا، ويتم اقتباس الإحصائية بدونها. لاحظ أن هذه ليست الحالة المعتادة للاختبار كاي تربيع ولكن بدلاً من ذلك تلك لاختبار فيشر الدقيق.<br/>\nفي حالة ملاءمة التوزيع، يتم إجراء المحاكاة عن طريق أخذ عينات عشوائية من التوزيع المنفصل المحدد بواسطة p، كل عينة بحجم n = sum(x). يتم إجراء هذه المحاكاة في R وقد تكون بطيئة.<br/>\n<b>القيمة</b></br>\nقائمة تحتوي على فئة \"htest\" تحتوي على المكونات التالية:</br>\nstatistic: قيمة إحصائية اختبار كاي تربيع.</br>\nparameter: درجات الحرية لتوزيع كاي تربيع التقريبي لإحصائية الاختبار، NA إذا تم حساب قيمة p بواسطة محاكاة مونت كارلو.</br>\np.value: قيمة p للاختبار.</br>\nmethod: سلسلة حرفية تشير إلى نوع الاختبار الذي تم إجراؤه، وما إذا كانت محاكاة مونت كارلو أو تصحيح الاستمرارية قد تم استخدامها.</br>\ndata.name: سلسلة حرفية تعطي اسم (أسماء) البيانات.</br>\nobserved: الأعداد الملاحظة.</br>\nexpected: الأعداد المتوقعة بموجب الفرضية الصفرية.</br>\nresiduals: الفروقات البيانية، (الملاحظة - المتوقعة) / sqrt(المتوقعة).</br>\nstdres: الفروقات المعيارية، (الملاحظة - المتوقعة) / sqrt(V)، حيث V هو تباين الخلية المتبقية (Agresti، 2007، القسم 2.4.5 للحالة التي تكون فيها x مصفوفة، n * p * (1 - p) خلاف ذلك).​​</br>\n<b>أمثلة</b><br/>\n<code> \n## من Agresti(2007) ص.39\nM <- as.table(rbind(c(762, 327, 468), c(484, 239, 477)))</br>\ndimnames(M) <- list(gender = c(\"F\", \"M\"),</br>\n                    party = c(\"ديمقراطي\",\"مستقل\", \"جمهوري\"))</br>\n(Xsq <- chisq.test(M))  # طباعة ملخص الاختبار</br>\nXsq$observed   # الأعداد الملاحظة (نفس M)</br>\nXsq$expected   # الأعداد المتوقعة بموجب الفرضية الصفرية</br>\nXsq$residuals  # الفروقات البيانية</br>\nXsq$stdres     # الفروقات المعيارية</br>\n</br>\n## تأثير محاكاة قيم p</br>\nx <- matrix(c(12, 5, 7, 7), ncol = 2)</br>\nchisq.test(x)$p.value           # 0.4233</br>\nchisq.test(x, simulate.p.value = TRUE, B = 10000)$p.value</br>\n                                # حوالي 0.29!</br>\n</code> <br/>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nhelp(chisq.test, package ='caret')      \n"
  }
}