{
  "title": "المخاطر المتنافسة، مجموعة واحدة",
  "navigation": "المخاطر المتنافسة، مجموعة واحدة",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الأحداث (0 = توقف، 1 = الحدث 1، 2 = الحدث 2، ...)",
  "eventnum": "رمز الحدث",
  "singleeventchkbox": "رسم لحدث واحد",
  "printallest": "جدول التقديرات بما في ذلك جميع الأوقات",
  "printspecest": "جدول التقديرات لأوقات محددة",
  "spectimes": "حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1,5,by=1)",
  "styleoptions": "خيارات النمط",
  "axisoptions": "خيارات المحور",
  "label12": "انقر على زر ? في الزاوية العلوية اليمنى من الحوار للحصول على تفاصيل حول مجموعات البيانات النموذجية وتنسيق البيانات المدعوم.",
  "titleboxall": "عنوان الرسم (رسم جميع الأحداث)",
  "titleboxsingle": "عنوان الرسم (رسم حدث واحد)",
  "plottitlesizelabel": "حجم عنوان الرسم (5-50)",
  "themedropdown": "موضوع الرسم",
  "label1": "التسمية (رسم جميع الأحداث)",
  "legendpos": "الموقع",
  "legendtitle": "العنوان",
  "eventlabels": "تسميات الأحداث (حدد التسميات مفصولة بفواصل حسب ترتيب رموز الأحداث: على سبيل المثال 'الحدث 1'، 'الحدث 2'، إلخ؛ ليس رمز التوقف)",
  "legendfontsize": "حجم تسميات الأسطورة (5-50)",
  "label2": "عدد المخاطر",
  "natriskchkbox": "تضمين عدد المخاطر",
  "risktableprop": "ارتفاع جدول المخاطر (0-1)",
  "risktablevaluesize": "حجم قيمة جدول المخاطر (1-15)",
  "risktabletitlesize": "حجم عنوان جدول المخاطر (5-50)",
  "risktableaxislabelsize": "حجم تسمية محور جدول المخاطر (5-50)",
  "risktableticklabelsize": "حجم تسمية علامات جدول المخاطر (5-50)",
  "risktableclean": "إزالة المحاور وخطوط الشبكة من جدول المخاطر",
  "label3": "خيارات الخط",
  "linesize": "الحجم (0-5)",
  "colorpalette": "لوحة الألوان (رسم جميع الأحداث)",
  "linecolor": "اللون (رسم حدث واحد)",
  "label4": "فترة الثقة",
  "cichkbox": "تضمين فترة الثقة 95%",
  "labelblank": "",
  "cistyle": "النمط",
  "citransparency": "الشفافية (0-1)",
  "censorchkbox": "تضمين الأوقات الموقوفة",
  "label5": "محور الحدوث",
  "incaxislabelall": "التسمية (رسم جميع الأحداث)",
  "incaxislabelsingle": "التسمية (رسم حدث واحد)",
  "label6": "المقياس",
  "defbutton": "النسبة",
  "pctbutton": "النسبة المئوية",
  "label7": "حدود المحور وزيادات علامات التوقف (0-1)",
  "incaxismin": "الحد الأدنى",
  "incaxismax": "الحد الأقصى",
  "incaxisinc": "الزيادة",
  "label8": "محور الوقت",
  "timeaxislabel": "التسمية",
  "label9": "حدود المحور وزيادات علامات التوقف",
  "timeaxismin": "الحد الأدنى",
  "timeaxismax": "الحد الأقصى",
  "timeaxisinc": "الزيادة",
  "label10": "ملاحظة: يمكن تحديد الحد الأقصى دون تحديد الزيادة. لا يمكن تحديد الزيادة دون تحديد الحد الأقصى.",
  "axislabelsize": "حجم تسمية المحور (5-50)",
  "ticklabelsize": "حجم تسمية علامات المحور (5-50)",
  "help": {
    "title": "المخاطر المتنافسة، مجموعة واحدة",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n\t\t\tانظر مجموعة البيانات النموذجية في دليل التثبيت، الموقع الافتراضي هو في حرف القرص:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\melanoma_upd.RData. يجب إدخال المتغير الوقت كوقت للحدث أو التوقف ويجب إدخال المتغير الموت كالأحداث.<br/>\t\t\t\n            هذه المجموعة هي نسخة محدثة من مجموعة بيانات الميلانوما في حزمة MASS.\n            <br/>\n            <br/>\n            الحدث المتنافس هو حدث يمنع حدوث الحدث الأساسي المعني. إن إجراء تحليل كابلان-ماير القياسي في مثل هذه الحالات يكون متحيزًا ويبالغ في تقدير خطر الحدث. يتم استخدام هذا الحوار لتقدير الخطر التراكمي لحدوث الحدث الأساسي بعد بدء المتابعة لذلك الحدث (أو الوقت صفر)، عندما تكون هناك مخاطر متنافسة واحدة أو أكثر موجودة. مجموع الحدوث التراكمي لكل حدث يساوي الحدوث التراكمي لأي حدث. يجب أن يكون الموضوعات في خطر لجميع الأحداث بدءًا من الوقت صفر. يتم توفير مخططات الحدوث التراكمي لجميع الأحداث (منحنيات منفصلة لكل حدث على نفس الرسم)، وخيارًا لحدث محدد بمفرده.\n            <br/>\n            يمكن العثور على مقدمة لموضوع المخاطر المتنافسة في \"مقدمة لتحليل بيانات البقاء في وجود المخاطر المتنافسة\" بواسطة بيتر أوستن، وآخرون، الدورة الدموية، 2016؛ 133:601-609.\n            <br/>\n            <br/>\n            <b>الوقت حتى الحدث أو التوقف:</b> لكل موضوع، طول الوقت حتى الحدث الأول، إذا حدث حدث، أو آخر متابعة للأحداث، إذا لم تحدث أحداث.\n            <br/><br/>\n            <b>الأحداث:</b> مؤشر رقمي لأي حدث حدث (1=الحدث 1، 2=الحدث 2، إلخ) أو عندما لم تحدث أحداث (0=توقف) لكل موضوع\n            <br/><br/>\n            <b>رسم لحدث واحد:</b> ما إذا كنت تريد رسم الحدوث التراكمي لحدث محدد بمفرده. <b>رمز الحدث</b> يتوافق مع الحدث الذي سيتم رسمه.\n            <br/><br/>\n            <b>جدول التقديرات بما في ذلك جميع الأوقات:</b> خيار لتضمين جدول يسرد احتمالات الحدوث التراكمي وفترات الثقة 95% لكل وقت تم ملاحظته في مجموعة البيانات\n            <br/>\n            <br/>\n\t\t\t<b>جدول التقديرات لأوقات محددة:</b> خيار لتضمين جدول يحتوي على احتمالات تقدير البقاء لمجموعة مختارة من الأوقات من قبل المستخدم.\n\t\t\t<br/><br/>\n\t\t\t<b>حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1,5,by=1):</b> هذه هي الأوقات المحددة التي سيتم تضمينها في الجدول للأوقات المحددة. يمكن تحديدها بشكل فردي بفواصل، أو كمتتالية من القيم المتباعدة بشكل متساوٍ.\n\t\t\t<br/><br/>\n            يتم إخراج الجداول مع حجم العينة، عدد الموضوعات مع كل حدث، متوسط الوقت المقيد في الحالة، ومدة المتابعة المتوسطة. يتم حساب مدة المتابعة المتوسطة باستخدام مُقدّر كابلان-ماير العكسي، الذي يعامل الأحداث الحقيقية كملاحظات موقوفة والملاحظات الموقوفة الحقيقية كأحداث. وبالتالي، فإن \"الحدث\" في هذا المُقدّر هو \"متابعة الموضوعات لأطول فترة ممكنة\".\n            <br/>\n            يتم توفير جدول تقديرات الحدوث التراكمي في كل وقت تم ملاحظته في مجموعة البيانات، مع فترات ثقة 95%.\n            <br/>\n            <br/>\n            <b>حزم R المطلوبة:</b> survival، broom، survminer، dplyr، forcats، arsenal، ggthemes، ggsci، RColorBrewer، scales\n            <br/>\n            <br/>\n            <br/>\n            <b>خيارات النمط</b>\n            <br/>\n            <br/>\n            <b>عنوان الرسم (رسم جميع الأحداث):</b> عنوان الرسم الذي يعرض جميع الأحداث؛ احذف كل النص لعدم وجود عنوان\n            <br/><br/>\n            <b>عنوان الرسم (رسم حدث واحد):</b> عنوان الرسم الذي يعرض الحدث الفردي المحدد؛ احذف كل النص لعدم وجود عنوان\n\t\t\t<br/><br/>\n\t\t\t<b>حجم عنوان الرسم:</b> حجم عناوين الرسم.\n\t\t\t<br/><br/>\n            <b>موضوع الرسم:</b> النمط العام للرسم\n            <br/><br/>\n            <b>خيارات الأسطورة:</b>\n            <br/>\n            يتحكم خيار <b>الموقع</b> في موقع الأسطورة (أعلى، أسفل، يسار، يمين). <b>العنوان</b> هو عنوان الأسطورة. لإزالة العنوان، قم بإزالة كل النص من مربع النص. تُستخدم <b>تسميات الأحداث</b> لعرض النص لكل رمز حدث رقمي بدلاً من الرموز. إذا قمت بتحديد أي تسميات، يجب تسمية جميع الأحداث.\n\t\t\tتحكم خيار <b>حجم تسميات الأسطورة</b> في حجم كل النص الموجود في الأسطورة.\n            <br/>\n            <br/>\n            <b>عدد المخاطر:</b>\n\t\t\t<br/>\n\t\t\tاختياريًا، تضمين جدول لعدد الموضوعات الذين لا يزالون في خطر مع مرور الوقت في أسفل الرسوم. يتحكم <b>ارتفاع جدول المخاطر</b> في نسبة منطقة الرسم التي سيشغلها الجدول.\n\t\t\tيتحكم <b>حجم قيمة جدول المخاطر</b> في حجم الأرقام في المخاطر. يتحكم <b>حجم عنوان جدول المخاطر</b> في حجم العنوان لجدول عدد المخاطر.\n\t\t\tيتحكم <b>حجم تسمية محور جدول المخاطر</b> في حجم تسميات المحاور.\n\t\t\tيتحكم <b>حجم تسمية علامات جدول المخاطر</b> في حجم تسميات علامات التوقف. إذا كان من المرغوب إزالة جميع المحاور وخطوط الشبكة\n\t\t\tمن جدول عدد المخاطر، يمكن تحديد خيار <b>إزالة المحاور وخطوط الشبكة من جدول المخاطر</b>. سيشمل هذا فقط الأرقام في المخاطر في الجدول.\n            <br/><br/>\n            <b>خيارات الخط:</b>\n            <br/>\n            يتحكم <b>الحجم</b> في السماكة. تتحكم خيارات <b>اللون</b> في لوحة الألوان المستخدمة للخطوط في رسم جميع الأحداث ولون الخط في رسم حدث واحد. يتم أيضًا توفير مخططات الألوان التي تحاكي المجلات العلمية. يمكن للمرء اختيار تضمين فترة ثقة 95% للتقديرات إما في شكل <b>شريط</b> (منطقة مظللة) أو <b>خطوة</b> (خط). تتحكم <b>الشفافية</b> في مدى ظلمة الشريط ويتم تجاهلها عند تحديد خيار الخطوة.\n\t\t\t<br/><br/>\n\t\t\t<b>تضمين الأوقات الموقوفة:</b> يمكن تضمين الأوقات الموقوفة (عندما لم يعد الموضوعات في خطر للأحداث) كخط بالقرب من محور الوقت في كلا الرسمين. هذا أكثر فائدة في مجموعات البيانات الصغيرة أو في حالات عدد قليل من الموضوعات الموقوفة.\n            <br/><br/><br/>\n\t\t\t<b>خيارات المحور</b>\n            <br/>\n            <br/>\n            يحدد خيار <b>التسمية</b> النص المسمى للمحور. يحدد <b>حدود المحور</b> القيم الدنيا والقصوى للمحور. يتحكم خيار <b>زيادات علامات التوقف</b> في تباعد علامات التوقف على المحور. تتحكم الزيادات على محور الوقت أيضًا في الأوقات لجدول عدد المخاطر الاختياري.\n            <br/>\n            يحدد خيار <b>المقياس</b> لمحور الحدوث ما إذا كنت تريد أن تكون التقديرات على مقياس نسبة (0-1) أو نسبة مئوية (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية المحور:</b> يتحكم هذا في حجم كل من حجم تسمية محور الحدوث ومحور الوقت.\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية علامات المحور:</b> يتحكم هذا في حجم كل من حجم تسمية علامات محور الحدوث ومحور الوقت.\t\t\t\t\n      "
  }
}