{
  "title": "قارن النماذج",
  "navigation": "قارن النماذج",
  "label1": "يقارن بين نموذجين متداخلين باستخدام اختبار F أو اختبار Chi-sq حسب التقدير ويجري اختبار نسبة الاحتمالية.",
  "label2": "اختر نماذج من الفئات التالية (فئة R بين قوسين أدناه)",
  "label3": "النماذج الخطية (lm)، النموذج الخطي المعمم (glm)، نموذج التأثيرات المختلطة الخطية (lme)، الانحدار اللوجستي المرتب أو الانحدار البروبيتي (polr)، نموذج المخاطر النسبية (coxph)، نموذج خطي باستخدام المربعات الصغرى المعممة (gls)، نموذج الانحدار البقائي (survreg)، ملاءمة الانحدار متعدد الحدود المحلي (loess)، نموذج المربعات الصغرى غير الخطية (nls)، نماذج لوغاريتمية متعددة الحدود (multinom)",
  "label4": "**ملاحظة: النماذج التي تم إنشاؤها من ضبط النموذج (فئة train) غير مدعومة",
  "modelselector1": "اختر النموذج الكامل:",
  "modelselector2": "اختر نموذجًا مع عدد أقل من المتنبئين:",
  "help": {
    "title": "قارن النماذج",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>\nيقارن بين نموذجين متداخلين باستخدام اختبار F أو اختبار Chi-sq حسب التقدير. تُستخدم اختبارات F لتقدير المربعات الصغرى، وتُستخدم اختبارات Chi-sq لتقدير الاحتمالية القصوى. يجب إنشاء كلا النموذجين على نفس مجموعة البيانات حيث يمكن أن تسبب الاختلافات في القيم المفقودة مشاكل</b></br>\n<b>الوصف</b></br>\nجداول أنوفا: تحسب جداول تحليل التباين وتؤدي اختبارات نسبة الاحتمالية لنموذج ملائم.  \n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nobject:  كائن يحتوي على النتائج التي تم إرجاعها بواسطة دالة ملاءمة النموذج (مثل lm أو glm).\n</li>\n</ul>\n<b>القيمة</b><br/>\nترجع هذه الدالة (العامة) كائنًا من فئة anova. تمثل هذه الكائنات جداول تحليل التباين وتحليل الانحراف. عند إعطائها حجة واحدة، تنتج جدولًا يختبر ما إذا كانت مصطلحات النموذج ذات دلالة. عند إعطائها تسلسل من الكائنات، تختبر anova النماذج ضد بعضها البعض بالترتيب المحدد.<br/>\nتقوم طريقة الطباعة لكائنات anova بطباعة الجداول بشكل \"جميل\".<br/>\n<b>تحذير</b><br/>\nستكون المقارنة بين نموذجين أو أكثر صحيحة فقط إذا تم ملاءمتها لنفس مجموعة البيانات. قد تكون هذه مشكلة إذا كانت هناك قيم مفقودة وتم استخدام الإعداد الافتراضي لـ R وهو na.action = na.omit.<br/>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي في محرر بناء جملة R help(anova,package='stats')</br></br>\n<b>الوصف</b></br>\nاختبار نسبة الاحتمالية للنماذج المتداخلة: lrtest هي دالة عامة لإجراء اختبارات نسبة الاحتمالية. يمكن استخدام الطريقة الافتراضية لمقارنة النماذج الخطية المتداخلة (انظر التفاصيل أدناه).\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## الطريقة الافتراضية S3:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## طريقة S3 لفئة 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nobject: كائن. انظر أدناه للحصول على التفاصيل.\n</li>\n<li>\n...: مزيد من مواصفات الكائنات المرسلة إلى الطرق. انظر أدناه للحصول على التفاصيل.\n</li>\n<li>\nname: دالة لاستخراج اسم/وصف مناسب من كائن نموذج ملائم. بشكل افتراضي، يتم استعلام الاسم عن طريق استدعاء الصيغة.\n</li>\n<li>\ndata: إطار بيانات يحتوي على المتغيرات في النموذج.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nlrtest تهدف إلى أن تكون دالة عامة لمقارنات النماذج عبر اختبارات نسبة الاحتمالية التقريبية. تقارن الطريقة الافتراضية بشكل متتالي كائن نموذج الملاءمة مع النماذج المرسلة في .... بدلاً من تمرير كائنات نموذج الملاءمة في ...، يمكن أن تكون هناك عدة مواصفات أخرى ممكنة. آلية التحديث هي نفسها كما في waldtest: يمكن تحديد النماذج في ... كأعداد صحيحة، أو أحرف (كلاهما للمصطلحات التي يجب إزالتها من النموذج السابق)، أو صيغ التحديث أو كائنات نموذج الملاءمة. باستثناء الحالة الأخيرة، يُفترض وجود طريقة تحديث. انظر waldtest للحصول على التفاصيل.<br/>\nبعد ذلك، يتم إجراء اختبار نسبة الاحتمالية التقريبية لكل نموذجين متتاليين: يتم مقارنة مرتين الفرق في لوغاريتم الاحتمالية (كما تم اشتقاقه بواسطة طرق logLik) مع توزيع Chi-squared.<br/>\nتقوم طريقة \"الصيغة\" بملاءمة lm أولاً ثم تستدعي الطريقة الافتراضية.<br/>\n<b>القيمة</b><br/>\nكائن من فئة \"anova\" يحتوي على لوغاريتم الاحتمالية، ودرجات الحرية، والفرق في درجات الحرية، وإحصائية Chi-squared لنسبة الاحتمالية والقيمة p المقابلة.\n<b>أمثلة</b><br/>\n<code> \n## مع بيانات من Greene (1993):<br/>\n## تحميل البيانات وحساب التأخيرات<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## مواصفات مختلفة مكافئة لاختبار LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
  }
}