{
  "title": "احسب قيم متغيرات النموذج لتحقيق الاستجابة المستهدفة",
  "label100": "هذا الحوار يحسب متغيرات النموذج لتحقيق قيمة الاستجابة المستهدفة للنموذج\nملاحظة: إذا كانت هناك أي متغيرات غير رقمية في النموذج المحدد، فسيفشل حساب الاستجابة المستهدفة",
  "navigation": "احسب الاستجابة المستهدفة",
  "modelSelection": "اختر نموذجًا لحساب القيم المثلى للمتغيرات",
  "targetResponse": "حدد قيمة الاستجابة المستهدفة (رقمي) المطلوبة للنموذج المحدد",
  "targetResponseLower": "(اختياري) حدد قيمة الاستجابة المستهدفة الدنيا (رقمي) المطلوبة للنموذج المحدد",
  "targetResponseUpper": "(اختياري) حدد قيمة الاستجابة المستهدفة العليا (رقمي) المطلوبة للنموذج المحدد",
  "label200": "قيود مُحسّن الاستجابة المستهدفة",
  "label12": "المتغيرات (العوامل) في النموذج المحدد مدرجة أدناه بنفس الترتيب الذي تظهر به في النموذج",
  "factorConstraintUseDatasetLowerChk": "قيود الحد الأدنى: إذا تم تحديدها، سيتم استخدام الحد الأدنى لكل متغير مستخدم في النموذج كحد أدنى",
  "factorConstraintLower": "قيود الحد الأدنى: (تجاهل إذا تم تحديدها أعلاه) اتركها فارغة لعدم وجود قيود على الحد الأدنى لقيم متغيرات النموذج (أي العوامل). خلاف ذلك، يجب عليك كتابة قيم مفصولة بفواصل لكل متغير في النموذج. إذا لم يكن لمتغير معين في النموذج حد أدنى، فاكتب -Inf، على سبيل المثال، 0، 0.1، -Inf، 20",
  "factorConstraintUseDatasetUpperChk": "قيود الحد الأقصى: إذا تم تحديدها، سيتم استخدام الحد الأقصى لكل متغير مستخدم في النموذج كحد أقصى",
  "factorConstraintUpper": "قيود الحد الأقصى: (تجاهل إذا تم تحديدها أعلاه) اتركها فارغة لعدم وجود قيود على الحد الأقصى لقيم متغيرات النموذج (أي العوامل). خلاف ذلك، يجب عليك كتابة قيم مفصولة بفواصل لكل متغير في النموذج. إذا لم يكن لمتغير معين في النموذج حد أقصى، فاكتب Inf، على سبيل المثال، 0، 0.2، 0.9، Inf",
  "factorInitalValues": "القيم الأولية: اتركها فارغة ليختار النظام القيم الأولية لمتغيرات النموذج (أي العوامل) (افتراضي: جميعها صفر). خلاف ذلك، يجب عليك كتابة قيم مفصولة بفواصل لكل متغير في النموذج، على سبيل المثال، 0، 0، 0، 0",
  "help": {
    "title": "احسب قيم متغيرات النموذج (العوامل) للاستجابة المستهدفة للنموذج المحدد",
    "r_help": "help(optim, package = 'stats')",
    "body": "\n        "
  }
}