{
  "title": "المخاطر المتنافسة، مقارنة المجموعات",
  "navigation": "المخاطر المتنافسة، مقارنة المجموعات",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الأحداث (0 = توقف، 1 = حدث 1، 2 = حدث 2، ...)",
  "groupvarlabel": "المجموعة",
  "eventnum": "رمز الحدث",
  "singleeventchkbox": "رسم لحدث واحد",
  "printallest": "جدول التقديرات بما في ذلك جميع الأوقات",
  "printspecest": "جدول التقديرات لأوقات محددة",
  "spectimes": "حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1,5,by=1)",
  "styleoptions": "خيارات النمط",
  "axisoptions": "خيارات المحور",
  "titleboxall": "عنوان الرسم (رسم جميع الأحداث)",
  "titleboxsingle": "عنوان الرسم (رسم حدث واحد)",
  "plottitlesizelabel": "حجم عنوان الرسم (5-50)",
  "themedropdown": "موضوع الرسم",
  "label1": "الأسطورة",
  "legendpos": "الموقع",
  "keywidthlabel": "عرض المفتاح (سم؛ الرسم المدمج فقط)",
  "legendeventslabel": "الأحداث",
  "legendtitle": "العنوان",
  "eventlabels": "التسميات (حدد التسميات مفصولة بفواصل حسب ترتيب رموز الأحداث: مثل 'الحدث 1'، 'الحدث 2'، إلخ؛ ليس رمز التوقف)",
  "legendgroupslabel": "المجموعات",
  "grouplabels": "التسميات (حدد التسميات مفصولة بفواصل حسب ترتيب المجموعات: مثل 'المجموعة 1'، 'المجموعة 2'، إلخ.)",
  "legendfontsize": "حجم تسميات الأسطورة (5-50)",
  "wraplabelfontsize": "حجم تسميات الأحداث للرسم حسب الحدث (5-50)",
  "label2": "عدد المخاطر",
  "natriskchkbox": "تضمين عدد المخاطر",
  "risktableprop": "ارتفاع جدول المخاطر (0-1)",
  "risktablevaluesize": "حجم قيمة جدول المخاطر (1-15)",
  "risktabletitlesize": "حجم عنوان جدول المخاطر (5-50)",
  "risktableaxislabelsize": "حجم تسميات محور جدول المخاطر (5-50)",
  "risktableticklabelsize": "حجم تسميات علامات جدول المخاطر (5-50)",
  "risktableclean": "إزالة المحاور وخطوط الشبكة من جدول المخاطر",
  "label3": "خيارات الخط",
  "linesize": "الحجم (0-5)",
  "colorpalette": "لوحة الألوان",
  "label4": "فترة الثقة",
  "cichkbox": "تضمين فترة الثقة 95%",
  "labelblank": "",
  "cistyle": "النمط",
  "citransparency": "الشفافية (0-1)",
  "censorlabel": "الأوقات الموقوفة",
  "censorchkbox": "تضمين الأوقات الموقوفة",
  "censorsize": "الحجم (0-10)",
  "pvaluelabel": "قيمة P (رسم حدث واحد فقط)",
  "pvaluechkbox": "تضمين قيمة P",
  "pvaluelocationx": "موقع المحور السيني (الوقت)",
  "pvaluelocationy": "موقع المحور الصادي (الاحتمالية)",
  "pvaluesize": "الحجم (1-20)",
  "pvalueaccuracy": "الدقة (0-1)",
  "label5": "محور الحدوث",
  "incaxislabelall": "التسمية (رسم جميع الأحداث)",
  "incaxislabelsingle": "التسمية (رسم حدث واحد)",
  "label6": "المقياس",
  "defbutton": "نسبة",
  "pctbutton": "نسبة مئوية",
  "label7": "حدود المحور وزيادات علامات التوقف (0-1)",
  "incaxismin": "الحد الأدنى",
  "incaxismax": "الحد الأقصى",
  "incaxisinc": "الزيادة",
  "label8": "محور الوقت",
  "timeaxislabel": "التسمية",
  "label9": "حدود المحور وزيادات علامات التوقف",
  "timeaxismin": "الحد الأدنى",
  "timeaxismax": "الحد الأقصى",
  "timeaxisinc": "الزيادة",
  "label10": "ملاحظة: يمكن تحديد الحد الأقصى بدون تحديد الزيادة. لا يمكن تحديد الزيادة بدون تحديد الحد الأقصى.",
  "axislabelsize": "حجم تسمية المحور (5-50)",
  "ticklabelsize": "حجم تسمية علامة المحور (5-50)",
  "help": {
    "title": "المخاطر المتنافسة، مقارنة المجموعات",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n            <br/>\n            المخاطر المتنافسة هي حدث يمنع حدوث الحدث الأساسي المعني. إن إجراء تحليل كابلان-ماير القياسي في مثل هذه الحالات يكون متحيزًا ويبالغ في تقدير خطر الحدث. تُستخدم هذه النافذة لتقدير الخطر التراكمي لحدوث الحدث الأساسي بعد بدء المتابعة لذلك الحدث (أو الوقت صفر)، عندما تكون هناك مخاطر متنافسة واحدة أو أكثر. مجموع الحدوثات التراكمية لكل حدث يساوي الحدوث التراكمي لأي حدث. يجب أن يكون الموضوعات في خطر لجميع الأحداث بدءًا من الوقت صفر. يتم توفير مخططات الحدوث التراكمي لجميع الأحداث (منحنيات منفصلة لكل حدث على نفس الرسم)، وخيارًا لحدث محدد بمفرده.\n            <br/>\n            يمكن العثور على مقدمة لموضوع المخاطر المتنافسة في \"مقدمة لتحليل بيانات البقاء في وجود المخاطر المتنافسة\" بواسطة بيتر أوستن، وآخرون، الدورة الدموية، 2016؛ 133:601-609.\n            <br/>\n            <br/>\n            <b>الوقت حتى الحدث أو التوقف:</b> لكل موضوع، طول الوقت حتى الحدث الأول، إذا حدث حدث، أو آخر متابعة للأحداث، إذا لم تحدث أحداث.\n            <br/><br/>\n            <b>الأحداث:</b> مؤشر رقمي لأي حدث حدث (1=حدث 1، 2=حدث 2، إلخ) أو عندما لم تحدث أحداث (0=توقف) لكل موضوع\n            <br/><br/>\n            <b>رسم لحدث واحد:</b> ما إذا كنت تريد رسم الحدوث التراكمي لحدث محدد بمفرده. <b>رمز الحدث</b> يتوافق مع الحدث الذي سيتم رسمه.\n            <br/><br/>\n            <b>جدول التقديرات بما في ذلك جميع الأوقات:</b> خيار لتضمين جدول يسرد احتمالات الحدوث التراكمي وفترات الثقة 95% لكل وقت تم ملاحظته في مجموعة البيانات\n            <br/>\n            <br/>\n\t\t\t<b>جدول التقديرات لأوقات محددة:</b> خيار لتضمين جدول يحتوي على احتمالات الحدوث التراكمي لمجموعة مختارة من الأوقات.\n\t\t\t<br/><br/>\n\t\t\t<b>حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1,5,by=1):</b> هذه هي الأوقات المحددة التي سيتم تضمينها في الجدول للأوقات المحددة. يمكن تحديدها بشكل فردي بفواصل، أو كمتتالية من القيم المتباعدة بالتساوي.\n\t\t\t<br/><br/>\t\t\t\n            يتم إخراج الجداول مع حجم العينة، وعدد الموضوعات مع كل حدث، ومتوسط الوقت المقيد في الحالة، ومتوسط وقت المتابعة. يتم حساب متوسط وقت المتابعة باستخدام مُقدّر كابلان-ماير العكسي، الذي يعامل الأحداث الحقيقية كملاحظات موقوفة والملاحظات الموقوفة الحقيقية كأحداث. وبالتالي، فإن \"الحدث\" في هذا المُقدّر هو \"متابعة الموضوعات لأطول فترة ممكنة\".\n            <br/>\n            يتم توفير جدول تقديرات الحدوث التراكمي في كل وقت تم ملاحظته في مجموعة البيانات، مع فترات الثقة 95%.\n            <br/>\n            <br/>\n            <b>حزم R المطلوبة:</b> survival، broom، survminer، dplyr، forcats، arsenal، ggthemes، ggsci، RColorBrewer، scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>خيارات النمط</b>\n            <br/>\n            <br/>\n            <b>عنوان الرسم (رسم جميع الأحداث):</b> عنوان الرسوم التي تعرض جميع الأحداث؛ احذف كل النص لعدم وجود عنوان\n            <br/><br/>\n            <b>عنوان الرسم (رسم حدث واحد):</b> عنوان الرسم الذي يعرض الحدث الفردي المحدد؛ احذف كل النص لعدم وجود عنوان\n\t\t\t<br/><br/>\n\t\t\t<b>حجم عنوان الرسم:</b> حجم عناوين الرسوم.\n\t\t\t<br/><br/>\n            <b>موضوع الرسم:</b> النمط العام للرسم\n            <br/><br/>\n            <b>خيارات الأسطورة:</b>\n            <br/>\n            يتحكم خيار <b>الموقع</b> في موقع الأسطورة (أعلى، أسفل، يسار، يمين). يُستخدم <b>عرض المفتاح</b> لتغيير عرض مفاتيح الأسطورة في الرسم الذي يجمع جميع الأحداث والمجموعات. يمكن استخدام ذلك لجعل أنواع الخطوط أكثر وضوحًا في الأسطورة.\n\t\t\t<b>عنوان الحدث</b> هو العنوان لجزء الأسطورة الذي يحدد الأحداث. <b>عنوان المجموعة</b> هو العنوان لجزء الأسطورة الذي يحدد المجموعات. احذف النص إذا لم يكن هناك عنوان مطلوب. تُستخدم <b>تسميات الأحداث</b> لعرض نص لكل رمز حدث رقمي بدلاً من الرموز. تُستخدم <b>تسميات المجموعات</b> لتغيير النص للمجموعات. إذا قمت بتحديد أي تسميات، يجب تحديد جميع التسميات.\n\t\t\tيُتحكم خيار <b>حجم تسميات الأسطورة</b> في حجم كل النص الموجود في الأسطورة.\n\t\t\tيُتحكم خيار <b>حجم تسميات الأحداث للرسم حسب الحدث</b> في حجم نص اسم الحدث في الرسم الذي يتوزع حسب نوع الحدث.\n            <br/>\n            <br/>\n            <b>عدد المخاطر:</b>\n\t\t\t<br/>\n\t\t\tخيارياً، تضمين جدول لعدد الموضوعات الذين لا يزالون في خطر مع مرور الوقت في أسفل الرسوم. لا يتم توفير ذلك للرسم الذي يتوزع حسب الحدث لأسباب تتعلق بالمساحة والوضوح. يتحكم <b>ارتفاع جدول المخاطر</b> في نسبة مساحة الرسم التي سيشغلها الجدول.\n\t\t\tيُتحكم <b>حجم قيمة جدول المخاطر</b> في حجم الأرقام في المخاطر. يُتحكم <b>حجم عنوان جدول المخاطر</b> في حجم العنوان لجدول عدد المخاطر.\n\t\t\tيُتحكم <b>حجم تسميات محور جدول المخاطر</b> في حجم تسميات المحاور.\n\t\t\tيمكن استخدام خيار <b>إزالة المحاور وخطوط الشبكة من جدول المخاطر</b> لإزالة جميع المحاور وخطوط الشبكة من جدول عدد المخاطر. سيشمل ذلك فقط الأرقام في المخاطر في الجدول.\n            <br/><br/>\n            <b>خيارات الخط:</b>\n            <br/>\n            يتحكم <b>الحجم</b> في السماكة. يتحكم خيار <b>لوحة الألوان</b> في لوحة الألوان المستخدمة للخطوط في جميع الرسوم. يتم توفير مخططات الألوان التي تحاكي المجلات العلمية أيضًا. يمكن تضمين فترة الثقة 95% للتقديرات إما في شكل <b>شريط</b> (منطقة مظللة) أو <b>خطوة</b> (خط). يتحكم <b>الشفافية</b> في مدى ظلمة الشريط ويتم تجاهله عند اختيار خيار الخطوة.\n\t\t\t<br/><br/>\n\t\t\t<b>تضمين الأوقات الموقوفة:</b> يمكن تضمين الأوقات الموقوفة (عندما لم يعد الموضوعات في خطر للأحداث) كعلامات زائد على الخطوط. هذا أكثر فائدة في مجموعات البيانات الصغيرة أو في حالات عدد قليل من الموضوعات الموقوفة. لا يتم توفيرها في الرسم الذي يتداخل جميع الأحداث والمجموعات لأسباب تتعلق بالوضوح.\n\t\t\tيُتحكم <b>الحجم</b> في حجم علامات الوقت الموقوفة.\n\t\t\t<br/><br/>\n\t\t\t<b>تضمين قيمة P</b> يمكن استخدامها لتضمين قيمة اختبار غراي للحدث المحدد في الرسم الخاص بالحدث الفردي. يوفر <b>موقع المحور السيني (الوقت)</b> و<b>موقع المحور الصادي (الاحتمالية)</b> إحداثيات (X، Y) لقيمة P على الرسم.\n\t\t\tيُتحكم <b>الحجم</b> في حجم قيمة P على الرسم. يُتحكم <b>الدقة</b> في دقة قيمة P. على سبيل المثال، ستعرض القيمة الافتراضية 0.0001 قيم P التي لا تقل عن 0.0001. أي قيمة P أقل من 0.0001 ستعرض كـ \"P<0.0001\".\n            <br/><br/><br/>\n\t\t\t<b>خيارات المحور</b>\n            <br/>\n            <br/>\n            تحدد خيارات <b>التسمية</b> النص الخاص بتسمية المحور. تحدد <b>حدود المحور</b> القيم الدنيا والقصوى للمحور. يتحكم خيار <b>زيادات علامات التوقف</b> في تباعد علامات التوقف على المحور. تتحكم الزيادات على محور الوقت أيضًا في الأوقات لجدول عدد المخاطر الاختياري.\n            <br/>\n            تحدد خيار <b>المقياس</b> لمحور الحدوث ما إذا كنت تريد أن تكون التقديرات على مقياس نسبة (0-1) أو نسبة مئوية (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية المحور:</b> يتحكم هذا في حجم كل من حجم تسميات محور الحدوث ومحور الوقت.\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية علامة المحور:</b> يتحكم هذا في حجم كل من حجم تسميات علامات المحور للحدوث والوقت."
  }
}