{
  "title": "مقارنة منحنيات ROC",
  "navigation": "مقارنة منحنيات ROC",
  "outcomevar": "متغير النتيجة الثنائي (رقمي/عامل)",
  "predprobvars": "متغيرات الاحتمالية المتوقعة من كل نموذج، حدد على الأقل 2",
  "outcomeorderlabel": "قيمة النتيجة 'الإيجابية'",
  "outcomeorderhigh": "قيمة مرتفعة مرتبة",
  "outcomeorderlow": "قيمة منخفضة مرتبة",
  "specopt": "رسم الخصوصية بدلاً من 1-الخصوصية",
  "cilevel": "مستوى الثقة",
  "multcompopt": "تعديل المقارنة المتعددة",
  "multcompmethod": "طريقة المقارنة المتعددة",
  "plotoptions": "خيارات الرسم",
  "plottitle": "عنوان الرسم",
  "plottitlesize": "حجم عنوان الرسم (5-50)",
  "themedropdown": "موضوع الرسم",
  "lineoptionslabel": "خيارات الخط",
  "linesize": "حجم الخط (0-5)",
  "colorpalette": "لوحة الألوان",
  "axisoptionslabel": "خيارات المحور",
  "axislabelsize": "حجم تسمية المحور (5-50)",
  "ticklabelsize": "حجم تسمية علامات المحور (5-50)",
  "legendoptionslabel": "خيارات الأسطورة",
  "legendtitle": "العنوان",
  "legendpos": "الموقع",
  "curvelabels": "تسميات المنحنيات، حدد كـ 'التسمية 1'، 'التسمية 2'، 'التسمية 3'؛ استخدم \\n داخل التسمية لفصل الأسطر",
  "legendfontsize": "حجم تسميات الأسطورة (5-50)",
  "help": {
    "title": "مقارنة منحنيات ROC",
    "r_help": "help(roc.test, package = 'pROC')",
    "body": "\nتقوم هذه النافذة بمقارنة منحنيات الخصائص التشغيلية (ROC) بناءً على مجموعة من الاحتمالات المتوقعة من نموذج (مثل الانحدار اللوجستي). يجب أن يكون كل نموذج قد تم ضبطه باستخدام نفس ترتيب متغير النتيجة. يوفر جدولًا للمساحات الفردية تحت منحنيات ROC مع فترات الثقة، وجدولًا للمقارنات الزوجية باستخدام اختبار DeLong، ومجموعة متراكبة من منحنيات ROC. يتم إزالة الموضوعات التي تحتوي على قيم مفقودة للنتيجة أو الاحتمالات المتوقعة بحيث يتم تقييم كل نموذج على نفس مجموعة من الموضوعات. راجع تقييم النموذج > التنبؤ > تسجيل النموذج للحصول على الاحتمالات المتوقعة من النماذج المرشحة. \n<br/><br/><br/>\n<b>متغير النتيجة الثنائي:</b> المتغير الثنائي المستخدم للتنبؤات. يجب أن يكون رقميًا أو عاملًا.\n<br/><br/>\n<b>متغيرات الاحتمالية المتوقعة من كل نموذج:</b> حدد أعمدة الاحتمالية المتوقعة من كل نموذج تم ضبطه تريد مقارنته.\n<br/><br/>\n<b>قيمة النتيجة 'الإيجابية':</b> حدد ما إذا كانت القيمة المرتفعة أو المنخفضة المرتبة لمتغير النتيجة الثنائي المحدد يجب اعتبارها القيمة 'الإيجابية'. هذا هو المستوى الذي تتعلق به الاحتمالات المتوقعة. على سبيل المثال، إذا كان المتغير الثنائي مشفرًا كـ 0/1، فإن القيمة المرتفعة المرتبة تعني أن 1 هو الاستجابة 'الإيجابية' والقيمة المنخفضة المرتبة تعني أن 0 هو الاستجابة 'الإيجابية'. \n<br/><br/>\n<b>رسم الخصوصية بدلاً من 1-الخصوصية:</b> يغير هذا المحور السيني لرسم منحنى ROC لاستخدام الخصوصية بدلاً من ذلك. سيكون المحور يتناقص من 1 إلى 0، كلما انتقلت من اليسار إلى اليمين.\n<br/><br/> \n<b>مستوى الثقة:</b> مستوى الثقة لفترات مساحة منحنى ROC\n<br/><br/>\n<b>تعديل المقارنة المتعددة:</b> تطبيق تعديل المقارنة المتعددة على المقارنات الزوجية لمساحات منحنيات ROC.\n<br/><br/><br/>\n<b>خيارات الرسم:</b>\n<br/><br/>\n<b>عنوان الرسم:</b> حدد العنوان للرسم. يمكن إزالته.\n<br/><br/>\n<b>موضوع الرسم:</b> حدد الموضوع العام للرسم\n<br/><br/>\n<b>خيارات الخط:</b>\n<br/><br/>\n<b>حجم الخط:</b> حدد حجم الخطوط على رسم منحنى ROC\n<br/><br/>\n<b>لوحة الألوان:</b> حدد لوحة الألوان المستخدمة لخطوط منحنى ROC\n<br/><br/>\n<b>خيارات المحور:</b>\n<br/><br/>\n<b>حجم تسمية المحور:</b> حدد حجم تسميات المحاور المستخدمة على الرسم.\n<br/><br/>\n<b>حجم تسمية علامات المحور:</b> حدد حجم تسميات علامات المحور.\n<br/><br/>\n<b>خيارات الأسطورة:</b>\n<br/><br/>\n<b>الموقع:</b> حدد موقع الأسطورة في الرسم. يمكن أن تكون اليمين، الأعلى، الأسفل، أو اليسار.\n<br/><br/>\n<b>العنوان:</b> حدد العنوان للأسطورة. يمكن إزالته.\n<br/><br/>\n<b>تسميات المنحنيات:</b> حدد تسميات المنحنيات المستخدمة في الأسطورة وفقًا لترتيب المنحنيات (المنحنى 1، المنحنى 2، المنحنى 3، إلخ). لن يؤدي تحديد أي شيء إلى الحصول على تسميات منحنيات 1، 2، 3، إلخ. إذا حددت أي تسميات، يجب عليك تحديد تسميات لجميع المنحنيات. ترتيب المنحنيات هو نفس ترتيب الاحتمالات المتوقعة المحددة.\n<br/><br/>\n<b>حجم تسميات الأسطورة:</b> حجم جميع النصوص في الأسطورة.\n<br/><br/>\n<b>حزم R المطلوبة:</b> pROC، ggthemes، RColorBrewer، ggsci، ggplot2\n"
  }
}