{
  "title": "تحويل الشخصية إلى التاريخ والوقت",
  "navigation": "تحويل الشخصية إلى التاريخ والوقت",
  "labelInfo": "إذا كانت عملية تحويل متغير تاريخ أو وقت أو تاريخ ووقت من نوع سلسلة إلى نوع بيانات التاريخ فقط أو نوع بيانات التاريخ والوقت ناجحة، فسيتم دائمًا إنشاء متغير التاريخ الجديد بتنسيق YYYY-MM-DD إذا كان التاريخ فقط متاحًا، وYYYY-MM-DD HH:MM:SS، أو YYYY-MM-DD HH:MM:SS.xxx مع xxx مللي ثانية إذا كان الوقت متاحًا",
  "label1": "اختر لاحقة أو بادئة للمتغير المحول",
  "suffix": "لاحقة",
  "prefix": "بادئة",
  "prefixOrSuffix": "أدخل بادئة أو لاحقة",
  "Destination": "اختر متغير الشخصية للتحويل إلى تاريخ",
  "DateFormat": "حدد التنسيق لجزء التاريخ من متغير الشخصية المحدد، على سبيل المثال، التاريخ فقط كـ 2024-10-07 أو التاريخ والوقت كـ 2024-10-07 16:34:56 (اتركه فارغًا إذا لم يكن هناك عنصر تاريخ متاح)",
  "TimeFormat": "حدد التنسيق لجزء الوقت من متغير الشخصية المحدد، على سبيل المثال، التاريخ والوقت بما في ذلك المللي ثانية كـ 2024-10-07 16:34:56.789 أو الوقت فقط كـ 16:34:56 (اتركه فارغًا إذا لم يكن هناك عنصر وقت متاح)",
  "TimeZone": "اختر منطقة زمنية (افتراضي - لا شيء محدد هو المنطقة الزمنية المحلية لجهاز الكمبيوتر)",
  "missingYear": "سنة مفقودة: إذا كانت السنة مفقودة في متغير تاريخ الشخصية، اكتب السنة، على سبيل المثال 2024. اتركه فارغًا لاستخدام السنة الحالية",
  "missingMonth": "شهر مفقود: إذا كان الشهر مفقودًا في متغير تاريخ الشخصية، اكتب الشهر، على سبيل المثال 03، مارس، أو مارس لشهر مارس. اتركه فارغًا لاستخدام الشهر الحالي",
  "missingDay": "يوم مفقود: إذا كان اليوم مفقودًا في متغير تاريخ الشخصية، اكتب يوم الشهر، على سبيل المثال 17. اتركه فارغًا لاستخدام اليوم",
  "missingHour": "ساعة مفقودة: إذا كانت الساعة مفقودة في متغير تاريخ/وقت الشخصية، اكتب الساعة، على سبيل المثال 7 أو 16. اتركه فارغًا لاستخدام الساعة الحالية",
  "missingMinute": "دقيقة مفقودة: إذا كانت الدقيقة مفقودة في متغير تاريخ/وقت الشخصية، اكتب الدقيقة، على سبيل المثال 10 أو 35. اتركه فارغًا لاستخدام الدقيقة الحالية",
  "missingSeconds": "ثواني مفقودة: إذا كانت الثواني مفقودة في متغير تاريخ/وقت الشخصية، اكتب الثواني، على سبيل المثال 17 أو 59. اتركه فارغًا لاستخدام الثواني الحالية",
  "help": {
    "title": "تحويل أجزاء أو كامل شخصيات التاريخ إلى نوع بيانات التاريخ",
    "r_help": "help(package=\"lubridate\")",
    "body": "\n\t\t\t<b>الوصف</b></br>\n\t\t\tتحويل سلسلة شخصية للتاريخ أو الوقت أو التاريخ والوقت مع عناصر تاريخ ووقت جزئية أو كاملة، أي، عناصر تاريخ مثل السنة والشهر واليوم من الشهر إلى نوع تاريخ (فئة POSIXct) أو فقط الوقت مثل ساعة دقيقة ثانية مللي ثانية، ساعة دقيقة ثانية، .. إلى نوع تاريخ كامل (فئة POSIXct). \n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tاختر تنسيقًا من قائمة التنسيقات الممكنة من تنسيقات التاريخ إذا كانت عناصر التاريخ فقط متاحة في سلسلة الشخصية المحددة\n\t\t\t<br/> \n\t\t\tاختر تنسيق وقت من قائمة التنسيقات الزمنية الممكنة إذا كانت عناصر الوقت فقط متاحة في سلسلة الشخصية المحددة\n\t\t\t<br/>\n\t\t\tاختر كلاً من تنسيقات التاريخ والوقت من قائمة اختيار تنسيقات التاريخ والوقت إذا كانت عناصر التاريخ والوقت متاحة في سلسلة الشخصية المحددة\n\t\t\t<br/>\n\t\t\tاختر التنسيق المناسب الذي يمثل سلسلة الشخصية للتاريخ والوقت (أي، ترتيب ووجود/غياب الشهر، اليوم، أو السنة أو الساعة، الدقيقة، الثواني، أو عناصر المللي ثانية)\n\t\t\t<br>\n\t\t\tتتم العديد من خطوات إعداد السلسلة داخليًا قبل استدعاء الوظائف من حزمة lubridate لتحويل سلسلة التاريخ أو الوقت أو التاريخ والوقت المعدة إلى متغير تاريخ POSIXct جديد.\n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tخيارات\n\t\t\t<br/>\n\t\t\tقم بتوسيع الخيارات لضبط المزيد مما إذا كان يجب استخدام السنة الحالية أو الشهر أو اليوم إذا كانت عناصر السنة أو الشهر أو التاريخ غائبة في متغير سلسلة التاريخ أو الساعة أو الدقيقة أو الثواني إذا كانت واحدة أو أكثر من عناصر الوقت مفقودة من سلسلة الوقت.\n\t\t\t<br/>\n\t\t\t<br/> \n\t\t\tخيارات تنسيق التاريخ لمتغير سلسلة التاريخ الشخصية المحدد هي:\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tشهر يوم:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة فقط على الشهر متبوعًا بيوم ولا تحتوي على سنة، مثل 03/17، 05-25، مارس،15 ، مايو-21، ...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tيوم شهر:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة فقط على اليوم متبوعًا بالشهر ولا تحتوي على سنة، مثل 17/03، 25-05، 15،مار ، 21-مايو,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tشهر سنة:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة فقط على الشهر متبوعًا بالسنة ولا تحتوي على يوم من الشهر، مثل 03/2024، 05-2020، مارس،2023 ، يوليو-2018,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tسنة شهر:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة فقط على السنة متبوعة بالشهر ولا تحتوي على يوم من الشهر، مثل 2024/03، 2020-05، 2023،مار، 2018-يوليو,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tسنة فقط:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة فقط على السنة ولا تحتوي على يوم أو شهر، مثل 2020، 2024، 1995، ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tشهر فقط:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة فقط على الشهر ولا تحتوي على يوم أو سنة، مثل 03، 11، مارس، نوفمبر، ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tيوم فقط:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة فقط على اليوم ولا تحتوي على شهر أو سنة، مثل يوم من الشهر كـ 03، 17، 28، أو يوم من الأسبوع كـ الإثنين، السبت، ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tسنة شهر يوم:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة على السنة، متبوعة بالشهر واليوم مثل 2024/03/22، 2020-05-19، 2019،مار،26,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tشهر يوم سنة:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة على الشهر، متبوعًا باليوم والسنة، مثل 03/22/2024، 05-19-2020، مارس،26،2019,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tيوم شهر سنة:\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ الشخصية المحددة على يوم، متبوعًا بالشهر والسنة، مثل 22/03/2024، 19-05-2020، 26 مارس 2019,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tخيارات تنسيق الوقت لمتغير سلسلة التاريخ الشخصية المحددة هي:\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tساعة دقيقة ثانية\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ/الوقت الشخصية المحددة على ساعة، متبوعة بالدقائق والثواني، مثل 22/03/2024 17:15:48، أو الوقت فقط كـ 17:15:48,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tساعة دقيقة ثانية مللي ثانية (أو ميكرو ثانية)\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ/الوقت الشخصية المحددة على ساعة، متبوعة بالدقائق والثواني والمللي ثانية، أو الميكرو ثواني، مثل 22/03/2024 17:15:48.784، أو الوقت فقط كـ 17:15:48.784،17:15:48.784239,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tدقيقة ثانية مللي ثانية (أو ميكرو ثانية)\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة الوقت الشخصية المحددة على دقائق، وثواني، ومللي ثانية، أو ميكرو ثواني، مثل الوقت فقط 15:48.784،15:48.784239... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tساعة دقيقة \n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة التاريخ/الوقت الشخصية المحددة على ساعة، متبوعة بالدقائق، مثل 22/03/2024 17:15، أو الوقت فقط 17:15,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tدقيقة ثانية\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة الوقت الشخصية المحددة على دقائق وثواني مثل الوقت كـ 15:48,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tثواني مللي ثانية (أو ميكرو ثانية)\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة الوقت الشخصية المحددة على ثواني، ومللي ثانية، أو ميكرو ثواني، مثل الوقت كـ 48.784، 55.784239,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tساعة فقط \n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة الوقت الشخصية المحددة على ساعة فقط مثل الوقت كـ 10، 14، أو 22,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tدقيقة فقط\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة الوقت الشخصية المحددة على دقائق فقط مثل الوقت كـ 10، 29، 44، أو 59,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tثانية فقط\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة الوقت الشخصية المحددة على ثواني فقط مثل الوقت كـ 10، 29، 44، أو 59,... \n\t\t\t</br>\n\t\t\t</br>\t\n\t\t\tمللي ثانية فقط\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة الوقت الشخصية المحددة على مللي ثانية فقط مثل الوقت كـ 10، 290، 448، أو 759,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tميكرو ثانية فقط\n\t\t\t</br>\n\t\t\tاختر هذا عندما تحتوي سلسلة الوقت الشخصية المحددة على ميكرو ثواني فقط مثل الوقت كـ 101، 2901، 448890، أو 759123,... \n\t\t\t</br>\n\t\t\t</br>\n<b>المساعدة</b></br>\nhelp(package=\"lubridate\")\n"
  }
}