{
  "title": "كوكس، فاين-غراي",
  "navigation": "كوكس، فاين-غراي",
  "modelname": "أدخل اسم النموذج",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الأحداث (0 = توقف، 1 = حدث 1، 2 = حدث 2، ...)",
  "eventcodelabel": "رمز الحدث",
  "modelterms": "منشئ تعبير النموذج للمتغيرات المستقلة",
  "stratavarslabel": "متغيرات التوزيع (اختياري)",
  "weightvar": "الأوزان (اختياري)",
  "tiemethod": "طريقة الوقت المرتبط",
  "diagnosticsbox": "تشخيص النموذج",
  "martminlabel": "القيمة الدنيا لمحور المتبقيات المارتينغالية للنموذج الصفري (-إنف إلى 1)",
  "anovachkboxlabel": "تحليل الانحراف (النوع الثاني)",
  "help": {
    "title": "كوكس، فاين-غراي",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nيتناسب نموذج كوكس النسبي فاين-غراي لبيانات الوقت حتى الحدث مع الملاحظات الموقوفة عندما تكون المخاطر المتنافسة موجودة.  نماذج فاين-غراي تدرس تأثير \nالمتغيرات على دالة الحدوث التراكمي.  بديل هو نمذجة تأثير المتغيرات على الخطر المحدد بالسبب، والتي يمكن استخدام نماذج الانحدار القياسية لكوكس \nلها.  يمكن العثور على مقدمة لموضوع المخاطر المتنافسة في \"مقدمة لتحليل بيانات البقاء في وجود المخاطر المتنافسة\" بواسطة بيتر أوستن، \nوآخرون، الدورة الدموية، 2016؛ 133:601-609. \n<br/><br/>\nتُقدم إحصائيات ملاءمة النموذج، وتقديرات المعلمات، ونسب المخاطر.  الخيارات المتاحة تشمل طريقة الوقت المرتبط وتشخيص النموذج.  يتم ملاءمة النموذج باستخدام \nوظائف فاين-غراي وكوكس في حزمة البقاء.\n<br/><br/>\n<b>أدخل اسم النموذج:</b> حدد اسم النموذج حيث سيتم تخزين النتائج.\n<br/><br/>\n<b>الوقت حتى الحدث أو التوقف:</b> الوقت حتى الحدث الأول لأولئك الذين يعانون من حدث أو الوقت حتى آخر متابعة لأولئك الذين لا يعانون من أي حدث\n<br/><br/>\n<b>الأحداث (0 = توقف، 1 = حدث 1، 2 = حدث 2، ...):</b> مؤشر حدث رقمي؛ 0=توقف، 1=حدث 1، 2=حدث 2، إلخ.\n<br/><br/>\n<b>رمز الحدث:</b> اختر الحدث الذي يهمك والذي تريد نمذجته.  يمكن اختياره أو كتابته.\n<br/><br/>\n<b>منشئ الصيغة:</b> بناء المصطلحات لتضمينها في النموذج.  سيتم ترميز العوامل، والسلاسل، والمتغيرات المنطقية.  الأزرار المقدمة تتيح لك تحديد التأثيرات الرئيسية، وتأثيرات العامل الكامل (التأثيرات الرئيسية وجميع التفاعلات مع المتغيرات المعنية)، ومتعددات الحدود، والتفاعلات المحددة، وحذف المصطلحات من القائمة.  التفاعلات \nمع متغيرات التوزيع مسموح بها.\n<br/><br/>\n<b>متغيرات التوزيع:</b> حدد واحدًا أو أكثر من متغيرات التوزيع.  يمكن أن تكون هذه متغيرات عددية، أو عوامل، أو عوامل مرتبة، أو متغيرات حرفية.  تقسم الطبقات \nالموضوعات إلى مجموعات منفصلة حيث تحتوي كل مجموعة على دالة خطر أساسية مميزة.  إذا تم إعطاء متغيرات توزيع متعددة، يتم استخدام دالة خطر أساسية منفصلة \nلكل مجموعة من مستويات متغيرات التوزيع.\n<br/><br/>\n<b>الأوزان:</b> متغير عددي لأوزان الملاحظة. مفيد في الحالات التي لا ينبغي فيها احتساب كل سجل كملاحظة واحدة. \n<br/><br/>\n<b>طريقة الوقت المرتبط:</b> طريقة لكسر الأوقات الملاحظة المرتبطة.  إيفرون هو الخيار الأفضل عادةً عندما لا تكون هناك أوقات مرتبطة كثيرة.\n<br/><br/>\n<b>تشخيص النموذج:</b> إذا تم تحديده، سيتم تقييم التناسب بين المخاطر والشكل الوظيفي للمتغيرات، بما في ذلك الرسوم البيانية ذات الصلة. \nإذا كانت هناك متغيرات توزيع أو متنبئات غير عددية، فلن يتم إنتاج رسوم بيانية للشكل الوظيفي. \nقد تحتاج <b>القيمة الدنيا لمحور المتبقيات المارتينغالية للنموذج الصفري</b> إلى التغيير من أجل رؤية جميع المتبقيات المارتينغالية.\n<br/><br/>\n<b>تحليل الانحراف (النوع الثاني):</b> إذا تم تحديده، سيتم توفير اختبارات متغيرات كاملة (بما في ذلك اختبارات متعددة درجات الحرية لمتغيرات متعددة الفئات).  تُستخدم اختبارات والد.\n<br/><br/>\n<b>حزم R المطلوبة:</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nانقر على زر مساعدة R للحصول على مساعدة مفصلة حول وظيفة coxph.  انتقل إلى مساعدة-> مساعدة وظيفة R للحصول على مزيد من المعلومات حول وظيفة finegray، التي تنشئ \nمجموعة البيانات المطلوبة.\n"
  }
}