{
  "title": "كوكس، مصنف",
  "navigation": "كوكس، مصنف",
  "modelname": "أدخل اسم النموذج",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الأحداث (1 = حدث 1، 0 = توقف)",
  "modelterms": "باني تعبير النموذج للمتغيرات المستقلة",
  "stratavarslabel": "متغيرات التصنيف",
  "weightvar": "الأوزان (اختياري)",
  "tiemethod": "طريقة الوقت المرتبط",
  "diagnosticsbox": "تشخيص النموذج",
  "help": {
    "title": "كوكس، مصنف",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n            يناسب نموذج كوكس النسبي المصنف لبيانات الوقت حتى الحدث مع ملاحظات مقيدة. هذا نموذج كوكس يسمح بدالة خطر أساسية منفصلة لكل مستوى من مستويات التصنيف. يتم توفير إحصائيات ملائمة النموذج، وتقديرات المعلمات، ونسب المخاطر. تشمل الخيارات المتاحة طريقة الوقت المرتبط وتشخيص النموذج. يتم ملاءمة النموذج باستخدام دالة coxph في حزمة survival.\n            <br/>\n            <br/>\n            <b>الوقت حتى الحدث أو التوقف:</b> الوقت حتى الحدث لأولئك الذين يعانون من الحدث أو الوقت حتى آخر متابعة لأولئك الذين لا يعانون من الحدث\n            <br/><br/>\n            <b>الأحداث (1=حدث، 0=توقف):</b> مؤشر حدث رقمي؛ 1=حدث، 0=توقف\n            <br/><br/>\n            <b>باني الصيغة:</b> بناء المصطلحات التي يجب تضمينها في النموذج. سيتم ترميز العوامل، والسلاسل، والمتغيرات المنطقية. تتيح لك الأزرار المقدمة تحديد التأثيرات الرئيسية، وتأثيرات العامل الكامل (التأثيرات الرئيسية وجميع التفاعلات مع المتغيرات المعنية)، الحدود، التفاعلات المحددة، وحذف المصطلحات من القائمة. يُسمح بالتفاعلات مع متغيرات التصنيف.\n            <br/><br/>\n\t\t\t<b>متغيرات التصنيف:</b> تحديد واحد أو أكثر من متغيرات التصنيف. يمكن أن تكون هذه متغيرات عددية، أو عوامل، أو عوامل مرتبة، أو متغيرات حرفية. تقسم الطبقات الموضوعات إلى مجموعات منفصلة حيث تحتوي كل مجموعة على دالة خطر أساسية مميزة. إذا تم إعطاء متغيرات تصنيف متعددة، يتم استخدام دالة خطر أساسية منفصلة لكل مجموعة من مستويات متغيرات التصنيف.\n\t\t\t<br/><br/>\n            <b>الأوزان:</b> متغير رقمي لأوزان الملاحظة. مفيد في الحالات التي لا ينبغي فيها اعتبار كل سجل كملاحظة واحدة.\n            <br/>\n            <br/>\n            <b>الحزم المطلوبة:</b> survival، broom، survminer\n            <br/>\n            <br/>\n            انقر على زر مساعدة R للحصول على مساعدة مفصلة حول دالة coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>الخيارات</b>\n            <br/>\n            <br/>\n            <b>طريقة الوقت المرتبط:</b>\n            <br/>\n            طريقة كسر الأوقات الملاحظة المرتبطة. عادةً ما يكون إيفرون هو الخيار الأفضل عندما لا تكون هناك أوقات مرتبطة كثيرة. يمكن أن تكون الطريقة الدقيقة مفيدة إذا كانت هناك أوقات مرتبطة كثيرة، كما هو الحال في الحالات الزمنية المنفصلة، ولكن قد يستغرق الأمر وقتًا أطول قليلاً لتناسب النموذج.\n            <br/>\n            <br/>\n            <b>تشخيص النموذج:</b>\n            <br/>\n            إذا تم تحديده، سيتم توفير اختبارات المخاطر النسبية والرسوم البيانية، بالإضافة إلى رسم بياني لبقايا مارتينغالي."
  }
}