{
  "title": "كوك، المتغيرات الثنائية المعتمدة على الزمن",
  "navigation": "كوك، المتغيرات الثنائية المعتمدة على الزمن",
  "modelname": "أدخل اسم النموذج",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الأحداث (1 = حدث 1، 0 = توقف)",
  "modelterms": "منشئ تعبير النموذج للمتغيرات المستقلة",
  "switchtimeslabel": "متغيرات وقت التعرض للمتغيرات المعتمدة على الزمن",
  "tdprefixlabel": "بادئة للمتغيرات المعتمدة على الزمن",
  "subjectidlabel": "معرف الموضوع",
  "weightvar": "الأوزان (اختياري)",
  "tiemethod": "طريقة الوقت المرتبط",
  "forestplotbox": "مخطط الغابة",
  "diagnosticsbox": "تشخيص النموذج",
  "martscalebox": "القيمة الدنيا لمحور المتبقيات في النموذج الصفري (-إنف إلى 1):",
  "devbox": "تحليل الانحراف (النوع الثاني)",
  "devtype": "إحصائية الاختبار",
  "startstopboxlabel": "عرض مجموعة بيانات (البداية، التوقف)",
  "startstopnamelabel": "اسم مجموعة البيانات",
  "help": {
    "title": "كوك، المتغيرات الثنائية المعتمدة على الزمن",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nيتناسب نموذج كوك للمخاطر النسبية مع بيانات الوقت حتى الحدث مع ملاحظات مقيدة تتضمن واحد أو أكثر من المتغيرات \"التعرض\" المعتمدة على الزمن. هذا النوع من \nالمتغيرات هو حيث يمكن أن يحدث \"نعم\" بعد بدء المتابعة ومتى يحدث \"نعم\" يبقى \"نعم\" طوال مدة المتابعة. مثال \nقد يكون رفض طعم بعد الزرع (أي قبل حدوث الرفض، لم يكن المريض \"معرضًا\"؛ بعد حدوث الرفض، أصبح المريض \"معرضًا\"). \nيعتبر التعامل مع مثل هذا المتغير على أنه معروف في بداية المتابعة شكلًا من أشكال النظر إلى المستقبل ويؤدي إلى تقديرات متحيزة (المعروفة أيضًا باسم \"تحيز الزمن الخالد\").\n<br/><br/>\nتُقدم إحصائيات ملاءمة النموذج، وتقديرات المعلمات، ونسب المخاطر. تشمل الخيارات المتاحة طريقة الوقت المرتبط، ومخططات الغابة، وتشخيص النموذج، والقدرة \nعلى عرض مجموعة بيانات عملية العد الأساسية التي يتم إنشاؤها. يتم توفير جدول يصف بيانات عملية العد كتحقق من أن هذه البيانات يتم إنشاؤها \nبشكل مناسب.\n<br/><br/>  \nملخصات بيانات عملية العد:\n<br/>\n<b>مبكر:</b> الوقت عندما يتغير المتنبئ قبل بدء وقت المتابعة<br/>\n<b>متأخر:</b> الوقت عندما يتغير المتنبئ بعد انتهاء المتابعة<br/>\n<b>داخل:</b> الوقت عندما يتغير المتنبئ داخل فترة المتابعة<br/>\n<b>رائد:</b> الوقت عندما يتغير المتنبئ في بداية المتابعة<br/>\n<b>متأخر:</b> الوقت عندما يتغير المتنبئ في نهاية المتابعة<br/>\n<b>حدودي:</b> الوقت عندما يتغير المتنبئ إما في بداية أو نهاية المتابعة\n<br/><br/>\nلمزيد من المعلومات حول هذا الجدول، راجع كتيب المتغيرات المعتمدة على الزمن في <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>.  \n<br/><br/>\nيتم ملاءمة النموذج باستخدام دالة coxph في حزمة البقاء.\n<br/><br/>\n<b>أدخل اسم النموذج:</b> الاسم الذي سيتم تخزين نتائج النموذج فيه\n<br/><br/>\n<b>الوقت حتى الحدث أو التوقف:</b> الوقت حتى حدث النتيجة لأولئك الذين يعانون من الحدث أو الوقت حتى آخر متابعة لأولئك الذين لا يعانون من حدث النتيجة\n<br/><br/>\n<b>الأحداث (1=حدث، 0=توقف):</b> مؤشر حدث رقمي؛ 1=حدث، 0=توقف\n<br/><br/>\n<b>منشئ الصيغة:</b> بناء المصطلحات لتضمينها في النموذج. سيتم ترميز العوامل، والسلاسل، والمتغيرات المنطقية بشكل زائف. تتيح لك الأزرار المقدمة تحديد التأثيرات الرئيسية، وتأثيرات العامل الكامل (التأثيرات الرئيسية وجميع التفاعلات مع المتغيرات المعنية)، والمتعددات، والتفاعلات المحددة، وحذف المصطلحات من القائمة.\n<br/><br/>\n<b>متغيرات وقت التعرض للمتغيرات المعتمدة على الزمن:</b> متغيرات عددية تخزن الوقت عندما كان الموضوع \"معرضًا\" لأول مرة. يجب أن تكون هذه على نفس مقياس الوقت مثل \nمتغير الوقت. يجب استخدام القيم المفقودة للمواضيع الذين لم يتعرضوا أبدًا. سيخلق كل متغير محدد هنا متغيرًا معتمدًا على الزمن منفصلًا. يفترض وقت محدد أن الموضوع غير معرض قبل هذا الوقت ومعرض بعد هذا الوقت (أي عندما يتغير المتنبئ من \"لا\" إلى \"نعم\"). يعني تحديد القيم الإيجابية فقط أن \nالمواضيع غير معرضة لبعض الوقت بعد بدء المتابعة. يشير تحديد بعض الأوقات الإيجابية والسلبية إلى أن بعض المواضيع تعرضت بعد وبعضها قبل \nبدء وقت المتابعة، على التوالي. إذا كنت تعرف أن موضوعًا تعرض قبل بدء المتابعة، ولكنك لا تعرف بالضبط متى، يمكنك استخدام أي وقت سلبي \nوسيتعامل النموذج بشكل صحيح مع ذلك الموضوع على أنه معرض طوال وقت المتابعة الخاص به. إذا تعرضت المواضيع بعد المتابعة، فسيتم التعامل معها بشكل صحيح على أنها غير\nمعرضة طوال وقت المتابعة الخاص بها.\n<br/><br/>\n<b>بادئة للمتغيرات المعتمدة على الزمن:</b> البادئة المرغوبة التي سيتم استخدامها لكل متغير معتمد على الزمن محدد في حقل <b>متغيرات وقت التعرض</b>. سيبدأ اسم \nكل متغير معتمد على الزمن بهذه البادئة.\n<br/><br/>\n<b>معرف الموضوع:</b> المتغير الذي يخزن معرف الموضوع. هذا مطلوب لأغراض إنشاء مجموعة بيانات عملية العد الأساسية.\n<br/><br/>\n<b>الأوزان:</b> متغير عددي لأوزان الملاحظة. مفيد في الحالات التي لا ينبغي فيها عد كل سجل كملاحظة واحدة. \n<br/><br/>\n<b>الخيارات:</b>\n<br/><br/>\n<b>طريقة الوقت المرتبط:</b> طريقة كسر الأوقات الملاحظة المرتبطة. عادةً ما تكون إيفرون الخيار الأفضل عندما لا توجد أوقات مرتبطة كثيرة. يمكن أن تكون الطريقة الدقيقة مفيدة إذا \nكانت هناك أوقات مرتبطة كثيرة، كما في الحالات الزمنية المنفصلة، ولكن قد يستغرق الأمر وقتًا أطول قليلاً لملاءمة النموذج.\n<br/><br/>\n<b>مخطط الغابة:</b> سيقوم بإنشاء مخطط غابة لنسب المخاطر وفواصل الثقة\n<br/><br/>\n<b>عرض مجموعة بيانات (البداية، التوقف):</b> سيظهر مجموعة بيانات عملية العد الأساسية المستخدمة في الحسابات. هذا يكسر وقت متابعة كل موضوع إلى أجزاء، اعتمادًا \nعلى متى يجب أن تتغير المتغيرات المعتمدة على الزمن.\n<br/><br/>\n<b>تشخيص النموذج:</b> إذا تم تحديده، سيتم توفير اختبارات المخاطر النسبية والمخططات، بالإضافة إلى تقييمات الشكل الوظيفي لكل متغير في النموذج.  \nقد تحتاج قيمة الحد الأدنى لمحور المتبقيات في النموذج الصفري إلى التغيير حتى تظهر جميع المتبقيات في المخطط. للحصول على تقييمات الشكل الوظيفي، يجب \nتحديد فقط المتنبئين العدديين وعدم وجود بيانات مفقودة. انظر المتغيرات > القيم المفقودة > إزالة NAs.\n<br/><br/>\n<b>تحليل الانحراف (النوع الثاني):</b> اختبار عالمي لكل متنبئ في النموذج. سيتم توفير اختبارات متعددة الدرجات من الحرية للتأثيرات التي تحتوي على أكثر من مستويين.  \nيمكن الحصول على اختبارات والد ونسبة الاحتمالات، مع وجود اختبارات نسبة الاحتمالات التي تتمتع بخصائص أفضل في العينات الصغيرة.           \n<br/><br/>\n<b>الحزم المطلوبة:</b> البقاء، المكنسة، survminer، السيارة\n"
  }
}