{
  "title": "كوكس، متقدم",
  "navigation": "كوكس، متقدم",
  "helplabel": "انقر على زر ? في الزاوية العلوية اليمنى من الحوار للحصول على تفاصيل حول مجموعات البيانات النموذجية وصيغة البيانات المدعومة.",
  "modelname": "أدخل اسم النموذج",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الأحداث (1 = حدث 1، 0 = توقف)",
  "modelterms": "منشئ تعبير النموذج للمتغيرات المستقلة",
  "weightvar": "الأوزان (اختياري)",
  "tiemethod": "طريقة الوقت المرتبط",
  "forestplotbox": "مخطط الغابة",
  "diagnosticsbox": "تشخيص النموذج",
  "martscalebox": "قيمة الحد الأدنى لمحور المتبقيات في نموذج العدم مارتينغالي (-إنف إلى 1):",
  "devbox": "تحليل الانحراف (النوع الثاني)",
  "devtype": "إحصائية الاختبار",
  "help": {
    "title": "كوكس، متقدم",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n\t\t\tانظر مجموعة البيانات النموذجية في دليل التثبيت، الموقع الافتراضي هو حرف محرك الأقراص:&bsol;program files&bsol;BlueSky Statistics&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. يجب إدخال المتغير Followup_time كوقت للحدث أو التوقف ويجب إدخال المتغير Event كالأحداث (1 = حدث، 0 = توقف). يمكن أن تكون الجنس والعمر ومؤشر كتلة الجسم هي المتغيرات المستقلة. \n\t\t\t<br/>\n\t\t\tتعتبر هذه المجموعة من البيانات نسخة محدثة من مجموعة بيانات mockstudy في حزمة arsenal.\n\t\t\t<br/><br/>\n            <b>نموذج كوكس للمخاطر النسبية</b>\n            <br/>\n            <br/>\n            يناسب نموذج المخاطر النسبية لكوكس لبيانات الوقت حتى الحدث مع الملاحظات المتوقفة. يتم توفير إحصائيات ملاءمة النموذج، وتقديرات المعلمات، ونسب المخاطر. تشمل الخيارات المتاحة طريقة الوقت المرتبط، وتشخيص النموذج مثل تقييمات المخاطر النسبية وتقييمات الشكل الوظيفي للمتغيرات، ومخطط غابة لنسب المخاطر مع فترات الثقة. يتم ملاءمة النموذج باستخدام دالة coxph في حزمة survival.\n            <br/>\n            <br/>\n            <b>الوقت:</b> الوقت حتى الحدث لأولئك الذين يختبرون الحدث أو الوقت حتى آخر متابعة لأولئك الذين لا يختبرون الحدث\n            <br/><br/>\n            <b>الحدث:</b> مؤشر حدث رقمي؛ 1=حدث، 0=توقف\n            <br/><br/>\n            <b>المتغيرات المستقلة:</b> المتغيرات المستقلة التي يجب تضمينها في النموذج. سيتم ترميز العوامل والسلاسل والمتغيرات المنطقية كمتغيرات وهمية.\n            <br/><br/>\n            <b>الأوزان:</b> متغير رقمي لأوزان الملاحظات. مفيد في الحالات التي لا ينبغي فيها اعتبار كل سجل كملاحظة واحدة. \n            <br/>\n            <br/>\n            <b>الحزم المطلوبة:</b> survival، broom، survminer، car، BlueSky\n            <br/>\n            <br/>\n            انقر على زر الحصول على مساعدة R للحصول على مساعدة مفصلة حول دالة coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>الخيارات</b>\n            <br/>\n            <br/>\n            <b>طريقة الوقت المرتبط:</b>\n            <br/>\n            طريقة كسر الأوقات الملاحظة المرتبطة. عادةً ما تكون Efron الخيار الأفضل عندما لا تكون هناك أوقات مرتبطة كثيرة. يمكن أن تكون الطريقة الدقيقة مفيدة إذا كانت هناك أوقات مرتبطة كثيرة، كما هو الحال في الحالات الزمنية المنفصلة، ولكن قد يستغرق الأمر وقتًا أطول قليلاً لملاءمة النموذج. \n            <br/>\n            <br/>\n            <b>مخطط الغابة:</b>\n            <br/>\n            مخطط لنسب المخاطر وفترات الثقة لكل متنبئ في النموذج.\n            <br/>\n            <br/>\n            <b>تشخيص النموذج:</b>\n            <br/>\n            إذا تم تحديده، سيتم توفير اختبارات المخاطر النسبية والمخططات، بالإضافة إلى تقييمات الشكل الوظيفي لكل متغير في النموذج. قد تحتاج إلى تغيير خيار قيمة الحد الأدنى لمحور المتبقيات في نموذج العدم مارتينغالي بحيث تظهر جميع المتبقيات في المخطط. للحصول على تقييمات الشكل الوظيفي، يجب عليك تحديد فقط المتنبئين الرقميين وعدم وجود بيانات مفقودة. انظر المتغيرات > القيم المفقودة > إزالة NAs.\n            <br/>\n            <br/>\n            <b>تحليل الانحراف (النوع الثاني):</b>\n            اختبار عالمي لكل متنبئ في النموذج. سيتم توفير اختبارات متعددة درجات الحرية للتأثيرات التي تحتوي على أكثر من مستويين. يمكن الحصول على اختبارات والد واختبارات نسبة الاحتمالات، مع وجود خصائص أفضل لاختبارات نسبة الاحتمالات في عينات صغيرة.\n            \n      "
  }
}