{
  "title": "قائمة التداخل",
  "navigation": "قائمة التداخل",
  "destvarslabel": "المتغيرات للجدول",
  "missinglabel": "القيم المفقودة",
  "removelabel": "إزالة",
  "showexcludelabel": "عرض واستبعاد من النسب المئوية",
  "includelabel": "عرض وإدراج في النسب المئوية",
  "sparseoptlabel": "تضمين التركيبات ذات العد صفر",
  "toplistoptlabel": "عرض أعلى N من القيم الأكثر تكرارًا",
  "topnumlabel": "N",
  "help": {
    "title": "قائمة التداخل",
    "r_help": "help(freqlist, package ='arsenal')",
    "body": "\nهذا ينشئ جداول تكرارية في تنسيق قائمة لتركيبات من متغير واحد أو أكثر. سيتم جدول كل تركيبة من القيم عبر جميع المتغيرات المحددة، \nمع تكراراتها الملحوظة. يمكن أن تكون المتغيرات المحددة من أي فئة، بما في ذلك المتغيرات العددية المستمرة. بينما يمكن استخدام هذا لتكرارات ملخصة و \nنسب مئوية، فإن الاستخدام الرئيسي هو التحقق من البيانات من أجل عدم التناسق. يجب توخي الحذر بشأن عدد المتغيرات التي سيتم تصنيفها عبر الفئات وعدد الاحتمالات التي يمكن أن تنتج، حيث \nقد تستغرق بعض الجداول وقتًا أطول للإنتاج. \n<br/><br/>\n<b>المتغيرات للجدول:</b>  <br/>المتغيرات التي سيتم تضمينها في الجدول، والتي يمكن أن تكون من أي فئة. سيتم فرز الجدول وفقًا لترتيب المتغيرات في هذه القائمة.  \nهذا يعني أنه إذا كانت المتغيرات A و B هي الترتيب المحدد، فسيتم فرز الجدول حسب مستويات A، ثم مستويات B داخل A.\n<br/><br/>\n<b>القيم المفقودة</b>\n<br/>\n<ul>\n\t<li><b>إزالة:</b>  سيتم استبعاد تركيبات قيم المتغيرات التي تحتوي على NA من الجدول.</li>\n\t<li><b>عرض واستبعاد من النسب المئوية:</b>  سيتم تضمين تركيبات قيم المتغيرات التي تحتوي على NA في الجدول، ولكن لن يتم تضمينها في حسابات النسب المئوية.</li>\n\t<li><b>عرض وإدراج في النسب المئوية:</b>  سيتم تضمين تركيبات قيم المتغيرات التي تحتوي على NA في الجدول وسيتم تضمينها في حسابات النسب المئوية.</li> \n</ul>\n<br/><br/>\n<b>تضمين التركيبات ذات العد صفر:</b>  <br/>ما إذا كان يجب تضمين تركيبات قيم المتغيرات التي لا توجد في مجموعة البيانات. على سبيل المثال، إذا كانت المتغيرات A و B تحتويان على قيم ملحوظة من 1 و 2 و 3، ولكن تركيبة (A، B) (1، 3) لم يتم ملاحظتها في البيانات، ستتضمن هذه الخيار صفًا لتركيبة (1، 3) بتكرار 0.\n<br/><br/>\n<b>عرض أعلى N من القيم الأكثر تكرارًا:</b>  <br/>إذا تم تحديده، فسيتم إنشاء جدول منفصل مع أعلى N من التركيبات المتغيرة الأكثر تكرارًا.\n<ul>\n\t<li><b>N:</b> عدد التركيبات المتغيرة التي يجب عرضها لجدول أعلى N.</li>\n</ul>\n<b>حزم R المطلوبة:</b> arsenal\n\t\t\t"
  }
}