{
  "title": "تحقق من ترتيب التاريخ",
  "navigation": "تحقق من ترتيب التاريخ",
  "datevarslabel": "متغيرات التاريخ (حدد الأقدم إلى الأحدث؛ نفس الفئة؛ على الأقل 2)",
  "compgrplabel": "المقارنة",
  "compgrpnote": "ملاحظة: هذه هي المقارنة بين جميع التواريخ المحددة أعلاه التي سيتم التحقق منها بحثًا عن أخطاء الترتيب، على سبيل المثال، يجب أن تكون القيم date1<date2<date3.",
  "ltlabel": "<",
  "ltelabel": "<=",
  "idvarslabel": "متغيرات تعريف الصف (اختياري)",
  "dateerrorboxlabel": "إنشاء مجموعة بيانات مع متغير خطأ التاريخ",
  "dateerrordatanamelabel": "اسم مجموعة البيانات",
  "dateerrorvarlabel": "اسم متغير خطأ التاريخ",
  "help": {
    "title": "تحقق من ترتيب التاريخ",
    "r_help": "help('<', package = 'base')",
    "body": "\nهذا ينشئ قائمة بالصفوف في مجموعة البيانات النشطة حيث لا تكون قيم متغيرات التاريخ في ترتيب محدد. يساعد ذلك في تحديد الأخطاء المحتملة في متغيرات التاريخ عندما تكون التواريخ أو \nالأوقات مطلوبة للتحليل. على سبيل المثال، إذا كان من المفترض أن تكون ثلاثة أعمدة تاريخ في ترتيب date1 < date2 < date3، ستقوم هذه النافذة بطباعة جميع الملاحظات حيث \nلا تتبع قيم تلك المتغيرات ذلك الترتيب. القيم المفقودة للتواريخ مسموح بها في المتغيرات المحددة ولن تستخدم في أي مقارنات.\n<br/><br/>\n<b>متغيرات التاريخ (حدد الأقدم إلى الأحدث؛ نفس الفئة؛ على الأقل 2):</b> حدد على الأقل 2 من متغيرات التاريخ بترتيب الأقدم إلى الأحدث. يمكن أن تكون هذه أي فئة تاريخ \n(POSIXct، تاريخ)، ولكن يجب أن تكون جميع المتغيرات المحددة من نفس فئة التاريخ. إذا لم يكن الأمر كذلك، ستحدث خطأ.\n<br/><br/>\n<b>المقارنة:</b> حدد عامل المقارنة المستخدم لمقارنة قيم التاريخ. \"<\" تعني أقل من و \"<=\" تعني أقل من أو يساوي. إذا تم اختيار \"<\"، فسيتم الإشارة إلى التواريخ التي\nتكون متساوية كأخطاء. إذا تم اختيار \"<=\"، فلن يتم الإشارة إلى التواريخ التي تكون متساوية كأخطاء.\n<br/><br/>\n<b>متغيرات تعريف الصف (اختياري):</b> حدد واحدًا أو أكثر من المتغيرات التي قد تكون مفيدة لتحديد الصفوف. على سبيل المثال، رقم تعريف الموضوع. سيتم \nتضمين هذه في قائمة الأخطاء. إذا لم يتم تحديد أي متغيرات، سيكون رقم الصف في مجموعة البيانات هو المعرف الوحيد.\n<br/><br/>\n<b>إنشاء مجموعة بيانات مع متغير خطأ التاريخ:</b> سيؤدي ذلك إلى إنشاء مجموعة بيانات منفصلة مع البيانات الأصلية ومتغير يشير إلى ما إذا كانت كل ملاحظة تحتوي على خطأ في ترتيب التاريخ \n(مشفر كـ 1=خطأ في ترتيب التاريخ و 0=لا يوجد خطأ في ترتيب التاريخ). <b>اسم مجموعة البيانات</b> هو الاسم المرغوب لهذه المجموعة من البيانات و <b>اسم متغير خطأ التاريخ</b> هو الاسم المرغوب \nلمتغير خطأ ترتيب التاريخ في هذه المجموعة من البيانات.\n\t\t"
  }
}