{
  "title": "أشجار القرار",
  "navigation": "أشجار القرار",
  "TxtTreeName": "أدخل اسم النموذج",
  "TreeGenChkbox": "لا تعيد إنشاء إذا كانت الشجرة موجودة بالفعل",
  "dependent": "المتغير التابع",
  "independent": "المتغير (المتغيرات) المستقلة",
  "weights": "أوزان الاستطلاع",
  "TxtMinSplit": "الحد الأدنى من الانقسام",
  "minBucket": "الحد الأدنى من الدلو",
  "TxtCP": "معامل التعقيد",
  "maxDepth": "العمق الأقصى",
  "PruneTreeChkbox": "تشذيب الشجرة",
  "rd0": "لا تقليم",
  "rd1": "استخدم معامل التعقيد الأمثل",
  "rd2": "حدد معامل التعقيد",
  "TxtCPPrune": "أدخل معامل التعقيد",
  "PlotCVChkbox": "رسم التحقق المتقاطع",
  "PlotRSQRChkbox": "رسم R-squared",
  "OptvarPlots": "الرسوم البيانية",
  "OptvarPreprune": "التقليم المسبق",
  "OptvarPrune": "تشذيب الشجرة",
  "help": {
    "title": "أشجار القرار",
    "r_help": "help(rpart, package ='rpart')",
    "body": "\n                <b>ملاحظة</b></br>\n                يمكن أن تكون المتغيرات التابعة عاملًا أو ترتيبًا أو سلسلة أو منطقيًا أو عدديًا</br>\n                يمكن أن تكون المتغيرات المستقلة عاملًا أو ترتيبًا أو سلسلة أو منطقيًا أو عدديًا</br></br>\n                <b>الوصف</b></br>\n                ملاءمة نموذج شجرة التقسيم والانحدار المتكررة\n                <br/>\n                <b>الاستخدام</b>\n                <br/>\n                <code> \n                rpart(formula, data, weights, subset, na.action = na.rpart, method,\n                      model = FALSE, x = FALSE, y = TRUE, parms, control, cost, ...)\n                </code> <br/>\n                <b>المعلمات</b><br/>\n                <ul>\n                <li>\n                formula: صيغة، مع استجابة ولكن بدون مصطلحات تفاعل. إذا كانت هذه إطار بيانات، يتم أخذها كإطار النموذج (انظر model.frame).\n                </li>\n                <li>\n                data: إطار بيانات اختياري لتفسير المتغيرات المسماة في الصيغة.\n                </li>\n                <li>\n                weights: أوزان الحالات الاختيارية.\n                </li>\n                <li>\n                subset: تعبير اختياري يقول أنه يجب استخدام مجموعة فرعية فقط من صفوف البيانات في الملاءمة.\n                </li>\n                <li>\n                na.action: الإجراء الافتراضي يحذف جميع الملاحظات التي تكون فيها y مفقودة، ولكنه يحتفظ بتلك التي تكون فيها واحدة أو أكثر من المتنبئات مفقودة.\n                </li>\n                <li>\n                method: واحد من \"anova\"، \"poisson\"، \"class\" أو \"exp\". إذا كانت الطريقة مفقودة، فإن الروتين يحاول إجراء تخمين ذكي. إذا كانت y كائن بقاء، فإن method = \"exp\" يُفترض، إذا كانت y تحتوي على عمودين، فإن method = \"poisson\" يُفترض، إذا كانت y عاملًا، فإن method = \"class\" يُفترض، وإلا فإن method = \"anova\" يُفترض. من الحكمة تحديد الطريقة مباشرة، خاصةً حيث قد تُضاف معايير أخرى إلى الوظيفة في المستقبل.\n                بدلاً من ذلك، يمكن أن تكون الطريقة قائمة من الوظائف المسماة init و split و eval. يتم إعطاء أمثلة في الملف 'tests/usersplits.R' في المصادر، وفي الكتيبات 'User Written Split Functions'.\n                </li>\n                <li>\n                model: إذا كانت منطقية: هل تحتفظ بنسخة من إطار النموذج في النتيجة؟ إذا كانت قيمة الإدخال للنموذج هي إطار نموذج (من المحتمل أن تكون من مكالمة سابقة إلى وظيفة rpart)، فإن هذا الإطار يُستخدم بدلاً من إنشاء بيانات جديدة.\n                </li>\n                <li>\n                x: احتفظ بنسخة من مصفوفة x في النتيجة.\n                </li>\n                <li>\n                y: احتفظ بنسخة من المتغير التابع في النتيجة. إذا كانت مفقودة وتم توفير النموذج، فإن هذا الافتراضي يكون FALSE.\n                </li>\n                <li>\n                parms: معلمات اختيارية لوظيفة الانقسام.<br/>\n                تقسيم anova ليس له معلمات.<br/>\n                تقسيم poisson له معلمة واحدة، معامل التباين للتوزيع السابق على المعدلات. القيمة الافتراضية هي 1.<br/>\n                تقسيم exponential له نفس المعلمة مثل poisson.<br/>\n                بالنسبة لتقسيم التصنيف، يمكن أن تحتوي القائمة على أي من: متجه الاحتمالات السابقة (مكون سابق)، مصفوفة الخسارة (مكون خسارة) أو مؤشر الانقسام (مكون تقسيم). يجب أن تكون الاحتمالات إيجابية وتجمع إلى 1. يجب أن تحتوي مصفوفة الخسارة على أصفار على القطر وعناصر إيجابية خارج القطر. يمكن أن يكون مؤشر الانقسام gini أو المعلومات. الاحتمالات الافتراضية تتناسب مع عدد البيانات، والخسائر الافتراضية هي 1، والانقسام الافتراضي هو gini.<br/>\n                </li>\n                <li>\n                control: قائمة من الخيارات التي تتحكم في تفاصيل خوارزمية rpart. انظر rpart.control.\n                </li>\n                <li>\n                cost: متجه من التكاليف غير السلبية، واحد لكل متغير في النموذج. الافتراضي هو واحد لجميع المتغيرات. هذه هي التعديلات التي سيتم تطبيقها عند النظر في الانقسامات، لذا يتم تقسيم التحسين على الانقسام على تكلفته في تحديد أي انقسام يتم اختياره.\n                </li>\n                <li>\n                ...: يمكن أيضًا تحديد المعلمات لـ rpart.control في المكالمة إلى rpart. يتم التحقق منها مقابل قائمة المعلمات الصالحة.\n                </li>\n                </ul>\n                <b>التفاصيل</b></br>\n                يختلف هذا عن وظيفة الشجرة في S بشكل رئيسي في تعامله مع المتغيرات البديلة. في معظم التفاصيل، يتبع Breiman et. al (1984) عن كثب. توفر حزمة R tree إعادة تنفيذ للشجرة.\n                <b>القيمة</b></br>\n                كائن من فئة rpart. انظر rpart.object.</br>\n                <b>المراجع</b></br>\n                Breiman L.، Friedman J. H.، Olshen R. A.، و Stone، C. J. (1984) أشجار التصنيف والانحدار. Wadsworth.</br>\n                <b>انظر أيضًا</b></br>\n                rpart.control، rpart.object، summary.rpart، print.rpart</br>\n                <b>أمثلة</b></br>\n                fit <- rpart(Kyphosis ~ Age + Number + Start، data = kyphosis)</br>\n                fit2 <- rpart(Kyphosis ~ Age + Number + Start، data = kyphosis،\n                              parms = list(prior = c(.65,.35)، split = \"information\"))</br>\n                fit3 <- rpart(Kyphosis ~ Age + Number + Start، data = kyphosis،\n                              control = rpart.control(cp = 0.05))</br>\n                par(mfrow = c(1,2)، xpd = NA) # خلاف ذلك على بعض الأجهزة يتم قص النص</br>\n                plot(fit)</br>\n                text(fit، use.n = TRUE)</br>\n                plot(fit2)</br>\n                text(fit2، use.n = TRUE)</br>\n                <b>الحزمة</b></br>\n                rpart؛ rpart.plot؛ partykit</br>\n                <b>المساعدة</b></br>\n                help(rpart، package ='rpart')</br></br>\n                <b>الوصف</b></br>\n                التحكم في ملاءمات Rpart. معلمات مختلفة تتحكم في جوانب ملاءمة rpart.\n                <br/>\n                <b>الاستخدام</b>\n                <br/>\n                <code> \n                rpart.control(minsplit = 20، minbucket = round(minsplit/3)، cp = 0.01، \n                              maxcompete = 4، maxsurrogate = 5، usesurrogate = 2، xval = 10،\n                              surrogatestyle = 0، maxdepth = 30، ...)\n                </code> <br/>\n                <b>المعلمات</b><br/>\n                <ul>\n                <li>\n                minsplit: الحد الأدنى من عدد الملاحظات التي يجب أن توجد في عقدة من أجل محاولة الانقسام.\n                </li>\n                <li>\n                minbucket: الحد الأدنى من عدد الملاحظات في أي عقدة نهائية <leaf>. إذا تم تحديد أحد minbucket أو minsplit فقط، فإن الكود إما يحدد minsplit إلى minbucket*3 أو minbucket إلى minsplit/3، حسب الاقتضاء.\n                </li>\n                <li>\n                cp: معامل التعقيد. أي انقسام لا يقلل من عدم الملاءمة العامة بعامل cp لا يتم محاولة. على سبيل المثال، مع تقسيم anova، يعني هذا أن R-squared العام يجب أن يزيد بمقدار cp في كل خطوة. الدور الرئيسي لهذه المعلمة هو توفير الوقت الحاسوبي عن طريق تقليم الانقسامات التي من الواضح أنها ليست جديرة بالاهتمام. بشكل أساسي، يُعلم المستخدم البرنامج أن أي انقسام لا يحسن الملاءمة بمقدار cp من المحتمل أن يتم تقليمه بواسطة التحقق المتقاطع، وبالتالي لا يحتاج البرنامج إلى متابعته.\n                </li>\n                <li>\n                maxcompete: عدد الانقسامات المنافسة المحتفظ بها في الإخراج. من المفيد معرفة ليس فقط أي انقسام تم اختياره، ولكن أي متغير جاء في المرتبة الثانية، الثالثة، إلخ.\n                </li>\n                <li>\n                maxsurrogate: عدد الانقسامات البديلة المحتفظ بها في الإخراج. إذا تم تعيين هذا على صفر، فسيتم تقليل وقت الحساب، حيث يتم استخدام حوالي نصف الوقت الحاسوبي (بخلاف الإعداد) في البحث عن الانقسامات البديلة.\n                </li>\n                <li>\n                usesurrogate: كيفية استخدام البدائل في عملية الانقسام. 0 تعني العرض فقط؛ لا يتم إرسال ملاحظة بها قيمة مفقودة لقواعد الانقسام الأولية إلى أسفل الشجرة. 1 تعني استخدام البدائل، بترتيب، لتقسيم الموضوعات المفقودة للمتغير الأساسي؛ إذا كانت جميع البدائل مفقودة، فلا يتم تقسيم الملاحظة. لقيمة 2، إذا كانت جميع البدائل مفقودة، يتم إرسال الملاحظة في الاتجاه الأكثرية. تتوافق قيمة 0 مع إجراء الشجرة، و 2 مع توصيات Breiman et.al (1984).\n                </li>\n                <li>\n                xval: عدد التحقق المتقاطع.\n                </li>\n                <li>\n                surrogatestyle: يتحكم في اختيار أفضل بديل. إذا تم تعيينه على 0 (افتراضي)، يستخدم البرنامج العدد الإجمالي للتصنيفات الصحيحة لمتغير بديل محتمل، إذا تم تعيينه على 1، فإنه يستخدم النسبة المئوية الصحيحة، المحسوبة على القيم غير المفقودة للبديل. الخيار الأول يعاقب بشدة المتغيرات ذات عدد كبير من القيم المفقودة.\n                </li>\n                <li>\n                maxdepth: تعيين الحد الأقصى لعمق أي عقدة من الشجرة النهائية، مع احتساب العقدة الجذرية كعمق 0. القيم الأكبر من 30 ستعطي نتائج غير منطقية على الآلات 32 بت.\n                </li>\n                <li>\n                ...: جمع المعلمات الأخرى.\n                </li>\n                </ul>\n                <b>القيمة</b></br>\n                قائمة تحتوي على الخيارات. \n                      "
  }
}