{
  "title": "اختبار تشخيصي",
  "navigation": "اختبار تشخيصي",
  "outvar": "متغير النتيجة (1=إيجابي، 0=سلبي):",
  "testvar": "متغير الاختبار (1=إيجابي، 0=سلبي):",
  "cilevel": "مستوى الثقة:",
  "help": {
    "title": "اختبار تشخيصي",
    "r_help": "help(epi.tests,package=epiR)",
    "body": "\n<b>الوصف</b></br>\nهذا يحسب مقاييس مختلفة مناسبة في دراسات الاختبار التشخيصي لاختبار ثنائي مقابل نتيجة معيارية ذهبية ثنائية للكشف عن \"مرض\".<br/>\nمتغير النتيجة: متغير يحتوي على القيم للمعيار الذهبي. يجب أن يكون هذا متغيرًا عدديًا مشفرًا كـ 1 = \"مرض\" إيجابي و 0 = \"مرض\" سلبي، حيث تعتمد الحسابات على هذا الترتيب.<br/>\nمتغير الاختبار: متغير يحتوي على القيم للاختبار المعني. يجب أن يكون هذا متغيرًا عدديًا مشفرًا كـ 1 = \"مرض\" إيجابي و 0 = \"مرض\" سلبي، حيث تعتمد الحسابات على هذا الترتيب.<br/>\nمستوى الثقة: مستوى فترة الثقة المرغوب<br/>\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nepi.tests(dat, conf.level = 0.95)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\ndat: كائن من فئة الجدول يحتوي على تكرارات الخلايا الفردية التي تم إنشاؤها عن طريق جدول متغير النتيجة ومتغير الاختبار. يحتوي متغير النتيجة على القيم للمعيار الذهبي. يجب أن يكون هذا متغيرًا عدديًا مشفرًا كـ 1 = \"مرض\" إيجابي و 0 = \"مرض\" سلبي، حيث تعتمد الحسابات على هذا الترتيب. يحتوي متغير الاختبار على القيم للاختبار المعني. يجب أن يكون هذا متغيرًا عدديًا مشفرًا كـ 1 = \"مرض\" إيجابي و 0 = \"مرض\" سلبي، حيث تعتمد الحسابات على هذا الترتيب.\n</li>\n<li>\nمستوى الثقة: مستوى فترة الثقة المرغوب\n</li>\n</ul>\n<b>التفاصيل</b></br>\nتُحسب حدود الثقة الثنائية الدقيقة لحساسية الاختبار، والخصوصية، والقيمة التنبؤية الإيجابية والسلبية (انظر كوليت 1999 للتفاصيل).</br>\nتستند فترات الثقة لنسب الاحتمالات الإيجابية والسلبية إلى الصيغ المقدمة من سيميل وآخرون (1991).</br>\nتُعرف دقة التشخيص على أنها نسبة جميع الاختبارات التي تعطي نتيجة صحيحة. تُعرف نسبة الاحتمالات التشخيصية على أنها مدى احتمال أن يجعل الاختبار التشخيص صحيحًا أكثر من تشخيص غير صحيح في المرضى الذين يعانون من المرض (سكوت وآخرون 2008). يُعرف العدد المطلوب للتشخيص على أنه عدد المرضى الذين يحتاجون إلى الاختبار لإعطاء اختبار إيجابي صحيح واحد. يُعرف مؤشر يودن بأنه الفرق بين معدل الإيجابيات الحقيقية ومعدل الإيجابيات الكاذبة. يتراوح مؤشر يودن من -1 إلى +1 مع قيم أقرب إلى 1 إذا كانت كل من الحساسية والخصوصية مرتفعة (أي قريبة من 1).</br>\n<b>القيمة</b></br>\nانظر المساعدة التفصيلية أدناه للوصول إلى مساعدة R التي ستصف القيم المعادة</br>\n<b>الحزمة</b></br>\nepiR;DescTools</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة تفصيلية، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(epi.tests,package=epiR) عن طريق إنشاء كتلة كود R بالنقر على + في نافذة الإخراج\n\t\t\t"
  }
}