{
  "title": "ملاءمة التوزيعات الأحادية المتغيرات للبيانات غير المقيدة (مع قيمة P)",
  "navigation": "ملاءمة التوزيع قيمة P",
  "variableSelcted": "اختر متغيرًا يحتوي على التوزيع",
  "label1": "كن على علم بأن اختبار الملاءمة للتوزيعات عادة ما يستغرق وقتًا أطول لإكماله",
  "label2": "اختبار الملاءمة لمختلف التوزيعات",
  "normDistChk": "طبيعي",
  "weibullDistChk": "ويبل",
  "lnormDistChk": "لوغاريتمي طبيعي",
  "poissonDistChk": "بواسون",
  "expDistChk": "أسّي",
  "gammaDistChk": "جاما",
  "nbinomDistChk": "ثنائي سالب",
  "geomDistChk": "هندسي",
  "betaDistChk": "بيتا",
  "unifDistChk": "موحد",
  "logisDistChk": "لوجستي",
  "cauchyDistChk": "كاوشي",
  "method": "طريقة الملاءمة",
  "gof": "جودة الملاءمة (gof) - مطلوبة فقط عند اختيار طريقة 'mge' للملاءمة أعلاه",
  "shoChiqTestChk": "عرض نتائج اختبار كاي تربيع للتوزيع المستمر",
  "showCompareTablesOnlyChk": "عرض فقط جداول وبيانات مقارنة التوزيع. يجب عليك إلغاء تحديد هذا إذا كنت تختار توزيعًا واحدًا فقط",
  "bootstrapIter": "تستخدم طريقة Bootstrap لتحسين دقة القيمة p. عدد التكرارات الافتراضي هو 600. قد تحسن المزيد من التكرارات الدقة ولكنها ستستغرق وقتًا أطول للحساب",
  "help": {
    "title": "ملاءمة التوزيعات الأحادية المتغيرات للبيانات غير المقيدة",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>الوصف</b></br>\n\t\t\t\tملاءمة التوزيعات الأحادية المتغيرات للبيانات غير المقيدة بواسطة الاحتمالية القصوى (mle) ، مطابقة اللحظات (mme) ، مطابقة الكميات (qme) أو تعظيم تقدير جودة الملاءمة (mge) المعروف أيضًا بتقليل تقدير المسافة.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tللحصول على مساعدة تفصيلية - استخدم R help(fitdist, package = fitdistrplus) و help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tتوجد أربع طرق ملاءمة ممكنة موصوفة أدناه:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method=\"mle\" (افتراضي)\n\t\t\t\tيتكون تقدير الاحتمالية القصوى من تعظيم اللوغاريتم الاحتمالي. يتم إجراء تحسين عددي في mledist عبر optim للعثور على أفضل القيم (انظر mledist للحصول على التفاصيل).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method=\"mme\"\n\t\t\t\tيتكون تقدير مطابقة اللحظات من معادلة اللحظات النظرية واللحظات التجريبية. يتم حساب القيم المقدرة لمتغيرات التوزيع بواسطة صيغة مغلقة للتوزيعات التالية: \"norm\" ، \"lnorm\" ، \"pois\" ، \"exp\" ، \"gamma\" ، \"nbinom\" ، \"geom\" ، \"beta\" ، \"unif\" و \"logis\". خلاف ذلك ، يتم مطابقة اللحظات النظرية والتجريبية عدديًا ، من خلال تقليل مجموع الفروق المربعة بين اللحظات المرصودة والنظرية. في هذه الحالة الأخيرة ، هناك حاجة إلى مزيد من الحجج في استدعاء fitdist: order و memp (انظر mmedist للحصول على التفاصيل).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method = \"qme\"\n\t\t\t\tيتكون تقدير مطابقة الكميات من معادلة الكميات النظرية والتجريبية. يتم إجراء تحسين عددي في qmedist عبر optim لتقليل مجموع الفروق المربعة بين الكميات المرصودة والنظرية. يتطلب استخدام هذه الطريقة حجة إضافية probs ، تعرف كمتجه عددي من الاحتمالات التي يجب مطابقة الكمية (الكميات) لها (انظر qmedist للحصول على التفاصيل).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method = \"mge\"\n\t\t\t\tيتكون تقدير جودة الملاءمة القصوى من تعظيم إحصائيات جودة الملاءمة. يتم إجراء تحسين عددي في mgedist عبر optim لتقليل مسافة جودة الملاءمة. يتطلب استخدام هذه الطريقة حجة إضافية gof coding لمسافة جودة الملاءمة المختارة. يمكن استخدام مسافة كرامر-فون ميس (\"CvM\") ، مسافة كولموغوروف-سميرنوف (\"KS\") ، مسافة أندرسون-دارلينغ (\"AD\") التي تعطي وزنًا أكبر لذيول التوزيع ، أو أحد المتغيرات من هذه المسافة الأخيرة المقترحة بواسطة لوكينو (2006) (انظر mgedist للحصول على مزيد من التفاصيل). هذه الطريقة غير مناسبة للتوزيعات المنفصلة.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method = \"mse\"\n\t\t\t\tيتكون تقدير جودة الملاءمة القصوى من تعظيم متوسط المسافة اللوغاريتمية. يتم إجراء تحسين عددي في msedist عبر optim.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tالتقارب هو \n\t\t\t\tرمز صحيح لتقارب optim/constrOptim المحدد أدناه أو المحدد بواسطة المستخدم في وظيفة التحسين المقدمة من قبل المستخدم. 0 يشير إلى تقارب ناجح. 1 يشير إلى أن حد التكرار لـ optim قد تم الوصول إليه. 10 يشير إلى تدهور بسيط. 100 يشير إلى أن optim واجه خطأ داخلي.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tتُحسب إحصائيات جودة الملاءمة بواسطة gofstat(). يتم حساب إحصائية كاي تربيع باستخدام خلايا محددة بواسطة حجة chisqbreaks أو خلايا محددة تلقائيًا من البيانات ، من أجل الوصول تقريبًا إلى نفس عدد الملاحظات لكل خلية ، تقريبًا يساوي حجة meancount ، أو قليلاً أكثر إذا كانت هناك بعض الروابط. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tبالنسبة للتوزيعات المستمرة ، يتم أيضًا حساب إحصائيات كولموغوروف-سميرنوف وكرامر-فون ميس وأندرسون-دارلينغ ، كما هو محدد بواسطة ستيفنز (1986).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tإحصائيات الأهمية هي كرامر-فون ميس وأندرسون-دارلينغ وإحصائيات كولموغوروف للتوزيعات المستمرة وإحصائيات كاي تربيع للتوزيعات المنفصلة (\"binom\" ، \"nbinom\" ، \"geom\" ، \"hyper\" و \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">للحصول على نظرة عامة جيدة حول ملاءمة التوزيع ، انظر https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">للحصول على نظرة عامة جيدة حول ملاءمة التوزيع ، انظر https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}