{
  "title": "رسم كولين وفراي مع أوصاف لتوزيع تجريبي للبيانات غير المقيدة",
  "navigation": "تحليل التوزيع (رسم كولين وفراي)",
  "variableSelcted": "اختر متغيرًا يحتوي على التوزيع",
  "boot": "(اختياري) قيم الانحراف والتفرطح. إذا تم تحديدها، يجب أن تكون عددًا صحيحًا فوق 10",
  "discreteChk": "منفصل - غير محدد (افتراضي) للتوزيع المتساوي، الطبيعي، اللوجستي، اللوغاريتمي، بيتا وغاما. محدد لتوزيع بواسون والتوزيع الثنائي السالب",
  "method": "غير متحيز (افتراضي) للقيم المقدرة غير المتحيزة للإحصائيات أو عينة للقيم العينية",
  "help": {
    "title": "وصف توزيع تجريبي للبيانات غير المقيدة",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>الوصف</b></br>\n\t\t\t\tيحسب المعلمات الوصفية لتوزيع تجريبي للبيانات غير المقيدة ويقدم رسمًا للانحراف والتفرطح\n\t\t\t\t<br/>\n\t\t\t\tللحصول على مساعدة تفصيلية - استخدم R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tالحد الأدنى، الحد الأقصى، الوسيط، المتوسط، الانحراف المعياري للعينة، و(إذا كانت الطريقة==\"عينة\") أو تقديرات غير متحيزة افتراضية للانحراف وقيم تفرطح بيرسون مطبوعة (سوكل ورولف، 1995). يتم تقديم رسم الانحراف والتفرطح مثل الذي اقترحه كولين وفراي (1999) للتوزيع التجريبي. في هذا الرسم، يتم عرض قيم للتوزيعات الشائعة كأدوات لمساعدة اختيار التوزيعات المناسبة للبيانات. لبعض التوزيعات (طبيعي، متساوي، لوجستي، أسي على سبيل المثال)، هناك قيمة واحدة فقط ممكنة للانحراف والتفرطح (لتوزيع طبيعي على سبيل المثال، الانحراف = 0 والتفرطح = 3)، وبالتالي يتم تمثيل التوزيع كنقطة على الرسم. بالنسبة لتوزيعات أخرى، يتم تمثيل مناطق القيم الممكنة، تتكون من خطوط (توزيعات غاما واللوغاريتمية على سبيل المثال)، أو مناطق أكبر (توزيع بيتا على سبيل المثال). توزيع ويبل غير ممثل على الرسم ولكن يتم الإشارة في الأسطورة إلى أن الأشكال القريبة من التوزيعات اللوغاريتمية والغاما قد يتم الحصول عليها مع هذا التوزيع.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tمن أجل أخذ عدم اليقين في القيم المقدرة للتفرطح والانحراف من البيانات في الاعتبار، يمكن أن يتم إعادة تشكيل مجموعة البيانات عن طريق تثبيت الحجة boot إلى عدد صحيح فوق 10. يتم حساب قيم الانحراف والتفرطح المقابلة لعينات bootstrap ثم يتم الإبلاغ عنها باللون الأزرق على رسم الانحراف والتفرطح.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tإذا كانت القيمة المنفصلة صحيحة، فإن التوزيعات الممثلة هي توزيعات بواسون، وتوزيعات ثنائية سالبة، والتوزيع الطبيعي الذي قد تتقارب إليه التوزيعات المنفصلة السابقة. إذا كانت القيمة المنفصلة خاطئة، فإنها تكون توزيعات متساوية، طبيعية، لوجستية، لوغاريتمية، بيتا وغاما.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">للحصول على نظرة عامة جيدة عن ملاءمة التوزيع، انظر https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}