{
  "title": "ملاءمة التوزيعات الأحادية للبيانات غير المقيدة",
  "navigation": "ملاءمة التوزيع",
  "variableSelcted": "اختر متغيرًا يحتوي على التوزيع",
  "label2": "اختبار الملاءمة لمختلف التوزيعات",
  "normDistChk": "طبيعي",
  "weibullDistChk": "ويبل",
  "lnormDistChk": "لوغاريتمي طبيعي",
  "poissonDistChk": "بواسون",
  "expDistChk": "أسّي",
  "gammaDistChk": "غاما",
  "nbinomDistChk": "ثنائي سالب",
  "geomDistChk": "هندسي",
  "betaDistChk": "بيتا",
  "unifDistChk": "موحد",
  "logisDistChk": "لوجستي",
  "cauchyDistChk": "كاوشي",
  "method": "طريقة الملاءمة",
  "gof": "جودة الملاءمة (gof) - مطلوبة فقط عند اختيار طريقة 'mge' أعلاه",
  "help": {
    "title": "ملاءمة التوزيعات الأحادية للبيانات غير المقيدة",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>الوصف</b></br>\n\t\t\t\tملاءمة التوزيعات الأحادية للبيانات غير المقيدة بواسطة الاحتمالية القصوى (mle) أو مطابقة اللحظات (mme) أو مطابقة الكميات (qme) أو تعظيم تقدير جودة الملاءمة (mge) المعروف أيضًا بتقليل تقدير المسافة.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tللحصول على مساعدة تفصيلية - استخدم R help(fitdist, package = fitdistrplus) و help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tطرق الملاءمة الأربعة موصوفة أدناه:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method=\"mle\" (افتراضي)\n\t\t\t\tيتكون تقدير الاحتمالية القصوى من تعظيم اللوغاريتم الاحتمالي. يتم إجراء تحسين عددي في mledist عبر optim للعثور على أفضل القيم (انظر mledist للحصول على التفاصيل).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method=\"mme\"\n\t\t\t\tيتكون تقدير مطابقة اللحظات من معادلة اللحظات النظرية والتجريبية. يتم حساب القيم المقدرة لمعاملات التوزيع بواسطة صيغة مغلقة للتوزيعات التالية: \"norm\"، \"lnorm\"، \"pois\"، \"exp\"، \"gamma\"، \"nbinom\"، \"geom\"، \"beta\"، \"unif\" و \"logis\". خلاف ذلك، يتم مطابقة اللحظات النظرية والتجريبية عدديًا، من خلال تقليل مجموع الفروق المربعة بين اللحظات الملاحظة والنظرية. في هذه الحالة الأخيرة، هناك حاجة إلى مزيد من الحجج في الاتصال بـ fitdist: order و memp (انظر mmedist للحصول على التفاصيل).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method = \"qme\"\n\t\t\t\tيتكون تقدير مطابقة الكميات من معادلة الكميات النظرية والتجريبية. يتم إجراء تحسين عددي في qmedist عبر optim لتقليل مجموع الفروق المربعة بين الكميات الملاحظة والنظرية. يتطلب استخدام هذه الطريقة حجة إضافية probs، المحددة كمتجه عددي من الاحتمالات التي يجب مطابقة الكمية (الكميات) لها (انظر qmedist للحصول على التفاصيل).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method = \"mge\"\n\t\t\t\tيتكون تقدير جودة الملاءمة القصوى من تعظيم إحصائيات جودة الملاءمة. يتم إجراء تحسين عددي في mgedist عبر optim لتقليل مسافة جودة الملاءمة. يتطلب استخدام هذه الطريقة حجة إضافية gof coding لمسافة جودة الملاءمة المختارة. يمكن استخدام مسافة كرامر-فون ميسيس الكلاسيكية (\"CvM\")، أو مسافة كولموغوروف-سميرنوف الكلاسيكية (\"KS\")، أو مسافة أندرسون-دارلينغ الكلاسيكية (\"AD\") التي تعطي وزنًا أكبر لأطراف التوزيع، أو أحد المتغيرات لهذه المسافة الأخيرة المقترحة من قبل لوكينو (2006) (انظر mgedist لمزيد من التفاصيل). هذه الطريقة غير مناسبة للتوزيعات المنفصلة.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tعندما method = \"mse\"\n\t\t\t\tيتكون تقدير جودة الملاءمة القصوى من تعظيم متوسط المسافة اللوغاريتمية. يتم إجراء تحسين عددي في msedist عبر optim.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tالتقارب هو \n\t\t\t\tرمز صحيح لتقارب optim/constrOptim المحدد أدناه أو المحدد من قبل المستخدم في وظيفة التحسين المقدمة من قبل المستخدم. 0 يشير إلى تقارب ناجح. 1 يشير إلى أن حد التكرار لـ optim قد تم الوصول إليه. 10 يشير إلى تدهور بسيط. 100 يشير إلى أن optim واجه خطأ داخلي.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tإحصائيات جودة الملاءمة يتم حسابها بواسطة gofstat(). يتم حساب إحصائية كاي-تربيع باستخدام خلايا محددة بواسطة الحجة chisqbreaks أو خلايا محددة تلقائيًا من البيانات، من أجل الوصول تقريبًا إلى نفس عدد الملاحظات لكل خلية، تقريبًا يساوي الحجة meancount، أو قليلاً أكثر إذا كانت هناك بعض الروابط. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tللتوزيعات المستمرة، يتم أيضًا حساب إحصائيات كولموغوروف-سميرنوف، كرامر-فون ميسيس وأندرسون-دارلينغ، كما هو محدد بواسطة ستيفنز (1986).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tإحصائيات الأهمية هي إحصائيات كرامر-فون ميسيس، أندرسون-دارلينغ وإحصائيات كولموغوروف للتوزيعات المستمرة وإحصائيات كاي-تربيع للتوزيعات المنفصلة (\"binom\"، \"nbinom\"، \"geom\"، \"hyper\" و \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">للحصول على نظرة عامة جيدة حول ملاءمة التوزيع، انظر https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">للحصول على نظرة عامة جيدة حول ملاءمة التوزيع، انظر https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}