{
  "title": "نظرة سريعة على وظيفة تصميم التجارب (DoE)",
  "navigation": "نظرة عامة على DoE",
  "lbl1": "1. لإنشاء أي تصميم تحت DOE -> قائمة إنشاء التصميم، تحتاج أولاً إلى مجموعة بيانات تحتوي على تفاصيل العوامل لإنشاء التصميم منها.",
  "lbl2": "2. للبدء، اختر واحدة من مجموعات البيانات النموذجية (ملف إكسل) المقدمة في دليل مجموعة البيانات النموذجية في دليل تثبيت التطبيق الخاص بك أو يمكنك إنشاء جدول/مجموعة بيانات بتفاصيل العوامل في الوقت الفعلي باستخدام قائمة DOE -> إنشاء تفاصيل عوامل DoE.",
  "lbl3": "3. بمجرد فتح مجموعة بيانات باستخدام قائمة فتح الملف أو إنشائها في الوقت الفعلي في الخطوة 2 أعلاه، انتقل إلى قائمة DOE -> إنشاء تصميم لإنشاء تصميم مناسب.",
  "lbl4": "4. بعد إنشاء التصميم بنجاح، سيظهر في شبكة واجهة المستخدم لمجموعة البيانات. يمكنك استخدام قائمة DOE -> فحص التصميم لفحص التصميم الذي تم إنشاؤه للتو.",
  "lbl5": "5. دعنا نصدر التصميم إلى دليل نظام الملفات باستخدام قائمة DOE -> تصدير التصميم. سيقوم تلقائيًا بإنشاء ثلاثة ملفات (.csv، .rda، .html) بنفس أسماء مجموعة بيانات التصميم في مسار دليل الملفات المحدد.",
  "lbl6": "6. الملف csv الذي تم تصديره في الخطوة 5 مخصص للاستخدام في إعداد التجارب في العالم الحقيقي كما هو محدد في التصميم لجمع/تسجيل النتائج للتحليل لاحقًا.",
  "lbl7": "7. يتم تسجيل النتائج وإضافتها كأعمدة منفصلة تسمى الاستجابات في مفردات DoE في ملف csv. لا تغير امتداد ملف csv إلى أي تنسيق ملف آخر. راجع دليل مجموعة البيانات النموذجية لـ DoE، وأمثلة على ملفات csv المميزة كـ معresp للحصول على القيم لأعمدة النتائج/الاستجابة لنسخها لإنشاء أعمدة استجابة في ملف csv الخاص بك الذي تم تصديره كجزء من تصدير التصميم في الخطوة 5 أعلاه.",
  "lbl8": "8. دعنا نستورد ملف تصميم csv مع أعمدة الاستجابة المضافة مرة أخرى إلى التطبيق باستخدام قائمة DOE -> استيراد استجابة التصميم.",
  "lbl9": "9. لاستيراد ملف csv للتصميم في الخطوة 8، يجب أن يكون التصميم الأصلي (الذي تم تصديره) متاحًا في شبكة واجهة المستخدم لمجموعة البيانات. إذا لم يكن متاحًا، استخدم قائمة فتح الملف لتحميل ملف .rda للتصميم الذي تم إنشاؤه كجزء من تصدير التصميم في الخطوة 5.",
  "lbl10": "10. بعد استيراد ملف csv بنجاح ضد مجموعة بيانات التصميم الصحيحة/النشطة وإنشاء تصميم جديد مع أعمدة الاستجابة، يمكنك استخدام قائمة DOE -> فحص التصميم لفحص التصميم مع أعمدة الاستجابة.",
  "lbl11": "11. الآن التصميم مع أعمدة الاستجابة جاهز للتحليل باستخدام قائمة DOE -> تحليل التصميم مع طرق تحليل متنوعة، مثل النموذج الخطي، نموذج سطح الاستجابة، إلخ."
}