{
  "title": "نظرة سريعة على تصميم تجارب (DoE) الوظائف",
  "navigation": "نظرة عامة على DoE",
  "lbl1": "1. لإنشاء أي تصميم تحت DOE -> قائمة إنشاء التصميم، تحتاج أولاً إلى مجموعة بيانات تحتوي على تفاصيل العوامل لإنشاء التصميم منها",
  "lbl2": "2. للبدء، اختر واحدة من مجموعات البيانات النموذجية (ملف إكسل) المتاحة في دليل مجموعة البيانات النموذجية في دليل تثبيت BioStat Prime الخاص بك أو يمكنك إنشاء جدول/مجموعة بيانات لتفاصيل العوامل على الفور باستخدام DOE -> إنشاء تفاصيل عوامل DoE",
  "lbl3": "3. بمجرد فتح مجموعة بيانات باستخدام قائمة فتح الملف أو إنشائها على الفور في الخطوة 2 أعلاه، انتقل إلى DOE -> قائمة إنشاء التصميم لإنشاء تصميم مناسب",
  "lbl4": "4. بعد إنشاء التصميم بنجاح، سيظهر في شبكة واجهة المستخدم لمجموعة البيانات. يمكنك استخدام DOE -> قائمة فحص التصميم لفحص التصميم الذي تم إنشاؤه للتو",
  "lbl5": "5. دعنا نصدر التصميم إلى دليل نظام الملفات باستخدام قائمة DOE -> تصدير التصميم. سيقوم تلقائيًا بإنشاء ثلاثة ملفات (.csv، .rda، .html) بنفس أسماء مجموعة بيانات التصميم في مسار دليل الملفات المحدد",
  "lbl6": "6. الملف csv الذي تم تصديره في الخطوة 5 مخصص لاستخدامه في إعداد التجارب في العالم الحقيقي كما هو محدد في التصميم لجمع/تسجيل النتائج للتحليل لاحقًا",
  "lbl7": "7. يتم تسجيل النتائج وإضافتها كأعمدة منفصلة تسمى الاستجابات في مفردات DoE إلى ملف csv. لا تغير امتداد ملف csv إلى أي تنسيق ملف آخر. انظر دليل مجموعة البيانات النموذجية لـ DoE، أمثلة على ملفات csv المميزة بـ withresp للحصول على القيم لأعمدة النتائج/الاستجابة لنسخها لإنشاء أعمدة استجابة في ملف csv الخاص بك الذي تم تصديره كجزء من تصدير التصميم في الخطوة 5 أعلاه",
  "lbl8": "8. دعنا نستورد ملف تصميم csv مع أعمدة الاستجابة المضافة مرة أخرى إلى تطبيق BlueSky Statistic باستخدام قائمة DOE -> استيراد استجابة التصميم",
  "lbl9": "9. لاستيراد ملف تصميم csv في الخطوة 8، يجب أن يكون التصميم الأصلي (الذي تم تصديره) متاحًا في شبكة واجهة المستخدم لمجموعة البيانات. إذا لم يكن متاحًا، استخدم قائمة فتح الملف لتحميل ملف التصميم .rda الذي تم إنشاؤه كجزء من تصدير التصميم في الخطوة 5",
  "lbl10": "10. بعد استيراد ملف csv بنجاح ضد مجموعة بيانات التصميم الصحيحة/النشطة وإنشاء تصميم جديد مع أعمدة الاستجابة، يمكنك استخدام قائمة DOE -> فحص التصميم لفحص التصميم مع أعمدة الاستجابة",
  "lbl11": "11. الآن التصميم مع أعمدة الاستجابة جاهز للتحليل باستخدام قائمة DOE -> تحليل التصميم مع طرق تحليل متنوعة مثل النموذج الخطي، نموذج سطح الاستجابة، إلخ"
}