{
  "title": "إسقاط المستويات غير المستخدمة",
  "navigation": "إسقاط غير مستخدم",
  "target": "المتغيرات العاملية لإسقاط المستويات من أجل",
  "label1": "أدخل المتغيرات العاملية لإسقاط المستويات من أجلها. يمكنك تحديد المستويات غير المستخدمة للإسقاط عن طريق إدخالها أو اختيار إسقاط جميع المستويات غير المستخدمة للمتغيرات المحددة. إذا كان المتغير في مجموعة البيانات يحتوي على قيمة NA في البيانات، فلن يتم إسقاط ذلك المستوى.",
  "label2": "احفظ المستويات الجديدة في متغيرات جديدة أو استبدل المتغيرات الموجودة",
  "rd3": "حدد لاحقة (سيتم إنشاء متغير جديد باللاحقة)",
  "txt3": "أدخل لاحقة",
  "rd2": "حدد بادئة (سيتم إنشاء متغير جديد بالبادئة)",
  "txt4": "أدخل بادئة",
  "rd1": "استبدل المتغيرات الموجودة",
  "label3": "الطريقة المستخدمة",
  "dropUnused": "إسقاط جميع المستويات غير المستخدمة",
  "levelsToDrop": "حدد المستويات للإسقاط",
  "drop": "أدخل المستويات للإسقاط مفصولة بفواصل، على سبيل المثال: المستوى1، المستوى2، المستوى3 ملاحظة: لا تستخدم المسافات كفواصل بين المستويات",
  "help": {
    "title": "إسقاط المستويات غير المستخدمة",
    "r_help": "help(fct_drop, package =forcats)",
    "body": "\n<b>ملاحظة: لا تقم بتضمين المستويات في علامات اقتباس مزدوجة أو مفردة، لا يمكن أن تكون هناك مسافات في أسماء المستويات. أدخل المستويات مفصولة بفواصل بالتنسيق: المستوى1، المستوى2، المستوى3</b></br>\n<b>الوصف</b></br>\nأدخل المتغيرات العاملية لإسقاط المستويات غير المستخدمة. يمكنك تحديد المستويات غير المستخدمة للإسقاط عن طريق إدخالها أو اختيار إسقاط جميع المستويات غير المستخدمة للمتغيرات المحددة. إذا كان المتغير في مجموعة البيانات يحتوي على قيمة NA في البيانات، فلن يتم إسقاط ذلك المستوى.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nfct_drop(f, only)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nf: متغير عامل (أو متجه حرفي).\n</li>\n<li>\nonly: متجه حرفي يقيد مجموعة المستويات التي سيتم إسقاطها. إذا تم تقديمه، سيتم إزالة المستويات التي ليس لها إدخالات وتظهر في هذا المتجه فقط.\n</li>\n</ul>\n<b>أمثلة</b><br/>\n</code>\nf <- factor(c(\"a\", \"b\"), levels = c(\"a\", \"b\", \"c\"))<br/>\nf<br/>\nfct_drop(f)<br/>\n# تعيين only لتقييد المستويات التي سيتم إسقاطها<br/>\nfct_drop(f, only = \"a\")<br/>\nfct_drop(f, only = \"c\")<br/>\n<b>الحزمة</b></br>\nforcats</br>\n<b>المساعدة</b></br>\nhelp(fct_drop, package =forcats)\n"
  }
}