{
  "title": "إعادة ترتيب مستويات العامل يدويًا",
  "navigation": "إعادة الترتيب يدويًا",
  "reordervarlabel": "العامل لإعادة الترتيب",
  "levelslabel": "حدد مستويات العامل التي تريد نقلها (مع علامات الاقتباس): على سبيل المثال 'المستوى 1'، 'المستوى 2'، إلخ.",
  "placelabel": "أين تضع المستويات",
  "firstlabel": "الأول",
  "lastlabel": "الأخير",
  "newoverwritelabel": "إنشاء متغير جديد أو الكتابة فوق المتغير الموجود",
  "newvarlabel": "متغير جديد",
  "overwritevarlabel": "الكتابة فوق المتغير",
  "newvarnamelabel": "اسم المتغير الجديد (بدون مسافات / أحرف خاصة)",
  "help": {
    "title": "إعادة ترتيب مستويات العامل يدويًا",
    "r_help": "help(fct_relevel, package ='forcats')",
    "body": "\nيستخدم هذا لتحديد مستوى أو أكثر من مستويات العامل التي تريد وضعها أولاً أو أخيراً في ترتيب الفرز. يمكن أن يكون هذا مفيدًا للنماذج، \nحيث يصبح مستوى العامل الأول هو مجموعة المرجع لتقديرات المعلمات عند استخدام ترميز خلية المرجع. يمكن أن تكون مفيدة أيضًا في \nالرسم البياني حيث يتم استخدام ترتيب الفرز لعرض الفئات.\n<br/><br/>\n<b>العامل لإعادة الترتيب:</b> العامل الذي تريد إعادة ترتيبه\n<br/><br/>\n<b>حدد مستويات العامل التي تريد نقلها (مع علامات الاقتباس): </b> هذه هي مستويات العامل التي تريد إعادة ترتيبها. \nسيتم إعادة ترتيب المستويات الموجودة فقط. إذا قمت بتحديد مستوى غير موجود، سيتم إخراج تحذير، ولكن سيتم ترتيب أي مستويات موجودة بالطريقة التي حددتها. عرض المستويات في علامة المتغيرات في شبكة البيانات لرؤية المستويات الحالية وترتيب الفرز أو الانتقال إلى المتغيرات > مستويات العامل > العرض. \nلاحظ أن تحديد جميع مستويات العامل الموجودة سيعيد ترتيب جميع المستويات، بغض النظر عما إذا كنت تختار \"الأول\" أو \"الأخير\" لوضع المستوى.\n<br/><br/>\n<b>أين تضع المستويات:</b> اختيار \"الأول\" سيضع المستويات المحددة أولاً في ترتيب الفرز. اختيار \"الأخير\" سيضع المستويات المحددة \nأخيرًا في ترتيب الفرز.\n<br/><br/>\n<b>إنشاء متغير جديد أو الكتابة فوق المتغير الموجود:</b> يتحكم فيما إذا كنت تريد إنشاء متغير جديد باسم جديد أو الكتابة فوق المتغير الموجود. لا يمكن أن يحتوي \nاسم المتغير الجديد على أحرف خاصة مثل #، $، %، &، (، )، =، إلخ. يُسمح باستخدام الشرطات السفلية، \"_\".\n<br/><br/>\n<b>أمثلة:</b> افترض أن لديك عاملًا بأربعة مستويات مع تسميات \"أ\"، \"ب\"، \"ج\"، \"د\" مع ترتيب فرز \"أ\"، \"ب\"، \"ج\"، \"د\" (من الأول إلى الأخير). تحديد \"د\" \nكأول في ترتيب الفرز سيخلق عاملًا بترتيب فرز \"د\"، \"أ\"، \"ب\"، \"ج\". تحديد \"ب\"، \"أ\" كآخر في ترتيب الفرز سيخلق عاملًا \nبترتيب فرز \"ج\"، \"د\"، \"ب\"، \"أ\". تحديد \"ب\"، \"ج\"، \"د\"، \"أ\" (أي جميع المستويات) سيخلق عاملًا بترتيب فرز \"ب\"، \"ج\"، \"د\"، \"أ\".\n<br/><br/>  \n<b>حزم R المطلوبة:</b> dplyr، forcats\n\t\t\t"
  }
}