{
  "title": "البحث عن التكرارات",
  "navigation": "البحث عن التكرارات",
  "keysnote": "ملاحظة: عدم تحديد متغيرات المفتاح سيؤدي إلى بحث كامل عن التكرارات.  تحديد متغيرات المفتاح سيبحث عن التكرارات بناءً على قيم متغيرات المفتاح فقط.",
  "keyvarslabel": "متغيرات المفتاح (اختياري)",
  "allduprowschecklabel": "إنشاء مجموعة بيانات تحتوي على جميع الصفوف المرتبطة بالتكرارات",
  "allduprowsnamelabel": "اسم مجموعة البيانات",
  "alldatachecklabel": "إنشاء مجموعة بيانات تحتوي على البيانات الأصلية وعمود يشير إلى التكرارات",
  "alldatanamelabel": "اسم مجموعة البيانات",
  "dupvarnamelabel": "اسم المتغير المكرر",
  "nodupdatachecklabel": "إنشاء مجموعة بيانات مع إزالة جميع التكرارات",
  "nodupdatanamelabel": "اسم مجموعة البيانات",
  "help": {
    "title": "البحث عن التكرارات",
    "r_help": "help(duplicated, package = 'base')",
    "body": "\nستقوم هذه النافذة بالبحث عن التكرارات إما من خلال الحالات الكاملة أو من خلال متغيرات المفتاح.  التكرارات الكاملة للحالات متساوية لكل قيمة لكل متغير.  التكرارات باستخدام متغيرات المفتاح هي تكرارات محددة فقط من خلال القيم المتساوية لمتغيرات معينة، تسمى \"المفاتيح\".  يتم البحث عن التكرارات من الأعلى إلى الأسفل في مجموعة البيانات.  لذا، فإن الصف المكرر يعني أن القيم متساوية لصف سابق.  يتم تقديم ملخصات للتكرارات.\n<br/><br/>\n<b>متغيرات المفتاح:</b>  حدد متغيرات مفتاح اختيارية تحدد التكرارات.  إذا لم يتم اختيار أي متغيرات مفتاح، سيتم البحث عن التكرارات الكاملة للحالات.\n<br/><br/>\n<b>إنشاء مجموعة بيانات تحتوي على جميع الصفوف المرتبطة بالتكرارات:</b>  سيؤدي ذلك إلى إنشاء مجموعة بيانات تحتوي على جميع الصفوف المكررة وأول حالة لكل صف يتوافق مع كل تكرار.  سيتم فرز مجموعة البيانات الناتجة حسب جميع المتغيرات في حالة التكرار الكامل وحسب متغيرات المفتاح في حالة متغير المفتاح.  سيتم أيضًا نقل متغيرات المفتاح إلى بداية مجموعة البيانات الناتجة.  يمكن استخدام حقل <b>اسم مجموعة البيانات</b> لتسمية مجموعة البيانات الناتجة هذه.\n<br/><br/>\n<b>إنشاء مجموعة بيانات تحتوي على البيانات الأصلية وعمود يشير إلى التكرارات:</b>  سيؤدي ذلك إلى إنشاء مجموعة بيانات تشمل جميع البيانات الأصلية بالإضافة إلى عمود إضافي يشير إلى الصفوف المكررة (0=ليس مكرر، 1=مكرر).  يمكن استخدام حقل <b>اسم مجموعة البيانات</b> لتسمية مجموعة البيانات الناتجة هذه.  يمكن استخدام حقل <b>اسم المتغير المكرر</b> لتسمية هذا العمود الإضافي.\n<br/><br/>\n<b>إنشاء مجموعة بيانات مع إزالة جميع التكرارات:</b>  سيؤدي ذلك إلى إنشاء مجموعة بيانات تزيل جميع الصفوف المكررة (إما كاملة الحالة أو بواسطة متغيرات المفتاح) حيث يتم البحث عن التكرارات من الأعلى إلى الأسفل في مجموعة البيانات.  هذا يعني أن جميع الحالات الثانية والثالثة، إلخ. من الصفوف ستتم إزالتها.  يمكن استخدام حقل <b>اسم مجموعة البيانات</b> لتسمية مجموعة البيانات الناتجة هذه.\n<br/><br/>\n<b>حزم R المطلوبة:</b> dplyr، arsenal\n"
  }
}