{
  "title": "كابا فليز",
  "navigation": "كابا فليز",
  "ratervars": "متغيرات المقيم:",
  "cilevel": "مستوى الثقة:",
  "options": "متقدم",
  "categLabels": "حدد اختياريًا جميع التقييمات الممكنة مفصولة بـ ، على سبيل المثال 1،2،3،4،5 أو \"منخفض\"، \"متوسط\"، \"مرتفع\"",
  "freqlistchkbox": "جدول متقاطع لوزن متغيرات المقيم",
  "weights": "اختر وزنًا محددًا مسبقًا",
  "N": "معامل اختياري يمثل حجم السكان (إن وجد)",
  "help": {
    "title": "كابا فليز",
    "r_help": "help(fleiss.kappa.raw, package=irrCAC)",
    "body": "\n<b>الوصف</b></br>\nكابا فليز العام بين عدة مقيمين (2، 3، +) عندما تمثل بيانات الإدخال التقييمات الخام المبلغ عنها لكل موضوع وكل مقيم.</br>\nإذا كان لدى أي مقيم قيمة مفقودة لملاحظة، تتم إزالة تلك الملاحظة من التحليل.</br>\nنحن نقدم أيضًا خيار جدول متقاطع لوزن متغيرات المقيم.</br>\n<b>الاستخدام</b>\n<br/>\n<code> \nfleiss.kappa.raw(ratings = dataset1[ , c('var1','var2','var3')], weights = \"unweighted\", categ.labels = NULL,</br>\n  conflev = 0.95, N = Inf)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nالتقييمات:  المتغيرات التي تتوافق مع كل مقيم حيث يمثل كل عمود مقيمًا واحدًا ويمثل كل صف موضوعًا واحدًا. يمكن أن تكون متغيرات عددية أو عاملية أو ترتيبية.</br>\n</li>\n<li>\nالأوزان: معامل إلزامي يمكن أن يكون إما متغير سلسلة أو مصفوفة. تصف السلسلة واحدة من الأوزان المحددة مسبقًا ويجب أن تأخذ واحدة من القيم (\"غير موزون\"، \"تربيعي\"، \"ترتيبي\"، \"خطّي\"، \"جذري\"، \"نسبة\"، \"دائري\"، \"ثنائي القطب\"). </br>\nإذا كانت هذه المعلمة مصفوفة، فيجب أن تكون مصفوفة مربعة qxq حيث q هو عدد الفئات الممكنة التي يمكن تصنيف الموضوع فيها. إذا لم يتم استخدام بعض الفئات الممكنة q، فمن المستحسن بشدة تحديد القائمة الكاملة للفئات الممكنة كمتجه في المعلمة categ.labels. خلاف ذلك، قد لا يعمل البرنامج.</br>\nملاحظة: تحديد مصفوفة غير مدعوم في الصياغة. تحتاج إلى لصق الكود وتحريره لتحديد مصفوفة.</br>\n</li>\n<li>\nconflev:  مستوى الثقة المرتبط بفترة الثقة. القيمة الافتراضية لها هي 0.95.</br>\n</li>\n<li>\nN: معامل اختياري يمثل حجم السكان (إن وجد). يمكن استخدامه لإجراء التصحيح النهائي للسكان على التباين. القيمة الافتراضية لها هي اللانهاية.\n</li>\n</ul>\n<b>القيمة</b></br>\nقائمة بيانات تحتوي على 3 كائنات: (1) إطار بيانات بصف واحد يحتوي على إحصائيات متنوعة بما في ذلك معامل الاتفاق المطلوب، (2) مصفوفة الوزن المستخدمة في الحسابات إذا كانت موجودة، و (3) الفئات المستخدمة في التحليل. يمكن أن تكون هذه الفئات التي أبلغ عنها المقيمون، أو تلك التي كانت متاحة للمقيمين سواء استخدموها أم لا. </br>إطار البيانات الناتج يحتوي على المتغيرات التالية: \"coeff.name\" (اسم المعامل - هنا سيكون \"كابا فليز\")، \"pa\" (نسبة الاتفاق)، \"pe\" (نسبة الاتفاق بالصدفة)، coeff.val (تقدير معامل الاتفاق - كابا فليز)، \"coeff.se\" (الخطأ القياسي)، \"conf.int\" (فترة الثقة لكابا فليز)، \"p.value\"(قيمة p لكابا فليز)، \"w.name\"(معرف الأوزان).\n<b>الحزمة</b></br>\nirrCAC</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(fleiss.kappa.raw, package=irrCAC) عن طريق إنشاء كتلة كود R بالنقر على + في نافذة الإخراج\n"
  }
}