{
  "title": "مخطط الغابة",
  "navigation": "مخطط الغابة",
  "modelselectorlabel": "اختر اسم النموذج",
  "plotvarslabel": "المتغيرات المراد رسمها (عدم تحديد أي متغيرات يعني رسم جميع المتغيرات)",
  "varlabelslabel": "تسميات المتغيرات (حدد كـ varname='label' مفصولة بفواصل، مثل: age='العمر بالسنوات'، bmi='مؤشر كتلة الجسم')؛ يمكن استخدام \\n لفواصل الأسطر داخل التسمية",
  "notelabel": "ملاحظة: تغيير التسميات يتطلب إعادة ضبط النموذج، لذا قد يستغرق الأمر وقتًا مع البيانات الكبيرة",
  "label3": "ملاحظة: النماذج التي تم بناؤها باستخدام ضبط النموذج (التدريب) غير مدعومة",
  "estimateoptlabel": "خيارات التقدير",
  "estimatelabellabel": "التسمية",
  "exponentiatelabel": "فرض تقدير المعاملات على الأس",
  "linecolorlabel": "لون الخط",
  "pointshapelabel": "شكل النقطة",
  "pointsizelabel": "حجم النقطة (0-10 مم)",
  "styleoptlabel": "خيارات النمط",
  "factorseplinelabel": "أسماء العوامل في أسطر منفصلة",
  "plotbandslabel": "أشرطة الرسم",
  "textsizelabel": "حجم النص (1-10 مم)",
  "estticklabelsizelabel": "حجم علامة تقدير العلامة (1-50)",
  "help": {
    "title": "مخطط الغابة",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nهذا ينشئ مخططًا لمعاملات النموذج، أو معاملات مضروبة، من نموذج الانحدار. يتم رسم كل متغير في صفه الخاص مع الإجماليات، تقديرات المعاملات، \nفترات الثقة 95%، وقيم p. يمكن تسمية المتغيرات للسماح بعرض أفضل. حاليًا، تدعم النماذج من فئة lm (نماذج خطية)، glm (نماذج خطية عامة، \nالتي تشمل اللوجستية وبواسون)، coxph (نموذج كوك النسبي للمخاطر)، و rq (الانحدار الكمي).\n<br/><br/>\n<b>اختر اسم النموذج:</b> اختر اسم النموذج كما هو محدد عند ضبط النموذج. هذا حقل مطلوب.\n<br/><br/>\n<b>المتغيرات المراد رسمها:</b> إذا كان لديك وصول إلى البيانات التي أنشأت النموذج، يمكنك تحديد مجموعة فرعية من المتغيرات في النموذج لتضمينها في المخطط. إذا لم يتم تحديد أي متغيرات، \nفإنه يتم افتراض جميع المتغيرات المضمنة.\n<br/><br/>\n<b>تسميات المتغيرات:</b> حدد تسميات أجمل لاستخدامها بدلاً من أسماء المتغيرات. إذا لم يتم تسمية متغير، فسيتم رسم اسم المتغير أو التسمية الحالية المستخدمة عند \nضبط النموذج (إذا كانت موجودة). يجب تحديدها بتنسيق variablename=\"label\"، مفصولة بفواصل. لاحظ أن تضمين \\n في التسمية سيجبر \nفاصل سطر داخل التسمية. هذا يعني أنه يمكنك تحديد تسميات متعددة الأسطر وقد يكون مفيدًا للتسميات الطويلة، حيث تترك التسميات الطويلة على سطر واحد مساحة أقل للتقديرات. القيام بملخص للنموذج مع تقييم النموذج -> تلخيص -> تلخيص نموذج سيطبع المتغيرات المستخدمة في النموذج في حال لم يكن لديك وصول إلى مجموعة البيانات. ملاحظة: هناك \nخطأ حالي في حزمة forestmodel R التي لا تستخدم تسميات المتغيرات للعوامل في نماذج كوك - تم إبلاغ مطور الحزمة. بديل حتى يتم إصلاح الحزمة هو إعادة ضبط النموذج باستخدام متغيرات مشفرة بدلاً من العوامل.\n<br/><br/><br/>\n<b>خيارات التقدير:</b>\n<br/><br/>\n<b>التسمية:</b> تسمية اختيارية لعمود التقدير في المخطط. سيتم اكتشاف الانحدار اللوجستي ونماذج كوك تلقائيًا وسيتم تسمية التقديرات كـ \"نسبة الأرجحية\" و \n\"نسبة المخاطر\"، على التوالي. ستستخدم النماذج الأخرى الافتراضي \"تقدير\" إذا لم تحدد أي شيء.\n<br/><br/>   \n<b>فرض تقدير المعاملات على الأس:</b> اختر هذا لفرض عرض قيم exp(coefficient)، أي 2.718 مرفوعة إلى قوة المعامل. تُستخدم المعاملات المضروبة عادةً في نماذج كوك النسبي للمخاطر (لنسب المخاطر)، والانحدار اللوجستي (لنسب الأرجحية)، ونماذج اللوغاريتم الثنائي (للمخاطر النسبية)، و \nالانحدار بواسون (لنسب المعدلات). بشكل افتراضي، سيتم اكتشاف الانحدار اللوجستي ونماذج كوك تلقائيًا وسيتم استخدام exp(coefficient).\n<br/><br/>\n<b>لون الخط:</b> لون الخط لفترات الثقة.\n<br/><br/>\n<b>شكل النقطة:</b> شكل النقاط لتقديرات المعاملات في المخطط.\n<br/><br/>\n<b>حجم النقطة (0-10 مم):</b>  حجم النقاط، بالمليمترات، لتقديرات المعاملات في المخطط. 0 مم سيزيل النقاط. الافتراضي هو 4 مم.\n<br/><br/><br/>\n<b>خيارات النمط:</b>\n<br/><br/>\n<b>أسماء العوامل في أسطر منفصلة:</b> اختر هذا لعرض أسماء المتغيرات العوامل في سطر منفصل عن مستويات العامل.\n<br/><br/>\n<b>أشرطة الرسم:</b> اختر هذا لعرض مناطق مظللة متناوبة لكل صف من المخطط.\n<br/><br/>\n<b>حجم النص (1-10 مم):</b> حجم النص، بالمليمترات، في المخطط. الافتراضي هو 4 مم.\n<br/><br/>\nملاحظة: إذا كنت ترغب في تغيير الحجم العام للمخطط، يمكن تعيين حجم المخطط باستخدام زر السمات في قائمة النقاط الثلاث.\n<br/><br/>\n<b>حجم علامة تقدير العلامة (1-50):</b> حجم علامات التقدير لمحور التقدير.\n<br/><br/>\n<b>حزم R المطلوبة:</b>  forestmodel، arsenal، survival، quantreg، insight\n"
  }
}