{
  "title": "اختبار فريدمان",
  "navigation": "اختبار فريدمان",
  "tvarbox1": "متغيرات الاستجابة، 2 أو أكثر",
  "help": {
    "title": "اختبار فريدمان",
    "r_help": "help(friedman.test, package=stats)",
    "body": "\n<b>الوصف</b></br>\nيجري اختبار فريدمان لمجموع الرتب مع بيانات محجوزة غير مكررة.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## طريقة S3 الافتراضية:\nfriedman.test(y, groups, blocks, ...)\n## طريقة S3 لفئة 'formula'\nfriedman.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>المعطيات</b><br/>\n<ul>\n<li>\ny: إما متجه عددي لقيم البيانات، أو مصفوفة بيانات.\n</li>\n<li>\ngroups: متجه يعطي المجموعة للعناصر المقابلة لـ y إذا كان هذا متجهًا؛ يتم تجاهله إذا كانت y مصفوفة. إذا لم يكن كائن عامل، يتم تحويله إلى واحد.\n</li>\n<li>\nblocks: متجه يعطي الكتلة للعناصر المقابلة لـ y إذا كان هذا متجهًا؛ يتم تجاهله إذا كانت y مصفوفة. إذا لم يكن كائن عامل، يتم تحويله إلى واحد.\n</li>\n<li>\nformula: صيغة من الشكل a ~ b | c، حيث تعطي a و b و c قيم البيانات والمجموعات والكتل المقابلة، على التوالي.\n</li>\n<li>\ndata: مصفوفة اختيارية أو إطار بيانات (أو مشابه: انظر model.frame) تحتوي على المتغيرات في الصيغة. بشكل افتراضي، يتم أخذ المتغيرات من environment(formula).\n</li>\n<li>\nsubset: متجه اختياري يحدد مجموعة فرعية من الملاحظات التي سيتم استخدامها.\n</li>\n<li>\nna.action: دالة تشير إلى ما يجب أن يحدث عندما تحتوي البيانات على NAs. الافتراضي هو getOption(\"na.action\").\n</li>\n<li>\n...: مزيد من المعطيات التي سيتم تمريرها إلى أو من الطرق.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nيمكن استخدام friedman.test لتحليل تصميمات الكتل الكاملة غير المكررة (أي، هناك ملاحظة واحدة بالضبط في y لكل مجموعة من مستويات المجموعات والكتل) حيث قد يتم انتهاك فرضية الطبيعية.</br>\nالفرضية الصفرية هي أنه بخلاف تأثير الكتل، فإن معلمة الموقع لـ y هي نفسها في كل من المجموعات.\nإذا كانت y مصفوفة، يتم الحصول على المجموعات والكتل من مؤشرات الأعمدة والصفوف، على التوالي. لا يُسمح بـ NA في المجموعات أو الكتل؛ إذا كانت y تحتوي على NA، تتم إزالة الكتل المقابلة.</br>\n<b>القيمة</b><br/>\nقائمة تحتوي على فئة \"htest\" تحتوي على المكونات التالية:<br/>\nstatistic: قيمة إحصائية كاي-تربيع لفريدمان.<br/>\nparameter: درجات الحرية لتوزيع كاي-تربيع التقريبي لإحصائية الاختبار.<br/>\np.value: قيمة p للاختبار.<br/>\nmethod: سلسلة حرفية \"اختبار مجموع رتب فريدمان\".<br/>\ndata.name: سلسلة حرفية تعطي أسماء البيانات.​<br/>\n<b>أمثلة</b><br/>\n<code> \nDataframe <- data.frame(Expenses=c(20,23,19,25,26), Sales=c(48,50,55,51,49), Gender=c('m','f','f','m','m'), Deptt=c('Accounts', 'HR', 'Sales','Marketing','IT'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Sales,Expenses)))<br/>\nResult_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nhelp(friedman.test, package=stats)\n"
  }
}