{
  "title": "نموذج خطي عام",
  "navigation": "GLZM",
  "modelname": "اسم النموذج",
  "dependent": "المتغير التابع",
  "offset": "الإزاحة",
  "weights": "الأوزان",
  "formulaBuilder": "باني الصيغة",
  "family": "اختر عائلة ودالة ارتباط",
  "theta": "حدد قيمة ثيتا (تطبق فقط لعائلة التوزيع الثنائي السالب)",
  "expCoefficients": "رفع القوى للمعاملات",
  "help": {
    "title": "نموذج خطي عام",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>الوصف</b></br>\n            يتم استخدام glm لتناسب النماذج الخطية العامة، المحددة من خلال إعطاء وصف رمزي للمؤشر الخطي ووصف لتوزيع الخطأ.\n            <br/>\nملاحظة 1: يتم توفير مربع نص لتحديد القيمة الأولية لثيتا، وهذا ينطبق فقط على عائلة التوزيع الثنائي السالب. إذا تم تجاهله، يتم استخدام تقدير لحظة بعد ملاءمة أولية باستخدام نموذج GLM بواسون.<br/>\nتظهر قيمة ثيتا الأولية المحسوبة في المخرجات فوق جدول ملخص GLM.<br/>\nملاحظة 2: عند تحديد متغير يحتوي على أوزان، كن على علم أنه نظرًا لأننا نستخدم الخيار na.exclude لبناء النموذج، تتم إزالة جميع القيم NA تلقائيًا من المتغيرات التابعة والمستقلة.<br/> \nيمكن أن يتسبب ذلك في عدم تطابق حيث لا تتم إزالة القيم NA تلقائيًا من متغير الوزن. <br/>\nفي هذه الحالة، سترى خطأ اختلاف أطوال المتغيرات (تم العثور عليه لـ (الأوزان))<br/>\nلإصلاح هذا الخطأ، انتقل إلى المتغيرات> القيم المفقودة> إزالة NAs واختر المتغيرات التابعة والمستقلة ومتغير الوزن لإزالة القيم المفقودة منها وإعادة بناء النموذج.<br/>\nملاحظة 3: متغيرات عامل الترميز الوهمية، عند استخدام عائلة التوزيع الثنائي السالب، انظر المتغيرات > حساب > الترميز الوهمي.<br/>\nملاحظة 4: يتم تضمين الاعتراض بشكل افتراضي، لإزالة الاعتراض أدخل -1 في باني الصيغة\n            <br/>\n            <b>الاستخدام</b>\n            <br/>\n            <code> \n            glm(formula, family = gaussian, data, weights, subset,\n                na.action, start = NULL, etastart, mustart, offset,\n                control = list(...), model = TRUE, method = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>المعلمات</b><br/>\n            <ul>\n            <li>\n            formula: كائن من فئة \"formula\" (أو واحد يمكن تحويله إلى تلك الفئة): وصف رمزي للنموذج الذي سيتم ملاءمته. يتم إعطاء تفاصيل تحديد النموذج تحت ‘التفاصيل’.\n            </li>\n            <li>\n            family: وصف لتوزيع الخطأ ودالة الارتباط التي سيتم استخدامها في النموذج. بالنسبة لـ glm، يمكن أن تكون سلسلة حرفية تسمي دالة عائلة، أو دالة عائلة، أو نتيجة استدعاء لدالة عائلة. بالنسبة لـ glm.fit، يتم دعم الخيار الثالث فقط. (انظر العائلة للحصول على تفاصيل دوال العائلة.)\n            </li>\n            <li>\n            data: إطار بيانات اختياري، قائمة أو بيئة (أو كائن يمكن تحويله بواسطة as.data.frame إلى إطار بيانات) يحتوي على المتغيرات في النموذج. إذا لم يتم العثور عليها في البيانات، يتم أخذ المتغيرات من البيئة(formula)، عادةً البيئة التي تم استدعاء glm منها.\n            </li>\n            <li>\n            weights: متجه اختياري من \"الأوزان السابقة\" التي سيتم استخدامها في عملية الملاءمة. يجب أن تكون NULL أو متجه عددي.\n            </li>\n            <li>\n            subset: متجه اختياري يحدد مجموعة فرعية من الملاحظات التي سيتم استخدامها في عملية الملاءمة.\n            </li>\n            <li>\n            na.action: دالة تشير إلى ما يجب أن يحدث عندما تحتوي البيانات على NAs. يتم تعيين الافتراضي بواسطة إعداد na.action من الخيارات، وهو na.fail إذا لم يتم تعيين ذلك. الافتراضي \"الجديد\" هو na.omit. قيمة أخرى ممكنة هي NULL، لا إجراء. يمكن أن تكون قيمة na.exclude مفيدة.\n            </li>\n            </ul>\n            <b>التفاصيل</b><br/>\n            يكون الشكل النموذجي للمؤشر هو response ~ terms حيث يكون response هو المتجه (العددي) للاستجابة وterms هو سلسلة من المصطلحات التي تحدد مؤشراً خطياً للاستجابة. بالنسبة لعائلات التوزيع الثنائي والرباعي، يمكن أيضًا تحديد الاستجابة كعامل (عندما تشير المستوى الأول إلى الفشل وجميع المستويات الأخرى إلى النجاح) أو كصفيف من عمودين يعطيان أعداد النجاحات والإخفاقات. تشير مواصفة المصطلحات من الشكل الأول + الثاني إلى جميع المصطلحات في الأول مع جميع المصطلحات في الثاني مع إزالة أي تكرارات.<br/>\n            <b>القيمة</b><br/>\n            كائن من فئة \"glm\" هو قائمة تحتوي على الأقل على المكونات التالية:\n            <ul>\n            <li>\n            coefficients: متجه مسمى من المعاملات\n            </li>\n            <li>\n            residuals: المتبقيات العاملة، أي المتبقيات في التكرار النهائي من ملاءمة IWLS. نظرًا لأن الحالات ذات الأوزان الصفرية مستبعدة، فإن المتبقيات العاملة لها NA.\n            </li>\n            <li>\n            fitted.values: القيم المتوسطة الملائمة، التي تم الحصول عليها عن طريق تحويل المؤشرات الخطية بواسطة عكس دالة الارتباط.\n            </li>\n            <li>\n            rank: الرتبة العددية للنموذج الخطي الملائم.\n            </li>\n            <li>\n            family: كائن العائلة المستخدم.\n            </li>\n            <li>\n            linear.predictors: الملاءمة الخطية على مقياس الارتباط.\n            deviance: حتى ثابت، ناقص مرتين من اللوغاريتم الأقصى. حيثما كان ذلك منطقيًا، يتم اختيار الثابت بحيث يكون للنموذج المشبع انحراف صفر.\n            </li>\n            <li>\n            aic\t: نسخة من معيار معلومات أكايك، ناقص مرتين من اللوغاريتم الأقصى زائد مرتين من عدد المعاملات، محسوبة عبر مكون aic من العائلة. بالنسبة لعائلات التوزيع الثنائي والسموم، يتم تثبيت التشتت عند واحد وعدد المعاملات هو عدد المعاملات. بالنسبة لعائلات التوزيع الغاوسي، غاما والغاوسي العكسي، يتم تقدير التشتت من انحراف المتبقي، وعدد المعاملات هو عدد المعاملات زائد واحد. بالنسبة لعائلة غاوسي، يتم استخدام تقدير MLE للتشتت لذا فإن هذه قيمة صالحة لـ AIC، ولكن بالنسبة لعائلات غاما والغاوسي العكسي، فهي ليست كذلك. بالنسبة للعائلات التي تم ملاءمتها بواسطة شبه الاحتمال، تكون القيمة NA.\n            </li>\n            </ul>\n            <b>الحزمة</b></br>\nglm</br>\n<b>المساعدة</b></br>\nhelp(glm, package ='stats')\n"
  }
}