{
  "title": "خريطة الحرارة",
  "navigation": "خريطة الحرارة",
  "rowVariables": "المتغير المستهدف",
  "columnVariables": "المتغيرات العمودية",
  "options": "خيارات",
  "title1": "عنوان خريطة الحرارة",
  "dendrogram": "شجرة التفرع:",
  "label1": "خيارات شجرة التفرع الصفية:",
  "plotRowYes": "إعادة ترتيب شجرة التفرع بناءً على متوسطات الصفوف",
  "plotRowNo": "لا إعادة ترتيب (لن يتم حساب شجرة التفرع)",
  "label2": "خيارات شجرة التفرع العمودية",
  "plotColumnYes": "إعادة ترتيب شجرة التفرع بناءً على متوسطات الأعمدة",
  "plotColumnNo": "لا",
  "symmetric": "في حالة المصفوفة المتماثلة، اعتبر الأعمدة مثل الصفوف",
  "trace": "خيارات لرسم خط تتبع صلب عبر الصفوف أو الأعمدة أو كليهما أو لا شيء",
  "density": "خيارات الكثافة:",
  "scale": "يجب أن تكون القيم مركزة في اتجاه الصف أو العمود أو لا شيء",
  "label3": "القيم المفقودة",
  "Remove": "إزالة جميع الصفوف التي تحتوي على قيمة مفقودة",
  "Keep": "الاحتفاظ بالصفوف التي تحتوي على قيم مفقودة",
  "label4": "وضع القيم في الخلية",
  "valuesNo": "نعم",
  "valuesYes": "لا",
  "noteColors": "اختر لونًا لقيم الخلايا (بعد اختيار اللون، انقر خارج التحكم لتطبيقه):",
  "advanced_lbl": "متقدم",
  "help": {
    "title": "خريطة الحرارة",
    "r_help": "help(heatmap.2,package='gplots')",
    "body": "\n            <b>الوصف</b></br>\n            خريطة الحرارة هي تمثيل رسومي للبيانات حيث يتم تمثيل القيم الفردية الموجودة في مصفوفة كألوان. يمكن إنشاء جوانب اختيارية عن طريق تحديد متغير عامل. يمكنك أيضًا تحديد السمات بشكل اختياري، وتحديد عنوان وتسميات للمحورين السيني والصادي</br>\n            يجب أن تكون مجموعة البيانات في التنسيق column1، column2…columnN حيث</br>\n            column1: يحدد الموضوعات مثل أسماء الأشخاص الذين يتم رسم قيم الكوليسترول الخاصة بهم</br>\n            column2: يحدد قيم الكوليسترول في الوقت 1</br>\n            column3: يحدد قيم الكوليسترول في الوقت 2</br>\n            column4: يحدد قيم الكوليسترول في الوقت 3</br>\n            column5: يحدد قيم الكوليسترول في الوقت 4…</br>\n            Column1 هو تسمية لكل صف في خريطة الحرارة.</br>\n            بالنسبة للعمود 2 وما بعده، يتم تمثيل القيم في كل صف من العمود كألوان في خريطة الحرارة.</br>\n            <br/>\n            <b>الاستخدام</b>\n            <br/>\n            <code> \n            BSkyHeatMap(rowVariable=c('Subject'),colVariables=c('chol1','chol2','chol3','chol4'),Colv=FALSE,Rowv=TRUE,dendrogram=c(\"row\"),scale=c(\"none\"),trace=c(\"none\"),density.info=c(\"none\"),na.rm=TRUE,noteForCells =FALSE,notecol =c(\"black\"),dataset=\"Dataset4\")<br/>\n            الدالة أعلاه موجودة في حزمة BlueSky وتستدعي دالة heatmap.2 في حزمة gplots.\n            </code> <br/>\n            <b>المعلمات</b><br/>\n            <ul>\n            <li>\n            data: مجموعة البيانات الافتراضية\n            </li>\n            <li>\n            rowVariable: المتغير العمودي الذي يحتوي على معلومات حول الموضوعات التي تم بناء الرسم البياني لها، انظر أعلاه\n            </li>\n            <li>\n            colVariables: قائمة من المتغيرات العمودية التي تحتوي على القيم التي سيتم تمثيلها كألوان في خريطة الحرارة\n            </li>\n            <li>\n            Colv: يحدد ما إذا كان وكيف يجب إعادة ترتيب شجرة التفرع العمودية. لديه الخيارات مثل معلمة Rowv أعلاه، بالإضافة إلى أنه عندما تكون x مصفوفة مربعة، فإن Colv=\"Rowv\" تعني أنه يجب التعامل مع الأعمدة بشكل مماثل للصفوف.\n            </li>\n            <li>\n            Rowv: يحدد ما إذا كان وكيف يجب إعادة ترتيب شجرة التفرع الصفية. بشكل افتراضي، يكون TRUE، مما يعني أنه يتم حساب شجرة التفرع وإعادة ترتيبها بناءً على متوسطات الصفوف. إذا كانت NULL أو FALSE، فلن يتم حساب شجرة التفرع ولن يتم إجراء أي إعادة ترتيب. إذا كانت شجرة تفرع، فسيتم استخدامها \"كما هي\"، أي بدون أي إعادة ترتيب. إذا كانت متجهًا من الأعداد الصحيحة، فسيتم حساب شجرة التفرع وإعادة ترتيبها بناءً على ترتيب المتجه.\n            </li>\n            <li>\n            na.rm: منطقي يحدد ما إذا كان يجب إزالة NA’s\n            </li>\n            <li>\n            dendrogram: سلسلة حرفية تشير إلى ما إذا كان يجب رسم 'لا شيء' أو 'صف' أو 'عمود' أو 'كلاهما' من أشجار التفرع. الافتراضي هو 'كلاهما'. ومع ذلك، إذا كانت Rowv (أو Colv) FALSE أو NULL و dendrogram هو 'كلاهما'، فسيتم إصدار تحذير وسيتم احترام معلمات Rowv (أو Colv).\n            </li>\n            <li>\n            scale: سلسلة حرفية تشير إلى ما إذا كانت القيم يجب أن تكون مركزة ومقاسة في اتجاه الصف أو اتجاه العمود، أو لا شيء. الافتراضي هو \"لا شيء\".\n            </li>\n            <li>\n            trace: سلسلة حرفية تشير إلى ما إذا كانت القيم يجب أن تكون مركزة ومقاسة في اتجاه الصف أو اتجاه العمود، أو لا شيء. الافتراضي هو \"لا شيء\".\n            </li>\n            <li>\n            density.info: سلسلة حرفية تشير إلى ما إذا كان يجب وضع 'هيستوجرام' أو 'كثافة'، أو لا شيء ('لا شيء') على مفتاح اللون.\n            </li>\n            <li>\n            noteForCells: منطقي يشير إلى ما إذا كانت القيم يجب أن توضع في خلايا خريطة الحرارة.\n            </li>\n            <li>\n            notecol: لون الملاحظات. إذا تم تحديده، يتم ملاحظة القيم في خلايا خريطة الحرارة باللون المحدد..\n            </li>\n            </ul>\n            <b>الحزمة</b></br>\n            BlueSky;gplots;</br>\n            <b>المساعدة</b></br>\n            help(heatmap.2,package='gplots')</br>\n            أخرى: انقر على زر مساعدة R للحصول على مساعدة مفصلة في R. يمكنك أيضًا إدخال help(labs)، help(geom_histogram)، help(aes)، help(facet_grid)، help(theme_calc)، help(coord_flip)</br>\n            مجموعات بيانات نموذجية: انظر Heatmaps.Rdata في مجلد مجموعات بيانات R النموذجية\n     "
  }
}