{
  "title": "رسوم ICC",
  "navigation": "رسوم ICC",
  "label1": "اختر نموذجًا (النماذج من الفئة Rm و dRm و tam.mml و tam.mml.2pl و tam.mml.mfr مدعومة)",
  "label1b": "إذا لم تكن هناك نماذج متاحة، تحتاج إلى إنشاء نموذج أولاً عن طريق اختيار ملاءمة النموذج -> IRT",
  "modelselector1": "اختر نموذجًا",
  "label2a": "للنماذج التي تم إنشاؤها باستخدام تقدير CML",
  "label2b": "(ينطبق على النماذج من الفئة Rm و dRm)",
  "lblrange": "حدد نطاقًا اختياريًا لمحور X",
  "range1": "النطاق بتنسيق value1، value2 مثل -1، 6 مثل",
  "label3a": "للنماذج التي تم إنشاؤها باستخدام تقدير MML",
  "label3b": "(ينطبق على النماذج من الفئة Rm و dRm)",
  "lblthetarange": "حدد نطاقًا اختياريًا لقيم ثيتا ليتم عرضها",
  "tb1": "الحد الأدنى، مثل -1",
  "tb2": "الحد الأقصى، مثل 8",
  "help": {
    "title": "رسوم ICC",
    "r_help": "help(plotICC, package='eRm')",
    "body": "\n                <b>الوصف</b></br>\n                دوال الرسم لتصور منحنيات الخصائص العنصرية\n                <br/>\n                يستدعي plotICC للنماذج التي تم إنشاؤها باستخدام تقدير CML (كائنات من الفئة Rm)\n                <br/>\n                يستدعي plot.tam للنماذج التي تم إنشاؤها باستخدام تقدير MML (كائنات من الفئة tam.mml و tam.mml.2pl و tam.mml.mfr)\n                <br/><br/>\n                <b>الاستخدام لـ plotICC</b>\n                <br/>\n                <code>\n                <br/>\n                ## طريقة S3 لفئة 'Rm'\n                <br/>\n                plotICC(object, item.subset = \"all\", empICC = NULL, empCI = NULL,\n                   mplot = NULL, xlim = c(-4, 4), ylim = c(0, 1),\n                   xlab = \"البعد الكامن\", ylab = \"احتمالية الحل\", main=NULL,\n                   col = NULL, lty = 1, legpos = \"left\", ask = TRUE, ...)\n                </code>\n                <br/><br/>\n                <b>المعلمات</b>\n                <br/>\n                <ul>\n                    <li>\n                    object: كائن من الفئة Rm أو dRm\n                    </li>\n\n                    <li>\n                    item.subset: مجموعة من العناصر التي سيتم رسمها. إما متجه عددي يشير إلى العمود في X أو متجه حرفي يشير إلى اسم العمود. إذا كان \"all\" (افتراضي)، يتم رسم جميع العناصر.\n                    </li>\n\n                    <li>\n                    empICC: رسم ICCs التجريبية لكائنات من الفئة dRm. إذا كان empICC=NULL (الافتراضي) فلا يتم رسم ICC التجريبية. خلاف ذلك، يجب تحديد empICC كقائمة حيث يجب أن يكون العنصر الأول واحدًا من \"raw\" أو \"loess\" أو \"tukey\" أو \"kernel\". العناصر الاختيارية الأخرى هي smooth (عددي) و type (نوع الخط لـ ICCs التجريبية، القيم المفيدة هي \"p\" (افتراضي) و \"l\" و \"b\"، انظر معلمة الرسوم البيانية type في plot.default) و pch و col و lty، رسم \"character\" و اللون ونوع الخط\n                    </li>\n\n                    <li>\n                    empCI: رسم فترات الثقة لـ ICCs التجريبية. إذا كان empCI=NULL (الافتراضي) فلا يتم رسم فترات الثقة. خلاف ذلك، من خلال تحديد empCI كقائمة تعطي فترات الثقة \"بالضبط\" لكل نقطة من ICC التجريبية. العناصر الاختيارية لهذه القائمة هي gamma، مستوى الثقة، col، اللون، و lty، نوع الخط. إذا تم تحديد empCI كقائمة فارغة، سيتم استخدام القيم الافتراضية empCI=list(gamma=0.95,col=\"red\",lty=\"dotted\").\n                    </li>\n\n                    <li>\n                    mplot: إذا كان NULL، يتم تطبيق الإعداد الافتراضي. بالنسبة للنماذج من الفئة dRm، يكون mplot = TRUE، أي، يتم رسم ICCs لما يصل إلى 4 عناصر في شكل واحد. بالنسبة لنماذج Rm، يكون الافتراضي هو FALSE (كل عنصر في شكل واحد) ولكن يمكن تعيينه إلى TRUE.\n                    </li>\n\n                    <li>\n                    xlab: تسمية المحور السيني.\n                    </li>\n\n                    <li>\n                    ylab: تسمية المحور الصادي.\n                    </li>\n\n                    <li>\n                    xlim: نطاق معلمات الشخص.\n                    </li>\n\n                    <li>\n                    ylim: نطاق احتمالية الحل.\n                    </li>\n\n                    <li>\n                    legend: إذا كان TRUE، يتم توفير الأسطورة، وإلا يتم تسمية ICCs.\n                    </li>\n\n                    <li>\n                    col: إذا لم يتم تحديده أو كان NULL، يتم تحديد ألوان الخطوط تلقائيًا. خلاف ذلك، يمكن تقديم عدد صحيح أو متجه مع مواصفات اللون المناسبة\n                    </li>\n\n                    <li>\n                    lty: نوع الخط.\n                    </li>\n\n                    <li>\n                    main: عنوان الرسم.\n                    </li>\n\n                    <li>\n                    legpos: موضع الأسطورة مع القيم الممكنة \"أسفل اليمين\" و \"أسفل\" و \"أسفل اليسار\" و \"يسار\" و \"أعلى اليسار\" و \"أعلى\" و \"أعلى اليمين\" و \"يمين\" و \"مركز\". إذا كان FALSE، فلا يتم عرض أي أسطورة.\n                    </li>\n\n                    <li>\n                    ask: إذا كان TRUE (الافتراضي) وكانت جلسة R تفاعلية، يُطلب من المستخدم الإدخال قبل رسم شكل جديد. FALSE مفيد فقط إذا كان تصدير الشكل الآلي ساريًا، على سبيل المثال، عند استخدام Sweave.\n                    </li>\n\n                    <li>\n                    ...: معلمات رسم إضافية.\n                    </li>\n                </ul>\n                <br/><br/>\n                <b>التفاصيل لـ plotICC</b>\n                <br/>\n                يمكن رسم ICCs التجريبية لكائنات من الفئة dRm باستخدام الخيار empICC، قائمة حيث يحدد العنصر الأول نوع حساب القيم التجريبية. إذا كانت empICC=list(\"raw\", مواصفات أخرى) يتم حساب التكرارات النسبية للاستجابات الإيجابية لكل مجموعة من درجات النقاط ويتم رسمها عند موضع معلمة الشخص المقابلة. تستخدم الخيارات الأخرى الإصدارات الافتراضية لمختلف الملسات: \"tukey\" (انظر smooth) و \"loess\" (انظر loess) و \"kernel\" (انظر ksmooth). بالنسبة لـ \"loess\" و \"kernel\"، يمكن تحديد عنصر إضافي، smooth، للتحكم في النسبة (الافتراضي هو 0.75) أو عرض النطاق (الافتراضي هو 0.5)، على التوالي. على سبيل المثال، يمكن أن يكون التحديد empirical = list(\"loess\", smooth=0.9) أو empirical = list(\"kernel\",smooth=2). تؤدي القيم الأعلى إلى تقديرات أكثر سلاسة لـ ICCs التجريبية.\n                يتم الحصول على فترات الثقة الاختيارية من خلال إجراء تم تقديمه أولاً في Clopper و Pearson (1934) بناءً على توزيع بيتا (انظر binom.test).\n                <br/><br/>\n                <b>الحزم</b>\n                <br/>\n                eRm\n\n                <br/><br/>\n                <b>الاستخدام لـ plot.tam</b>\n                <br/>  \n                <code>         \n                ## طريقة S3 لفئة 'tam' و tam.mml\n                <br/>\n                plot(x, items=1:x$nitems, type=\"expected\", low=-3, high=3, \n                                   export=TRUE,  observed=TRUE, \n                                   package=\"lattice\" ...)           \n                </code>        \n                <br/><br/>\n                <b>التفاصيل لـ plot.tam</b>\n                <br/>   \n                <ul>   \n                <li>\n                x: كائن من الفئة tam أو tam.mml\n                </li>\n                <li>\n                items: متجه فهرس يعطي العناصر التي سيتم تصورها.\n                </li>\n                <li>\n                type: نوع الرسم. type=\"expected\" يرسم منحنيات الاستجابة العنصرية المتوقعة بينما type=\"items\" يرسم منحنيات الاستجابة لجميع فئات العناصر.\n                </li>\n                <li>               \n                low: أدنى قيمة ثيتا ليتم عرضها\n                </li>\n                <li>                \n                high: أعلى قيمة ثيتا ليتم عرضها\n                </li>\n                <li>                \n                package: حزمة R المستخدمة للرسم. يمكن أن تكون \"lattice\" أو \"graphics\".\n                </li>\n                <li>                \n                observed: منطقية تشير إلى ما إذا كان يجب عرض منحنى الاستجابة المرصودة\n                </li>\n                <li>                \n                export: منطقية تشير إلى ما إذا كان يجب تصدير جميع الرسوم بشكل منفصل في ملفات من نوع export.type في دليل فرعي 'Plots' من دليل العمل.                                             \n                </li>\n                </ul>\n                <br/><br/>\n                <b>الحزم</b>\n                <br/>\n                TAM\n                <br/><br/>\n                <b>المساعدة</b>\n                <br/>\n                help(plotICC, package='eRm')\n                "
  }
}