{
  "title": "تثبيت حزمة R (حزم)",
  "navigation": "تثبيت حزمة R (حزم)",
  "package_name": "يرجى إدخال اسم (أسماء) حزمة واحدة أو أكثر مفصولة بفواصل",
  "instruction_text": "\nملاحظة: أسماء حزم R حساسة لحالة الأحرف. يمكنك تثبيت أسماء حزم متعددة باستخدام ، كفاصل\nمثال 1: foreign\nمثال 2: foreign, car, MASS",
  "instruction_text1": "\nملاحظة: يجب أن يكون لديك حق الوصول للكتابة إلى المسار المحدد أدناه وإلا أعد تشغيل التطبيق عن طريق اختيار خيار التشغيل كـ \nمدير",
  "repository": "أدخل عنوان URL لمستودع CRAN، الافتراضي https://cloud.r-project.org/ يقوم بالتثبيت من مرآة CRAN الأقرب إليك.",
  "label1": "مثال 1: foreign",
  "label2": "ملاحظة: شعار R الذي يظهر في شريط القائمة هو ملكية حقوق الطبع والنشر لمؤسسة R",
  "installPath": "اختر مسار مكتبة R حيث سيتم تثبيت حزمة R",
  "help": {
    "title": "تثبيت حزمة R (حزم)",
    "r_help": "help(install.packages)",
    "body": "\n            <b>الوصف</b></br>\n            تثبيت أو تحديث حزمة أو أكثر من حزم R إلى مسار المكتبة المحدد.</br>\n            ملاحظة:</br>\n            1. سنقوم بتثبيت جميع الحزم التي تعتمد عليها الحزم المحددة، أو تستوردها أو ترتبط بها</br>\n            2. إذا كنت تقوم بتحديث حزمة موجودة، يجب عليك إعادة تشغيل تطبيق BioStat Prime.</br>\n            3. سنقوم بتحميل الحزمة المثبتة/المحدثة حديثًا بعد التثبيت.</br>\n            4. بشكل افتراضي، سنقوم دائمًا بالتثبيت في مكتبة R الشخصية للمستخدم على الجهاز المحلي.</br>\n            5. إذا تم تثبيت نفس حزمة R في موقع المكتبة الشخصية ونظام المكتبة (موقع المكتبة النظامية هو موقع التثبيت الافتراضي الذي يحتوي على الحزم \n                التي نقدمها خارج الصندوق مع BioStat Prime)، نقوم بتحميل الحزمة من الموقع الشخصي.</br>\n            <br/>\n            <b>الاستخدام</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Path to the user or system library\", repos = \"Path to the repository containing the package\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>المعلمات</b><br/>\n            <ul>\n            <li>\n            pkgs: مصفوفة حرفية من أسماء الحزم التي يجب تنزيل إصداراتها الحالية من المستودع المحدد.\n            </li>\n            <li>\n            lib: مصفوفة حرفية تعطي مسار المكتبة على الجهاز المحلي حيث سيتم تثبيت الحزمة (الحزم). نحن دائمًا نفترض الموقع الشخصي للمكتبة.\n            </li>\n            <li>\n            repos: مصفوفة حرفية، عنوان URL الأساسي (العناوين) للمستودعات التي يجب استخدامها، على سبيل المثال، عنوان URL لمرآة CRAN مثل \"https://cloud.r-project.org\".\n            </li>\n            <li>\n            BSkypackageinstall: هذه علامة تستخدمها تطبيق BioStat Prime داخليًا للإشارة إلى أن \n            الحزمة تم تثبيتها عبر القائمة وتمريرها.\n            </li>\n            </ul>\n            <b>القيمة</b><br/>\n            NULL غير مرئي.<br/>\n            <b>أمثلة</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>الحزمة</b></br>\n            broom</br>\n            <b>المساعدة</b></br>\n            للحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العليا اليمنى من هذه النافذة المنبثقة\n\n"
  }
}