{
  "title": "تقدير كابلان-ماير، مجموعة واحدة",
  "navigation": "تقدير كابلان-ماير، مجموعة واحدة",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الحدث (1 = حدث، 0 = توقف)",
  "label1": "نوع الرسم",
  "survivalradio": "البقاء",
  "inciradio": "الفشل",
  "printallest": "جدول التقديرات بما في ذلك جميع الأوقات",
  "printspecest": "جدول التقديرات لأوقات محددة",
  "spectimes": "حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1,5,by=1)",
  "styleoptions": "خيارات النمط",
  "axisoptions": "خيارات المحور",
  "label12": "انقر على زر ? في الزاوية العليا اليمنى من الحوار للحصول على تفاصيل حول مجموعات البيانات النموذجية وتنسيق البيانات المدعوم.",
  "titlebox": "عنوان الرسم",
  "plottitlesizelabel": "حجم عنوان الرسم (5-50)",
  "themedropdown": "موضوع الرسم",
  "label2": "عدد المعرضين للخطر",
  "natriskchkbox": "تضمين عدد المعرضين للخطر",
  "risktableprop": "ارتفاع جدول المخاطر (0-1)",
  "risktablepos": "موضع جدول المخاطر",
  "risktablevaluesize": "حجم قيمة جدول المخاطر (1-15)",
  "risktabletitlesize": "حجم عنوان جدول المخاطر (5-50)",
  "risktableaxislabelsize": "حجم تسمية محور جدول المخاطر (5-50)",
  "risktableticklabelsize": "حجم تسمية علامات جدول المخاطر (5-50)",
  "risktableclean": "إزالة المحاور وخطوط الشبكة من جدول المخاطر",
  "label3": "خيارات الخط",
  "linesize": "الحجم (0-5)",
  "linecolor": "اللون",
  "label4": "فترة الثقة",
  "cichkbox": "تضمين فترة الثقة 95%",
  "cistyle": "النمط",
  "citransparency": "الشفافية (0-1)",
  "label5": "الأوقات الموقوفة",
  "censorchkbox": "تضمين الأوقات الموقوفة",
  "censorsize": "الحجم (0-10)",
  "medsurvivalline": "الإشارة إلى البقاء الوسيط (h=أفقي، v=عمودي)",
  "label6": "محور البقاء",
  "survaxislabel": "التسمية",
  "axislabelsize": "حجم تسمية المحور (5-50)",
  "label7": "المقياس",
  "defbutton": "نسبة",
  "pctbutton": "نسبة مئوية",
  "survaxislimits": "حدود المحور على مقياس النسبة (0-1) - أدخل 'c(min, max)'",
  "survtickinc": "زيادات علامات الت tick (0-1)",
  "label8": "محور الوقت",
  "timeaxislabel": "التسمية",
  "timeaxislimits": "حدود المحور (NULL هو الافتراضي، أدخل 'c(min,max)' للتغيير مثل 'c(0,20)')",
  "timetickinc": "زيادات علامات الت tick (NULL هو الافتراضي، أدخل رقمًا للتغيير، الحد الأدنى=0)",
  "ticklabelsize": "حجم تسمية علامات المحور (5-50)",
  "help": {
    "title": "تقدير كابلان-ماير، مجموعة واحدة",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tانظر مجموعة البيانات النموذجية في دليل التثبيت، الموقع الافتراضي هو في حرف القرص:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. يجب إدخال المتغير Followup_time كوقت للحدث أو التوقف ويجب إدخال المتغير Event كحدث (1 = حدث، 0 = توقف).<br/>\n            هذه مجموعة بيانات محدثة من مجموعة بيانات mockstudy في حزمة arsenal.<br/><br/>\t\t\n            <b>منحنيات بقاء كابلان-ماير</b>\n            <br/>\n            <br/>\n            تُستخدم لتقدير المخاطر التراكمية لعدم حدوث حدث ما (أو بالعكس، حدوث حدث ما) على مدى فترة زمنية بعد بدء المتابعة لذلك الحدث (أو الوقت صفر). يجب أن يكون الموضوعات معرضين للخطر للحدث بدءًا من الوقت صفر.\n            <br/>\n            <br/>\n            <b>الوقت:</b> طول الوقت حتى حدوث حدث، إذا حدث الحدث، أو آخر متابعة لذلك الحدث، إذا لم يحدث الحدث، لكل موضوع\n            <br/><br/>\n            <b>الحدث:</b> مؤشر رقمي على ما إذا كان الحدث قد حدث أم لا (1=حدث، 0=توقف) لكل موضوع\n            <br/><br/>\n            <b>نوع الرسم:</b> ما إذا كنت تريد رسم احتمال عدم حدوث الحدث (البقاء) أو حدوث الحدث (الفشل)\n            <br/><br/>\n            <b>جدول التقديرات بما في ذلك جميع الأوقات:</b> خيار لتضمين جدول يحتوي على احتمالات تقدير البقاء والحدث لكل وقت تم ملاحظته في مجموعة البيانات\n            <br/>\n            <br/>\n\t\t\t<b>جدول التقديرات لأوقات محددة:</b> خيار لتضمين جدول يحتوي على احتمالات تقدير البقاء لمجموعة مختارة من الأوقات من قبل المستخدم.\n\t\t\t<br/><br/>\n\t\t\t<b>حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1,5,by=1):</b> هذه هي الأوقات المحددة التي سيتم تضمينها في الجدول للأوقات المحددة. يمكن تحديدها بشكل فردي بفواصل، أو كمتتالية من القيم المتباعدة بالتساوي.\n\t\t\t<br/><br/>\n            يتم إخراج الجداول مع حجم العينة، وعدد الموضوعات التي حدث لها الحدث، ومدة البقاء الوسيطة (إذا تم تعريفها)، ومتوسط البقاء المقيد، ومدة المتابعة الوسيطة. يتم حساب مدة المتابعة الوسيطة باستخدام مُقدّر كابلان-ماير العكسي، الذي يعامل الأحداث الحقيقية كملاحظات متوقفة والملاحظات المتوقفة الحقيقية كأحداث. وبالتالي، فإن \"الحدث\" في هذا المُقدّر هو \"متابعة الموضوعات لأطول فترة ممكنة\".\n            <br/>\n            يتم توفير جدول تقديرات البقاء والأحداث لكابلان-ماير في كل وقت تم ملاحظته في مجموعة البيانات، مع فترات ثقة 95%. \n            <br/>\n            <br/>\n            <b>الحزم المطلوبة:</b> survival، broom، survminer، dplyr، arsenal، ggthemes \n            <br/>\n            <br/>\n            <br/>           \n            <b>خيارات النمط</b>\n            <br/>\n            <br/>\n            <b>عنوان الرسم:</b> عنوان الرسم؛ احذف كل النص لعدم وجود عنوان\n            <br/><br/>\n\t\t\t<b>حجم عنوان الرسم:</b> حجم عنوان الرسم.\n\t\t\t<br/><br/>\n            <b>موضوع الرسم:</b> النمط العام للرسم\n            <br/><br/>\n            <b>تضمين عدد المعرضين للخطر:</b> اختياريًا، تضمين جدول لعدد الموضوعات التي لا تزال معرضة للخطر على مر الزمن في أسفل الرسم. <b>موضع جدول المخاطر</b> يحدد ما إذا كنت تريد الجدول خارج المحاور أو داخل المحاور. يتحكم <b>ارتفاع جدول المخاطر</b> في نسبة مساحة الرسم التي سيشغلها الجدول. يتم تجاهل هذا الخيار عندما يكون موضع جدول المخاطر داخل المحاور. \n\t\t\tيتحكم <b>حجم قيمة جدول المخاطر</b> في حجم الأرقام المعرضة للخطر. يتحكم <b>حجم عنوان جدول المخاطر</b> في حجم عنوان جدول عدد المعرضين للخطر.\n\t\t\tيتحكم <b>حجم تسمية محور جدول المخاطر</b> في حجم تسميات المحاور.\n\t\t\tيتحكم <b>حجم تسمية علامات جدول المخاطر</b> في حجم تسميات علامات الت tick للأوقات في جدول عدد المعرضين للخطر. إذا كان من المرغوب إزالة جميع المحاور وخطوط الشبكة \n\t\t\tمن جدول عدد المعرضين للخطر، يمكن تحديد خيار <b>إزالة المحاور وخطوط الشبكة من جدول المخاطر</b>. سيشمل هذا فقط الأرقام المعرضة للخطر في الجدول.\n            <br/>\n            <br/>\n            <b>خيارات الخط:</b>\n            <b>الحجم</b> يتحكم في سمك الخط و<b>اللون</b> يتحكم في لون الخط المرسوم. يمكن تضمين فترة ثقة 95% للتقديرات إما في شكل <b>شريط</b> (منطقة مظللة) أو <b>خطوة</b> (خط). تتحكم <b>الشفافية</b> في مدى ظلمة الشريط ويتم تجاهلها عند اختيار خيار الخطوة. يمكن الإشارة إلى <b>الأوقات الموقوفة</b> (عندما لم يعد الموضوع معرضًا للخطر للحدث) على الخط باستخدام رموز \"+\". يمكن ضبط حجم رموز \"+\". سيشمل خيار <b>الإشارة إلى البقاء الوسيط</b> خطوطًا أفقية أو عمودية في الوقت الذي يُقدّر فيه أن 50% من الموضوعات قد حدث لها الحدث. تكون المدة الوسيطة غير معرفة إذا لم يتقاطع منحنى البقاء مع 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>خيارات المحور</b>\n            <br/> \n            <br/> \n            يحدد خيار <b>التسمية</b> نص التسمية للمحور. يحدد <b>حدود المحور</b> القيم الدنيا والقصوى للمحور. يتحكم خيار <b>زيادات علامات الت tick</b> في تباعد علامات الت tick على المحور. تتحكم الزيادات على محور الوقت أيضًا في الأوقات لجدول عدد المعرضين للخطر الاختياري.\n            <br/> \n            يحدد خيار <b>المقياس</b> لمحور البقاء ما إذا كنت تريد أن تكون التقديرات على مقياس نسبة (0-1) أو نسبة مئوية (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية المحور:</b> يتحكم هذا في حجم كل من حجم تسمية محور البقاء ومحور الوقت.\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية علامات المحور:</b> يتحكم هذا في حجم كل من حجم تسمية علامات محور البقاء ومحور الوقت.\n        "
  }
}