{
  "title": "تقدير كابلان-ماير، مقارنة المجموعات",
  "navigation": "تقدير كابلان-ماير، مقارنة المجموعات",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الحدث (1 = حدث، 0 = توقف)",
  "groupvar": "المجموعة",
  "label1": "نوع الرسم",
  "survivalradio": "البقاء",
  "inciradio": "الفشل",
  "allesttable": "جدول التقديرات بما في ذلك جميع الأوقات",
  "printspecest": "جدول التقديرات لأوقات محددة",
  "spectimes": "حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1,5,by=1)",
  "styleoptions": "خيارات النمط",
  "axisoptions": "خيارات المحور",
  "label12": "انقر على زر ? في الزاوية العلوية اليمنى من الحوار للحصول على تفاصيل حول مجموعات البيانات النموذجية وتنسيق البيانات المدعوم.",
  "titlebox": "عنوان الرسم",
  "plottitlesizelabel": "حجم عنوان الرسم (5-50)",
  "themedropdown": "موضوع الرسم",
  "label2": "عدد المخاطر",
  "natriskchkbox": "تضمين عدد المخاطر",
  "risktableprop": "ارتفاع جدول المخاطر (0-1)",
  "risktablepos": "موضع جدول المخاطر",
  "risktabletext": "تضمين تسميات الطبقات",
  "risktablevaluesize": "حجم قيمة جدول المخاطر (1-15)",
  "risktabletitlesize": "حجم عنوان جدول المخاطر (5-50)",
  "risktableaxislabelsize": "حجم تسمية محور جدول المخاطر (5-50)",
  "risktableticklabelsize": "حجم تسمية علامة المحور لجدول المخاطر (5-50)",
  "risktableclean": "إزالة المحاور وخطوط الشبكة من جدول المخاطر",
  "label2b": "وسيلة الإيضاح",
  "legendpos": "الموضع",
  "legendtitle": "العنوان",
  "legendlabels": "تسميات القيم (القيمة الافتراضية هي NULL؛ أعطها بترتيب الطبقات؛ على سبيل المثال c('ذكر', 'أنثى')):",
  "legendfontsize": "حجم تسميات الوسيلة (5-50)",
  "label3": "خيارات الخط",
  "linesize": "الحجم (0-5)",
  "linecolor": "لوحة الألوان",
  "label4": "فترة الثقة",
  "cichkbox": "تضمين فترة الثقة 95%",
  "cistyle": "النمط",
  "citransparency": "الشفافية (0-1)",
  "label5": "الأوقات الموقوفة",
  "censorchkbox": "تضمين الأوقات الموقوفة",
  "censorsize": "الحجم (0-10)",
  "medsurvivalline": "الإشارة إلى البقاء الوسيط (h=أفقي، v=عمودي)",
  "label5b": "قيمة P",
  "pvaluechkbox": "تضمين قيمة P",
  "label5c": "النوع",
  "logrank": "اختبار لوغرانك",
  "gehanbreslow": "جيهان-بريسلوب (ويلكوكسون)",
  "taroneware": "تارون-وير",
  "petopeto": "بيتو-بيتو",
  "modpetopeto": "بيتو-بيتو المعدل",
  "flemharr": "فليمنغتون-هارينغتون",
  "pvaluelocation": "الموقع ((x,y)، على سبيل المثال c(الوقت، النسبة)):",
  "pvaluesize": "الحجم",
  "label6": "محور البقاء",
  "survaxislabel": "التسمية",
  "label7": "المقياس",
  "defbutton": "النسبة",
  "pctbutton": "النسبة المئوية",
  "survaxislimits": "حدود المحور على مقياس النسبة (0-1) - أدخل 'c(min, max)'",
  "survtickinc": "زيادات علامة التحقق (0-1)",
  "label8": "محور الوقت",
  "timeaxislabel": "التسمية",
  "timeaxislimits": "حدود المحور (NULL هو الافتراضي، أدخل 'c(min,max)' للتغيير على سبيل المثال 'c(0,20)'",
  "timetickinc": "زيادات علامة التحقق (NULL هو الافتراضي، أدخل رقمًا للتغيير، الحد الأدنى=0",
  "axislabelsize": "حجم تسمية المحور (5-50)",
  "ticklabelsize": "حجم تسمية علامة المحور (5-50)",
  "help": {
    "title": "تقدير كابلان-ماير، مقارنة المجموعات",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tانظر مجموعة البيانات النموذجية في دليل التثبيت، الموقع الافتراضي هو في حرف محرك الأقراص:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\survival\\mockstudy_upd.RData. يجب إدخال المتغير Followup_time كوقت للحدث أو التوقف ويجب إدخال المتغير Event كحدث (1 = حدث، 0 = توقف). يجب أن يكون المتغير sex هو متغير المجموعة.<br/>\n            هذه مجموعة بيانات محدثة من مجموعة بيانات mockstudy في حزمة arsenal.<br/><br/>\t\t\t\n            <b>مقارنة منحنيات بقاء كابلان-ماير</b>\n            <br/>\n            <br/>\n            تُستخدم هذه لتقدير المخاطر التراكمية لعدم حدوث حدث ما (أو بالعكس، حدوث حدث ما) على مدى فترة زمنية بعد بدء المتابعة لذلك الحدث (أو الوقت صفر). يجب أن يكون الموضوعات في خطر للحدث بدءًا من الوقت صفر.\n            <br/>\n            <br/>\n            <b>الوقت:</b> طول الوقت حتى حدوث حدث، إذا حدث الحدث، أو آخر متابعة لذلك الحدث، إذا لم يحدث الحدث، لكل موضوع\n            <br/><br/>\n            <b>الحدث:</b> مؤشر رقمي على ما إذا كان الحدث قد حدث أم لا (1=حدث، 0=توقف) لكل موضوع\n            <br/><br/>\n            <b>المجموعة:</b> المجموعات التي تريد مقارنتها\n            <br/><br/>\n            <b>نوع الرسم:</b> سواء كنت تريد رسم احتمال عدم حدوث الحدث (البقاء) أو حدوث الحدث (الفشل)\n            <br/><br/>\n            <b>جدول التقديرات بما في ذلك جميع الأوقات:</b> خيار لتضمين جدول يحتوي على احتمالات تقدير البقاء والحدث لكل وقت تم ملاحظته في مجموعة البيانات\n            <br/>\n            <br/>\n\t\t\t<b>جدول التقديرات لأوقات محددة:</b> خيار لتضمين جدول يحتوي على احتمالات تقدير البقاء لمجموعة مختارة من الأوقات من قبل المستخدم.\n\t\t\t<br/><br/>\n\t\t\t<b>حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1,5,by=1):</b> هذه هي الأوقات المحددة التي سيتم تضمينها في الجدول للأوقات المحددة. يمكن تحديدها بشكل فردي بفواصل، أو كمتتالية من القيم المتباعدة بالتساوي.\n\t\t\t<br/><br/>\n            يتم إخراج جدول يحتوي على حجم العينة، وعدد الموضوعات التي حدث لها الحدث، ووقت البقاء الوسيط (إذا تم تعريفه)، ووقت المتابعة الوسيط حسب المجموعة والمجموع الكلي. وقت المتابعة الوسيط هو تقدير لوقت المتابعة \"النموذجي\". يتم حسابه باستخدام مقدر كابلان-ماير العكسي، الذي يعامل الأحداث الحقيقية كملاحظات متوقفة والملاحظات المتوقفة الحقيقية كأحداث. وبالتالي، فإن \"الحدث\" في هذا المقدر هو \"متابعة الموضوعات لأطول فترة ممكنة\".\n            <br/>\n            تُقارن منحنيات البقاء باستخدام طرق مختلفة متعددة، مع كون اختبار لوغرانك وجيهان-بريسلوب (ويلكوكسون) الأكثر شيوعًا.\n            يتم توفير جدول تقديرات بقاء كابلان-ماير والأحداث في كل وقت تم ملاحظته في مجموعة البيانات، مع فترات ثقة 95%. \n            <br/>\n            <br/>\n            <b>الحزم المطلوبة:</b> survival، broom، survminer، dplyr، arsenal، ggthemes، RColorBrewer، ggsci\n            <br/><br/>\n            <br/>\n            <b>خيارات النمط</b>\n            <br/>\n            <br/>\n            <b>عنوان الرسم:</b> عنوان الرسم؛ احذف كل النص لعدم وجود عنوان\n            <br/><br/>\n\t\t\t<b>حجم عنوان الرسم:</b> حجم عنوان الرسم.\n\t\t\t<br/><br/>\t\t\t\n            <b>موضوع الرسم:</b> النمط العام للرسم\n            <br/><br/>\n            <b>عدد المخاطر:</b> خيارياً، تضمين جدول لعدد الموضوعات التي لا تزال في خطر على مر الزمن في أسفل الرسم.  <b>موضع جدول المخاطر</b> يحدد ما إذا كنت تريد الجدول خارج المحاور أو داخل المحاور.  <b>ارتفاع جدول المخاطر</b> يتحكم في نسبة منطقة الرسم التي سيشغلها الجدول.  <b>تضمين تسميات الطبقات</b> يتحكم فيما إذا كانت تسميات الطبقات مضمنة أم لا.  إذا لم يكن الأمر كذلك، فسيتم تمييز الطبقات فقط بواسطة اللون. يتم تجاهل خيارات موضع الجدول وتسميات الطبقات عندما يكون موضع جدول المخاطر داخل المحاور.\n\t\t\tحجم <b>قيمة جدول المخاطر</b> يتحكم في حجم الأرقام في المخاطر. حجم <b>عنوان جدول المخاطر</b> يتحكم في حجم عنوان جدول عدد المخاطر.\n\t\t\tحجم <b>تسمية محور جدول المخاطر</b> يتحكم في حجم تسميات المحاور. \n\t\t\tيمكن التحقق من خيار <b>إزالة المحاور وخطوط الشبكة من جدول المخاطر</b> إذا كان من المرغوب فيه إزالة جميع المحاور وخطوط الشبكة.  سيشمل هذا فقط الأرقام في المخاطر في الجدول.           \n            <br/><br/>\n            <b>خيارات الوسيلة:</b>\n            <br/>\n            يتحكم خيار <b>الموضع</b> في موقع الوسيلة (أعلى، أسفل، يسار، يمين).  <b>العنوان</b> هو عنوان الوسيلة.  لإزالة العنوان، احذف كل النص من مربع النص.  <b>تسميات القيم</b> تحدد التسميات التي ستظهر بها الطبقات في الوسيلة.  مهم: إذا كنت تريد تغيير الافتراضي، يجب تحديدها بترتيب الظهور في الوسيلة.  تغيير التسميات لا يغير اللون المرتبط بكل طبقة.\n\t\t\tتحكم خيار <b>حجم تسميات الوسيلة</b> في حجم كل النص الموجود في الوسيلة.\n            <br/>\n            <br/>\n            <b>خيارات قيمة P:</b>\n            <br/>\n            يمكن تضمين قيمة P التي تقارن المنحنيات على الرسم بشكل اختياري.  يتحكم <b>النوع</b> في أي قيمة P مرغوبة، مع كون اختبار لوغرانك وجيهان-بريسلوب (ويلكوكسون) الأكثر شيوعًا.  يتحكم <b>الموقع</b> في مكان وضع قيمة P على الرسم، عند (x,y)=(الوقت، النسبة).  يتحكم <b>الحجم</b> في حجم قيمة P المرسومة.\n            <br/>\n            <br/>\n            <br/>      \n            <b>خيارات المحور</b>\n            <br/>\n            <br/>\n            يحدد خيار <b>التسمية</b> النص المسمى للمحور.  يحدد <b>حدود المحور</b> القيم الدنيا والقصوى للمحور.  يتحكم خيار <b>زيادات علامة التحقق</b> في تباعد علامات التحقق على المحور.  تتحكم الزيادات على محور الوقت أيضًا في الأوقات لجدول عدد المخاطر الاختياري.\n            <br/>\n            يحدد خيار <b>مقياس</b> محور البقاء ما إذا كنت تريد أن تكون التقديرات على مقياس نسبة (0-1) أو نسبة مئوية (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية المحور:</b>  يتحكم هذا في حجم كل من حجم تسمية محور البقاء ومحور الوقت.\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية علامة المحور:</b>  يتحكم هذا في حجم كل من حجم تسمية علامة محور البقاء ومحور الوقت.\t\t\t\n      "
  }
}