{
  "title": "K أقرب الجيران",
  "navigation": "KNN",
  "dependentvar": "المتغير التابع",
  "independentvars": "المتغير (المتغيرات) المستقلة",
  "header": "KNN هو مصنف كسول، لا ينشئ نموذجًا للتنبؤ لاحقًا. إنه يتناسب ويقيم في نفس الوقت. نقوم بتقسيم مجموعة البيانات إلى مجموعات تدريب واختبار، ثم نبني النموذج على مجموعة بيانات التدريب، مما يجعل التنبؤات على مجموعة بيانات الاختبار ونستخدم تلك التنبؤات لعرض إحصائيات تقييم النموذج.",
  "Seed": "تعيين البذور",
  "Group2": "تعديل المعلمات لـ KNN",
  "noneighbhors": "عدد الجيران (عندما لا يتم تحديد قيمة، يتم تعيين القيمة الافتراضية إلى الجذر التربيعي لعدد الملاحظات في مجموعة البيانات)",
  "Group1": "مجموعات بيانات التدريب والاختبار",
  "splitPercentage": "أدخل نسبة التقسيم",
  "trainDatasetName": "أدخل اسم مجموعة بيانات التدريب",
  "testDatasetName": "أدخل اسم مجموعة بيانات الاختبار",
  "predictedValues": "أدخل بادئة المتغيرات للقيم المتوقعة. (يجب عليك تحديد بادئة) يتم إنشاء المتغيرات ذات البادئة في مجموعة بيانات الاختبار.",
  "help": {
    "title": "K أقرب الجيران",
    "r_help": "help(knn, package ='class')",
    "body": "\n                <b>الوصف</b></br>\nتصنيف الجيران الأقرب k\n<br/>\n<b>ملاحظة: </b></br>\n1. يتم إنشاء مجموعات بيانات التدريب والاختبار تلقائيًا مع KNN بناءً على نسبة التقسيم المحددة<br/>\n2. يتم تخزين القيم المتوقعة في مجموعة بيانات الاختبار وتستخدم لحساب إحصائيات النموذج وهي الدقة، كابا، الحساسية.... كما يتم عرض مصفوفة الارتباك\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nknn(train, test, cl, k = 1, l = 0, prob = FALSE, use.all = TRUE)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\ntrain: مصفوفة أو إطار بيانات لحالات مجموعة التدريب.\n</li>\n<li>\ntest: مصفوفة أو إطار بيانات لحالات مجموعة الاختبار. سيتم تفسير المتجه كمتجه صف لحالة واحدة.\n</li>\n<li>\ncl: عامل التصنيفات الحقيقية لمجموعة التدريب\n</li>\n<li>\nk: عدد الجيران المعتمدين.\n</li>\n<li>\nl: الحد الأدنى من الأصوات للقرار النهائي، وإلا فسيكون هناك شك. (بدقة أكثر، يُسمح بأقل من k-l أصوات معارضة، حتى لو تم زيادة k بسبب التعادل.)\n</li>\n<li>\nprob: إذا كان هذا صحيحًا، يتم إرجاع نسبة الأصوات للفئة الفائزة كخاصية prob.\n</li>\n<li>\nuse.all: يتحكم في معالجة التعادلات. إذا كان صحيحًا، يتم تضمين جميع المسافات التي تساوي الأكبر k. إذا كان خطأ، يتم اختيار مجموعة عشوائية من المسافات التي تساوي الأكبر k لاستخدام بالضبط k جيران.\n</li>\n</ul>\n<b>القيمة</b></br>\nعامل التصنيفات لمجموعة الاختبار. سيتم إرجاع الشك كـ NA.</br>\n<b>الحزمة</b></br>\ncaret;class</br>\n<b>المساعدة</b></br>\nhelp(knn, package ='class')\n                "
  }
}