{
  "title": "قم بعمل توقعات باستخدام KNN",
  "navigation": "توقع باستخدام KNN",
  "dataset_var": "فتح مجموعات البيانات",
  "header": "KNN هو مصنف كسول، لا ينشئ نموذجًا مناسبًا يمكن استخدامه للتنبؤ لاحقًا. إنه يتناسب ويقوم بالتنبؤ في نفس الوقت. تحتاج إلى اتباع الخطوات أدناه لإجراء التوقعات/التقييم.",
  "NOTE1": "يجب أن تكون مجموعة البيانات النشطة هي مجموعة البيانات التي تريد بناء نموذج عليها وليس مجموعة البيانات التي تريد تقييمها",
  "step1": "الخطوة 1: كما هو معتاد، يجب عليك اختيار مجموعة بيانات التدريب في Datagrid قبل فتح هذه النافذة.",
  "step2": "الخطوة 2: اختر المتغير التابع في مجموعة بيانات التدريب المستخدمة لتناسب النموذج.",
  "step3": "الخطوة 3: حدد المتغيرات المستقلة في مجموعة بيانات التدريب.",
  "step4": "الخطوة 4: حدد عدد الجيران الذين سيتم استخدامهم لبناء النموذج.",
  "step5": "الخطوة 5: أدخل بادئة المتغير لمتغير جديد يحتوي على التوقعات.",
  "step6": "الخطوة 6: حدد مجموعة البيانات لإضافة التوقعات إليها. يجب أن تحتوي على نفس المتغيرات المستقلة المستخدمة لتدريب النموذج.",
  "dependentvar": "المتغير التابع (من مجموعة بيانات التدريب)",
  "independentvars": "المتغير (المتغيرات) المستقلة (من مجموعة بيانات التدريب)",
  "Seed": "تعيين البذور",
  "datasetToScore": "مجموعة البيانات للتقييم/التوقع",
  "Group2": "معلمات ضبط KNN",
  "noneighbhors": "عدد الجيران (عندما لا يتم تحديد قيمة، يتم تعيين القيمة الافتراضية إلى الجذر التربيعي لعدد الملاحظات في مجموعة البيانات)",
  "testDatasetName": "أدخل اسم مجموعة البيانات لإجراء التوقعات",
  "predictedValues": "أدخل بادئة المتغير للقيم المتوقعة. يتم إنشاء متغير جديد عن طريق إضافة البادئة إلى اسم المتغير التابع.",
  "help": {
    "title": "K أقرب الجيران",
    "r_help": "help(knn, package ='class')",
    "body": "\n                <b>الوصف</b></br>\nتصنيف الجيران الأقرب k\n<br/>\n<b>ملاحظة: </b></br>\nانظر نص المساعدة في النافذة\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nknn(train= dataset1, test, cl, k = 1, l = 0, prob = FALSE, use.all = TRUE)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\ntrain: هذه هي مجموعة البيانات المصدر (النشطة) المستخدمة لإنشاء نموذج مناسب.\n</li>\n<li>\ntest: هذه هي مجموعة البيانات التي سيتم حفظ القيم المتوقعة فيها عند البادئة التي حددتها. يتم إنشاء متغير جديد عن طريق إضافة البادئة إلى المتغير التابع المحدد من مجموعة البيانات المصدر.\n</li>\n<li>\ncl: عامل التصنيفات الحقيقية من مجموعة البيانات المستخدمة لتناسب النموذج\n</li>\n<li>\nk: عدد الجيران الذين يتم اعتبارهم.\n</li>\n<li>\nl: الحد الأدنى من الأصوات للقرار النهائي، وإلا فإن هناك شك. (بدقة أكثر، يُسمح بأقل من k-l أصوات معارضة، حتى إذا تم زيادة k بسبب التعادل.)\n</li>\n<li>\nprob: إذا كان هذا صحيحًا، يتم إرجاع نسبة الأصوات للفئة الفائزة كخاصية prob.\n</li>\n<li>\nuse.all: يتحكم في معالجة التعادلات. إذا كان صحيحًا، يتم تضمين جميع المسافات التي تساوي أكبر k. إذا كان خطأ، يتم اختيار عشوائيًا من المسافات التي تساوي k لاستخدام بالضبط k جيران.\n</li>\n</ul>\n<b>القيمة</b></br>\nعامل التصنيفات لمجموعة الاختبار. سيتم إرجاع الشك كـ NA.</br>\n<b>الحزمة</b></br>\ncaret;class</br>\n<b>المساعدة</b></br>\nhelp(knn, package ='class')\n                "
  }
}