{
  "title": "اختبار كروسكال-واليس لمجموع الرتب",
  "navigation": "اختبار كروسكال-واليس",
  "tvarbox1": "متغير الاستجابة",
  "tvarbox2": "متغير العامل",
  "label1": "طريقة التقدير",
  "default": "تقريب",
  "exact": "دقيق ملاحظة: يجب أن يحتوي متغير العامل على مستويين بالضبط وإلا ستظهر رسالة خطأ",
  "normal": "مونت كارلو",
  "header": "ملاحظة: عند اختيار طريقة التقدير الدقيقة، يجب أن يحتوي متغير العامل على مستويين بالضبط وإلا ستظهر رسالة خطأ",
  "padjust": "تعديل المقارنات المتعددة",
  "ties": "خيارات التعامل مع الروابط",
  "simulations": "أدخل عدد المحاكاة",
  "help": {
    "title": "اختبار كروسكال-واليس لمجموع الرتب",
    "r_help": "help(kruskal.test, package=stats)",
    "body": "\n<b>الوصف</b></br>\nيجري اختبار كروسكال-واليس لمجموع الرتب.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nkruskal.test(x, ...)\n## طريقة S3 الافتراضية:\nkruskal.test(x, g, ...)\n## طريقة S3 لفئة 'formula'\nkruskal.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>المعطيات</b><br/>\n<ul>\n<li>\nالمعطيات\nx: متجه عددي من قيم البيانات، أو قائمة من المتجهات العددية. سيتم تحويل العناصر غير العددية في القائمة، مع تحذير.\n</li>\n<li>\ng: متجه أو كائن عامل يعطي المجموعة للعناصر المقابلة لـ x. يتم تجاهله مع تحذير إذا كانت x قائمة.\n</li>\n<li>\nformula: صيغة من الشكل الاستجابة ~ المجموعة حيث تعطي الاستجابة قيم البيانات والمجموعة متجه أو عامل من المجموعات المقابلة.\n</li>\n<li>\ndata: مصفوفة اختيارية أو إطار بيانات (أو مشابه: انظر model.frame) تحتوي على المتغيرات في الصيغة formula. بشكل افتراضي، يتم أخذ المتغيرات من البيئة (formula).\n</li>\n<li>\nsubset: متجه اختياري يحدد مجموعة من الملاحظات التي سيتم استخدامها.\n</li>\n<li>\nna.action: دالة تشير إلى ما يجب أن يحدث عندما تحتوي البيانات على NAs. الافتراضي هو getOption(\"na.action\").\n</li>\n<li>\n...: مزيد من المعطيات التي سيتم تمريرها إلى أو من الطرق.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nيجري kruskal.test اختبار كروسكال-واليس لمجموع الرتب للفرضية القائلة بأن معلمات الموقع لتوزيع x هي نفسها في كل مجموعة (عينة). البديل هو أنها تختلف في واحدة على الأقل.</br>\nإذا كانت x قائمة، يتم أخذ عناصرها كعينات للمقارنة، وبالتالي يجب أن تكون متجهات بيانات عددية. في هذه الحالة، يتم تجاهل g، ويمكن ببساطة استخدام kruskal.test(x) لإجراء الاختبار. إذا لم تكن العينات موجودة بعد في قائمة، استخدم kruskal.test(list(x, ...)).</br>\nبخلاف ذلك، يجب أن تكون x متجه بيانات عددي، ويجب أن يكون g متجهًا أو كائن عامل بنفس طول x يعطي المجموعة للعناصر المقابلة لـ x.</br>\n<b>القيمة</b><br/>\nقائمة تحتوي على فئة \"htest\" تحتوي على المكونات التالية:<br/>\nstatistic: إحصائية مجموع رتب كروسكال-واليس<br/>\nparameter: درجات الحرية لتوزيع كاي-مربع التقريبي لإحصائية الاختبار<br/>\np.value: قيمة p للاختبار<br/>\nmethod: سلسلة حرفية \"اختبار مجموع رتب كروسكال-واليس\"<br/>\ndata.name: سلسلة حرفية تعطي أسماء البيانات<br/>\n<b>الوصف</b></br>\nتعديل المقارنة المتعددة</br>\nتشمل طرق التعديل تصحيح بونفيروني (\"bonferroni\") حيث يتم ضرب قيم p بعدد المقارنات. تشمل التصحيحات الأقل تحفظًا أيضًا من هولم (1979) (\"holm\")، هوشبرغ (1988) (\"hochberg\")، هوميل (1988) (\"hommel\")، بنجاميني وهوتشبرغ (1995) (\"BH\" أو اسمها المستعار \"fdr\")، وبنجاميني ويكوتيلي (2001) (\"BY\")، على التوالي. كما تم تضمين خيار تمرير (\"none\"). تتضمن مجموعة الطرق في متجه p.adjust.methods لفائدة الطرق التي تحتاج إلى أن تكون الطريقة كخيار وتمريرها إلى p.adjust.</br>\nتم تصميم الطرق الأربعة الأولى لتوفير تحكم قوي في معدل الخطأ العائلي. لا يبدو أن هناك سبب لاستخدام تصحيح بونفيروني غير المعدل لأنه يتم السيطرة عليه بواسطة طريقة هولم، والتي تكون صالحة أيضًا تحت افتراضات تعسفية.</br>\nتكون طرق هوشبرغ وهوميل صالحة عندما تكون اختبارات الفرضيات مستقلة أو عندما تكون مرتبطة بشكل غير سلبي (ساركار، 1998؛ ساركار وتشانغ، 1997). طريقة هوميل أكثر قوة من هوشبرغ، لكن الفرق عادة ما يكون صغيرًا وقيم p لهوشبرغ أسرع في الحساب.</br>\nتتحكم طريقة \"BH\" (المعروفة أيضًا باسم \"fdr\") و\"BY\" لبنجاميني وهوتشبرغ ويكوتيلي في معدل الاكتشاف الخاطئ، النسبة المتوقعة للاكتشافات الخاطئة بين الفرضيات المرفوضة. معدل الاكتشاف الخاطئ هو شرط أقل صرامة من معدل الخطأ العائلي، لذا فإن هذه الطرق أكثر قوة من الأخرى.</br>\n</br>\nطريقة الاختبار للمقارنات الزوجية بين المجموعات:</br>\nافتراضي: يتم حساب قيمة p الدقيقة إذا كانت العينات تحتوي على أقل من 50 قيمة نهائية ولا توجد روابط. خلاف ذلك، يتم استخدام تقريب عادي.</br>\nدقيق: يتم حساب قيمة p الدقيقة؛ غير موصى به لأحجام العينات الكبيرة بسبب وقت الحساب</br>\nتقريب عادي: يتم حساب قيم p باستخدام تقريب عادي</br>\nمع تصحيح الاستمرارية: يتم حساب قيم p باستخدام تقريب عادي مع تصحيح الاستمرارية </br>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nhelp(kruskal.test, package=stats)\n"
  }
}