{
  "title": "التحقق المتقاطع بترك واحد",
  "navigation": "التحقق المتقاطع بترك واحد",
  "modelname": "أدخل اسم النموذج المعدل",
  "dependent": "المتغير المراد التنبؤ به",
  "independent": "المتغيرات المستقلة",
  "levelOfInterest": "عندما يحتوي المتغير المراد التنبؤ به على مستويين، حدد مستوى الاهتمام. يتم عرض مصفوفة الالتباس والإحصائيات ذات الصلة مع مستوى الاهتمام المحدد كمرجع",
  "label1": "بعض النماذج تعترض على القيم المفقودة أو المتغيرات التابعة التي هي عوامل. لمعالجة القيم المفقودة، انظر [ المتغيرات > القيم المفقودة ] ولتشفير المتغيرات العاملية، انظر [ المتغيرات > حساب > تشفير وهمي ]. انقر على أيقونة ? في الزاوية العلوية اليمنى من الحوار للحصول على التفاصيل.",
  "ModelSelection": "اختر فئة نموذج ثم نوع النموذج",
  "help": {
    "title": "التحقق المتقاطع بترك واحد",
    "r_help": "help(train, package=caret)",
    "body": "\n<b>الوصف</b></br>\nالتحقق المتقاطع بترك واحد يستخدم trainControl و train ضمن حزمة caret لإنشاء نموذج معدل/محسن.<br/>\nيتم بناء نموذج معدل من خلال إعادة أخذ النتائج عبر معلمات الضبط. يتم عرض نتائج الضبط أدناه الجداول في أسفل المخرجات<br/>\nبمجرد بناء النموذج المعدل، نقوم بعمل تنبؤات باستخدام النموذج المعدل ضد مجموعة بيانات التدريب (المستخدمة لبناء النموذج) وعرض مصفوفة الالتباس والإحصائيات ذات الصلة.<br/>\nملاحظة: انظر الرابط في https://www.blueskystatistics.com/Articles.asp?ID=330 للحصول على تفاصيل حول النماذج التي تتطلب أن تكون المتغيرات التابعة مشفرة بشكل وهمي والمتطلبات المقابلة للمتغيرات التابعة المدعومة. أيضًا، بعض النماذج لا تدعم القيم المفقودة، إذا ظهرت أخطاء عند بناء النموذج، قم بإزالة القيم المفقودة.<br/>\nيتم تخزين النموذج المعدل في كائن من فئة train باسم الذي حددته في مربع النص.<br/>\nتظهر قيم المعلمات المختارة للنموذج المعدل النهائي في الأسفل في المخرجات.<br/>\nفي حالة وجود متنبئين بمستويين، لديك خيار تحديد مستوى المرجع/مستوى الاهتمام.<br/>\nيتم إنشاء مصفوفة الالتباس والإحصائيات ذات الصلة باستخدام مستوى الاهتمام المحدد.<br/>\n<code> \ntrain_control <- caret::trainControl(method=\"LOOCV\")<br/>\n#الصياغة العامة<br/>\ntunedModel <- caret::train(x = بيانات عشوائية لتدريب النموذج، y = المتغير التابع، trControl = train_control, method = \"النموذج المستخدم\"، prob.model = TRUE )<br/>\n#صياغة مملوءة كمثال<br/>\ntunedModel <- caret::train(as.data.frame(TrainData)، dependentVariable، trControl = train_control، method = \"adaboost\"، preProcess = NULL، prob.model = TRUE )<br/>\n</code>\nنقوم بإنشاء مصفوفة الالتباس وإحصائيات دقة النموذج المعدل. يتم ذلك كما يلي\n<ul>\n<li>\nنقوم بإنشاء قيم متوقعة من مجموعة بيانات التدريب عن طريق استدعاء دالة predict على النموذج المحسن من فئة train (داخليًا، predict.train هي الدالة في حزمة caret التي تستدعيها R)<br/>\n<code> \npredictedValues = predict(tunedModel الذي تم إرجاعه بواسطة دالة train)<br/>\n</code> <br/>\n</li>\n<li>\nنقوم بحساب إحصائيات الدقة من مصفوفة الالتباس التي تم إنشاؤها كما هو موضح أدناه<br/>\n<code> \ncaret::confusionMatrix (predictions = predictedValues، reference = المتغير التابع للنموذج)<br/>\n</code> \n</li>\n</ul>\nيمكنك استخدام النموذج المعدل/المحسن النهائي لتسجيل مجموعة بيانات. للقيام بذلك، اتبع الخطوات أدناه<br/>\n1.  انتقل إلى مجموعة البيانات التي تريد تسجيلها. ملاحظة: يجب أن تتطابق أسماء المتغيرات في مجموعة البيانات المراد تسجيلها (المعروفة أيضًا باسم المتغيرات المستقلة) مع أسماء المتغيرات التي استخدمتها في مجموعة البيانات لإنشاء النموذج المعدل في الأصل. إذا لم يكن الأمر كذلك، ستظهر رسالة خطأ. ستظهر رسالة الخطأ هذه تحت قسم الاختبارات التشخيصية في حوار تسجيل النموذج، انظر النقطة 2 أدناه. <br/>\n2.\tافتح حوار تسجيل النموذج تحت تقييم النموذج>تنبؤ>تسجيل النموذج. <br/>\n3.\tاختر نموذجًا تريد استخدامه لتسجيل مجموعة البيانات. يمكنك تصفية النماذج التي أنشأتها حسب الفئة. <br/>\n4.\tبمجرد اختيار النموذج، حدد بادئة لاستخدامها لتخزين القيم المتوقعة. يمكنك اختيارياً حفظ فترات الثقة للتنبؤات وإنشاء مصفوفة الالتباس. يجب عليك تحديد بادئة للمتغير الذي يحتوي على التنبؤات/الدرجات. يتم تخزين التنبؤات والاحتمالات المتوقعة حيثما ينطبق ذلك كمتغيرات جديدة في نهاية مجموعة البيانات. على سبيل المثال، إذا كانت البادئة المحددة هي AA، يتم تخزين التنبؤات في متغير AA_original اسم المتغير التابع_التنبؤات، وتخزن الاحتمالات المتوقعة في متغير AA_Level1_PredictedProbs. <br/>\n5.  انقر على زر التشغيل لتسجيل مجموعة البيانات. <br/>\n<b>الحزمة</b></br>\ncaret</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذا الحوار أو قم بتشغيل الأمر التالي help(train, package ='caret') في نافذة محرر R\n"
  }
}