{
  "title": "نسب الاحتمالات ورسم بيتا",
  "navigation": "نسب الاحتمالات ورسم بيتا",
  "label1": "اختر نموذجًا (النماذج من الفئة Rm و dRm و eRm مدعومة)",
  "label1b": "إذا لم تكن هناك نماذج متاحة، تحتاج إلى إنشاء نموذج أولاً عن طريق اختيار ملاءمة النموذج -> IRT -> نموذج راش البسيط واختيار تقدير CML",
  "modelselector1": "اختر نموذجًا",
  "spcr": "معايير الانقسام",
  "destination": "اختر المتغيرات لرسم بيتا لها",
  "help": {
    "title": "نسب الاحتمالات ورسم بيتا",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>الوصف</b></br>\n                هذا الاختبار يعتمد على تقسيم مجموعات فرعية من الموضوعات.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \n## طريقة S3 لفئة 'Rm'\n<br/>\nLRtest(object, splitcr = \"median\", se = TRUE)\n<br/>\n## طريقة S3 لفئة 'LR'\n<br/>\nplotGOF(x, beta.subset = \"all\", main = \"التحقق من النموذج الرسومي\", xlab, ylab,\n    tlab = \"عنصر\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nobject: كائن من فئة \"Rm\".\n</li>\n<li>\nsplitcr: معيار الانقسام لتقسيم الدرجات الخام للموضوع. \"all.r\" يتوافق مع تقسيم كامل للدرجات الخام، \"median\" يستخدم الوسيط كمعيار انقسام، \"mean\" يقوم بعملية تقسيم متوسط. يمكن أيضًا أن يكون splitcr متجهًا يخصص كل شخص لمجموعة فرعية معينة (على سبيل المثال، وفقًا لمعيار خارجي). يمكن أن يكون هذا المتجه عدديًا أو حرفيًا أو عاملًا.\n</li>\n<li>\nse: يتحكم في حساب الأخطاء المعيارية في النماذج الفرعية (الافتراضي: TRUE)\n</li>\n<li>\nx: كائن من فئة \"LR\". يستخدم أيضًا لتصور ملاءمة العناصر الفردية.\n</li>\n<li>\nbeta.subset: إذا كان \"all\"، يتم رسم جميع العناصر. خلاف ذلك، يمكن تحديد متجه فرعي عددي.\n</li>\n<li>\ntlab: تحديد تسميات العناصر: \"item\" يطبع أسماء العناصر، \"number\" يعطي أعداد صحيحة تتوافق مع ترتيب معلمات بيتا، إذا كان \"none\" فلا يتم طباعة تسميات. \"identify\" يسمح بتسمية تفاعلية. في البداية لا يتم طباعة تسميات، بعد النقر بالقرب من نقطة عنصر يتم إضافة التسمية المقابلة. يتم إنهاء عملية التعرف بالنقر على الزر الثاني واختيار 'Stop' من القائمة، أو من قائمة 'Stop' في نافذة الرسوميات. لمزيد من المعلومات والعمليات الأساسية، انظر identify.\n</li>\n<li>\nconf: لرسم بيضاوي الثقة لمعلمات العناصر. إذا كان conf = NULL (الافتراضي) فلا يتم رسم أي بيضاوي. خلاف ذلك، يجب تحديد conf كقائمة مع عناصر اختيارية: gamma، هو مستوى الثقة (عددي)، col و lty، اللون ونوع الخط (انظر par)، والذي (متجه فهرس عددي) يحدد العناصر التي يتم رسم البيضاوي لها (يجب أن يكون مجموعة فرعية من beta.subset)، و ia، منطقي، إذا كان يجب رسم البيضاوي بشكل تفاعلي (cf.، tlab = \"identify\" أعلاه). لمزيد من التفاصيل حول السلوك الافتراضي، إذا تم تحديد conf كقائمة فارغة، انظر التفاصيل والأمثلة أدناه. لاستخدام conf، يجب أن يتم إنشاء كائن LR باستخدام الخيار se = TRUE في LRtest(). انظر help(MLoef) لمزيد من التفاصيل.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nإذا كانت مجموعة البيانات تحتوي على قيم مفقودة وتم تحديد المتوسط أو الوسيط كمعيار انقسام، يتم حساب المتوسطات أو الوسيطات لكل مجموعة فرعية من القيم المفقودة وبالتالي استخدامها لتقسيم الدرجات الخام.\n<br/>\nعند استخدام الاختيار التفاعلي لكل من تسمية النقاط الفردية (tlab = \"identify\" ورسم بيضاوي الثقة عند نقاط معينة (ia = TRUE) يتم أولاً تسمية جميع النقاط المرسومة وبعد ذلك يتم إنشاء جميع البيضاوي. يمكن إنهاء كلا عمليتي التعرف بالنقر على الزر الثاني (الأيمن) واختيار 'Stop' من القائمة، أو من قائمة 'Stop' في نافذة الرسوميات.\n<br/>\nباستخدام المواصفة التي تسمح برسم البيضاوي بشكل انتقائي لبعض العناصر فقط، على سبيل المثال، which = 1:3 يرسم البيضاوي للعناصر من 1 إلى 3 (طالما أنها مدرجة في beta.subset). الافتراضي هو رسم البيضاوي لجميع العناصر. يمكن أن يكون العنصر col في قائمة conf إما تحديد لون واحد مثل \"أزرق\" أو متجه مع تحديدات الألوان لجميع العناصر. يجب أن يكون الطول هو نفسه عدد البيضاوي الذي سيتم رسمه. لتحديد اللون، يمكن إعداد لوحة باستخدام اللوحات القياسية (مثل قوس قزح) أو اللوحات من حزمة colorspace أو RColorBrewer. تم إعطاء مثال أدناه.\n<br/>\nطرق الملخص والطباعة متاحة لكائنات من فئة LR.\n<br/><br/>\n<b>القيمة</b><br/>\nتُرجع LRtest كائنًا من فئة LR يحتوي على:\n<br/><br/>\nLR: قيمة LR.\n<br/>\ndf: درجات الحرية لإحصائية الاختبار.\n<br/>\nChisq: قيمة كاي-تربيع مع df المقابل.\n<br/>\n<br/>\n<b>الحزمة</b></br>\neRm\n<br/><br/>\n<b>المساعدة</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}