{
  "title": "تحميل النماذج من ملف",
  "navigation": "تحميل النماذج",
  "filterModels": "تصفية النماذج حسب الفئة",
  "modelSelection": "اختر نموذجًا للحفظ",
  "importResp": "اختر ملفًا لتحميل النماذج منه",
  "label1": "سيتم تحميل جميع النماذج الموجودة في الملف المحدد في الذاكرة. ملاحظة: إذا كان لديك نماذج موجودة بنفس الاسم، فسيتم الكتابة فوقها.",
  "levelOfInterest": "عندما تحتوي المتغيرات التي يجب التنبؤ بها على مستويين، حدد مستوى الاهتمام. سيتم عرض مصفوفة الالتباس والإحصائيات ذات الصلة مع مستوى الاهتمام المحدد كمرجع.",
  "label12": "نتائج الاختبار: بمجرد اختيار نموذج، سنقوم بإجراء اختبارات لمعرفة ما إذا كانت المتغيرات التابعة المحددة في النموذج متاحة في مجموعة البيانات التي سيتم تقييمها. ستظهر النتائج هنا.",
  "label2": "احفظ القيم المتوقعة والإحصائيات الداعمة.",
  "label3": "يتم تخزين التوقعات والاحتمالات المتوقعة حيثما كان ذلك مناسبًا في مجموعة البيانات التي يتم تقييمها كمتغيرات جديدة مع بادئة أدناه.",
  "label4": "**بالنسبة للمتغيرات التابعة ذات المستويين، يتم اعتبار المستوى الثاني كمستوى إيجابي. راجع البيانات > مستويات العوامل > إعادة ترتيب المستويات يدويًا لتغيير ترتيب مستويات العوامل وإعادة بناء النموذج.",
  "conflevel": "احفظ فترات الثقة للقيم المتوقعة الفردية **(صالحة فقط للنماذج الخطية (class lm))",
  "roctable": "عرض جدول ROC (**للمتغيرات التابعة الثنائية فقط)",
  "colname": "حدد بادئة اسم العمود",
  "label5": "**التحقق من مربع الاختيار أعلاه سيؤدي إلى عقوبة أداء لمجموعات البيانات الكبيرة.",
  "level": "حدد مستوى الثقة",
  "confusioncheck": "توليد مصفوفة الالتباس",
  "help": {
    "title": "تحميل النماذج",
    "r_help": "help(load, package='base')",
    "body": "\n<b>الوصف</b></br>\nسيتم تحميل كائنات نموذج R المحفوظة في الملف المحدد.</br>\nسنقوم بتحميل جميع كائنات R المحفوظة في الملف المحدد. إذا كانت هناك كائنات بنفس الاسم موجودة في بيئة R العالمية، فسيتم الكتابة فوقها.</br>\nسنقوم بعرض رسالة تؤكد النماذج التي تم بناؤها باستخدام تطبيق  والتي تم تحميلها.</br>\nيجب عليك النقر على زر التنفيذ (زر مثلث أفقي) لتحميل كائنات R المحفوظة في الملف المحدد. \n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nload(file =\"مسار الملف\")\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nfile: اسم الملف مع المسار، سيتم حفظ كائنات النموذج المحددة في هذا الملف RData\n</li>\n</ul>\n<b>الحزمة</b></br>\nbase</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العليا اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(load, package = 'base') في نافذة محرر R\n</br>\n                "
  }
}