{
  "title": "الانحدار اللوجستي",
  "navigation": "الانحدار اللوجستي، أساسي",
  "modelname": "أدخل اسم النموذج",
  "dependent": "المتغير التابع",
  "independent": "المتغير(ات) المستقلة",
  "generateplotchk": "رسم المتبقيات مقابل القيم المتوقعة، Q-Q العادي، موقع المقياس والمتبقيات مقابل النفوذ",
  "destination2": "حدد متغيرًا مع الأوزان",
  "help": {
    "title": "الانحدار اللوجستي",
    "r_help": "help(glm, package ='stats')",
    "body": "\n<b>الوصف</b></br>\nيبني نموذج الانحدار اللوجستي الثنائي. نستخدم دالة glm مع تمرير المعامل family =binomial(link='logit'). نعرض ملخص النموذج، وجداول تحليل التباين و McFadden R2.<br/>\nيمكنك تقييم النموذج عن طريق اختيار النموذج الذي تم إنشاؤه في الزاوية العلوية اليمنى من شاشة التطبيق الرئيسية واختيار زر التقييم. يمكنك اختيار عرض مصفوفة الارتباك ومنحنى ROC<br/>\nاسم النموذج الافتراضي هو Logistic1 والذي يمكنك تغييره.<br/><br/>\nملاحظة: عند تحديد متغير يحتوي على أوزان، كن على علم أنه نظرًا لأننا نستخدم الخيار na.exclude لبناء النموذج، تتم إزالة جميع القيم NA تلقائيًا من المتغيرات التابعة والمستقلة.<br/> \nيمكن أن يتسبب ذلك في عدم تطابق حيث أن القيم NA لا تتم إزالتها تلقائيًا من متغير الوزن. <br/>\nفي هذه الحالة، سترى خطأ اختلاف أطوال المتغيرات (تم العثور عليه لـ (weights))<br/>\nلإصلاح هذا الخطأ، انتقل إلى المتغيرات> القيم المفقودة> إزالة NAs وحدد المتغيرات التابعة والمستقلة ومتغير الوزن لإزالة القيم المفقودة منها وإعادة بناء النموذج.<br/>\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nmodelname <- glm(dependentVariable ~ var1+var2+var3...,family =binomial(link='logit'),data=datasetName)\n#تلخيص النموذج<br/>\nsummary(modelname)<br/>\n#عرض جدول Anova<br/>\nanova(modelname)<br/>\n#رسم المتبقيات مقابل القيم المتوقعة، Q-Q العادي، موقع المقياس، المتبقيات مقابل النفوذ<br/>\nplot(modelname)<br/>\n#McFadden R2<br/>\npR2(Logistic1)<br/>\n#نسبة الأرجحية وفترة الثقة 95%<br/>\nexp(cbind(OR=coef(Logistic1), confint(Logistic1,level=0.95)))<br/>\n#رسم النموذج<br/>\nplot(Logistic1)<br/>\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\ndepVar: اسم المتغير التابع. إذا كان لدينا مجموعة بيانات السيارات، مع متغير الفئة الذي نريد التنبؤ به (المتغير التابع هو الفئة) أدخل الفئة\n</li>\n<li>\nindepVars: أسماء المتغيرات المستقلة، مفصولة بـ +. إذا كان لدينا مجموعة بيانات السيارات، مع المتغير المستقل قوة الحصان، حجم المحرك، حدد قوة الحصان+حجم المحرك). يتم ترميز المتغيرات الفئوية تلقائيًا.​\n</li>\n<li>\ndata: اسم إطار البيانات. عند فتح إطارات البيانات أو مجموعات البيانات مثل csv، ملفات Excel، ملفات SAS في BlueSky Statistics، يتم تسميتها Dataset1، Dataset2، Dataset3 لذا أدخل data=Dataset1​\n</li>\n</ul>\n<b>الحزمة</b></br>\nglm</br>\n<b>المساعدة</b></br>\nhelp(glm, package ='stats')</br>\n<b>المراجع</b></br>\nhttps://datascienceplus.com/perform-logistic-regression-in-r/</br>\nhttps://www.machinelearningplus.com/machine-learning/logistic-regression-tutorial-examples-r/</br>\n<b>أخرى</b></br>\nانقر على أيقونة مساعدة R للحصول على مساعدة R مفصلة​</br>\n\t\t\t"
  }
}