{
  "title": "دمج مجموعات البيانات",
  "join": "انضم إلى الخريطة",
  "navigation": "دمج",
  "description": "سيساعدك دمج مجموعات البيانات على دمج مجموعتين من البيانات معًا. بشكل افتراضي، ستبحث هذه النافذة عن أسماء المتغيرات المشتركة داخل مجموعتي البيانات وتدمج على مجموعة كاملة من المتغيرات المشتركة.",
  "out": "أدخل اسم مجموعة البيانات المدمجة",
  "in1": "اختر مجموعة البيانات الأولى",
  "in2": "اختر مجموعة البيانات الثانية",
  "label1": "خيارات الدمج",
  "leftjoin": "دمج يسار (احتفظ فقط بالصفوف في مجموعة البيانات الأولى (اليسار))",
  "rightjoin": "دمج يمين (احتفظ فقط بالصفوف في مجموعة البيانات الثانية (اليمين))",
  "innerjoin": "دمج داخلي (احتفظ بالصفوف المشتركة بين مجموعتي البيانات)",
  "fulljoin": "دمج كامل (احتفظ بجميع الصفوف في أي مجموعة بيانات)",
  "semijoin": "دمج نصف (احتفظ بجميع الصفوف في مجموعة البيانات الأولى (اليسار) مع تطابق في مجموعة البيانات الثانية (اليمين))",
  "antijoin": "دمج مضاد (احتفظ بجميع الصفوف في مجموعة البيانات الأولى (اليسار) بدون تطابق في مجموعة البيانات الثانية (اليمين))",
  "label2": "تجاوز الدمج الذي يتم على جميع أسماء الأعمدة المشتركة",
  "by": "لتجاوز الإعداد الافتراضي للدمج الذي يتم على جميع أسماء الأعمدة المشتركة، أدخل مجموعة فرعية من أسماء الأعمدة المشتركة أدناه مفصولة بفواصل، على سبيل المثال: country,region. سيتم تنفيذ الدمج فقط على أسماء الأعمدة المشتركة المدخلة. قم بتنسيق هذه القائمة كقيم مفصولة بفواصل، على سبيل المثال: A,B,C",
  "label3": "إذا كانت أسماء الأعمدة التي يتم الدمج عليها مختلفة في كل مجموعة بيانات",
  "byDiffNames": "أدخل أسماء الأعمدة المتطابقة مفصولة بفواصل، على سبيل المثال: 'C'='D', 'B'='A'. يرجى استخدام علامات الاقتباس المفردة ( ' ) هنا.",
  "label4": "إذا كانت هناك أسماء أعمدة مشتركة في كلا مجموعتي البيانات",
  "suffix": "بشكل افتراضي، سيتم استخدام .x و .y كلاحقات للمتغيرات المشتركة. إذا كنت ترغب في تغييرها، أدخلها هنا مفصولة بفواصل، على سبيل المثال: 1,2. لاحظ أن أي نقطة . سيتم استبدالها بـ _ في مجموعة البيانات الناتجة",
  "advOptions": "خيارات متقدمة",
  "help": {
    "title": "دمج مجموعات البيانات",
    "r_help": "help(join, package=dplyr)",
    "body": "\n            <b>الوصف</b></br>\n            سيساعدك دمج مجموعات البيانات على دمج مجموعتين من البيانات معًا.<br/> تحتاج إلى تحديد واحد أو أكثر من المتغيرات في مجموعة البيانات النشطة وفي مجموعة البيانات المستهدفة المحددة التي تريد أن يتم الدمج عليها.<br/>\n            سيتم حفظ النتائج في مجموعة بيانات جديدة.<br/>\n            inner_join: إرجاع جميع الصفوف من x حيث توجد قيم مطابقة في y، وجميع الأعمدة من x و y. إذا كانت هناك تطابقات متعددة بين x و y، يتم إرجاع جميع تركيبات المطابقات.</br>\n            left_join: إرجاع جميع الصفوف من x، وجميع الأعمدة من x و y. الصفوف في x التي لا تتطابق مع y ستحتوي على قيم NA في الأعمدة الجديدة. إذا كانت هناك تطابقات متعددة بين x و y، يتم إرجاع جميع تركيبات المطابقات.</br>\n            right_join: إرجاع جميع الصفوف من y، وجميع الأعمدة من x و y. الصفوف في y التي لا تتطابق مع x ستحتوي على قيم NA في الأعمدة الجديدة. إذا كانت هناك تطابقات متعددة بين x و y، يتم إرجاع جميع تركيبات المطابقات.</br>\n            full_join: إرجاع جميع الصفوف وجميع الأعمدة من كل من x و y. حيث لا توجد قيم مطابقة، يتم إرجاع NA للواحد المفقود.</br>\n            semi_join: احتفظ بجميع الصفوف في مجموعة البيانات الأولى مع تطابق في مجموعة البيانات الثانية</br>\n            anti_join: احتفظ بجميع الصفوف في مجموعة البيانات الأولى بدون تطابق في مجموعة البيانات الثانية)</br>\n            <b>الاستخدام</b>\n            <br/>\n            <code> \n            left_join(x, y, by = c(NULL), suffix = c(\".x\", \".y\"), ...)\n            right_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            inner_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            full_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            semi_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            anti_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            </code> <br/>\n            <b>المعلمات</b><br/>\n            <ul>\n            <li>\n            x: مجموعة البيانات للانضمام\n            </li>\n            <li>\n            y: مجموعة البيانات للانضمام\n            </li>\n            <li>\n            by: متجه حرفي من المتغيرات للانضمام. إذا كان NULL، الإعداد الافتراضي، ستقوم *_join() بعمل انضمام طبيعي، باستخدام جميع المتغيرات ذات الأسماء المشتركة عبر الجدولين. رسالة تسرد المتغيرات حتى تتمكن من التحقق من صحتها (لإخفاء الرسالة، قم ببساطة بإدراج المتغيرات التي تريد الانضمام إليها). للانضمام بواسطة متغيرات مختلفة على x و y استخدم متجه مسمى. على سبيل المثال، by = c(\"a\" = \"b\") ستطابق x.a مع y.b.\n            </li>\n            <li>\n            suffix: إذا كانت هناك متغيرات مكررة غير متصلة في x و y، ستضاف هذه اللواحق إلى الناتج لتوضيحها. يجب أن تكون متجه حرفي بطول 2.\n            </li>\n            </ul>\n            <b>القيمة</b><br/>\n            جدول.<br/>\n            <b>الحزمة</b></br>\n            dplyr</br>\n            <b>المساعدة</b></br>\n            للحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(left_join, package=\"dplyr\") عن طريق إنشاء كتلة كود R بالنقر على + في نافذة الإخراج\n      "
  }
}