{
  "title": "مخطط التحكم في الجودة متعدد المتغيرات (MQCC)",
  "navigation": "مخطط MQCC",
  "summaryPrintChk": "طباعة الملخص بالإضافة إلى المخطط (المخططات)",
  "variableListSelcted": "البيانات (اختر متغيرًا أو أكثر) للمخطط",
  "groupingVariable": "(اختياري) اختر متغير التجميع إذا كانت هناك مجموعات فرعية",
  "excludeGroups": "(اختياري) استبعاد المجموعات (إذا كانت المجموعات الفرعية عددية) من الحساب/المخطط (على سبيل المثال، حدد كـ 1:10 أو مفصولة بفواصل كـ 1،4،5،7:12)",
  "groupsTobeUsedAsNewData": "(اختياري) بيانات جديدة - المجموعات (إذا كانت المجموعات الفرعية عددية) التي سيتم استخدامها كبيانات جديدة للمخطط (على سبيل المثال، حدد كـ 1:25 أو 1،4،5،7:12) - بيانات جديدة للرسم ولكن لا تشمل في حسابات الحدود",
  "limitsChk": "إذا كان يجب حساب ورسم حدود التحكم (المرحلة الأولى)",
  "pred_limitsChk": "إذا كان يجب حساب ورسم حدود التنبؤ (المرحلة الثانية)",
  "confidence_level": "(اختياري) مستوى الثقة: اترك الصيغة الافتراضية كما هو موضح (حيث سيتم حساب p تلقائيًا كعدد المتغيرات المحددة). خلاف ذلك، حدد قيمة عددية بين 0 و 1 لاستخدامها كمستوى ثقة لحساب حدود الاحتمالية",
  "genVarianceChk": "رسم مخطط التحكم للتباين العام |S| للمتغيرات المحددة (ويجب اختيار متغير تجميع)",
  "help": {
    "title": "مخطط التحكم في الجودة متعدد المتغيرات (mqcc)",
    "r_help": "help(mqcc, package = qcc)",
    "body": "\n\t\t\t\t<b>الوصف</b></br>\n\t\t\t\tدالة mqcc لأداء التحكم الإحصائي في الجودة متعدد المتغيرات والتباين العام |S|\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tللحصول على مساعدة تفصيلية - استخدم R help(mqcc, package = qcc) و help(GVcontrol, package = IAcsSPCR)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tلتجربة ذلك، يمكنك تحميل مجموعة البيانات المسماة boiler من حزمة qcc باستخدام قائمة تحميل مجموعة البيانات عن طريق اختيار حزمة qcc ثم اختيار مجموعة بيانات boiler للتحميل\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tاختر المتغيرات من مجموعة بيانات boiler، اترك كل شيء كما هو افتراضي، وشغل الحوار\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tيمكنك أيضًا استخدام ملف مجموعة البيانات النموذجية المسماة widgets_mqcc.xlsx. افتح الملف في شبكة البيانات باستخدام قائمة فتح الملف\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tلرسم التباين العام |S|، يجب أن تحتوي مجموعة البيانات على عمود بأرقام المجموعات الفرعية - وإلا فلن يتم الرسم\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tاتبع البرنامج التعليمي qcc على https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
  }
}