{
  "title": "التحجيم متعدد الأبعاد",
  "navigation": "التحجيم متعدد الأبعاد",
  "betRows": "بين الصفوف",
  "betVariables": "بين المتغيرات",
  "textSize": "حجم النص",
  "textPos": "موضع النص",
  "destination": "اختر المتغيرات",
  "maxDimensions": "الحد الأقصى للأبعاد",
  "label1": "مصفوفة المسافة",
  "computationMethod": "طريقة الحساب",
  "power": "قوة مسافة مينكوفسكي",
  "dispDist": "عرض مصفوفة المسافة",
  "saveDims": "حفظ الأبعاد في مجموعة بيانات جديدة",
  "datasetName": "أدخل اسم مجموعة البيانات لحفظ الأبعاد فيه (اختياري)",
  "label2": "خيارات متقدمة",
  "scalingMethod": "طريقة التحجيم",
  "maxIter": "الحد الأقصى لعدد التكرارات (*غير قابل للتطبيق على القياس الكلاسيكي)",
  "plotResults": "رسم النتائج",
  "help": {
    "title": "التحجيم متعدد الأبعاد",
    "r_help": "help(cmdscale, package=stats)",
    "body": "\n<b>الوصف</b></br>\nهناك أنواع مختلفة من خوارزميات MDS، بما في ذلك</br>\n<b>التحجيم متعدد الأبعاد الكلاسيكي</b></br>\nيحافظ على مقياس المسافة الأصلي، بين النقاط، بأفضل شكل ممكن. أي أن المسافات الملائمة على خريطة MDS والمسافات الأصلية في نفس المقياس. ينتمي MDS الكلاسيكي إلى فئة التحجيم متعدد الأبعاد المقياسي.</br>\nكما يُعرف باسم تحليل الإحداثيات الرئيسية. وهو مناسب للبيانات الكمية.</br></br>\n<b>التحجيم متعدد الأبعاد غير المقياسي</b></br>\nكما يُعرف باسم MDS الترتيبي. هنا، ليس مقياس قيمة المسافة هو المهم أو المعنى، ولكن قيمته بالنسبة للمسافات بين أزواج أخرى من الكائنات.</br>\nيبني MDS الترتيبي المسافات الملائمة التي تكون في نفس ترتيب الرتبة مثل المسافة الأصلية. على سبيل المثال، إذا كانت المسافة بين الكائنات 1 و 5 تحتل المرتبة الخامسة في بيانات المسافة الأصلية، فيجب أن تحتل أيضًا المرتبة الخامسة في تكوين MDS.</br>\nوهو مناسب للبيانات النوعية.</br>\nنستخدم الوظائف التالية في R</br>\ncmdscale() [حزمة stats]: حساب التحجيم متعدد الأبعاد الكلاسيكي (المقياسي).</br>\nisoMDS() [حزمة MASS]: حساب التحجيم متعدد الأبعاد غير المقياسي لكروسكال (شكل واحد من MDS غير المقياسي).</br>\nsammon() [حزمة MASS]: حساب رسم سامون غير الخطي (شكل واحد من MDS غير المقياسي).</br>\nتأخذ جميع هذه الوظائف كائن المسافة كوسيط رئيسي و k هو العدد المطلوب من الأبعاد في المخرجات المقاسة. بشكل افتراضي، تعيد حلول بعدين، ولكن يمكننا تغيير ذلك من خلال المعامل k الذي يكون افتراضيًا 2.</br>\n<br/>\nيمكن اختيار خيارات لعرض مصفوفة المسافة، حفظ الأبعاد في مجموعة بيانات جديدة ورسم الأبعاد. </br>\nعند اختيار طريقة التحجيم المقياسية الكلاسيكية، نعرض القيم الذاتية، وإحصائية جودة الملاءمة ومخطط السقوط. بالنسبة لطرق التحجيم الأخرى، نعرض قيمة الضغط.\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، قم بتشغيل الأوامر التالية help(dist, package=\"stats\") أو help(cmdscale, package ='stats') أو help(isoMDS, package = \"MASS\") أو help(sammon, package =\"MASS\") في محرر R الخاص بـ BioStat Prime.           \n<br/>\n<br/>"
  }
}