{
  "title": "لوغاريتم متعدد الحدود",
  "navigation": "لوغاريتم متعدد الحدود",
  "modelname": "أدخل اسم النموذج",
  "dependent": "المتغير التابع",
  "independent": "المتغير (المتغيرات) المستقلة",
  "generateplotchk": "رسم المتبقيات مقابل القيم المتوقعة، Q-Q العادي، موقع النطاق والمتبقيات مقابل النفوذ",
  "destination2": "حدد متغيرًا مع الأوزان",
  "help": {
    "title": "لوغاريتم متعدد الحدود",
    "r_help": "help(multinom, package=nnet)",
    "body": "\n            <b>الوصف</b></br>\n            يناسب نماذج لوغاريتم متعدد الحدود عبر الشبكات العصبية.\n            <br/>\n            <b>الاستخدام</b>\n            <br/>\n            <code> \n            multinom(formula, data, weights, subset, na.action,<br/>\n                     contrasts = NULL, Hess = FALSE, summ = 0, censored = FALSE,<br/>\n                     model = FALSE, ...)<br/>\n            </code> <br/>\n            <b>المتغيرات</b><br/>\n            <ul>\n            <li>\n            formula: تعبير صيغة كما هو الحال في نماذج الانحدار، بالشكل response ~ predictors. يجب أن يكون الاستجابة عاملًا أو مصفوفة تحتوي على K أعمدة، والتي سيتم تفسيرها كعد لكل من K فئات. يتم ملاءمة نموذج لوغاريتمي، مع معاملات صفرية للفئة الأولى. يمكن تضمين تعويض: يجب أن تكون مصفوفة عددية تحتوي على K أعمدة إذا كانت الاستجابة إما مصفوفة تحتوي على K أعمدة أو عاملًا مع K >= 2 فئات، أو متجهًا عدديًا لعامل استجابة مع مستويين. راجع توثيق formula() لمزيد من التفاصيل.\n            </li>\n            <li>\n            data: إطار بيانات اختياري يتم فيه تفسير المتغيرات التي تظهر في الصيغة.\n            </li>\n            <li>\n            weights: أوزان حالة اختيارية في الملاءمة.\n            </li>\n            <li>\n            subset: تعبير يوضح أي مجموعة من صفوف البيانات يجب استخدامها في الملاءمة. يتم تضمين جميع الملاحظات بشكل افتراضي.\n            </li>\n            <li>\n            na.action: دالة لتصفية البيانات المفقودة.\n            </li>\n            <li>\n            contrasts: قائمة من التباينات التي سيتم استخدامها لبعض أو كل العوامل التي تظهر كمتغيرات في صيغة النموذج.\n            </li>\n            <li>\n            Hess: منطقي لمعرفة ما إذا كان يجب إرجاع هيسيان (مصفوفة المعلومات الملاحظة/المتوقعة).\n            </li>\n            <li>\n            summ: عدد صحيح؛ إذا كان غير صفري يلخص عن طريق حذف الصفوف المكررة وضبط الأوزان. تختلف الطرق 1 و 2 في السرعة (2 تستخدم C)؛ الطريقة 3 تجمع أيضًا الصفوف التي لها نفس X و Y مختلفة، مما يغير الأساس للانحراف.\n            </li>\n            <li>\n            censored: إذا كانت Y مصفوفة تحتوي على K أعمدة، ففسر الإدخالات كواحدة للفئات الممكنة، صفر للفئات المستحيلة، بدلاً من كونها عد.\n            </li>\n            <li>\n            model: منطقي. إذا كان صحيحًا، يتم حفظ إطار النموذج كعنصر نموذج للكائن المعاد.\n            </li>\n            <li>\n            ... متغيرات إضافية لـ nnet\n            </li>\n            </ul>\n            <b>التفاصيل</b></br>\n            تستدعي multinom nnet. يجب أن تكون المتغيرات على الجانب الأيمن من الصيغة مقاسة تقريبًا إلى [0,1] أو سيكون الملاءمة بطيئة أو قد لا تتقارب على الإطلاق.</br>\n            <b>القيمة</b><br/>\n            كائن nnet مع مكونات إضافية:<br/>\n            <li>\n            deviance: الانحراف المتبقي، مقارنة بالنموذج المشبع الكامل (الذي يفسر الملاحظات الفردية بدقة). أيضًا، ناقص مرتين من لوغاريتم الاحتمالية.\n            </li>\n            <li>\n            edf: عدد درجات الحرية (الفعالة) المستخدمة بواسطة النموذج\n            </li>\n            <li>\n            AIC: AIC لهذه الملاءمة.\n            </li>\n            <li>\n            Hessian: (إذا كان Hess صحيحًا).\n            </li>\n            <li>\n            model: (إذا كان النموذج صحيحًا).\n            </li>\n            <b>أمثلة</b><br/>\n            <code> \n            options(contrasts = c(\"contr.treatment\", \"contr.poly\"))<br/>\n            library(MASS)<br/>\n            example(birthwt)<br/>\n            (bwt.mu <- multinom(low ~ ., bwt))<br/>\n            </code>\n            <b>الحزمة</b></br>\n            nnet</br>\n            <b>المساعدة</b></br>\n            للحصول على مساعدة مفصلة انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(multinom, package=nnet) عن طريق إنشاء كتلة كود R عن طريق النقر + في نافذة الإخراج\n           "
  }
}