{
  "title": "الانحدار الترتيبي",
  "navigation": "ترتيبي",
  "label1": "طريقة الاختبار",
  "logit": "لوغيت",
  "probit": "بروبوت",
  "modelname": "أدخل اسم النموذج",
  "dependent": "المتغير التابع",
  "formula": "المتغير (المتغيرات) المستقلة",
  "generateplotchk": "رسم المتبقيات مقابل القيم المتوقعة، Q-Q العادي، موقع المقياس والمتبقيات مقابل الرفع",
  "weights": "حدد متغيرًا مع الأوزان",
  "help": {
    "title": "ترتيبي",
    "r_help": "help(polr, package=MASS)",
    "body": "\n            <b>الوصف</b></br>\n            يناسب نموذج الانحدار اللوجستي أو البروبيتي لاستجابة عامل مرتبة. الحالة اللوجستية الافتراضية هي انحدار لوغاريتمي متناسب، بعد ذلك سمي الوظيفة.\n            <br/>\n            <b>الاستخدام</b>\n            <br/>\n            <code> \n            polr(formula, data, weights, start, ..., subset, na.action,\n                 contrasts = NULL, Hess = FALSE, model = TRUE,\n                 method = c(\"logistic\", \"probit\", \"loglog\", \"cloglog\", \"cauchit\"))\n            </code> <br/>\n            <b>المعلمات</b><br/>\n            <ul>\n            <li>\n            formula: تعبير صيغة كما هو الحال في نماذج الانحدار، من الشكل الاستجابة ~ المتنبئات. يجب أن تكون الاستجابة عاملًا (يفضل أن يكون عاملًا مرتبة)، والذي سيتم تفسيره كاستجابة مرتبة، مع مستويات مرتبة كما في العامل. يجب أن يحتوي النموذج على تقاطع: محاولات إزالته ستؤدي إلى تحذير وسيتم تجاهله. يمكن استخدام إزاحة. راجع توثيق الصيغة للحصول على تفاصيل أخرى.\n            </li>\n            <li>\n            data: إطار بيانات اختياري يتم فيه تفسير المتغيرات التي تحدث في الصيغة.\n            </li>\n            <li>\n            weights: أوزان الحالة الاختيارية في التناسب. الافتراضي هو 1.\n            </li>\n            <li>\n            start: القيم الأولية للمعلمات. هذا في التنسيق c(coefficients, zeta): انظر قسم القيم.\n            </li>\n            <li>\n            ... معلمات إضافية سيتم تمريرها إلى optim، غالبًا ما تكون معلمة تحكم.\n            </li>\n            <li>\n            subset: تعبير يقول أي مجموعة من صفوف البيانات يجب استخدامها في التناسب. يتم تضمين جميع الملاحظات بشكل افتراضي.\n            </li>\n            <li>\n            na.action: دالة لتصفية البيانات المفقودة.\n            </li>\n            <li>\n            contrasts: قائمة من التباينات التي سيتم استخدامها لبعض أو كل العوامل التي تظهر كمتغيرات في صيغة النموذج.\n            </li>\n            <li>\n            Hess: منطقي حول ما إذا كان يجب إرجاع هيسيان (مصفوفة المعلومات الملاحظة). استخدم هذا إذا كنت تنوي استدعاء ملخص أو vcov على التناسب.\n            </li>\n            <li>\n            model: منطقي حول ما إذا كان يجب إرجاع مصفوفة النموذج.\n            </li>\n            <li>\n            method: لوجستي أو بروبيتي أو (مكمل) لوغاريتمي-لوغاريتمي أو كوشيت (يتوافق مع متغير كوشي الخفي).\n            </li>\n            </ul>\n            <b>التفاصيل</b></br>\n            هذا النموذج هو ما يسميه أغريستي (2002) نموذج الرابط التراكمي. التفسير الأساسي هو كنسخة مقلصة من متغير خفي Y_i الذي لديه توزيع لوغاريتمي أو عادي أو قيمة متطرفة أو كوشي مع معامل مقياس واحد ونموذج خطي للمتوسط. العامل المرتب الذي يتم ملاحظته هو أي حاوية يقع فيها Y_i مع نقاط الانكسار\n            zeta_0 = -Inf < zeta_1 < … < zeta_K = Inf</br>\n            وهذا يؤدي إلى النموذج</br>\n            logit P(Y <= k | x) = zeta_k - eta</br>\n            مع استبدال اللوغيت بالبروبوت لمتغير خفي عادي، وeta هو المتنبئ الخطي، وهو دالة خطية للمتغيرات التفسيرية (بدون تقاطع). لاحظ أنه من الشائع جدًا أن تستخدم برامج أخرى الإشارة المعاكسة لـ eta (ومن ثم المعاملات beta).</br>\n            في الحالة اللوجستية، الجانب الأيسر من العرض الأخير هو لوغاريتم الاحتمالات للفئة k أو أقل، ونظرًا لأن هذه هي لوغاريتم الاحتمالات التي تختلف فقط بواسطة ثابت لفئات مختلفة k، فإن الاحتمالات متناسبة. ومن ثم فإن مصطلح انحدار لوغاريتمي متناسب.</br>\n            روابط اللوغاريتم-اللوغاريتم واللوغاريتم المكمل هي الدوال المتزايدة F^-1(p) = -log(-log(p)) و F^-1(p) = log(-log(1-p)); يسمي البعض الأول رابط \"اللوغاريتم السالب-اللوغاريتم\". هذه تتوافق مع متغير خفي مع توزيع القيمة المتطرفة للحد الأقصى والأدنى على التوالي.</br>\n            يمكن الحصول على نموذج مخاطر متناسب لأوقات البقاء المجمعة باستخدام رابط اللوغاريتم المكمل مع ترتيب المجموعات حسب الأوقات المتزايدة.</br>\n            predict، summary، vcov، anova، model.frame وطريقة extractAIC للاستخدام مع stepAIC (و step). هناك أيضًا طرق profile و confint.</br>\n            <b>القيمة</b><br/>\n            كائن من فئة \"polr\". يحتوي على مكونات\n            <li>\n            coefficients: معاملات المتنبئ الخطي، الذي ليس له تقاطع.\n            </li>\n            <li>\n            zeta: التقاطعات لحدود الفئة.\n            </li>\n            <li>\n            deviance: الانحراف المتبقي.\n            </li>\n            <li>\n            fitted.values: مصفوفة، مع عمود لكل مستوى من الاستجابة.\n            </li>\n            <li>\n            lev: أسماء مستويات الاستجابة.\n            </li>\n            <li>\n            terms: هيكل المصطلحات التي تصف النموذج.\n            </li>\n            <li>\n            df.residual: عدد درجات الحرية المتبقية، المحسوبة باستخدام الأوزان.\n            </li>\n            <li>\n            edf: عدد درجات الحرية (الفعالة) المستخدمة بواسطة النموذج\n            </li>\n            <li>\n            n، nobs: عدد الملاحظات (الفعالة)، المحسوبة باستخدام الأوزان. (nobs للاستخدام بواسطة stepAIC.\n            </li>\n            <li>\n            call: المكالمة المطابقة.\n            </li>\n            <li>\n            method: الطريقة المطابقة المستخدمة.\n            </li>\n            <li>\n            convergence: رمز التقارب الذي تم إرجاعه بواسطة optim.\n            </li>\n            <li>\n            niter: عدد تقييمات الدالة والتدرج المستخدمة بواسطة optim.\n            </li>\n            <li>\n            lp: المتنبئ الخطي (بما في ذلك أي إزاحة).</li>\n            <li>\n            Hessian: (إذا كان Hess صحيحًا). لاحظ أن هذا تقدير عددي مشتق من عملية التحسين.\n            </li>\n            <li>\n            model:(إذا كان النموذج صحيحًا).\n            </li>\n            <li>\n            ملاحظة</br>\n            تستخدم طريقة vcov هيسيان التقريبي: للحصول على نتائج موثوقة يجب أن تكون مصفوفة النموذج مقاسة بشكل معقول مع جميع الأعمدة التي تتراوح في ترتيب واحد.</br>\n            قبل الإصدار 7.3-32، كانت الطريقة = \"cloglog\" تعطي بشكل محير رابط اللوغاريتم-اللوغاريتم، مما يفترض ضمنيًا أن مستوى الاستجابة الأول هو \"الأفضل\".</br>\n            <br/>\n            <b>أمثلة</b><br/>\n            <code> \n            options(contrasts = c(\"contr.treatment\", \"contr.poly\"))<br/>\n            house.plr <- polr(Sat ~ Infl + Type + Cont, weights = Freq, data = housing)<br/>\n            house.plr<br/>\n            summary(house.plr, digits = 3)<br/>\n            ## ملاءمة أسوأ قليلاً من<br/>\n            summary(update(house.plr, method = \"probit\", Hess = TRUE), digits = 3)<br/>\n            ## على الرغم من أنه ليس مناسبًا حقًا، يمكن أن يناسب<br/>\n            summary(update(house.plr, method = \"loglog\", Hess = TRUE), digits = 3)<br/>\n            summary(update(house.plr, method = \"cloglog\", Hess = TRUE), digits = 3)<br/>\n            <br/>\n            predict(house.plr, housing, type = \"p\")<br/>\n            addterm(house.plr, ~.^2, test = \"Chisq\")<br/>\n            house.plr2 <- stepAIC(house.plr, ~.^2)<br/>\n            house.plr2$anova<br/>\n            anova(house.plr, house.plr2)<br/>\n            <br/>\n            house.plr <- update(house.plr, Hess=TRUE)<br/>\n            pr <- profile(house.plr)<br/>\n            confint(pr)<br/>\n            plot(pr)<br/>\n            pairs(pr)<br/>\n            </code> <br/>\n            <b>الحزمة</b></br>\n            MASS</br>\n            <b>المساعدة</b></br>\n            للحصول على مساعدة مفصلة انقر على أيقونة R في الزاوية العلوية اليمنى من هذا الحوار أو قم بتشغيل الأمر التالي help(polr, package =MASS) عن طريق إنشاء كتلة كود R بالنقر على + في نافذة الإخراج\t\t\t"
  }
}