{
  "title": "تحليل البقاء البارامترية",
  "navigation": "البقاء البارامترية",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الحدث (1 أو أعلى = حدث، 0 أو أقل = توقف)",
  "rmstChk": "احسب متوسط البقاء المقيد (RMST)",
  "rmstSEChk": "احسب الخطأ المعياري لـ RMST باستخدام طريقة البوتستراب (ملاحظة: سيستغرق الأمر بعض الوقت)",
  "bootIter": "تكرار البوتستراب",
  "labelSurvival": "نوع مخطط البقاء",
  "survivalradioCI": "البقاء مع CI",
  "survivalradio": "البقاء",
  "survivalradioKMCI": "البقاء مع طبقة كابلان-ماير (غير بارامترية) مع CI",
  "survivalradioKM": "البقاء مع طبقة كابلان-ماير (غير بارامترية)",
  "labelFailure": "نوع مخطط الفشل التراكمي",
  "inciradioCI": "الفشل التراكمي مع CI",
  "inciradio": "الفشل التراكمي",
  "inciradioKMCI": "الفشل التراكمي مع طبقة كابلان-ماير (غير بارامترية) مع CI",
  "inciradioKM": "الفشل التراكمي مع طبقة كابلان-ماير (غير بارامترية)",
  "spectimes": "احسب احتمال البقاء - حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq (1،5،by=1)",
  "specprobs": "احسب وقت البقاء حتى الحدث - حدد الكمية (الاحتمالية) كـ 0.25، 0.50، 0.60، 0.75، إلخ. أو كـ seq (0.2،0.9،by=0.1)",
  "labelDistribution": "اختر دالة توزيع تناسب البيانات بشكل أفضل",
  "selectDistFuncWeibullRad": "ويبل",
  "selectDistFuncExpRad": "أسّي",
  "selectDistFuncGammaRad": "غاما",
  "selectDistFuncLnormalRad": "لوغاريتمي طبيعي",
  "selectDistFuncPoissonRad": "بواسون",
  "selectDistFuncNBinomRad": "ثنائي سالب",
  "selectDistFuncGeomRad": "هندسي",
  "selectDistFuncBetaRad": "بيتا",
  "selectDistFuncUnifRad": "موحد",
  "selectDistFuncLogisRad": "لوجستي",
  "selectDistFuncLogLogisRad": "لوج لوجستي",
  "selectDistFuncCauchyRad": "كوشي",
  "selectDistFuncNormRad": "طبيعي",
  "confidenceInterval": "فترات الثقة لتقديرات الاحتمالات القصوى",
  "help": {
    "title": "انحدار البقاء البارامترية",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n\t\t\tانظر مجموعة البيانات النموذجية في دليل التثبيت، الموقع الافتراضي هو في حرف محرك الأقراص:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. يجب إدخال المتغير Followup_time كوقت للحدث أو التوقف ويجب إدخال المتغير Event كحدث (1 = حدث، 0 = توقف).<br/>\n            <br/>\n            <br/>\n\t\t\tتتضمن مجموعات البيانات النموذجية الرئة، بيانات التصنيع، وموثوقية المصابيح <br/><br/>\t\t\n            <b>تقديرات ومعالم انحدار البقاء البارامترية مع منحنيات بقاء كابلان-ماير (نموذج فقط للمعامل الثابت) فوقها</b>\n            <br/>\n            <br/>\n            تُستخدم هذه لتقدير المخاطر التراكمية لعدم حدوث حدث ما (أو بالعكس، حدوث حدث ما) على مدى فترة زمنية بعد بدء المتابعة لذلك الحدث (أو الوقت صفر). يجب أن يكون الأفراد في خطر حدوث الحدث بدءًا من الوقت صفر.\n            <br/>\n            <br/>\n            <b>الوقت:</b> طول الوقت حتى حدوث حدث، إذا حدث الحدث، أو آخر متابعة لذلك الحدث، إذا لم يحدث الحدث، لكل فرد\n            <br/><br/>\n            <b>الحدث:</b> مؤشر عددي على ما إذا كان الحدث قد حدث أم لا (1=حدث، 0=توقف) لكل فرد\n            <br/><br/>\n            <b>نوع المخطط:</b> رسم احتمال عدم حدوث الحدث (البقاء) أو حدوث الحدث (الفشل)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>جدول التقديرات لأوقات محددة أو احتمالية:</b> خيار لتضمين جدول يحتوي على احتمالات تقدير البقاء لمجموعة مختارة من الأوقات من قبل المستخدم.\n\t\t\t<br/><br/>\n\t\t\t<b>حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1،5،by=1):</b> هذه هي الأوقات المحددة التي سيتم تضمينها في الجدول للأوقات المحددة. يمكن تحديدها بشكل فردي بفواصل، أو كمتتالية من القيم المتباعدة بشكل متساوٍ.\n\t\t\t<br/><br/>\n            يتم إخراج الجداول مع حجم العينة، عدد الأفراد الذين حدث لهم الحدث، متوسط وقت البقاء (إذا تم تعريفه)، متوسط البقاء المقيد، ومتوسط وقت المتابعة. يتم حساب متوسط وقت المتابعة باستخدام مقدر كابلان-ماير العكسي، الذي يعامل الأحداث الحقيقية كملاحظات متوقفة والملاحظات المتوقفة الحقيقية كأحداث. وبالتالي، فإن \"الحدث\" في هذا المقدر هو \"متابعة الأفراد لأطول فترة ممكنة\".\n            <br/>\n            جدول تقديرات البقاء البارامترية والأحداث للتوزيع المختار متاح عند كل وقت تم ملاحظته في مجموعة البيانات، مع فترات الثقة المعطاة. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>خيارات النمط</b>\n            <br/>\n            <br/>\n            <b>عنوان المخطط:</b> عنوان المخطط؛ احذف كل النصوص لعدم وجود عنوان\n            <br/><br/>\n\t\t\t<b>حجم عنوان المخطط:</b> حجم عنوان المخطط.\n\t\t\t<br/><br/>\n            <b>موضوع المخطط:</b> النمط العام للمخطط\n            <br/><br/>\n            <b>تضمين عدد الأفراد المعرضين للخطر:</b> خيارياً، تضمين جدول لعدد الأفراد الذين لا يزالون في خطر على مر الزمن في أسفل المخطط. <b>موضع جدول المخاطر</b> يحدد ما إذا كنت تريد الجدول خارج المحاور أو داخل المحاور.  <b>ارتفاع جدول المخاطر</b> يتحكم في نسبة منطقة الرسم التي سيشغلها الجدول. يتم تجاهل هذا الخيار عندما يكون موضع جدول المخاطر داخل المحاور. \n\t\t\tتحكم <b>حجم قيمة جدول المخاطر</b> في حجم الأرقام المعرضة للخطر. <b>حجم عنوان جدول المخاطر</b> يتحكم في حجم عنوان جدول الأفراد المعرضين للخطر.\n\t\t\tتحكم <b>حجم تسمية المحور لجدول المخاطر</b> في حجم تسميات المحاور.\n\t\t\tتحكم <b>حجم تسمية علامات المحور لجدول المخاطر</b> في حجم تسميات علامات المحور للأوقات في جدول الأفراد المعرضين للخطر. إذا كان من المرغوب إزالة جميع المحاور وخطوط الشبكة \n\t\t\tمن جدول الأفراد المعرضين للخطر، يمكن تحديد خيار <b>إزالة المحاور وخطوط الشبكة من جدول المخاطر</b>.  سيشمل هذا فقط الأرقام المعرضة للخطر في الجدول.\n            <br/>\n            <br/>\n            <b>خيارات الخط:</b>\n            <b>الحجم</b> يتحكم في سمك الخط و<b>اللون</b> يتحكم في لون الخط المرسوم. يمكن تضمين فترة ثقة 95% للتقديرات إما في شكل <b>شريط</b> (منطقة مظللة) أو <b>خطوة</b> (خط). يتحكم <b>الشفافية</b> في مدى ظلمة الشريط ويتم تجاهله عند اختيار خيار الخطوة. يمكن الإشارة إلى <b>الأوقات المتوقفة</b> (عندما لم يعد الأفراد في خطر للحدث) على الخط باستخدام رموز \"+\". يمكن ضبط حجم رموز \"+\". ستتضمن خيار <b>الإشارة إلى متوسط البقاء</b> خطوط أفقية أو عمودية في الوقت الذي يُقدّر فيه أن 50% من الأفراد قد حدث لهم الحدث. يكون الوقت الوسيط غير محدد إذا لم يتقاطع منحنى البقاء مع 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>خيارات المحور</b>\n            <br/> \n            <br/> \n            يحدد خيار <b>التسمية</b> النص التسموي للمحور. يحدد <b>حدود المحور</b> القيم الدنيا والقصوى للمحور. يتحكم خيار <b>فواصل علامات المحور</b> في تباعد علامات المحور على المحور. تتحكم الفواصل على محور الوقت أيضًا في الأوقات لجدول الأفراد المعرضين للخطر الاختياري.\n            <br/> \n            يحدد خيار <b>مقياس</b> المحور البقاء ما إذا كنت تريد أن تكون التقديرات على مقياس نسبي (0-1) أو مئوي (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية المحور:</b>  يتحكم هذا في حجم كل من أحجام تسميات المحور البقاء والزمن.\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية علامات المحور:</b>  يتحكم هذا في حجم كل من أحجام تسميات علامات المحور البقاء والزمن."
  }
}