{
  "title": "تقديرات مستوى المعلمات",
  "navigation": "تقديرات المعلمات",
  "label1": "تدعم النماذج من الفئات التالية، الفئات مدرجة بين قوسين أدناه",
  "label2": "النماذج الخطية (lm)، النماذج الخطية المعممة (glm)، النماذج اللوجستية متعددة الحدود (multinom)، الانحدار الكمي (rq)، الانحدار الخطي القوي (rlm)، كائن منحنى البقاء (survfit)، نموذج التأثيرات المختلطة الخطية (lme)، كائن الانحدار النسبي للمخاطر (coxph)، نموذج الانحدار البقاء المعلمي (survreg)، الانحدار اللوجستي المرتب/الاحتمالي (polr)، تحليل العوامل (factanal)، نماذج الخطية المعممة المنتظمة باستخدام لاسو وElastic-net (glmnet)",
  "modelselector1": "اختر نموذجًا",
  "help": {
    "title": "تقديرات مستوى المعلمات",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>الوصف</b></br>\nيعرض تقديرات المعلمات للنموذج المحدد\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nx: نموذج أو كائن R آخر لتحويله إلى إطار بيانات بصف واحد\n</li>\n</ul>\n<b>التفاصيل</b></br>\nيعرض تقديرات المعلمات للنماذج التالية</br>\nالنماذج الخطية (فئة النموذج lm)</br>\nالنماذج الخطية المعممة (فئة النموذج glm)</br>\nالنماذج اللوجستية متعددة الحدود (فئة النموذج multinom)</br>\nالانحدار اللوجستي المرتب أو الاحتمالي (فئة النموذج polr)</br>\nنماذج الخطية المعممة المنتظمة باستخدام لاسو وElastic-Net (فئة النموذج glmnet)</br>\nالانحدار الخطي القوي (فئة النموذج rlm)</br>\nالانحدار الكمي (فئة النموذج rq)</br>\nنموذج التأثيرات المختلطة الخطية (lme)</br>\nكائن الانحدار النسبي للمخاطر (coxph)</br>\nنموذج الانحدار البقاء المعلمي (survreg)</br>\nتحليل العوامل (factanal)</br>\n<b>القيمة</b></br>\nتibble::tibble() مع معلومات حول مكونات النموذج.</br>\nterm: اسم مصطلح الانحدار.</br>\nestimate: القيمة المقدرة لمصطلح الانحدار.</br>\nstd.error: الخطأ المعياري لمصطلح الانحدار.</br>\nstatistic: قيمة إحصائية، غالبًا ما تكون إحصائية T، لاستخدامها في فرضية أن مصطلح الانحدار غير صفري.</br>\np.value: القيمة الاحتمالية ذات الجانبين المرتبطة بالإحصائية الملاحظة.</br>\nconf.low: الحد الأدنى من فترة الثقة لمصطلح الانحدار. مدرج فقط إذا conf.int = TRUE.</br>\nconf.high: الحد الأعلى من فترة الثقة لمصطلح الانحدار. مدرج فقط إذا conf.int = TRUE.</br>\nإذا كان النموذج الخطي كائن mlm (نموذج خطي متعدد)، فهناك عمود إضافي:</br>\nresponse: أي عمود استجابة تتوافق معه المعاملات (عادةً Y1، Y2، إلخ)</br>\n<b>الحزمة</b></br>\nbroom</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي في محرر صيغة R help(tidy, package ='broom')\n"
  }
}