{
  "title": "الانحدار البقائي البرامترية",
  "navigation": "الانحدار البقائي البرامترية",
  "modelname": "أدخل اسم النموذج",
  "timevar": "الوقت حتى الحدث أو التوقف",
  "eventvar": "الحدث (1 أو أعلى = حدث، 0 أو أقل = توقف)",
  "destvars": "المتغيرات المستقلة",
  "weightvar": "الأوزان (اختياري)",
  "rmstChk": "احسب متوسط البقاء المقيد (RMST)",
  "rmstSEChk": "احسب الخطأ المعياري لـ RMST باستخدام طريقة Bootstrap (ملاحظة: سيستغرق الأمر بعض الوقت)",
  "bootIter": "تكرار Bootstrap",
  "HazardRatioChk": "احسب نسب المخاطر",
  "labelSurvival": "نوع مخطط البقاء",
  "survivalradioCI": "البقاء مع CI",
  "survivalradio": "البقاء",
  "survivalradioKMCI": "البقاء مع مخطط كابلان-ماير (غير برامترية) مع CI",
  "survivalradioKM": "البقاء مع مخطط كابلان-ماير (غير برامترية)",
  "labelFailure": "نوع مخطط الفشل التراكمي",
  "inciradioCI": "الفشل التراكمي مع CI",
  "inciradio": "الفشل التراكمي",
  "inciradioKMCI": "الفشل التراكمي مع مخطط كابلان-ماير (غير برامترية) مع CI",
  "inciradioKM": "الفشل التراكمي مع مخطط كابلان-ماير (غير برامترية)",
  "spectimes": "احسب احتمال البقاء - حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq (1،5،by=1)",
  "specprobs": "احسب وقت البقاء حتى الحدث - حدد الكمية (الاحتمالية) كـ 0.25، 0.50، 0.60، 0.75، إلخ. أو كـ seq (0.2،0.9،by=0.1)",
  "coVarValues": "إذا تركت فارغة، سيتم استخدام القيم المتوسطة للمتغيرات المستقلة (المتغيرات المشتركة). خلاف ذلك، حدد القيم مفصولة بفواصل التي سيتم استخدامها لتقدير الاحتمالات والرسم",
  "labelDistribution": "اختر دالة توزيع تناسب البيانات بشكل أفضل",
  "selectDistFuncWeibullRad": "ويبل",
  "selectDistFuncExpRad": "أسي",
  "selectDistFuncGammaRad": "جاما",
  "selectDistFuncLnormalRad": "لوغاريتمي طبيعي",
  "selectDistFuncPoissonRad": "بواسون",
  "selectDistFuncNBinomRad": "ثنائي سالب",
  "selectDistFuncGeomRad": "هندسي",
  "selectDistFuncBetaRad": "بيتا",
  "selectDistFuncUnifRad": "موحد",
  "selectDistFuncLogisRad": "لوجستي",
  "selectDistFuncLogLogisRad": "لوج لوجستي",
  "selectDistFuncCauchyRad": "كوشي",
  "selectDistFuncNormRad": "طبيعي",
  "confidenceInterval": "فترات الثقة لتقديرات الاحتمالات القصوى",
  "help": {
    "title": "الانحدار البقائي البرامترية",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n\t\t\tانظر مجموعة البيانات النموذجية في دليل التثبيت، الموقع الافتراضي هو في حرف محرك الأقراص:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. يجب إدخال المتغير Followup_time كوقت للحدث أو التوقف ويجب إدخال المتغير Event كحدث (1 = حدث، 0 = توقف).<br/>\n            <br/>\n            <br/>\n\t\t\tتتضمن مجموعات البيانات النموذجية الرئة، بيانات التصنيع، وموثوقية المصابيح <br/><br/>\t\t\n            <b>تقديرات معلمات الانحدار البقائي البرامترية والمخططات جنبًا إلى جنب مع منحنيات بقاء كابلان-ماير (نموذج فقط مع الصفر/الاعتراض)</b>\n            <br/>\n            <br/>\n            تُستخدم هذه لتقدير المخاطر التراكمية لعدم حدوث حدث ما (أو بالعكس، حدوث حدث ما) على مدى فترة زمنية بعد بدء المتابعة لذلك الحدث (أو الوقت صفر). يجب أن يكون الأفراد في خطر للحدث بدءًا من الوقت صفر.\n            <br/>\n            <br/>\n            <b>الوقت:</b> طول الوقت حتى حدوث حدث، إذا حدث الحدث، أو آخر متابعة لذلك الحدث، إذا لم يحدث الحدث، لكل فرد\n            <br/><br/>\n            <b>الحدث:</b> مؤشر رقمي على ما إذا كان الحدث قد حدث أم لا (1=حدث، 0=توقف) لكل فرد\n            <br/><br/>\n            <b>نوع المخطط:</b> رسم احتمال عدم حدوث الحدث (البقاء) أو حدوث الحدث (الفشل)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>جدول التقديرات لأوقات أو احتمالات محددة:</b> خيار لتضمين جدول يحتوي على تقديرات احتمالات البقاء لمجموعة مختارة من الأوقات من قبل المستخدم.\n\t\t\t<br/><br/>\n\t\t\t<b>حدد الأوقات كـ time1، time2، time3، إلخ. أو كـ seq(1،5،by=1):</b> هذه هي الأوقات المحددة التي سيتم تضمينها في الجدول للأوقات المحددة. يمكن تحديدها بشكل فردي بفواصل، أو كمتتالية من القيم المتباعدة بالتساوي.\n\t\t\t<br/><br/>\n            يتم إخراج الجداول مع حجم العينة، عدد الأفراد الذين لديهم الحدث، متوسط وقت البقاء (إذا تم تعريفه)، متوسط وقت البقاء المقيد، ومتوسط وقت المتابعة. يتم حساب متوسط وقت المتابعة باستخدام مقدر كابلان-ماير العكسي، الذي يعامل الأحداث الحقيقية كملاحظات متوقفة والملاحظات المتوقفة الحقيقية كأحداث. وبالتالي، فإن \"الحدث\" في هذا المقدار هو \"متابعة الأفراد لأطول فترة ممكنة\".\n            <br/>\n            يتم توفير جدول لتقديرات الانحدار البقائي البرامترية وتقديرات الأحداث للتوزيع المختار في كل وقت تم ملاحظته في مجموعة البيانات، مع فترات ثقة محددة. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>خيارات النمط</b>\n            <br/>\n            <br/>\n            <b>عنوان المخطط:</b> عنوان المخطط؛ احذف كل النص لعدم وجود عنوان\n            <br/><br/>\n\t\t\t<b>حجم عنوان المخطط:</b> حجم عنوان المخطط.\n\t\t\t<br/><br/>\n            <b>موضوع المخطط:</b> النمط العام للمخطط\n            <br/><br/>\n            <b>تضمين عدد الأفراد المعرضين للخطر:</b> خيارياً، تضمين جدول لعدد الأفراد الذين لا يزالون في خطر على مر الزمن في أسفل المخطط.  <b>موضع جدول المخاطر</b> يحدد ما إذا كنت تريد الجدول خارج المحاور أو داخل المحاور.  <b>ارتفاع جدول المخاطر</b> يتحكم في نسبة منطقة الرسم التي سيشغلها الجدول.  يتم تجاهل هذا الخيار عندما يكون موضع جدول المخاطر داخل المحاور. \n\t\t\tحجم <b>قيمة جدول المخاطر</b> يتحكم في حجم الأرقام المعرضة للخطر. حجم <b>عنوان جدول المخاطر</b> يتحكم في حجم عنوان جدول الأفراد المعرضين للخطر.\n\t\t\tحجم <b>تسمية المحور لجدول المخاطر</b> يتحكم في حجم تسميات المحاور.\n\t\t\tحجم <b>تسمية العلامة لجدول المخاطر</b> يتحكم في حجم تسميات العلامات للزمن في جدول الأفراد المعرضين للخطر. إذا كان من المرغوب إزالة جميع المحاور وخطوط الشبكة \n\t\t\tمن جدول الأفراد المعرضين للخطر، يمكن تحديد خيار <b>إزالة المحاور وخطوط الشبكة من جدول المخاطر</b>.  سيشمل هذا فقط الأرقام المعرضة للخطر في الجدول.\n            <br/>\n            <br/>\n            <b>خيارات الخط:</b>\n            <b>الحجم</b> يتحكم في سمك الخط و<b>اللون</b> يتحكم في لون الخط المرسوم. يمكن تضمين فترة ثقة بنسبة 95% للتقديرات إما في شكل <b>شريط</b> (منطقة مظللة) أو <b>خطوة</b> (خط).  يتحكم <b>الشفافية</b> في مدى ظلمة الشريط ويتم تجاهله عند اختيار خيار الخطوة. يمكن الإشارة إلى <b>الأوقات المتوقفة</b> (عندما لم يعد الأفراد في خطر للحدث) على الخط باستخدام رموز \"+\". يمكن ضبط حجم رموز \"+\". خيار <b>الإشارة إلى متوسط البقاء</b> سيتضمن خطوط أفقية أو عمودية في الوقت الذي يُقدّر فيه أن 50% من الأفراد قد حدث لهم الحدث. يكون الوقت المتوسط غير معرف إذا لم يتقاطع منحنى البقاء مع 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>خيارات المحور</b>\n            <br/> \n            <br/> \n            خيار <b>التسمية</b> يحدد نص التسمية للمحور.  خيار <b>حدود المحور</b> يحدد القيم الدنيا والقصوى للمحور.  خيار <b>فواصل علامات الت tick</b> يتحكم في تباعد علامات الت tick على المحور.  تتحكم الفواصل على محور الزمن أيضًا في الأوقات لجدول الأفراد المعرضين للخطر الاختياري.\n            <br/> \n            خيار <b>مقياس</b> المحور البقائي يحدد ما إذا كنت تريد أن تكون التقديرات على مقياس نسبة (0-1) أو مقياس نسبة مئوية (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية المحور:</b>  يتحكم هذا في حجم كل من أحجام تسميات المحور البقائي والزمني.\n\t\t\t<br/><br/>\n\t\t\t<b>حجم تسمية علامة المحور:</b>  يتحكم هذا في حجم كل من أحجام تسميات علامات المحور البقائي والزمني."
  }
}