{
  "title": "مخطط باريتو",
  "navigation": "مخطط باريتو",
  "label1": "ثلاث خيارات - تنسيق طويل (افتراضي) أي العيوب والعدادات في أعمدة عمودية، تنسيق واسع أي العيوب كأسماء أعمدة والعدادات كصف، وحساب العداد من البيانات الخام",
  "selectLongRad": "الخيار 1: تنسيق طويل - اختر فئة العيوب وعدد العيوب",
  "selectWideRad": "الخيار 2: تنسيق واسع - سيتم استخدام أسماء الأعمدة كفئة العيوب والصف الأول (افتراضي) سيتم استخدامه كعدادات",
  "selectRawRad": "الخيار 3: بيانات خام - حساب العداد لرسم مخطط باريتو",
  "rownumForCounts": "رقم الصف (الصف الأول الافتراضي) الذي سيتم استخدامه للعدادات",
  "defects": "متغير (مثل الفئات) للرسم",
  "counts": "(اختياري) متغير لاستخدامه كعدادات للرسم",
  "grouping": "(اختياري) متغير تجميع لرسم مخططات باريتو متعددة جنبًا إلى جنب",
  "uniformBarOrderChk": "رسم الأعمدة بنفس الترتيب الأبجدي (عبر المجموعات). قم بإلغاء تحديده لترتيب الأعمدة بناءً على التكرار التنازلي (داخل كل مجموعة)",
  "grouping2": "(اختياري) متغير تجميع لرسم باريتو متعدد جنبًا إلى جنب",
  "rawVariable": "متغير (مثل الفئات) مع بيانات خام",
  "mainTitle": "أدخل عنوان المخطط",
  "xlab": "تسمية المحور السيني",
  "ylab": "تسمية المحور الصادي",
  "ylab2": "تسمية المحور الصادي على المحور الصادي الأيمن",
  "RefCumFreqLine": "ارسم خط مرجعي أفقي لنسبة تراكمي محدد (مثل، اكتب 80 لـ 80%) - اتركه فارغًا لعدم وجود خط",
  "legends": "عرض الأساطير وإذا كان الأمر كذلك، موقع الأساطير (الافتراضي هو اليمين)",
  "percentStep": "خطوة النسبة المئوية التي سيتم استخدامها كعلامات ت ticks للمحور الثاني على الجانب الأيمن",
  "digits": "عدد النقاط العشرية لجدول الإحصائيات",
  "help": {
    "title": "مخطط باريتو",
    "r_help": "help(pareto.chart, package = qcc)",
    "body": "\n\t\t\t\t<b>الوصف</b></br>\n\t\t\t\tدالة pareto.chart لإنشاء جدول إحصائيات ورسم مخطط باريتو\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tللحصول على مساعدة تفصيلية - استخدم R help(pareto.chart, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tلتجربة ذلك، يمكنك استخدام ملف مجموعة البيانات النموذجية المسمى defects_frequency_pareto_chart.xlsx. افتح الملف في شبكة البيانات باستخدام قائمة فتح الملف\n\t\t\t\t<br/>\n\t\t\t"
  }
}