{
  "title": "رسم خريطة الشخص-العنصر",
  "navigation": "رسم خريطة الشخص-العنصر",
  "label1": "اختر نموذجًا (تدعم نماذج الفئة Rm و dRm)",
  "label1b": "إذا لم تكن هناك نماذج متاحة، تحتاج إلى إنشاء نموذج أولاً عن طريق اختيار ملاءمة النموذج -> IRT",
  "modelselector1": "اختر نموذجًا",
  "range1": "نطاق المحور السيني",
  "help": {
    "title": "رسم خريطة الشخص-العنصر",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>الوصف</b></br>\n                تعرض خريطة الشخص-العنصر موقع معلمات العنصر (والعتبات) بالإضافة إلى توزيع معلمات الشخص على طول البعد الكامن. تعتبر خرائط الشخص-العنصر مفيدة لمقارنة نطاق وموقع توزيع قياس العنصر (اللوحة السفلية) مع نطاق وموقع توزيع قياس الشخص (اللوحة العلوية). يجب أن تكون العناصر موجودة بشكل مثالي على طول المقياس بالكامل لقياس ‘القدرة’ لجميع الأشخاص بشكل ذي معنى.\n\n                <br/><br/>\n                <b>الاستخدام</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"خريطة الشخص-العنصر\", latdim = \"البعد الكامن\",\n                pplabel = \"توزيع\nمعلمة\nالشخص\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>المعلمات</b>\n                <br/>  \n                object: كائن من الفئة Rm أو dRm\n                <br/>\n                item.subset: مجموعة فرعية من العناصر التي سيتم رسمها. إما متجه عددي يشير إلى العمود في X أو متجه حرفي يشير إلى اسم العمود. إذا كان \"all\"، يتم رسم جميع العناصر. يجب أن يكون عدد العناصر المرسومة > 1.\n                <br/>\n                sorted: إذا كان TRUE، يتم فرز العناصر بترتيب متزايد وفقًا لموقعها على البعد الكامن.   \n                <br/>\n                main: العنوان الرئيسي للرسم.\n                <br/>\n                latdim: تسمية المحور السيني، أي البعد الكامن.\n                <br/>\n                pplabel: عنوان للوحة العلوية التي تعرض توزيع معلمة الشخص\n                <br/>\n                cex.gen: cex كمعلمة رسومية تحدد قيمة عددية تعطي المقدار الذي يجب أن يتم تكبير النصوص والرموز به بالنسبة للقيمة الافتراضية. هنا cex.gen ينطبق على جميع تسميات النص. القيمة الافتراضية هي 0.7.\n                <br/>\n                xrange: نطاق المحور السيني\n                <br/>\n                warn.ord: إذا كان TRUE (القيمة الافتراضية) يتم عرض النجوم في الهامش الأيمن للوحة السفلية للإشارة إلى مواقع العتبات غير الترتيبية للعناصر متعددة الفئات.\n                <br/>\n                warn.ord.colour: يتم تلوين مواقع العتبات غير الترتيبية للعناصر متعددة الفئات بهذا اللون لجعلها أكثر وضوحًا. هذا مفيد بشكل خاص عندما تكون هناك العديد من العناصر بحيث تكون الخريطة كثيفة جدًا. القيمة الافتراضية هي \"أسود\"، بحيث لا يتم إجراء تمييز.\n                <br/>   \n                irug: إذا كان TRUE (القيمة الافتراضية)، يتم رسم جميع العتبات أسفل توزيع الشخص للإشارة إلى أين تكون العناصر المدرجة أكثر إفادة.                \n                <br/>\n                pp: إذا كانت غير NULL، تحتوي على بيانات معلمة الشخص من كائن البيانات، مما يلغي الحاجة إلى إعادة حسابها.\n                <br/><br/>\n\n                <b>الحزم</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>المساعدة</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}