{
  "title": "اختبار نسبة عينتين",
  "navigation": "عينتان (تصحيح الاستمرارية)",
  "tvarbox1": "تجميع، حدد متغير عامل",
  "response": "متغير الاستجابة، متغير عامل بمستويين فقط",
  "label1": "الفرضية البديلة",
  "test1": "النسبة != النسبة المفترضة",
  "test2": "النسبة > النسبة المفترضة",
  "test3": "النسبة < النسبة المفترضة",
  "txtbox1": "مستوى الثقة",
  "chkbox1": "مع تصحيح الاستمرارية",
  "help": {
    "title": "اختبار نسبة عينتين",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>الوصف</b></br>\nيمكن استخدام prop.test لاختبار الفرضية الصفرية بأن النسب (احتمالات النجاح) في عدة مجموعات هي نفسها، أو أنها تساوي قيم معينة معينة.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nx: متجه من عدادات النجاحات، جدول أحادي البعد مع مدخلتين، أو جدول (أو مصفوفة) ثنائي الأبعاد مع عمودين، يعطي عدادات النجاحات والإخفاقات، على التوالي.\n</li>\n<li>\nn: متجه من عدادات التجارب؛ يتم تجاهله إذا كان x مصفوفة أو جدولاً.\n</li>\n<li>\np: متجه من احتمالات النجاح. يجب أن تكون طول p هو نفسه عدد المجموعات المحددة بواسطة x، ويجب أن تكون عناصرها أكبر من 0 وأقل من 1.\n</li>\n<li>\nalternative: سلسلة أحرف تحدد الفرضية البديلة، يجب أن تكون واحدة من \"two.sided\" (افتراضي)، \"greater\" أو \"less\". يمكنك تحديد الحرف الأول فقط. تستخدم فقط لاختبار الفرضية الصفرية بأن نسبة واحدة تساوي قيمة معينة، أو أن نسبتين متساويتين؛ يتم تجاهلها بخلاف ذلك.\n</li>\n<li>\nconf.level: مستوى الثقة لفترة الثقة المعادة. يجب أن يكون رقمًا واحدًا بين 0 و 1. يستخدم فقط عند اختبار الفرضية الصفرية بأن نسبة واحدة تساوي قيمة معينة، أو أن نسبتين متساويتين؛ يتم تجاهلها بخلاف ذلك.\n</li>\n<li>\ncorrect: قيمة منطقية تشير إلى ما إذا كان يجب تطبيق تصحيح الاستمرارية لـ Yates حيثما كان ذلك ممكنًا.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nتستخدم فقط المجموعات التي تحتوي على أعداد نهائية من النجاحات والإخفاقات. يجب أن تكون عدادات النجاحات والإخفاقات غير سالبة وبالتالي لا تزيد عن الأعداد المقابلة للتجارب التي يجب أن تكون إيجابية. يجب أن تكون جميع العدادات النهائية أعدادًا صحيحة.</br>\nإذا كانت p NULL وكان هناك أكثر من مجموعة واحدة، فإن الفرضية الصفرية المختبرة هي أن النسب في كل مجموعة هي نفسها. إذا كان هناك مجموعتان، فإن البدائل هي أن احتمال النجاح في المجموعة الأولى أقل من، غير متساوي، أو أكبر من احتمال النجاح في المجموعة الثانية، كما هو محدد بواسطة البديل. يتم إرجاع فترة ثقة للاختلاف في النسب مع مستوى الثقة كما هو محدد بواسطة conf.level ومقصوص إلى [-1,1]. يتم استخدام تصحيح الاستمرارية فقط إذا لم يتجاوز الفرق في النسب العينية في القيمة المطلقة. خلاف ذلك، إذا كان هناك أكثر من مجموعتين، فإن البديل هو دائمًا \"two.sided\"، وفترة الثقة المعادة هي NULL، ولا يتم استخدام تصحيح الاستمرارية أبدًا.</br>\nإذا كان هناك مجموعة واحدة فقط، فإن الفرضية الصفرية المختبرة هي أن الاحتمال الأساسي للنجاح هو p، أو 0.5 إذا لم يتم إعطاء p. البديل هو أن احتمال النجاح أقل من، غير متساوي، أو أكبر من p أو 0.5، على التوالي، كما هو محدد بواسطة البديل. يتم إرجاع فترة ثقة للنسبة الأساسية مع مستوى الثقة كما هو محدد بواسطة conf.level ومقصوصة إلى [0,1]. يتم استخدام تصحيح الاستمرارية فقط إذا لم يتجاوز الفرق بين النسب العينية والنسب الصفرية في القيمة المطلقة. يتم حساب فترة الثقة عن طريق عكس اختبار النقطة.</br>\nأخيرًا، إذا تم إعطاء p وكان هناك أكثر من مجموعتين، فإن الفرضية الصفرية المختبرة هي أن الاحتمالات الأساسية للنجاح هي تلك المعطاة بواسطة p. البديل هو دائمًا \"two.sided\"، وفترة الثقة المعادة هي NULL، ولا يتم استخدام تصحيح الاستمرارية أبدًا.</br>\n<b>القيمة</b><br/>\nقائمة مع فئة \"htest\" تحتوي على المكونات التالية:</br>\nstatistic: قيمة إحصائية اختبار كاي تربيع لبييرسون.</br>\nparameter: درجات الحرية لتوزيع كاي تربيع التقريبي لإحصائية الاختبار.</br>\np.value: قيمة p للاختبار.</br>\nestimate: متجه مع النسب العينية x/n.</br>\nconf.int: فترة ثقة للنسبة الحقيقية إذا كان هناك مجموعة واحدة، أو للاختلاف في النسب إذا كان هناك مجموعتان و p لم يتم إعطاؤها، أو NULL بخلاف ذلك. في الحالات التي لا تكون NULL، فإن فترة الثقة المعادة لها مستوى ثقة غير متناسق كما هو محدد بواسطة conf.level، وهي مناسبة للفرضية البديلة المحددة.</br>\nnull.value: قيمة p إذا تم تحديدها بواسطة الفرضية الصفرية، أو NULL بخلاف ذلك.</br>\nalternative: سلسلة أحرف تصف البديل.</br>\nmethod: سلسلة أحرف تشير إلى الطريقة المستخدمة، وما إذا كان تم تطبيق تصحيح الاستمرارية لـ Yates.</br>\ndata.name: سلسلة أحرف تعطي أسماء البيانات.</br>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nhelp(prop.test, package ='stats')\n    "
  }
}