{
  "title": "اختبار نسبة العينة المزدوجة",
  "navigation": "عينة مزدوجة",
  "tvarbox1": "رقمي أو عامل بمستويين/قيمتين فقط",
  "tvarbox2": "رقمي أو عامل بمستويين/قيمتين فقط",
  "tvarbox3": "متغير رقمي",
  "tvarbox4": "متغير عامل بمستويين/قيمتين فقط",
  "label1": "فرضية بديلة",
  "test1": "النسبة != النسبة المفترضة",
  "test2": "النسبة > النسبة المفترضة",
  "test3": "النسبة < النسبة المفترضة",
  "txtbox1": "مستوى الثقة",
  "txtbox2": "الفرضية الصفرية (النسبة المفترضة في النطاق 0-1)",
  "chkbox1": "مع تصحيح الاستمرارية",
  "dataInCols": "البيانات في متغيرين منفصلين",
  "dataInOneCols": "البيانات في متغير واحد",
  "dataVariable": "متغير يحتوي على البيانات",
  "groupingVariable": "متغير التجميع",
  "summarized": "بيانات ملخصة",
  "noOfEvents": "عدد الأحداث",
  "noOfTrials": "عدد التجارب",
  "method": "اختر الطريقة",
  "label2": "عينة1",
  "label3": "عينة2",
  "noOfEvents2": "عدد الأحداث",
  "noOfTrials2": "عدد التجارب",
  "help": {
    "title": "اختبار نسبة العينة المزدوجة",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>الوصف</b></br>\nيمكن استخدام prop.test لاختبار الفرضية الصفرية بأن النسب (احتمالات النجاح) في عدة مجموعات هي نفسها، أو أنها تساوي قيم معينة معينة.\nندعم الخيارات التالية </br>\n1. البيانات في عمودين: هنا نقارن نسبة النجاحات في كل عمود. يُسمح بحد أقصى من قيمتين فريدتين في كل عمود.</br>\n2. البيانات في عمود واحد: هنا نقارن نسبة النجاحات في كل مجموعة في العمود الأول، ويتم تعريف المجموعة بواسطة مستويات العامل في عمود آخر. يُسمح بحد أقصى من قيمتين فريدتين في كل عمود.</br>\n3. يتم إدخال البيانات في تنسيق ملخص. الطريقة = تقدير النسب بشكل منفصل.</br>\nعندما تكون الطريقة = تقدير النسب بشكل منفصل، نختبر الفرضية الصفرية بأن النسب (احتمالات النجاح) في كل مجموعة هي نفسها، أو أنها تساوي قيم معينة معينة. انظر الكود أدناه للبيانات في تنسيق ملخص.</br>\n<code> \nBSky2SampleProportionMT( x1=4, x2=5,\n    n1=18, n2=7, p=0, \n    alternate=\"two.sided\", conf.level=0.95, testMethod =\"Estimate proportions separately\") <br/>\n</code> <br/>\nعندما تكون الطريقة = استخدام تقدير مجمع للنسبة، فإن تقدير مجمع للنسبة هو تقدير مجمع للنسبة بناءً على البيانات من كلا العينة. يتم حسابه عندما نفترض أن السكان الاثنين لديهم نفس النسبة، وهي الفرضية الصفرية في العديد من اختبارات نسبة العينة المزدوجة. انظر المثال أدناه للبيانات في تنسيق ملخص.</br>\n<code> \nBSky2SampleProportionMT( x1=5, x2=3,\n    n1=16, n2=10, p=0, \n    alternate=\"two.sided\", conf.level=0.95, testMethod =\"Use pooled estimate of the proportion\")\n</code> <br/>\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>المعطيات</b><br/>\n<ul>\n<li>\nx: متجه من عدد النجاحات، جدول أحادي البعد مع مدخلين، أو جدول ثنائي الأبعاد (أو مصفوفة) مع عمودين، يعطي عدد النجاحات والإخفاقات، على التوالي.\n</li>\n<li>\nn: متجه من عدد التجارب؛ يتم تجاهله إذا كان x مصفوفة أو جدول.\n</li>\n<li>\np: متجه من احتمالات النجاح. يجب أن يكون طول p هو نفسه عدد المجموعات المحددة بواسطة x، ويجب أن تكون عناصره أكبر من 0 وأقل من 1.\n</li>\n<li>\nalternative: سلسلة حرفية تحدد الفرضية البديلة، يجب أن تكون واحدة من \"two.sided\" (افتراضي)، \"greater\" أو \"less\". يمكنك تحديد الحرف الأول فقط. تُستخدم فقط لاختبار الفرضية الصفرية بأن نسبة واحدة تساوي قيمة معينة، أو أن نسبتين متساويتين؛ يتم تجاهلها بخلاف ذلك.\n</li>\n<li>\nconf.level: مستوى الثقة لفترة الثقة المعادة. يجب أن يكون رقمًا واحدًا بين 0 و 1. تُستخدم فقط عند اختبار الفرضية الصفرية بأن نسبة واحدة تساوي قيمة معينة، أو أن نسبتين متساويتين؛ يتم تجاهلها بخلاف ذلك.\n</li>\n<li>\ncorrect: منطق يشير إلى ما إذا كان يجب تطبيق تصحيح الاستمرارية لـ Yates حيثما كان ذلك ممكنًا.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nتُستخدم فقط المجموعات التي تحتوي على أعداد نهائية من النجاحات والإخفاقات. يجب أن تكون أعداد النجاحات والإخفاقات غير سالبة وبالتالي ليست أكبر من الأعداد المقابلة للتجارب التي يجب أن تكون إيجابية. يجب أن تكون جميع الأعداد النهائية أعداد صحيحة.</br>\nإذا كانت p NULL وكان هناك أكثر من مجموعة واحدة، فإن الفرضية المختبرة هي أن النسب في كل مجموعة هي نفسها. إذا كانت هناك مجموعتان، فإن البدائل هي أن احتمال النجاح في المجموعة الأولى أقل من، ليس مساويًا، أو أكبر من احتمال النجاح في المجموعة الثانية، كما هو محدد بواسطة البديل. يتم إرجاع فترة ثقة للاختلاف في النسب مع مستوى الثقة كما هو محدد بواسطة conf.level ومقصوصة إلى [-1,1]. يتم استخدام تصحيح الاستمرارية فقط إذا لم يتجاوز الفرق بين النسب العينية في القيمة المطلقة. بخلاف ذلك، إذا كان هناك أكثر من مجموعتين، فإن البديل هو دائمًا \"two.sided\"، وتكون فترة الثقة المعادة NULL، ولا يتم استخدام تصحيح الاستمرارية أبدًا.</br>\nإذا كانت هناك مجموعة واحدة فقط، فإن الفرضية المختبرة هي أن احتمال النجاح الأساسي هو p، أو 0.5 إذا لم يتم إعطاؤه. البديل هو أن احتمال النجاح أقل من، ليس مساويًا، أو أكبر من p أو 0.5، على التوالي، كما هو محدد بواسطة البديل. يتم إرجاع فترة ثقة للنسبة الأساسية مع مستوى الثقة كما هو محدد بواسطة conf.level ومقصوصة إلى [0,1]. يتم استخدام تصحيح الاستمرارية فقط إذا لم يتجاوز الفرق بين العينة والنسب الصفرية في القيمة المطلقة. يتم حساب فترة الثقة عن طريق عكس اختبار النسبة.</br>\nأخيرًا، إذا تم إعطاء p وكان هناك أكثر من مجموعتين، فإن الفرضية المختبرة هي أن احتمالات النجاح الأساسية هي تلك المعطاة بواسطة p. البديل هو دائمًا \"two.sided\"، وتكون فترة الثقة المعادة NULL، ولا يتم استخدام تصحيح الاستمرارية أبدًا.</br>\n<b>القيمة</b><br/>\nقائمة مع فئة \"htest\" تحتوي على المكونات التالية:</br>\nstatistic: قيمة إحصائية اختبار كاي تربيع لبييرسون.</br>\nparameter: درجات الحرية لتوزيع كاي تربيع التقريبي لإحصائية الاختبار.</br>\np.value: قيمة p للاختبار.</br>\nestimate: متجه مع النسب العينية x/n.</br>\nconf.int: فترة ثقة للنسبة الحقيقية إذا كانت هناك مجموعة واحدة، أو للاختلاف في النسب إذا كانت هناك مجموعتان و p غير معطاة، أو NULL بخلاف ذلك. في الحالات التي لا تكون فيها NULL، فإن فترة الثقة المعادة لها مستوى ثقة تقريبي كما هو محدد بواسطة conf.level، وهي مناسبة للفرضية البديلة المحددة.</br>\nnull.value: قيمة p إذا تم تحديدها بواسطة الصفر، أو NULL بخلاف ذلك.</br>\nalternative: سلسلة حرفية تصف البديل.</br>\nmethod: سلسلة حرفية تشير إلى الطريقة المستخدمة، وما إذا كان تم تطبيق تصحيح الاستمرارية لـ Yates.</br>\ndata.name: سلسلة حرفية تعطي أسماء البيانات.</br>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nhelp(prop.test, package ='stats')\n"
  }
}