{
  "label1": "لمقارنة انحدار الكوانتيل، انظر \"تقييم النموذج > مقارنة > نماذج انحدار الكوانتيل\"",
  "title": "انحدار الكوانتيل",
  "navigation": "كوانتيل",
  "modelname": "أدخل اسم النموذج",
  "depvarlabel": "المتغير التابع",
  "quantilelabel": "الكوانتيل (0-1)",
  "estgrplabel": "طريقة التقدير",
  "brlabel": "باروديل وروبرتس",
  "fnlabel": "فريش-نيوتن",
  "pfnlabel": "فريش-نيوتن، معالجة مسبقة",
  "sfnlabel": "فريش-نيوتن، نادر",
  "stderrgrplabel": "طريقة الخطأ القياسي",
  "ranklabel": "الرتبة",
  "iidlabel": "IID",
  "nidlabel": "NID",
  "kernallabel": "نواة",
  "bootstraplabel": "إعادة التقدير",
  "bootsamplabel": "عينات إعادة التقدير",
  "help": {
    "title": "انحدار الكوانتيل",
    "r_help": "help(rq, package = 'quantreg')",
    "body": "\nهذا يناسب نموذج انحدار الكوانتيل، الذي يقوم بنمذجة كوانتيل مرغوب (أي نسبة مئوية) من المتغير الناتج. كوانتيل نموذجي للنمذجة هو 0.5، أي الوسيط. \nملخص النموذج وتقديرات المعلمات مع فترات الثقة 95% متاحة.\n<br/><br/>\n<b>أدخل اسم النموذج:</b> الاسم المرغوب للنموذج\n<br/><br/>\n<b>المتغير التابع:</b> حدد المتغير التابع للنموذج. سيتم نمذجة الكوانتيل المرغوب من هذا المتغير. يجب أن يكون هذا عدديًا.\n<br/><br/>\n<b>منشئ الصيغة:</b> حدد مصطلحات النموذج باستخدام تدوين الصيغة. يُسمح بالمتغيرات العددية، والعوامل، والعوامل المرتبة، والمتغيرات النصية. سيتم تحويل المتغيرات النصية إلى عوامل.\n<br/><br/>\n<b>الكوانتيل (0-1):</b> حدد الكوانتيل المرغوب لنمذجة المتغير التابع. 0.5 (الوسيط) هو الافتراضي وهو كمية نموذجية.\n<br/><br/>\n<b>طريقة التقدير:</b> حدد طريقة التقدير لمعلمات النموذج. طريقة باروديل وروبرتس هي الافتراضية وفعالة للنماذج التي تحتوي على \nعدة آلاف من الملاحظات. قد تكون طريقة فريش-نيوتن وطريقة فريش-نيوتن، المعالجة المسبقة مفيدة للمشاكل الكبيرة جدًا، على التوالي، \nخاصة في الحالات التي تحتوي على عدد قليل من المعلمات المقدرة. بالنسبة لأحجام العينات الكبيرة مع عدد كبير من المعلمات، قد تكون طريقة فريش-نيوتن، النادرة مطلوبة. \nانظر المراجع في مساعدة R للحصول على التفاصيل.\n<br/><br/>\n<b>طريقة الخطأ القياسي:</b> حدد الطريقة المستخدمة لتقدير الأخطاء القياسية وفترات الثقة. توفر طريقة الرتبة فترات الثقة فقط، ويمكن أن تكون بطيئة \nلتشغيلها لأحجام العينات الأكبر (n > 1000)، وتعتمد على عكس اختبار الرتبة. تفترض طريقة IID أن الأخطاء مستقلة وموزعة بشكل متطابق (iid). \nتفترض طريقة NID الخطية المحلية في الكوانتيل وتحسب تقدير ساندويتش باستخدام تقدير محلي للندرة. تستخدم طريقة النواة تقدير نواة للساندويتش. \nتستخدم طريقة إعادة التقدير نهج إعادة التقدير لإعادة تقدير الأخطاء القياسية. انظر المراجع في مساعدة R للحصول على التفاصيل.\n<br/><br/>\n<b>عينات إعادة التقدير:</b> العدد المرغوب من عينات إعادة التقدير لنهج الخطأ القياسي لإعادة التقدير. الافتراضي هو 2000 عينة.\n<br/><br/>\n<b>حزم R المطلوبة:</b> quantreg، broom\n\t\t"
  }
}