{
  "title": "الغابة العشوائية",
  "label1": "يمكن تشغيل الغابة العشوائية في وضع الإشراف أو عدم الإشراف. لتشغيلها في وضع عدم الإشراف، لا تحدد متغيرًا تابعًا.",
  "navigation": "الغابة العشوائية",
  "modelname": "أدخل اسم النموذج",
  "dependentvar": "المتغير التابع",
  "independentvars": "المتغير (المتغيرات) المستقلة",
  "ntree": "عدد الأشجار",
  "mtry": "mtry",
  "proximity": "القرب:",
  "newds": "حدد اسم مجموعة البيانات لتخزين القرب:",
  "predictor": "احفظ القيم المتوقعة:",
  "newcolname": "حدد اسم العمود الجديد للقيم المتوقعة:",
  "help": {
    "title": "الغابة العشوائية",
    "r_help": "help(randomForest,package='randomForest')",
    "body": "\n                <b>الوصف</b></br>\nتقوم randomForest بتنفيذ خوارزمية الغابة العشوائية لبريمان (استنادًا إلى كود Fortran الأصلي لبريمان وكاتلر) للتصنيف والانحدار. يمكن أيضًا استخدامها في وضع عدم الإشراف لتقييم القرب بين نقاط البيانات.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nrandomForest(x, y=NULL,  ntree=500, importance=FALSE, proximity, ...)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\nx : إطار بيانات أو مصفوفة من المتنبئين، أو صيغة تصف النموذج الذي سيتم ملاءمته (لطريقة الطباعة، كائن randomForest).\n</li>\n<li>\ny: متجه الاستجابة. إذا كان عاملًا، يُفترض التصنيف، وإلا يُفترض الانحدار. إذا تم حذفها، ستعمل randomForest في وضع عدم الإشراف.\n</li>\n<li>\nntree : عدد الأشجار التي يجب زراعتها. يجب ألا يتم تعيين هذا العدد صغيرًا جدًا، لضمان أن كل صف إدخال يتم التنبؤ به على الأقل بضع مرات.\n</li>\n<li>\nimportance : هل يجب تقييم أهمية المتنبئين؟ \n</li>\n<li>\nproximity : هل يجب حساب مقياس القرب بين الصفوف؟\n</li>\n<li>\n... : معلمات اختيارية يجب تمريرها إلى الوظيفة ذات المستوى المنخفض randomForest.default.\n</li>\n</ul>\n<b>القيمة</b><br/>\nكائن من فئة randomForest، وهو قائمة تحتوي على المكونات التالية:<br/>\ncall: الاستدعاء الأصلي لـ randomForest<br/>\ntype: واحد من الانحدار، التصنيف، أو عدم الإشراف.<br/>\npredicted: القيم المتوقعة للبيانات المدخلة بناءً على عينات خارج الحقيبة.<br/>\nimportance:\ta مصفوفة تحتوي على nclass + 2 (للتصنيف) أو عمودين (للانحدار). للتصنيف، تكون الأعمدة nclass الأولى هي مقاييس خاصة بالفئة تم حسابها كمتوسط انخفاض في الدقة. العمود nclass + 1 هو متوسط انخفاض الدقة عبر جميع الفئات. العمود الأخير هو متوسط انخفاض في مؤشر جيني. بالنسبة للانحدار، العمود الأول هو متوسط انخفاض في الدقة والثاني هو متوسط انخفاض في MSE. إذا كانت importance=FALSE، يتم إرجاع المقياس الأخير كمتجه.<br/>\nimportanceSD: \"أخطاء القياسية\" لمقياس الأهمية المستند إلى التبديل. للتصنيف، مصفوفة p بواسطة nclass + 1 تتوافق مع أول nclass + 1 أعمدة من مصفوفة الأهمية. بالنسبة للانحدار، متجه بطول p.<br/>\nlocalImp: مصفوفة p بواسطة n تحتوي على مقاييس الأهمية حسب الحالة، حيث العنصر [i,j] هو أهمية المتغير i-th على الحالة j-th. NULL إذا كانت localImp=FALSE.<br/>\nntree: عدد الأشجار المزروعة.<br/>\nmtry: عدد المتنبئين الم sampled للتقسيم في كل عقدة.<br/>\nforest: (قائمة تحتوي على الغابة بأكملها؛ NULL إذا تم تشغيل randomForest في وضع عدم الإشراف أو إذا كانت keep.forest=FALSE.<br/>\nerr.rate: (التصنيف فقط) معدلات خطأ المتجه للتنبؤ على البيانات المدخلة، حيث العنصر i-th هو معدل الخطأ (OOB) لجميع الأشجار حتى العنصر i-th.<br/>\nconfusion: (التصنيف فقط) مصفوفة الالتباس للتنبؤ (استنادًا إلى بيانات OOB).<br/>\nvotes: (التصنيف فقط) مصفوفة تحتوي على صف واحد لكل نقطة بيانات مدخلة وعمود واحد لكل فئة، مما يعطي الكسر أو العدد من \"الأصوات\" (OOB) من الغابة العشوائية.<br/>\noob.times: عدد المرات التي تكون فيها الحالات \"خارج الحقيبة\" (وبالتالي تستخدم في حساب تقدير خطأ OOB)<br/>\nproximity: إذا كانت proximity=TRUE عند استدعاء randomForest، مصفوفة من مقاييس القرب بين المدخلات (استنادًا إلى تكرار وجود أزواج من نقاط البيانات في نفس العقد النهائية).<br/>\nmse\t: (الانحدار فقط) متجه من الأخطاء المربعة المتوسطة: مجموع المربعات المتبقية مقسومًا على n.<br/>\nrsq\t: (الانحدار فقط) \"R-squared الزائف\": 1 - mse / Var(y).<br/>\ntest: إذا تم إعطاء مجموعة الاختبار (من خلال xtest أو ytest الإضافية)، فإن هذه المكونة هي قائمة تحتوي على القيم المتوقعة المقابلة، err.rate، confusion، votes (للتصنيف) أو القيم المتوقعة، mse و rsq (للانحدار) لمجموعة الاختبار. إذا كانت proximity=TRUE، هناك أيضًا مكون، proximity، الذي يحتوي على القرب بين مجموعة الاختبار وكذلك القرب بين بيانات الاختبار والتدريب.<br/>\n<b>الحزمة</b></br>\nrandomForest​;BlueSky</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذا الحوار أو قم بتشغيل الأمر التالي في محرر صيغة R</br>\nhelp(randomForest,package='randomForest')\n                "
  }
}