{
  "title": "تقسيم عشوائي",
  "navigation": "تقسيم عشوائي",
  "traindataset": "أدخل اسم مجموعة التدريب",
  "testdataset": "أدخل اسم مجموعة الاختبار",
  "split": "أدخل نسبة التقسيم",
  "replace": "هل يجب أن يكون السحب مع الاستبدال",
  "seed": "تعيين البذور",
  "dependent": "المتغير الذي سيتم بناء عينات مصنفة منه",
  "help": {
    "title": "تقسيم عشوائي",
    "r_help": "help(sample, package=\"base\")",
    "body": "\n<b>الوصف</b></br>\nsample تأخذ عينة بالحجم المحدد من عناصر x باستخدام إما مع أو بدون استبدال.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nsample(x, size, replace = FALSE, prob = NULL)\nsample.int(n, size = n, replace = FALSE, prob = NULL)\n</code> <br/>\n<b>المعطيات</b><br/>\n<ul>\n<li>\nx: إما متجه من عنصر واحد أو أكثر للاختيار منه، أو عدد صحيح موجب. انظر 'التفاصيل'.\n</li>\n<li>\nn: عدد موجب، عدد العناصر للاختيار منها. انظر 'التفاصيل'.\n</li>\n<li>\nsize: عدد صحيح غير سالب يعطي عدد العناصر للاختيار.\n</li>\n<li>\nreplace: هل يجب أن يكون السحب مع الاستبدال؟\n</li>\n<li>\nprob: متجه من أوزان الاحتمالية للحصول على عناصر المتجه الذي يتم سحبه.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nإذا كان x بطول 1، وعددي (بالمعنى هو.numeric) و x >= 1، يتم السحب عبر sample من 1:x. لاحظ أن هذه الميزة قد تؤدي إلى سلوك غير مرغوب فيه عندما يكون x بطول متغير في استدعاءات مثل sample(x). انظر الأمثلة.<br/>\nبخلاف ذلك، يمكن أن يكون x أي كائن R حيث يكون الطول والتجزئة بواسطة الأعداد الصحيحة منطقيًا: سيتم توجيه طرق S3 أو S4 لهذه العمليات كما هو مناسب.<br/>\nبالنسبة لـ sample، القيمة الافتراضية لـ size هي عدد العناصر المستنتجة من المعطى الأول، بحيث أن sample(x) ينتج ترتيبًا عشوائيًا لعناصر x (أو 1:x).<br/>\nيسمح بطلب عينات بحجم = 0 مع n = 0 أو x بطول صفر، ولكن بخلاف ذلك n > 0 أو طول(x) موجب مطلوب.<br/>\nالقيم العددية الموجبة غير الصحيحة لـ n أو x سيتم تقطيعها إلى العدد الصحيح الأصغر التالي، والذي يجب ألا يكون أكبر من .Machine$integer.max.<br/>\nيمكن استخدام المعطى الاختياري prob لتقديم متجه من الأوزان للحصول على عناصر المتجه الذي يتم سحبه. لا تحتاج إلى أن تكون مجموعها واحدًا، ولكن يجب أن تكون غير سالبة وليس كلها صفر. إذا كان replace صحيحًا، يتم استخدام طريقة وكيل ووكر (Ripley، 1987) عندما يكون هناك أكثر من 200 قيمة محتملة معقولة: وهذا يعطي نتائج غير متوافقة مع تلك من R < 2.2.0.<br/>\nإذا كان replace خاطئًا، يتم تطبيق هذه الاحتمالات بالتتابع، أي أن احتمال اختيار العنصر التالي يتناسب مع الأوزان بين العناصر المتبقية. يجب أن يكون عدد الأوزان غير الصفرية على الأقل بحجم في هذه الحالة.<br/>\nsample.int هو واجهة عارية حيث يجب تقديم كل من n و size كأعداد صحيحة.<br/>\nاعتبارًا من R 3.0.0، يمكن أن يكون n أكبر من أكبر عدد صحيح من نوع integer، حتى أكبر عدد يمكن تمثيله في نوع double. يتم دعم السحب العشوائي الموحد فقط. يتم استخدام رقمين عشوائيين لضمان السحب العشوائي الموحد للأعداد الكبيرة.<br/>\n<b>الحزمة</b></br>\nbase\n<b>المساعدة</b></br>\nhelp(sample, package=\"base\")\n"
  }
}