{
  "title": "إعادة ترميز المتغيرات",
  "navigation": "إعادة ترميز",
  "oldvars": "المتغيرات لإعادة ترميزها",
  "label1": "الخيارات",
  "newvarradio": "متغير(ات) جديدة",
  "newvar": "أدخل أسماء المتغيرات الجديدة مفصولة بـ ، على سبيل المثال newVar1، newVar2",
  "oldvarradio": "استبدال المتغير(ات) الموجودة",
  "suffix": "حدد لاحقة للمتغيرات المعاد ترميزها",
  "prefix": "حدد بادئة للمتغيرات المعاد ترميزها",
  "enterSuffix": "أدخل لاحقة",
  "enterPrefix": "أدخل بادئة",
  "label3": "عند تحديد معايير إعادة ترميز متعددة، استخدم ; كفاصل.",
  "label4": "ملاحظة: يجب أن تكون القيم النصية محاطة بعلامات اقتباس مزدوجة (\") وليس بعلامات اقتباس مفردة (').",
  "label5": "أدخل القيم القديمة والقيم الجديدة مفصولة بـ ; على سبيل المثال \"ذكر\"=\"رجل\";\"أنثى\"=2;\"هيوستن، تكساس\"=\"تكساس\";\"غير متوفر\"=NA ",
  "label5a": "لإعادة ترميز النوع الرقمي أدخل 70=100;71=101;99=NA",
  "label5b": "يدعم نطاق القيم، على سبيل المثال 5:10=\"متوسط\" قد تظهر القيم الخاصة lo و hi في النطاق، على سبيل المثال lo:10=\"منخفض\";11:89=\"متوسط\";90:hi=\"مرتفع\"",
  "label6": "يمكن استخدام الكلمة الرئيسية else لكل ما لا يتناسب مع المواصفات، على سبيل المثال else =NA",
  "dontMakeFactor": "بشكل افتراضي، سيكون المتغير المعاد ترميزه عاملًا إذا كان المتغير المصدر عاملًا. لتجاوز ذلك، تحقق من مربع الاختيار",
  "oldnewvals": "أدخل معايير إعادة الترميز",
  "help": {
    "title": "إعادة ترميز المتغيرات",
    "r_help": "help(recode, package=car)",
    "body": "\n<b>الوصف</b></br>\nيعيد ترميز واحد أو أكثر من متجه رقمي، متجه حرفي، أو عوامل وفقًا لمواصفات إعادة الترميز. يمكنك تخزين النتائج عن طريق استبدال المتغيرات الموجودة، أو تحديد أسماء متغيرات جديدة لتخزين القيم المعاد ترميزها أو اختيار تخزين القيم المعاد ترميزها في متغيرات جديدة مع بادئة أو لاحقة مناسبة. سيتم تطبيق البادئة أو اللاحقة على اسم المتغير الموجود.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nBSkyRecode(colNames,newColNames,OldNewVals,NewCol=TRUE,dataSetNameOrIndex='Dataset2')\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\ncolNames: متجه حرفي يحتوي على متغير واحد أو أكثر في مجموعة البيانات لإعادة ترميزه\n</li>\n<li>\nnewColNames:  متجه حرفي يحتوي على أسماء الأعمدة الجديدة.\n</li>\n<li>\nOldNewVals: سلسلة حرفية لمواصفات إعادة الترميز في شكل oldval1,newval1, oldval2,newval2\n</li>\n<li>\nNewCol: قيمة منطقية تشير إلى ما إذا كانت القيم المعاد ترميزها مخزنة في متغيرات جديدة (TRUE) أو يتم استبدال المتغيرات الموجودة (FALSE).\n</li>\n<li>\nprefixOrSuffix: حدد ما إذا كنت تريد تخزين القيم المعاد ترميزها في متغيرات جديدة مسبوقة أو ملحقة بالاسم الذي تحدده.  أدخل بادئة أو لاحقة.\n</li>\n<li>\nprefixOrSuffixString: أدخل سلسلة لاستخدامها كبادئة أو لاحقة لاسم المتغير الموجود. سيتم تخزين القيم المعاد ترميزها في هذه المتغيرات.\n</li>\n<li>\ndataSetNameOrIndex: اسم مجموعة البيانات/إطار البيانات\n</li>\n</ul>\nملاحظة: لن نقوم بتحويل من رقمي إلى عامل. عندما يتم إعادة ترميز رقم، سيبقى رقمًا، وعندما يتم إعادة ترميز متغير عامل سيبقى عاملًا.<br/>\n<b>الحزمة</b></br>\ncar</br>\n<b>المساعدة</b></br>\nاكتب السطر أدناه في محرر بناء الجملة R في BlueSky Statistics</br>\nhelp(recode, package=car)\n"
  }
}