{
  "title": "تحليل الموثوقية (ألفا كرونباخ)",
  "navigation": "ألفا كرونباخ",
  "tvarbox1": "جميع العناصر",
  "tvarbox2": "أدخل العناصر أعلاه التي تم عكس تسجيلها",
  "help": {
    "title": "ألفا كرونباخ",
    "r_help": "help(alpha, package=psych)",
    "body": "\n            <b>جدول إحصائيات الموثوقية يعطيك​</b></br>\n•\tألفا كرونباخ: ألفا كرونباخ α (القيم ≥ .7 أو .8 تشير إلى موثوقية جيدة؛ كلاين (1999))​<br/>\n•\tstd.alpha: الألفا المعيارية بناءً على الارتباطات​<br/>\n•\tلامبدا 6 لجوتمان (محسوبة من الارتباط المتعدد المربع أو 'smc')​​<br/>\n•\taverage_r: متوسط الارتباط بين العناصر (يستخدم لحساب std.alpha)​​<br/>\n•\tmean: متوسط المقياس (متوسط المتوسطات لجميع الأفراد)​​<br/>\n•\tsd: الانحراف المعياري للمقياس​​<br/></br>\n<b>تفسير الموثوقية إذا تم حذف عنصر​</b></br>\n•\tيشير إلى ألفا كرونباخ العامة عندما يتم حذف/حذف ذلك العنصر المحدد (في الصف)</br>\n•\tعندما تكون قيم ألفا كرونباخ الخام لأي صف أكبر من α العامة في جدول إحصائيات الموثوقية أعلاه، فهذا يعني أن حذف ذلك العنصر المحدد في الصف سيزيد من ألفا كرونباخ العامة للمقياس.​</br>\n•\tتشير الأعمدة الأخرى في هذا الجدول إلى كيفية تغيير الإحصائيات الأخرى إذا تم حذف/حذف ذلك العنصر المحدد.​</br>\n<b>كيف تفسر 'إحصائيات العناصر'؟​</b></br>\n•\traw.r: الارتباط لكل عنصر مع الدرجة الإجمالية، غير مصحح لتداخل العناصر.​</br>\n•\tr.drop: ارتباط العنصر مع الدرجة الإجمالية بدون ذلك العنصر نفسه (أي، ارتباط العنصر-rest أو ارتباط العنصر الإجمالي المصحح)؛ تشير الارتباطات المنخفضة بين العنصر والدرجة الإجمالية إلى أن العنصر لا يرتبط جيدًا بالمقياس بشكل عام​</br>\n•\tr.cor: ارتباط العنصر مع الدرجة الإجمالية مصحح لتداخل العناصر وموثوقية المقياس​</br>\n•\tmean و sd: متوسط و sd للمقياس إذا تم حذف ذلك العنصر​</br>\n•\tيجب أن ترتبط جميع العناصر مع الدرجة الإجمالية، لذا نحن نبحث عن العناصر التي لا ترتبط مع الدرجة الإجمالية من المقياس. إذا كانت قيم r.drop أقل من حوالي .3، فهذا يعني أن ذلك العنصر المحدد لا يرتبط جيدًا بالمقياس بشكل عام.​</br>​</br>\n<b>كيف تفسر جدول التكرار النهائي؟​​</b></br>\n•\tهذا الجدول يخبرنا عن النسبة المئوية للأشخاص الذين أعطوا كل استجابة لكل من العناصر (أي، إذا كان لديك مقياس من 5 نقاط، فإنه يخبرك عن النسبة المئوية للاستجابات التي كانت 1، 2، 3، 4، أو 5).​</br>\n•\tيساعدك هذا في التحقق من توزيع الاستجابات وما إذا كان الجميع يقدم نفس الاستجابات (مما سيؤدي إلى موثوقية منخفضة).​</br>\nإذا كان مقياسك يحتوي على عناصر تم عكس تسجيلها، تحتاج إلى تحديدها. يسمح لك حجة المفاتيح بذلك.</br> </br> \n\n<b>الوصف</b></br>\nابحث عن تقديرين للموثوقية: ألفا كرونباخ ولامبدا 6 لجوتمان.​\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nalpha(x, keys=NULL,cumulative=FALSE, title=NULL, max=10,na.rm = TRUE,​\n   check.keys=FALSE,n.iter=1,delete=TRUE,use=\"pairwise\",warnings=TRUE,n.obs=NULL)​\n</code> <br/>\n<b>الحجج</b><br/>\n<ul>\n<li>\nx​: إطار بيانات أو مصفوفة من البيانات، أو مصفوفة التباين أو الارتباط​\n</li>\n<li>\nkeys​: إذا كانت بعض العناصر يجب أن تكون معكوسة، فحدد إما اتجاه جميع العناصر أو مجرد متجه من العناصر التي يجب عكسها​\n</li>\n<li>\ntitle​: أي سلسلة نصية لتحديد هذه العملية​\n</li>\n<li>\ncumulative​: هل يجب أن تعكس المتوسطات مجموع العناصر أو متوسط العناصر. القيمة الافتراضية هي المتوسطات.​\n</li>\n<li>\nmax​: عدد الفئات/العناصر التي يجب أخذها في الاعتبار عند الإبلاغ عن تكرارات الفئات. الافتراضية هي 10، تمرر إلى link{response.frequencies}​\n</li>\n<li>\nna.rm​: الافتراضية هي إزالة القيم المفقودة والعثور على الارتباطات الزوجية​\n</li>\n<li>\ncheck.keys​: إذا كانت TRUE، ابحث عن المكون الرئيسي الأول وعكس العناصر ذات التحميلات السلبية. أعط تحذير إذا حدث ذلك.​\n</li>\n<li>\nn.iter​: عدد التكرارات إذا كانت فترات الثقة المعاد تشكيلها مطلوبة​\n</li>\n<li>\ndelete​: احذف العناصر التي ليس لها تباين وأصدر تحذيرًا​\n</li>\n<li>\nuse​: خيارات تمرر إلى وظيفة cor: \"everything\"، \"all.obs\"، \"complete.obs\"، \"na.or.complete\"، أو \"pairwise.complete.obs\". الافتراضية هي \"pairwise\"​\n</li>\n<li>\nwarnings​: بشكل افتراضي، اطبع تحذيرًا ورسالة تفيد بأنه تم عكس العناصر. قم بإسكات الرسالة إذا كانت warnings = FALSE​\n</li>\n<li>\nn.obs​: إذا كنت تستخدم مصفوفات الارتباط كمدخلات، من خلال تحديد عدد الملاحظات، يمكننا العثور على فترات الثقة​\n</li>\n</ul>\n<b>التفاصيل</b></br>\nألفا هي واحدة من عدة تقديرات لموثوقية الاتساق الداخلي لاختبار.​​</br>\n<b>القيمة</b><br/>\ntotal​: قائمة تحتوي على​​</br>\nraw_alpha​: ألفا بناءً على التباينات​​</br>\nstd.alpha​: الألفا المعيارية بناءً على الارتباطات​​</br>\nG6(smc)​: موثوقية لامبدا 6 لجوتمان​</br>\naverage_r​: متوسط الارتباط بين العناصر​​</br>\nmean​: بالنسبة لمصفوفات البيانات، متوسط المقياس الناتج عن جمع العناصر​​</br>\nsd​: بالنسبة لمصفوفات البيانات، الانحراف المعياري للدرجة الإجمالية​​</br>\nalpha.drop​: إطار بيانات يحتوي على كل ما سبق لحالة كل عنصر يتم إزالته واحدًا تلو الآخر.​​</br>\nitem.stats​: إطار بيانات يتضمن​​</br>\nالن​: عدد الحالات الكاملة للعنصر​​</br>\nraw.r​: الارتباط لكل عنصر مع الدرجة الإجمالية، غير مصحح لتداخل العناصر.​​</br>\nstd.r​: الارتباط لكل عنصر مع الدرجة الإجمالية (غير مصحح لتداخل العناصر) إذا كانت العناصر كلها موحدة​​</br>\nr.cor​: ارتباط العنصر الكلي مصحح لتداخل العناصر وموثوقية المقياس​​</br>\nr.drop​: ارتباط العنصر الكلي لهذا العنصر مقابل المقياس بدون هذا العنصر​​</br>\nmean​: بالنسبة لمصفوفات البيانات، متوسط كل عنصر​​</br>\nsd​: بالنسبة لمصفوفات البيانات، الانحراف المعياري لكل عنصر​​</br>\nresponse.freq​: بالنسبة لمصفوفات البيانات، تكرار كل استجابة عنصر (إذا كانت أقل من 20)​​</br>\nboot​: مصفوفة مكونة من 6 أعمدة بواسطة n.iter من القيم المعاد تشكيلها​​</br>\nUnidim​: مؤشر أحادية الأبعاد​​</br>\nFit​: ملاءمة المصفوفة غير القطرية​​</br>\n<b>الحزمة</b></br>\npsych</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذا الحوار أو قم بتشغيل الأمر التالي help(alpha, package=psych) عن طريق إنشاء كتلة كود R بالنقر على + في نافذة الإخراج\n\n\t\t\t"
  }
}