{
  "helpText": "يتطلب تحليل التباين ذو القياسات المتكررة أن تكون البيانات في تنسيق طويل. إذا لم تكن بياناتك في التنسيق الطويل، انظر إلى مجموعات البيانات > إعادة تشكيل > أطول",
  "modelname": "أدخل اسم النموذج",
  "title": "تحليل التباين ذو القياسات المتكررة",
  "subjectID": "المتغير المستخدم كمعرف للموضوع",
  "dependentVariable": "المتغير التابع",
  "navigation": "تحليل التباين، القياسات المتكررة، طويل",
  "response": "المتغيرات داخل الموضوع (المتغيرات) مثل الوقت",
  "Fixed": "عوامل بين الموضوعات",
  "covariates": "المتغيرات المشتركة",
  "Summary": "الوسائل الهامشية المقدرة",
  "Scatter_plot": "الاختبارات اللاحقة",
  "Residual": "مخطط المتبقيات مقابل القيم المتوقعة",
  "Histogram": "مخطط هيستوجرام للمتبقيات",
  "brownForsythe": "اختبار براون-فورسيث",
  "levenesTest": "اختبار ليفين",
  "plotMeansCI": "مخطط للوسائل وفواصل الثقة",
  "simpleEffectsTest": "اختبار التأثيرات البسيطة",
  "label2": "خيارات للاختبارات اللاحقة واختبار التأثيرات البسيطة",
  "combon": "مقارنة الوسائل باستخدام:",
  "adjust": "طريقة لتعديل قيم p",
  "displayBoxMDetails": "عرض التفاصيل المرتبطة باختبار Box's M (ملاحظة: يتم دائمًا عرض نتائج اختبار Box's M)",
  "help": {
    "title": "تحليل التباين ذو القياسات المتكررة",
    "r_help": "help(aov_ez , package='afex')",
    "body": "\n<b>الوصف</b></br>\nمع تحليل التباين ذو القياسات المتكررة، يتم حساب إحصائيات F لكل عامل داخل الموضوع، وعامل بين الموضوعات، وعبارة التفاعل لتحليل التباين المختلط</br>\nابحث عن جداول قيم ANOVA الإضافية في المخرجات التي تعرض MSE (متوسط مجموع المربعات للخطأ) و pes (الجزء المربع الجزئي)</br>\nندعم حاليًا عامل واحد داخل الموضوع وعامل واحد بين الموضوعات، والعامل بين الموضوعات اختياري.</br>\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"dependentVariable\", \n\tid = \"Identifier\", within = c(\"Time\"), \tbetween = c(\"Treatment\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\ndata: إطار بيانات يحتوي على البيانات. إلزامي\n</li>\n<li>\ndv: متجه حرفي (بطول 1) يشير إلى العمود الذي يحتوي على المتغير التابع في البيانات.\n</li>\n<li>\nbetween: متجه حرفي يشير إلى عوامل بين الموضوعات/الأعمدة في البيانات. الافتراضي هو NULL مما يعني عدم وجود عوامل بين الموضوعات.\n</li>\n<li>\nwithin: متجه حرفي يشير إلى عوامل داخل الموضوع/الأعمدة في البيانات. الافتراضي هو NULL مما يعني عدم وجود عوامل داخل الموضوعات.\n</li>\n<li>\ncovariate: متجه حرفي يشير إلى المتغيرات المشتركة بين الموضوعات (أي، الأعمدة) في البيانات. الافتراضي هو NULL مما يعني عدم وجود متغيرات مشتركة. يرجى ملاحظة أنه يجب تعيين factorize إلى FALSE في حالة كون المتغير المشترك عدديًا ويجب التعامل معه على هذا النحو.\n</li>\n<li>\nanovatable: قائمة من المعلمات الإضافية المرسلة إلى الدالة التي تنتج جدول ANOVA. \n</li>\n</ul>\n<br/>\n<b>التفاصيل</b></br>\nانظر المساعدة التفصيلية في R</br>\n<b>القيمة</b><br/>\naov_car، aov_4، و aov_ez هي أغلفة لـ Anova و aov، القيمة المرجعة تعتمد على وسيط الإرجاع. بشكل افتراضي، يتم إرجاع كائن S3 من فئة \"afex_aov\" يحتوي على الفتحات التالية:<br/>\n\"anova_table\": جدول ANOVA من فئة c(\"anova\", \"data.frame\").<br/>\n\"aov\": كائن aov تم إرجاعه من aov (لا ينبغي استخدامه لتقييم دلالة التأثيرات، ولكن يمكن تمريره إلى emmeans للاختبارات اللاحقة).<br/>\n\"Anova\": كائن تم إرجاعه من Anova، كائن من فئة \"Anova.mlm\" (إذا كانت عوامل داخل الموضوع موجودة) أو من فئة c(\"anova\", \"data.frame\").<br/>\n\"lm\": الكائن الذي تم ملاءمته باستخدام lm وتم تمريره إلى Anova (أي، كائن من فئة \"lm\" أو \"mlm\"). يتم إرجاعه أيضًا إذا كان return = \"lm\".<br/>\n\"data\": قائمة تحتوي على: (1) long (البيانات المحتملة المجمعة في تنسيق طويل المستخدمة لـ aov)، wide (البيانات المستخدمة لتناسب كائن lm)، و idata (إذا كانت عوامل داخل الموضوع موجودة، الوسيطة idata المرسلة إلى car::Anova). يتم إرجاعها أيضًا إذا كان return = \"data\".<br/>\n<b>الحزمة</b></br>\nafex</br>\n<b>المساعدة</b></br>\nhelp(aov_ez, package ='afex')\nانقر على زر مساعدة R للحصول على مساعدة R التفصيلية. يمكنك أيضًا إدخال help(aov_ez, package ='afex') والضغط على CTRL Enter في محرر صيغة R للحصول على المساعدة\n    "
  }
}