{
  "helpText": "يتطلب تحليل التباين المتكرر أن تكون البيانات في تنسيق طويل. إذا لم تكن بياناتك في التنسيق الطويل، انظر مجموعات البيانات > إعادة تشكيل > أطول",
  "repMeasuresConfig": "التكوين",
  "modelname": "أدخل اسم النموذج",
  "title": "تحليل التباين المتكرر - واسع",
  "subjectID": "حدد متغيرًا لاستخدامه كمعرف للموضوع (اختياري)",
  "dependentVariable": "المتغير التابع",
  "navigation": "تحليل التباين، التكرار، واسع",
  "response": "المتغيرات داخل الموضوع (المتغيرات) مثل الوقت",
  "Fixed": "عامل بين الموضوعات",
  "covariates": "المتغيرات المشتركة",
  "Summary": "الوسائل الهامشية المقدرة",
  "Scatter_plot": "الاختبارات اللاحقة",
  "Residual": "مخطط المتبقيات مقابل القيم المتوقعة",
  "Histogram": "مخطط هيستوجرام للمتبقيات",
  "brownForsythe": "اختبار براون-فورسيث",
  "levenesTest": "اختبار ليفين",
  "plotMeansCI": "مخطط الوسائل وفواصل الثقة",
  "simpleEffectsTest": "اختبار التأثيرات البسيطة",
  "label2": "خيارات للاختبارات اللاحقة واختبار التأثيرات البسيطة",
  "combon": "قارن الوسائل باستخدام:",
  "adjust": "طريقة لضبط قيم p",
  "displayBoxMDetails": "عرض التفاصيل المرتبطة باختبار Box's M (ملاحظة: يتم دائمًا عرض نتائج اختبار Box's M)",
  "help": {
    "title": "تحليل التباين المتكرر",
    "r_help": "help(aov_ez , package='afex')",
    "body": "\n<b>الوصف</b></br>\nملاحظة:<br/>\n1. نحتاج إلى إعادة تشكيل البيانات عند تشغيل تحليل التباين المتكرر على مجموعة بيانات واسعة<br/>\n2. ندعم قياسات متكررة متعددة لمتغير واحد مثل مستوى السكر في الدم المقاس في الاختبار المبدئي، الاختبار النهائي وزيارة المتابعة<br/>\n3. تحتاج إلى تحديد اسم عامل متكرر مثل مستوى السكر في الدم وعدد المستويات. سنقوم بإنشاء متغير عامل مثل مستوى السكر في الدم مع المستويات التي تم إنشاؤها من أسماء المتغيرات التي تحتوي على القياسات المتكررة مثل المستويات التي ستكون الاختبار المبدئي، الاختبار النهائي وزيارة المتابعة<br/>\n4. تحتاج إلى تحديد اسم قياس مثل القيمة. سنقوم بإنشاء متغير مثل القيمة مع جميع قيم مستوى السكر في الدم المقابلة للاختبار المبدئي، الاختبار النهائي وزيارة المتابعة لكل موضوع.<br/>\n5. ندعم متغير عامل واحد بين الموضوعات وداخل الموضوع.<br/>\n6. ستدعم الإصدارات المستقبلية قياسات متعددة بالإضافة إلى متغيرات عوامل متعددة بين الموضوعات وداخل الموضوع.<br/>\n7. بشكل افتراضي، كل صف من مجموعة البيانات يتوافق مع موضوع فريد، يمكنك أيضًا تحديد متغير لمعرف الموضوع.</br>\n<br/>\nمع تحليل التباين المتكرر، يتم حساب إحصائيات F لكل عامل داخل الموضوع، عامل بين الموضوع وتفاعل المصطلح لتحليل التباين المختلط</br>\nابحث عن جداول قيم ANOVA الإضافية في المخرجات التي تعرض MSE (متوسط مجموع المربعات للخطأ) وpes (الجزئي إيتا المربعة)</br>\nندعم حاليًا عامل واحد داخل الموضوع وعامل واحد بين الموضوع، عامل بين الموضوع اختياري.</br>\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"المتغير التابع\", \n\tid = \"المعرف\", within = c(\"الوقت\"), \tbetween = c(\"العلاج\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\ndata: إطار بيانات يحتوي على البيانات. إلزامي\n</li>\n<li>\ndv: متجه حرفي (بطول 1) يشير إلى العمود الذي يحتوي على المتغير التابع في البيانات.\n</li>\n<li>\nbetween: متجه حرفي يشير إلى عوامل/أعمدة بين الموضوعات في البيانات. الافتراضي هو NULL مما يعني عدم وجود عوامل بين الموضوعات.\n</li>\n<li>\nwithin: متجه حرفي يشير إلى عوامل/أعمدة داخل الموضوع (أو قياسات متكررة) في البيانات. الافتراضي هو NULL مما يعني عدم وجود عوامل داخل الموضوع.\n</li>\n<li>\ncovariate: متجه حرفي يشير إلى المتغيرات المشتركة بين الموضوعات (أي، الأعمدة) في البيانات. الافتراضي هو NULL مما يعني عدم وجود متغيرات مشتركة. يرجى ملاحظة أنه يجب تعيين factorize إلى FALSE في حالة كون المتغير المشترك عدديًا ويجب التعامل معه على هذا النحو.\n</li>\n<li>\nanovatable: قائمة من المعلمات الإضافية المرسلة إلى الدالة التي تنتج جدول ANOVA. \n</li>\n</ul>\n<br/>\n<b>التفاصيل</b></br>\nانظر المساعدة التفصيلية في R</br>\n<b>القيمة</b><br/>\naov_car، aov_4، وaov_ez هي أغلفة لـ Anova وaov، القيمة المرجعة تعتمد على معلمة الإرجاع. بشكل افتراضي، يتم إرجاع كائن S3 من فئة \"afex_aov\" يحتوي على الفتحات التالية:<br/>\n\"anova_table\": جدول ANOVA من فئة c(\"anova\", \"data.frame\").<br/>\n\"aov\": كائن aov تم إرجاعه من aov (لا ينبغي استخدامه لتقييم دلالة التأثيرات، ولكن يمكن تمريره إلى emmeans للاختبارات اللاحقة).<br/>\n\"Anova\": كائن تم إرجاعه من Anova، كائن من فئة \"Anova.mlm\" (إذا كانت عوامل داخل الموضوع موجودة) أو من فئة c(\"anova\", \"data.frame\").<br/>\n\"lm\": الكائن الذي تم ملاءمته باستخدام lm وتم تمريره إلى Anova (أي، كائن من فئة \"lm\" أو \"mlm\"). يتم إرجاعه أيضًا إذا كانت القيمة المرجعة = \"lm\".<br/>\n\"data\": قائمة تحتوي على: (1) طويل (البيانات المحتملة المجمعة في تنسيق طويل المستخدمة لـ aov)، واسع (البيانات المستخدمة لتناسب كائن lm)، وidata (إذا كانت عوامل داخل الموضوع موجودة، المعلمة idata المرسلة إلى car::Anova). يتم إرجاعها أيضًا إذا كانت القيمة المرجعة = \"data\".<br/>\n<b>الحزمة</b></br>\nafex</br>\n<b>المساعدة</b></br>\nhelp(aov_ez, package ='afex')\nانقر على زر مساعدة R للحصول على مساعدة R التفصيلية. يمكنك أيضًا إدخال help(aov_ez, package ='afex') والضغط على CTRL Enter في محرر بناء الجملة R للحصول على المساعدة\n    "
  }
}