{
  "title": "بناء نموذج مضبوط مع التحقق المتكرر باستخدام KFold",
  "navigation": "التحقق المتكرر باستخدام KFold",
  "modelname": "أدخل اسم النموذج المضبوط",
  "folds": "أدخل عدد الطيات",
  "levelOfInterest": "عندما تحتوي المتغيرات التي يجب التنبؤ بها على مستويين، حدد مستوى الاهتمام. يتم عرض مصفوفة الارتباك والإحصائيات ذات الصلة مع مستوى الاهتمام المحدد كمرجع",
  "repeats": "أدخل عدد التكرارات",
  "dependent": "المتغير الذي يجب التنبؤ به",
  "independent": "المتغيرات المستقلة",
  "label1": "بعض النماذج تعترض على القيم المفقودة أو المتغيرات التابعة التي هي عوامل. لمعالجة القيم المفقودة، انظر [ المتغيرات > القيم المفقودة ] ولتشفير المتغيرات العاملية، انظر [ المتغيرات > حساب > تشفير وهمي ]. انقر على أيقونة ؟ في الزاوية العلوية اليمنى من الحوار للحصول على التفاصيل.",
  "ModelSelection": "اختر فئة نموذج ثم نوع النموذج",
  "label2": "المعلمات",
  "help": {
    "title": "بناء نموذج مضبوط مع التحقق المتكرر باستخدام KFold",
    "r_help": "help(train, package=caret)",
    "body": "\n<b>الوصف</b></br>\nيستخدم التحقق المتكرر باستخدام KFold دالة trainControl و train ضمن حزمة caret لإنشاء نموذج مضبوط/محسن.<br/>\nيتم بناء نموذج مضبوط من خلال إعادة عينة النتائج عبر معلمات الضبط. يتم عرض نتائج الضبط أدناه الجداول في أسفل المخرجات<br/>\nبمجرد بناء النموذج المضبوط، نقوم بعمل تنبؤات باستخدام النموذج المضبوط ضد مجموعة البيانات التدريبية (المستخدمة لبناء النموذج) وعرض مصفوفة الارتباك والإحصائيات ذات الصلة.<br/>\nملاحظة: انظر الرابط في https://www.blueskystatistics.com/Articles.asp?ID=330 للحصول على تفاصيل حول النماذج التي تتطلب أن تكون المتغيرات التابعة مشفرة بشكل وهمي والمتطلبات المقابلة للمتغيرات التابعة المدعومة. أيضًا، بعض النماذج لا تدعم القيم المفقودة، إذا ظهرت أخطاء عند بناء النموذج، قم بإزالة القيم المفقودة.<br/>\nيتم تخزين النموذج المضبوط في كائن من فئة train باسم الذي حددته في مربع النص.<br/>\nتظهر قيم المعلمات المختارة للنموذج المضبوط النهائي في الأسفل في المخرجات.<br/>\nفي حالة وجود متنبئين بمستويين، لديك خيار تحديد مستوى المرجع/مستوى الاهتمام.<br/>\nيتم إنشاء مصفوفة الارتباك والإحصائيات ذات الصلة باستخدام مستوى الاهتمام المحدد.<br/>\n<code> \ntrain_control <- caret::trainControl(method=\"repeatedcv\", number=أدخل عدد الطيات، repeats=أدخل عدد التكرارات)<br/>\n#الصياغة العامة<br/>\ntunedModel <- caret::train(x = بيانات عشوائية لتدريب النموذج، y = المتغير التابع، trControl = train_control، method = \"النموذج الذي سيتم استخدامه\"، prob.model = TRUE )<br/>\n#صياغة نموذجية مملوءة<br/>\ntunedModel <- caret::train(as.data.frame(TrainData)، dependentVariable، trControl = train_control، method = \"adaboost\"، preProcess = NULL، prob.model = TRUE )<br/>\n</code>\nنقوم بإنشاء مصفوفة ارتباك وإحصائيات دقة للنموذج المضبوط. يتم ذلك كما يلي\n<ul>\n<li>\nنقوم بإنشاء قيم متنبأ بها من مجموعة البيانات التدريبية عن طريق استدعاء دالة predict على النموذج المحسن من فئة train (داخليًا، predict.train هي الدالة في حزمة caret التي تستدعيها R)<br/>\n<code> \npredictedValues = predict(n النموذج المضبوط الذي تم إرجاعه بواسطة دالة train)<br/>\n</code> <br/>\n</li>\n<li>\nنقوم بحساب إحصائيات الدقة من مصفوفة الارتباك التي تم إنشاؤها كما هو أدناه<br/>\n<code> \ncaret::confusionMatrix (predictions = predictedValues، reference = المتغير التابع للنموذج)<br/>\n</code> \n</li>\n</ul>\nيمكنك استخدام النموذج المضبوط/المحسن النهائي لتسجيل مجموعة بيانات. للقيام بذلك، اتبع الخطوات أدناه<br/>\n1.  انتقل إلى مجموعة البيانات التي تريد تسجيلها. ملاحظة: يجب أن تتطابق أسماء المتغيرات في مجموعة البيانات التي سيتم تسجيلها (المعروفة أيضًا باسم المتغيرات المستقلة) مع أسماء المتغيرات التي استخدمتها في مجموعة البيانات لإنشاء النموذج المضبوط في الأصل. إذا لم يكن الأمر كذلك، ستظهر رسالة خطأ. ستظهر رسالة الخطأ هذه تحت قسم الاختبارات التشخيصية في حوار تسجيل النموذج، انظر النقطة 2 أدناه. <br/>\n2.\tافتح حوار تسجيل النموذج تحت تقييم النموذج>تنبؤ>تسجيل النموذج. <br/>\n3.\tاختر نموذجًا تريد استخدامه لتسجيل مجموعة البيانات. يمكنك تصفية النماذج التي قمت بإنشائها حسب الفئة. <br/>\n4.\tبمجرد اختيار النموذج، حدد بادئة لاستخدامها لتخزين القيم المتنبأ بها. يمكنك اختيارياً حفظ فترات الثقة للتنبؤات وإنشاء مصفوفة ارتباك. يجب عليك تحديد بادئة للمتغير الذي يحتوي على التنبؤات/الدرجات. يتم تخزين التنبؤات والاحتمالات المتنبأ بها حيثما ينطبق ذلك كمتغيرات جديدة في نهاية مجموعة البيانات. على سبيل المثال، إذا كانت البادئة المحددة هي AA، يتم تخزين التنبؤات في متغير AA_original dependent variable name_Predictions، وتخزن الاحتمالات المتنبأ بها في متغير AA_Level1_PredictedProbs. <br/>\n5.  انقر على زر التشغيل لتسجيل مجموعة البيانات. <br/>\n<b>الحزمة</b></br>\ncaret</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذا الحوار أو قم بتشغيل الأمر التالي help(train, package ='caret') في نافذة محرر R\n"
  }
}