{
  "title": "إعادة تحليل البيانات على مجموعات بيانات مختلفة",
  "navigation": "إعادة تحليل",
  "helpText": "إعادة أو إنتاج التحليل في علامة التبويب الناتجة عن طريق تبديل مجموعة البيانات الأصلية مع مجموعة البيانات الجديدة.\nاتبع الخطوات أدناه.\n1. يجب أن تحتوي علامة التبويب الناتجة المحددة على التحليل لإعادة إنتاجه أو إعادة تشغيله.\n2. يجب أن تكون مجموعة البيانات الجديدة التي تريد تبديلها مفتوحة في جدول البيانات.\n3. حدد مجموعة البيانات الجديدة التي سيتم تبديلها مع الأصلية (من التحليل في علامة التبويب الناتجة النشطة)\n4. للقيام بذلك، حدد مجموعة البيانات الأصلية في القائمة الأولى ومجموعة البيانات الجديدة في القائمة الثانية وانقر على زر التحريك.\n5. كرر الخطوة 4 لتبديل مجموعات بيانات متعددة.\n6. اضغط على زر التنفيذ.\n",
  "allDatasets": "مجموعات البيانات للتبديل",
  "datasetsFromOutput_BSky": "مجموعات البيانات الأصلية",
  "mapping": "مجموعات البيانات المرسومة",
  "out": "أدخل اسم مجموعة البيانات المكدسة",
  "in1": "حدد مجموعتين أو أكثر من البيانات",
  "in2": "حدد مجموعة البيانات الثانية",
  "label1": "خيارات التكديس",
  "label2": "جميع الخيارات أدناه تتطلب مجموعتين من البيانات بنفس أسماء المتغيرات بالضبط",
  "bindrows": "ربط الصفوف (تكديس مجموعات البيانات كما هي، قد يؤدي إلى تكرار الصفوف)",
  "union": "الاتحاد (تكديس مجموعات البيانات وإزالة التكرارات الدقيقة)",
  "intersect": "التقاطع (احتفظ بالصفوف المشتركة بين مجموعتي البيانات)",
  "setdiff": "الفرق (احتفظ فقط بالصفوف في مجموعة البيانات الأولى ولكن ليس في الثانية)",
  "id": "إذا كنت ترغب في تتبع مجموعة البيانات التي جاء منها كل ملاحظة، حدد اسمًا لهذه المتغير هنا. ملاحظة: يتم إضافة المتغير الجديد إلى بداية مجموعة البيانات الناتجة.",
  "help": {
    "title": "تكديس مجموعات البيانات",
    "r_help": "help(bind_rows, package=dplyr)",
    "body": "\n            <b>الوصف</b></br>\nستساعدك هذه النافذة على تكديس مجموعتين أو أكثر من البيانات فوق بعضها البعض. يمكنك اختيار واحدة من الخيارات التالية.<br/>\n1. ربط الصفوف:  يكدس مجموعتين أو أكثر من البيانات تمامًا كما هي. إذا كان اسم المتغير شائعًا بين مجموعتي البيانات، ستملأ القيم كما تتوقع. إذا كانت مجموعة البيانات A تحتوي على متغير يسمى var1 غير موجود في مجموعة البيانات الأخرى B، ستظهر قيم NA في المتغير var1 لجميع الصفوف التي تتوافق مع مجموعة البيانات B.<br/>\nتعمل جميع الخيارات أدناه على مجموعتين فقط من البيانات وتتطلب أن تشترك كلا مجموعتي البيانات في نفس المتغيرات.<br/>\n2. الاتحاد: يكدس مجموعات البيانات ويزيل التكرارات<br/>\n3. التقاطع: يحتفظ بالصفوف المشتركة بين كلاهما<br/>\n4. الفرق: يحتفظ بالصفوف في مجموعة البيانات الأولى، وليس في الثانية<br/>\nاعتمادًا على الخيار المحدد، يتم استدعاء الدوال bind_rows و union و intersect و setdiff في حزمة dplyr.\nملاحظة: يمكنك تتبع مجموعة البيانات التي جاء منها الملاحظة الأصلية. يتم إضافة معرف مجموعة البيانات (الأولى/الثانية) إلى بداية مجموعة البيانات التي تحتوي على النتائج.<br/>\n<b>الحزمة</b></br>\ndplyr</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(bind_rows, package=\"dplyr\") في نافذة بناء جملة R\n            "
  }
}