{
  "toplabel": "بشكل افتراضي، سيتم استخدام جميع أعمدة مجموعة البيانات باستثناء العامل المتكرر المحدد ومتغيرات القيمة لتحديد كل ملاحظة. لتجاوز ذلك، انظر أدناه",
  "id_cols": "اختياري: بشكل افتراضي، سيتم استخدام جميع أعمدة مجموعة البيانات باستثناء العامل المتكرر المحدد ومتغيرات القيمة لتحديد كل ملاحظة. لتجاوز ذلك، اختر وانقل المتغيرات",
  "title": "إعادة تشكيل، من طويل إلى عريض",
  "navigation": "أوسع",
  "labelTop": "عندما يتم تحديد عامل متكرر واحد ومتغير قيمة، يتم إضافة أسماء المتغيرات الجديدة مسبوقة باسم العامل المتكرر. في جميع الحالات الأخرى، يتم إضافتها مسبوقة باسم متغير القيمة",
  "label0": "يمكنك اختيار حفظ النتائج في مجموعة بيانات جديدة أو الكتابة فوق مجموعة البيانات الحالية",
  "label1": "خيارات",
  "New": "حفظ النتائج في مجموعة بيانات جديدة",
  "newdatasetname": "أدخل اسم مجموعة البيانات",
  "Existing": "الكتابة فوق مجموعة البيانات الحالية",
  "subsetvars": "أدخل اسم (أسماء) المتغيرات للعوامل المتكررة، على سبيل المثال: الوقت",
  "dontReshape": "أدخل اسم (أسماء) المتغيرات للقيم المتكررة، على سبيل المثال: العد",
  "names_sort": "ترتيب أسماء الأعمدة أبجديًا",
  "appearence_sort": "ترتيب أسماء الأعمدة حسب الظهور",
  "names_sep": "فاصل اختياري للاستخدام عند دمج أسماء المتغيرات المحددة لتشكيل أسماء متغيرات جديدة",
  "label2": "خيارات الفرز",
  "help": {
    "title": "إعادة تشكيل (من طويل إلى عريض)",
    "r_help": "help(pivot_wider, package=tidyr)",
    "body": "\n           <b>الوصف</b></br>\nشاهد الفيديو على <a href=\"https://youtu.be/ypLXqmFp3jY\">إعادة تشكيل من طويل إلى عريض</a></br>\nتأخذ مجموعة بيانات عريضة وتحولها إلى مجموعة بيانات طويلة عن طريق تحويل (توسيع) الأعمدة. تقوم دالة pivot_wider \"بإطالة\" البيانات، مما يزيد من عدد الصفوف ويقلل من عدد الأعمدة. تستخدم دالة pivot_wider عندما يكون لديك متغيرات/أعمدة تحتاج قيمها إلى أن تكون في صفوف. \n<br/>\nملاحظة: عندما يتم تحديد عامل متكرر واحد، يتم إضافة أسماء المتغيرات الجديدة مسبوقة باسم العامل المتكرر. عندما يتم تحديد عوامل متكررة متعددة، يتم إضافتها مسبوقة باسم متغير القيمة</br>\n<b>الاستخدام</b>\n<br/>\n<code> \ndataset %>% \n\tpivot_wider(names_from =name, values_from=value, names_sort= TRUE)\n</code> <br/>\n<b>المعلمات</b><br/>\n<ul>\n<li>\ndataset: إطار بيانات/تيبل\n</li>\n<li>\nnames_from: اسم العمود الناتج \n</li>\n<li>\nvalues_from: العمود للحصول على قيم الخلايا منه \n</li>\n<li>\nnames_sort: هل يجب فرز أسماء الأعمدة؟ إذا كان FALSE، وهو الافتراضي، يتم ترتيب أسماء الأعمدة حسب الظهور الأول.\n</li>\n<li>\nnames_sep: فاصل اختياري للاستخدام عند دمج أسماء المتغيرات المحددة لتشكيل أسماء متغيرات جديدة\n</li>\n<li>\n<b>القيمة</b><br/>\nترجع مجموعة البيانات المعاد تشكيلها\n<br/>\n<b>الحزمة</b></br>\ntidyr\n<b>المساعدة</b></br>\nhelp(pivot_wider)\n"
  }
}