{
  "title": "مطابقة مجموعة المخاطر",
  "navigation": "مطابقة مجموعة المخاطر",
  "newdatasetnamelabel": "اسم مجموعة البيانات لتخزين البيانات المطابقة",
  "groupvarlabel": "متغير الحدث (1=حدث، 0=توقف)",
  "timevarlabel": "متغير الوقت",
  "calipervarslabel": "متغيرات المطابقة (رقمية)",
  "caliperslabel": "حدد حدود المطابقة بترتيب المتغيرات المفصولة بفواصل، مثل 5، 2؛ حدد 0 للمطابقات الدقيقة",
  "ratiolabel": "عدد الضوابط لكل حالة",
  "repeatcontrolslabel": "السماح بتطابق الضوابط أكثر من مرة",
  "supercontrolslabel": "لا تسمح بتطابق الحالات مع حالات أخرى",
  "help": {
    "title": "مطابقة مجموعة المخاطر",
    "body": "\n            تقوم بمطابقة موضوع مجموعة المخاطر داخل مجموعة. يتم مطابقة أولئك الذين لديهم حدث النتيجة (الحالات) مع أولئك الذين لم يحدث لهم الحدث (الضوابط) والذين هم في مجموعة المخاطر في وقت حدث الحالة. هذا تصميم حالة/تحكم متداخل. يتم أيضًا استخدام المتغيرات الأساسية المعروفة عند دخول المجموعة لمطابقة الحالات والضوابط.\n\t\t\t<br/><br/>\n\t\t\tتدعم المتغيرات الأساسية التي يجب أن تتطابق قيمها بدقة والقيم التي تتطابق ضمن حدود رقمية. يتم اختيار الضوابط عشوائيًا من بين جميع الضوابط المؤهلة لكل حالة.\n\t\t\t<br/><br/>\n\t\t\tستحتوي مجموعة البيانات الناتجة التي تحتوي على البيانات المطابقة على المتغيرات الأصلية، ومؤشر الحدث (\"فشل\")، ومتغير يحدد مجموعة المطابقة (\"match.num\").\n\t\t\t<br/><br/>\n\t\t\tيتم إزالة الملاحظات التي تحتوي على أي قيم مفقودة للمتغيرات المعنية في عملية المطابقة قبل المطابقة.\n\t\t\t<br/><br/>\n\t\t\tيمكن العثور على مقدمة موجزة لتصاميم الحالة/التحكم المتداخلة في:\n\t\t\tEssebag V ، وآخرون. دراسة الحالة/التحكم المتداخلة في أمراض القلب. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>اسم مجموعة البيانات لتخزين البيانات المطابقة:</b>\n\t\t\t<br/>اسم مجموعة البيانات الناتجة التي تحتوي على مجموعات الموضوعات المطابقة.\n\t\t\t<br/><br/>\n\t\t\t<b>متغير الحدث (1=حدث، 0=توقف):</b>\n\t\t\t<br/>اسم المتغير الذي يشير إلى أولئك الذين لديهم أحداث. يجب أن يكون رقميًا مع 1=حدث و0=توقف.\n\t\t\t</br><br/>\n\t\t\t<b>متغيرات المطابقة:</b>\n\t\t\t<br/>حدد المتغيرات الأساسية التي تريد أن تتطابق مجموعات الحالة/التحكم عليها. يجب أن تكون هذه المتغيرات رقمية.\n\t\t\t<br/><br/>\n\t\t\t<b>حدد حدود المطابقة بترتيب المتغيرات المفصولة بفواصل:</b>\n\t\t\t<br/>حدد قيم حدود رقمية لكل من المتغيرات، بترتيب المتغيرات. يجب أن تستخدم المطابقات الدقيقة حدًا قدره 0. \n\t\t\tعلى سبيل المثال، إذا تم تحديد العمر (بالسنوات) بحد قدره 5، فهذا يعني أن الضوابط يجب أن تكون ضمن +/- 5 سنوات من الحالة المطابقة لها.\n\t\t\tيجب أن يكون لكل متغير مطابقة قيمة حد محددة.\n\t\t\t<br/><br/>\n\t\t\t<b>عدد الضوابط لكل حالة:</b>\n\t\t\t<br/>هذا هو الحد الأقصى لعدد الضوابط التي سيتم مطابقتها مع كل حالة. قد تحتوي بعض مجموعات المطابقة على أقل من هذه القيمة إذا لم يمكن تحديد مطابقة مناسبة.\n            <br/><br/>\n\t\t\t<b>السماح بتطابق الضوابط أكثر من مرة:</b>\n\t\t\t<br/>حدد ما إذا كنت تريد أن يتم مطابقة الضوابط مع أكثر من حالة واحدة. نوصي باختيار هذا الخيار لتجنب التحيز.\n            <br/><br/>\n\t\t\t<b>لا تسمح بتطابق الحالات مع حالات أخرى:</b>\n\t\t\t<br/>حدد ما إذا كنت تريد السماح للحالات بأن تعتبر كضوابط قبل وقت حدث الحالة. نوصي بعدم اختيار هذا الخيار لتجنب التحيز. عدم اختيار هذا الخيار يعني أن الحالة في مجموعة مخاطر الضوابط، ومؤهلة لتطابق مع حالة أخرى، حتى وقت حدثها.\n            <br/><br/>\n            <b>حزم R المطلوبة:</b> dplyr، tidyr\n"
  }
}