{
  "title": "كشف القيم الشاذة بطريقة ROUT",
  "navigation": "اختبار القيم الشاذة ROUT",
  "variableListSelcted": "اختر متغيرًا أو أكثر",
  "adjPvalue": "تعديل قيم p من مقارنة المتوسطات",
  "FDR_Q": "حدد الحد الأقصى لمعدل الاكتشافات الكاذبة (FDR) المطلوب (الافتراضي 1%)",
  "plotShowOutliersChk": "رسم لإظهار جميع النقاط بما في ذلك القيم الشاذة، إن وجدت",
  "showOnlyOuliersInSummaryTableChk": "عرض جدول ملخص التحليل مع القيم الشاذة فقط، إن وجدت",
  "showAllPointsInSummaryTableChk": "عرض جدول ملخص التحليل مع جميع النقاط",
  "help": {
    "title": "طريقة ROUT (الانحدار المتين) لكشف القيم الشاذة",
    "r_help": "help(rlm, package = MASS)",
    "body": "<b>الوصف</b><br>ROUT (الانحدار المتين وإزالة القيم الشاذة) هي طريقة قوية وحديثة لاكتشاف واحدة أو أكثر من القيم الشاذة. تم تطويرها أصلاً للانحدار غير الخطي، ويمكن تكييفها للاستخدام العام، بما في ذلك تحديد القيم الشاذة في متغير (عمود بيانات في مجموعة البيانات).<br><br>يجمع ROUT بين فكرتين قويتين:<br>توفيق نموذج متين يقلل من تأثير القيم الشاذة المحتملة أثناء تقدير الاتجاهات المركزية.<br>معدل الاكتشافات الكاذبة (FDR) — طريقة تحكم إحصائية تحدد عدد القيم الشاذة المكتشفة التي قد تكون إيجابيات كاذبة.<br><br>طرق تعديل قيمة p:<br>تشمل تصحيحات بونفيروني (bonferroni) حيث تُضرب قيم p بعدد المقارنات، بالإضافة إلى تصحيحات أقل تحفظًا مثل هولم (holm)، هوشبرغ (hochberg)، هوميل (hommel)، وبينجاميني وهوشبرغ (BH أو fdr)، وبينجاميني ويكوتيلي (BY)، بالإضافة إلى خيار عدم التعديل (none).<br><br>تكتسب الطرق الأولى تحكمًا قويًا في معدل الخطأ العائلي. طرق هوشبرغ وهوميل صالحة عندما تكون الفرضيات مستقلة أو مرتبطة ارتباطًا غير سلبي.<br><br>طرق BH و BY تتحكم في معدل الاكتشافات الكاذبة، وهي أقل صرامة من معدل الخطأ العائلي.<br><br>تكتشف القيم الشاذة في متغير (قيم Y فقط، لا حاجة لـ X).<br><br>خطوات التحليل الداخلية:<br>تعيين قيم X وهمية: 1, 2, ..., n<br>توفيق نموذج: Y = M (متوسط ثابت) باستخدام الانحدار المتين (rlm من حزمة MASS)<br>حساب البواقي من التوفيق المتين<br>استخدام البواقي المُدرّسة<br>تطبيق تصحيح معدل الاكتشافات الكاذبة مع Q محدد من المستخدم (الافتراضي 1%)<br>تحديد القيم الشاذة حيث قيمة p المعدلة أقل من Q/100<br><br>لمزيد من التفاصيل:<br>help(rlm, package = MASS)<br>help(psi.huber, package = MASS)<br>help(p.adjust, package = stats)"
  }
}
