{
  "title": "حفظ النماذج في ملف",
  "navigation": "حفظ النماذج",
  "filterModels": "تصفية النماذج حسب الفئة",
  "modelSelection": "اختر نموذجًا (نماذج) للحفظ",
  "importResp": "اختر ملفًا لحفظ نموذج فيه",
  "label1": "ملاحظة: سيتم حفظ النموذج في ملف في المسار المحدد أدناه فقط عند تنفيذ الحوار.",
  "levelOfInterest": "عندما تحتوي المتغيرات التي يجب التنبؤ بها على مستويين، حدد مستوى الاهتمام. سيتم عرض مصفوفة الالتباس والإحصائيات ذات الصلة مع مستوى الاهتمام المحدد كمرجع",
  "label12": "نتائج الاختبار: بمجرد اختيار نموذج، سنقوم بإجراء اختبارات لمعرفة ما إذا كانت المتغيرات التابعة المحددة في النموذج متاحة في مجموعة البيانات التي سيتم تقييمها. ستظهر النتائج هنا",
  "label2": "احفظ القيم المتوقعة والإحصائيات الداعمة.",
  "label3": "يتم تخزين التنبؤات والاحتمالات المتوقعة حيثما كان ذلك مناسبًا في مجموعة البيانات التي يتم تقييمها كمتغيرات جديدة مع البادئة أدناه",
  "label4": "**بالنسبة للمتغيرات التابعة ذات المستويين، يتم اعتبار المستوى الثاني كمستوى إيجابي. راجع البيانات > مستويات العوامل > إعادة ترتيب المستويات يدويًا لتغيير ترتيب مستويات العوامل وإعادة بناء النموذج.",
  "conflevel": "احفظ فترات الثقة للقيم المتوقعة الفردية **(صالحة فقط للنماذج الخطية (فئة lm))",
  "roctable": "عرض جدول ROC (**للمتغيرات التابعة الثنائية فقط)",
  "colname": "حدد بادئة اسم العمود",
  "label5": "**التحقق من المربع أعلاه سيؤدي إلى عقوبة أداء لمجموعات البيانات الكبيرة.",
  "level": "حدد مستوى الثقة",
  "confusioncheck": "توليد مصفوفة الالتباس",
  "help": {
    "title": "حفظ النماذج",
    "r_help": "help(save, package='base')",
    "body": "\n    <b>الوصف</b></br>\n    سيتم حفظ النماذج المحددة في ملف بتنسيق بيانات R (.RData extension)</br>\n    يمكنك تحديد ملف جديد عن طريق إدخال اسم أو اختيار ملف موجود</br>\n    إذا اخترت ملفًا موجودًا، سيتم الكتابة فوقه.</br>\n    يجب عليك النقر على زر التنفيذ (زر مثلث أفقي) لتشغيل الحوار وحفظ الكائنات في ملف. \n    <br/>\n    <b>الاستخدام</b>\n    <br/>\n    <code> \n    save(model1, model2.., file =\"path of the file\")\n    </code> <br/>\n    <b>المعلمات</b><br/>\n    <ul>\n    <li>\n    model1, model2...: كائنات نموذجية ملائمة\n    </li>\n    <li>\n    file: اسم الملف مع المسار، سيتم حفظ كائنات النموذج المحددة في هذا الملف RData\n    </li>\n    </ul>\n    <b>الحزمة</b></br>\n    base</br>\n    <b>المساعدة</b></br>\n    للحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العليا اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(save, package = 'base') في نافذة محرر R\n    </br>\n    "
  }
}