{
  "title": "احتمالات البقاء المتوقعة المعلمية",
  "label100": "تقوم هذه النافذة بإخراج احتمالية البقاء المتوقعة في وقت أو أكثر محدد. يجب أن تتوفر المتطلبات التالية. 1. يجب أن تكون قد أنشأت نموذج انحدار بقاء معلمي باستخدام flexsurvreg على مجموعة بيانات حيث القيمة 1 أو أعلى = حدث، القيمة 0 أو أقل = قيد الإلغاء. 2. يجب أن تحتوي مجموعة البيانات التي تريد توليد التوقعات لها على جميع المتغيرات المستقلة المستخدمة لإنشاء النموذج الأصلي. 3. يجب أن تتطابق وحدة القياس المستخدمة للوقت مع وحدة القياس المستخدمة لإنشاء النموذج الأصلي. 4. إذا كنت تريد توقعات لملاحظة واحدة، تحتاج إلى إنشاء مجموعة بيانات جديدة تحتوي على تلك الملاحظة الواحدة.",
  "navigation": "تقييم البقاء المعلمي",
  "filterModels": "تصفية النماذج حسب الفئة",
  "modelSelection": "اختر نموذجًا لتقييم مجموعة بيانات",
  "label1": "اختبارات تشخيصية",
  "followUpTime": "حدد وقتًا أو أكثر مثل 200، 1200، 1250، سيتم توليد احتمالات البقاء والفشل لكل وقت",
  "levelOfInterest": "عندما يحتوي المتغير المراد توقعه على مستويين، حدد مستوى الاهتمام. يتم عرض مصفوفة الارتباك والإحصائيات ذات الصلة مع مستوى الاهتمام المحدد كمرجع",
  "label12": "نتائج الاختبار: بمجرد اختيار نموذج، سنقوم بإجراء اختبارات لمعرفة ما إذا كانت المتغيرات التابعة المحددة في النموذج متاحة في مجموعة البيانات التي سيتم تقييمها. ستظهر النتائج هنا",
  "label2": "احفظ احتمالات البقاء والفشل.",
  "label3": "يتم تخزين الاحتمالات المتوقعة كمتغيرات جديدة (مع بادئة إذا تم تحديدها)",
  "label4": "**بالنسبة للمتغيرات التابعة ذات المستويين، يتم اعتبار المستوى الثاني كمستوى إيجابي. راجع البيانات > مستويات العوامل > إعادة ترتيب المستويات يدويًا لتغيير ترتيب مستويات العوامل وإعادة بناء النموذج.",
  "conflevel": "احفظ فترات الثقة للقيم المتوقعة الفردية **(صالح فقط للنماذج الخطية (فئة lm))",
  "roctable": "عرض جدول ROC (**للمتغيرات التابعة الثنائية فقط)",
  "colname": "حدد بادئة اسم العمود",
  "label5": "**التحقق من المربع أعلاه سيؤدي إلى عقوبة أداء لمجموعات البيانات الكبيرة.",
  "level": "حدد مستوى الثقة",
  "confusioncheck": "توليد مصفوفة الارتباك",
  "help": {
    "title": "تقييم مجموعة بيانات باستخدام نموذج flexsurvreg (البقاء المعلمي)",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n    عند تحديد فترات زمنية متعددة، يتم إنشاء مصفوفة ارتباك ومنحنى ROC للفترة الزمنية الأولى فقط\n    <b>الوصف</b></br>\n    يقوم تقييم النموذج بما يلي</br>\n    1. تقييم مجموعة البيانات الحالية باستخدام النموذج المحدد مسبقًا. يخزن التوقعات مع فترة الثقة المحددة في مجموعة البيانات الحالية باستخدام البادئة المحددة.</br>\n    2. ينشئ اختياريًا مصفوفة ارتباك ومنحنى ROC</br>\n    3. في حالة تقييم مجموعة بيانات تدريبية تحتوي على المتغير التابع/المتغير المراد توقعه وكان المتغير التابع له مستويين، لديك الخيار لاختيار مستوى المرجع/مستوى الاهتمام.<br/>\n    4. يتم إنشاء مصفوفة الارتباك والإحصائيات ذات الصلة باستخدام مستوى الاهتمام المحدد.<br/>\n    راجع التفاصيل حول وظيفة التوقع ومصفوفة الارتباك أدناه\n    <br/>\n    <br/>\n    <b>الوصف</b></br>\n    predict هي وظيفة عامة لإجراء التوقعات باستخدام النموذج المحدد. \n    <br/>\n    <b>الاستخدام</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>المعلمات</b><br/>\n    <ul>\n    <li>\n    modelname: كائن نموذج ترغب في الحصول على توقعات له.\n    </li>\n    <li>\n    prefix: سلسلة بادئة سيتم استخدامها لإنشاء متغيرات جديدة تحتوي على التوقعات.\n    </li>\n    <li>\n    datasetname: هي مجموعة البيانات الحالية للتقييم وحفظ التوقعات إليها.\n    </li>\n    </ul>\n    <b>التفاصيل</b></br>\n    يخزن التوقعات مع فترة الثقة المحددة في مجموعة البيانات الحالية باستخدام البادئة المحددة.</br>\n    <b>الحزمة</b></br>\n    stats</br>\n    <b>المساعدة</b></br>\n    للحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(predict, package ='stats') في نافذة محرر R\n    </br>\n    </br>\n    <b>الوصف</b></br>\n    ينشئ مصفوفة ارتباك عن طريق جدول تقاطع الفئات الملاحظة والمتوقعة مع الإحصائيات المرتبطة. \n    <br/>\n    <b>الاستخدام</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>المعلمات</b><br/>\n    <ul>\n    <li>\n    modelname : كائن نموذج ترغب في الحصول على مصفوفة ارتباك له.\n    </li>\n    <li>\n    showCofusionMatrix:  منطقي، إذا كان TRUE يتم إنشاء مصفوفة الارتباك (إذا كان ذلك ينطبق)، إذا كان FALSE، لا يتم إنشاء مصفوفة الارتباك.\n    </li>\n    <li>\n    predictions : كائن يتم إرجاعه كنتيجة لاستدعاء predict().\n    </li>\n    <li>\n    datasetname: هي اسم مجموعة البيانات الحالية التي نريد إجراء التوقعات باستخدامها.\n    </li>\n    </ul>\n    <b>التفاصيل</b></br>\n    يعرض مصفوفة الارتباك باستخدام وظيفة confusionMatrix في حزمة caret</br>\n    <b>الحزمة</b></br>\n    caret</br>\n    <b>المساعدة</b></br>\n    للحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(confusionMatrix, package ='caret') في نافذة محرر R\n                "
  }
}