{
  "title": "نموذج راش البسيط",
  "navigation": "نموذج راش البسيط",
  "modelname": "أدخل اسم النموذج",
  "destinationvars": "متغير(ات) الوجهة",
  "estimationlbl": "التقدير",
  "rad1": "استخدم تقدير CML",
  "chk1": "احسب الخطأ المعياري الموحد",
  "chk2": "قم بتطبيع المعلمات لتكون مجموعها (0)",
  "rad2": "استخدم تقدير MML",
  "help": {
    "title": "نموذج راش البسيط",
    "r_help": "help(RM, package='eRm')",
    "body": "\n            <b>الوصف</b>\n            <br/>\n            ينشئ نموذج راش البسيط باستخدام تقدير CML أو MML.\n            <br/><br/>\n            لتقدير CML، نقوم باستدعاء eRm::RM لحساب تقديرات المعلمات لنموذج راش لاستجابات العناصر الثنائية باستخدام تقدير CML.\n            <br/><br/>\n            لتقدير MML، نقوم باستدعاء TAM::tam.mml لتوليد تقديرات المعلمات لنموذج أحادي الأبعاد \n            <br/><br/>\n            <b>الاستخدام لتقدير CML</b>\n            <br/>\n            <code>\n            eRm::RM(X, se = TRUE, sum0 = TRUE, etaStart) \n            </code>\n            <br/><br/>\n            <b>المعلمات</b>\n            <br/>          \n            <ul>\n            <li>\n            X:  مصفوفة بيانات 0/1 أو إطار بيانات؛ تمثل الصفوف الأفراد، وتمثل الأعمدة العناصر. يتم إدراج القيم المفقودة كـ NA.\n            </li>\n            <li>\n            W:  مصفوفة التصميم لنموذج راش. إذا تم حذفها، ستقوم الدالة بحساب W تلقائيًا.\n            </li>\n            <li>\n            se: إذا كانت TRUE، يتم حساب الأخطاء المعيارية.\n            </li>\n            <li>\n            sum0: إذا كانت TRUE، يتم تطبيع المعلمات لتكون مجموعها 0 عن طريق تحديد W مناسب. إذا كانت FALSE، يتم تقييد المعلمة الأولى إلى 0.\n            </li>\n            <li>\n            etaStart: يمكن تحديد متجه من القيم الابتدائية لمعلمات eta. إذا كانت مفقودة، يتم استخدام المتجه 0.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>الاستخدام لتقدير MML</b>\n            <br/>\n            <code>\n            tam.mml(resp,verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>المعلمات</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: إطار بيانات مع استجابات عناصر متعددة الخيارات k=0,...,K. يجب إعلان الاستجابات المفقودة كـ NA.\n            </li>\n            <li>\n            irtmodel: لنحدود من انحدارات العناصر الثابتة (في tam.mml) تشمل الخيارات PCM (نموذج الائتمان الجزئي)، PCM2 (نموذج الائتمان الجزئي مع برمجة ConQuest 'item+item*step') وRSM (نموذج مقياس التقييم؛ برمجة ConQuest 'item+step'). \n            <br/>\n            بالنسبة لانحدارات العناصر المقدرة (متاحة فقط في tam.mml.2pl) الخيارات هي 2PL (يتم تقدير جميع انحدارات فئات العناصر؛ نموذج استجابة العنصر الاسمي)، GPCM (نموذج الائتمان الجزئي المعمم حيث يحصل كل عنصر على معلمة انحدار واحدة فقط لكل بعد) و2PL.groups (تحصل مجموعات العناصر على نفس تقديرات انحدار العناصر) ومصفوفة تصميم E على انحدارات العناصر في نموذج الائتمان الجزئي المعمم (GPCM.design، انظر الأمثلة). لاحظ أنه لا يمكن تقدير انحدارات العناصر مع التصاميم المتعددة باستخدام الدالة tam.mml.mfr. ومع ذلك، من السهل استخدام مصفوفات التصميم المحددة مسبقًا وتطبيق بعض القيود على tam.mml.2pl\n            </li>\n            <li>\n            verbose: منطقي يشير إلى ما إذا كان يجب طباعة المخرجات أثناء التكرارات. \n            </li>\n            </ul>\n            <br/><br/>\n            <b>الحزم</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>            \n            <b>المساعدة</b>\n            <br/>\n            help(RM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
  }
}