{
  "title": "تقسيم/تجميع مجموعة بيانات مع مجموعة متكررة من المتغيرات",
  "navigation": "مجموعات المتغيرات المتكررة",
  "removeColsWithConstantChk": "إزالة جميع الأعمدة ذات القيم الثابتة (غير حساسة لحالة الأحرف) قبل تقسيم أو تجميع",
  "removeRowsWithNAsChk": "احتفظ فقط بالحالات الكاملة أي إزالة الصف بالكامل مع أي قيم فارغة أو NA في مجموعة البيانات الناتجة",
  "resultDatasetNameSuffix": "(اختياري) سلسلة واحدة أو أكثر (مفصولة بفواصل) لاستخدامها كلاحقة لأسماء مجموعة البيانات الناتجة",
  "splitDatasetRad": "تقسيم مجموعة البيانات إلى مجموعات بيانات متعددة بناءً على مجموعة المتغيرات المتكررة",
  "autoDetectColGroupLengthRad": "الكشف تلقائيًا عن مجموعة المتغيرات المتكررة للتقسيم أو التجميع",
  "manualColGroupLengthRad": "تحديد طول مجموعة المتغيرات المتكررة التي سيتم استخدامها للتقسيم أو التجميع",
  "manualRepeatingColumnGroupLength": "طول مجموعة المتغيرات المتكررة",
  "outputColumnNames": "(اختياري) قائمة بأسماء المتغيرات (مفصولة بفواصل) لاستخدامها لمجموعة البيانات الناتجة",
  "collapseDatasetRad": "تجميع لإنشاء مجموعة بيانات طويلة واحدة بدلاً من تقسيمها إلى مجموعات بيانات متعددة",
  "collapseGpIDPrefix": "بادئة لقيم معرف المجموعة",
  "collapseGpIDColName": "اسم متغير معرف المجموعة (سيتم إنشاء متغير جديد في مجموعة البيانات الناتجة)",
  "collapseGpIDColFirstChk": "اجعل متغير معرف المجموعة هو العمود الأول (قم بإلغاء تحديده ليكون العمود الأخير)",
  "makeCollapseGpIDColFactorChk": "اجعل متغير معرف المجموعة عامل",
  "label1": "كشف مجموعة المتغيرات المتكررة",
  "label2": "تقسيم أو تجميع مجموعة البيانات؟",
  "help": {
    "title": "تقسيم/تجميع مجموعة بيانات مع مجموعة متكررة من المتغيرات",
    "r_help": "",
    "body": "\n            <b>الوصف</b></br>\n            يتم استخدام هذه النافذة لتقسيم (إلى مجموعات بيانات متعددة) أو تجميع (إلى مجموعة بيانات طويلة واحدة) مجموعة بيانات تحتوي على مجموعة متكررة من المتغيرات\n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tمثال 1: لتجربة ذلك، يمكنك استخدام ملف مجموعة البيانات النموذجية المسمى Repeating Variable Sets.xlsx\n\t\t\t<br/>\n\t\t\tافتح الملف في شبكة البيانات باستخدام قائمة فتح الملف\n\t\t\t<br/>\n\t\t\tفي النافذة - اكتب\n\t\t\t<br/>\n\t\t\tسيتم إنشاء ثلاث مجموعات بيانات حيث توجد ثلاث مجموعات متكررة من المتغيرات. يمكنك كتابة لا شيء، أو واحد، أو أكثر\n\t\t\tسلاسل لأسماء مجموعة البيانات الناتجة كـ abcX، abcY، abcZ\n\t\t\t<br/>\n\t\t\tاحتفظ بكل عنصر آخر في النافذة كافتراضي  \n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tمثال 2: لتجربة ذلك، يمكنك استخدام ملف مجموعة البيانات النموذجية المسمى Repeating Variable Sets2.xlsx\n\t\t\t<br/>\n\t\t\tافتح الملف في شبكة البيانات باستخدام قائمة فتح الملف\n\t\t\t<br/>\n\t\t\tفي النافذة - اكتب\n\t\t\t<br/>\n\t\t\tسيتم إنشاء أربع مجموعات بيانات حيث توجد أربع مجموعات متكررة من المتغيرات\n\t\t\t<br/>\n\t\t\tاحتفظ بكل عنصر في النافذة كافتراضي \n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tيمكنك استخدام نفس ملفي مجموعة البيانات النموذجية لتجربة خيار التجميع في قسم \"تقسيم أو تجميع مجموعة البيانات؟\" في النافذة لإنشاء مجموعة بيانات ناتجة واحدة\n\t\t\t<br/>\n\t\t\t<br/>\n"
  }
}