{
  "title": "تكديس مجموعات البيانات",
  "navigation": "تكديس",
  "out": "أدخل اسم مجموعة البيانات المكدسة",
  "in1": "اختر مجموعتين أو أكثر من البيانات",
  "in2": "اختر مجموعة البيانات الثانية",
  "label1": "خيارات التكديس",
  "label2": "جميع الخيارات أدناه تتطلب مجموعتين من البيانات تحملان نفس أسماء المتغيرات بالضبط",
  "bindrows": "ربط الصفوف (تكديس مجموعات البيانات كما هي، قد يؤدي إلى تكرار الصفوف)",
  "union": "الاتحاد (تكديس مجموعات البيانات وإزالة التكرارات الدقيقة)",
  "intersect": "التقاطع (الاحتفاظ بالصفوف المشتركة بين مجموعتي البيانات)",
  "setdiff": "الفرق (الاحتفاظ بالصفوف في مجموعة البيانات الأولى ولكن ليس في الثانية)",
  "id": "إذا كنت ترغب في تتبع مجموعة البيانات التي جاءت منها كل ملاحظة، حدد اسمًا لهذه المتغير هنا. ملاحظة: يتم إضافة المتغير الجديد إلى بداية مجموعة البيانات الناتجة.",
  "help": {
    "title": "تكديس مجموعات البيانات",
    "r_help": "help(bind_rows, package=dplyr)",
    "body": "\n            <b>الوصف</b></br>\nستساعدك هذه النافذة في تكديس مجموعتين أو أكثر من البيانات فوق بعضها البعض. يمكنك اختيار أحد الخيارات التالية.<br/>\n1. ربط الصفوف:  يكدس مجموعتين أو أكثر من البيانات تمامًا كما هي. إذا كان اسم المتغير شائعًا بين مجموعتي البيانات، ستملأ القيم كما تتوقع. إذا كانت مجموعة البيانات A تحتوي على متغير يسمى var1 غير موجود في مجموعة البيانات الأخرى B، ستظهر قيم NA في المتغير var1 لجميع الصفوف التي تتوافق مع مجموعة البيانات B.<br/>\nجميع الخيارات أدناه تعمل على مجموعتين فقط من البيانات وتتطلب أن تشترك كلا مجموعتي البيانات في نفس المتغيرات.<br/>\n2. الاتحاد: يكدس مجموعات البيانات ويزيل التكرارات<br/>\n3. التقاطع: يحتفظ بالصفوف المشتركة بين كلا المجموعتين<br/>\n4. الفرق: يحتفظ بالصفوف في مجموعة البيانات الأولى، وليس في الثانية<br/>\nاعتمادًا على الخيار المحدد، يتم استدعاء الدوال bind_rows و union و intersect و setdiff في حزمة dplyr.\nملاحظة: يمكنك تتبع مجموعة البيانات التي جاءت منها الملاحظة الأصلية بشكل اختياري. يتم إضافة معرف مجموعة البيانات (1st/2nd) إلى بداية مجموعة البيانات التي تحتوي على النتائج.<br/>\n<b>الحزمة</b></br>\ndplyr</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي help(bind_rows, package=\"dplyr\") في نافذة صيغة R\n            "
  }
}