{
  "title": "مطابقة الموضوع",
  "navigation": "مطابقة الموضوع",
  "newdatasetnamelabel": "اسم مجموعة البيانات لتخزين البيانات المطابقة",
  "groupvarlabel": "متغير الحالة/التحكم (التحكم=قيمة أقل، الحالة=قيمة أعلى)",
  "notelabel": "ملاحظة: يجب عليك تحديد متغير واحد على الأقل لمتغيرات المطابقة الدقيقة أو المتغيرات المحددة",
  "exactvarslabel": "المتغيرات للمطابقة الدقيقة",
  "calipervarslabel": "المتغيرات للمطابقة المحددة",
  "caliperslabel": "حدد الحدود بترتيب المتغيرات المحددة مفصولة بفواصل، مثل 5، 2",
  "idvarlabel": "متغير معرف الموضوع",
  "ratiolabel": "عدد الضوابط لكل حالة",
  "help": {
    "title": "مطابقة الموضوع",
    "r_help": "help(matchit, package = 'MatchIt')",
    "body": "\n            يقوم بإجراء مطابقة موضوعية لأقرب جار حيث يتم مطابقة مجموعة من الحالات مع 1 أو أكثر من الضوابط. هذا مناسب لدراسات الحالة/التحكم ودراسات المجموعة المطابقة.\n\t\t\t<br/><br/>\n\t\t\tالمتغيرات التي يجب أن تتطابق قيمها بدقة والقيم التي تتطابق ضمن حدود عددية مدعومة.\n\t\t\tتتم المطابقة بدون استبدال (يمكن مطابقة كل موضوع مرة واحدة فقط) وسيتم اختيار الضوابط من بين الضوابط المحتملة وفقًا لترتيب البيانات لكل حالة.\n\t\t\t<br/><br/>\n\t\t\tستحتوي مجموعة البيانات الناتجة على البيانات الأصلية واثنين من المتغيرات الإضافية: 1) subclass: متغير يحدد المجموعة المطابقة، و2) weights: متغير وزن الحالة المطابقة الذي يمكن استخدامه في التحليل اللاحق، إذا رغبت في ذلك.\n\t\t\t<br/><br/>\n\t\t\t<b>اسم مجموعة البيانات لتخزين البيانات المطابقة:</b>\n\t\t\t<br/>اسم مجموعة البيانات الناتجة التي تحتوي على مجموعات الموضوعات المطابقة.\n\t\t\t<br/><br/>\n\t\t\t<b>متغير الحالة/التحكم (التحكم=قيمة أقل، الحالة=قيمة أعلى):</b>\n\t\t\t<br/>اسم المتغير الذي يشير إلى الحالات والضوابط. يمكن أن يكون عدديًا أو عاملًا أو حرفيًا.  \n\t\t\tإذا كان متغيرًا عدديًا، يجب ترميزه كـ 0=تحكم، 1=حالة. إذا كان متغيرًا عاملًا، سيكون المستوى الأقل ترتيبًا هو الضوابط والمستوى الأعلى ترتيبًا هو الحالات.  \n\t\t\tإذا كان متغيرًا حرفيًا، ستكون القيمة الأقل ترتيبًا (حسب الترتيب الأبجدي) هي الضوابط، والقيمة الأعلى ترتيبًا (حسب الترتيب الأبجدي) ستكون الحالات.\n\t\t\tلذا، لتكون أكثر أمانًا، نوصي بالترميز كـ 0=تحكم، 1=حالة.\n\t\t\t</br><br/>\n\t\t\t<b>المتغيرات للمطابقة الدقيقة:</b>\n\t\t\t<br/>حدد المتغيرات التي تريد أن تتطابق مجموعات الحالة/التحكم بدقة.  \n\t\t\tهذا يعني أن الحالات والضوابط في مجموعة مطابقة لها نفس القيم تمامًا لهذه المتغيرات. يمكن أن تكون هذه متغيرات حرفية أو تاريخية أو عددية أو عاملية أو ترتيبية.\n\t\t\t<br/><br/>\n\t\t\t<b>المتغيرات للمطابقة المحددة:</b>\n\t\t\t<br/>حدد المتغيرات التي تريد أن تتطابق مجموعات الحالة/التحكم على قيم الحدود العددية. ستكون الضوابط ضمن عرض محدد من الحدود لكل من هذه المتغيرات.\n\t\t\tيمكن أن تكون هذه متغيرات عددية أو تاريخية. يجب أن يكون لكل متغير حدود قيمة محددة.\n\t\t\t<br/><br/>\n\t\t\t<b>حدد الحدود بترتيب المتغيرات المحددة مفصولة بفواصل:</b>\n\t\t\t<br/>حدد قيم الحدود العددية لكل من المتغيرات المحددة، بترتيب المتغيرات المحددة.  \n\t\t\tعلى سبيل المثال، إذا تم تحديد العمر (بالسنوات) مع حد قدره 5، فهذا يعني أن الضوابط يجب أن تكون ضمن +/- 5 سنوات من الحالة المطابقة لها.\n\t\t\tيجب أن يكون لكل متغير حدود قيمة محددة. إذا لم يكن هناك متغيرات حدود، يجب أن يكون هذا الحقل فارغًا.\n\t\t\t<br/><br/>\n\t\t\t<b>عدد الضوابط لكل حالة:</b>\n\t\t\t<br/>هذا هو الحد الأقصى لعدد الضوابط التي سيتم مطابقتها مع كل حالة. قد تحتوي بعض مجموعات المطابقة على أقل من هذه القيمة إذا لم يمكن تحديد مطابقة مناسبة.\n            <br/><br/>\n            <b>حزم R المطلوبة:</b> dplyr، tidyr، MatchIt\n"
  }
}