{
  "title": "تحديد مجموعة حسب الموضع",
  "navigation": "تحديد مجموعة حسب الموضع",
  "newdatasetlabel": "حدد اسم مجموعة البيانات الجديدة",
  "sortbyvarslabel": "المتغيرات التي سيتم فرزها أولاً (ترتيب تصاعدي)",
  "groupbyvarslabel": "المجموعات التي سيتم تحديدها ضمنها",
  "subsettypelabel": "نوع المجموعة الفرعية",
  "firstnlabel": "أول N صفوف",
  "lastnlabel": "آخر N صفوف",
  "lowestnlabel": "الصفوف ذات أقل N قيم لمتغير",
  "highestnlabel": "الصفوف ذات أعلى N قيم لمتغير",
  "firstproplabel": "أول نسبة من الصفوف",
  "lastproplabel": "آخر نسبة من الصفوف",
  "lowestproplabel": "الصفوف ضمن أدنى نسبة لمتغير",
  "highestproplabel": "الصفوف ضمن أعلى نسبة لمتغير",
  "nlabel": "N (الإيجابي يحتفظ، السلبي يزيل)",
  "proplabel": "النسبة (الإيجابي يحتفظ، السلبي يزيل)",
  "varlabel": "متغير",
  "tieslabel": "تضمين القيم المتساوية",
  "rownumlabel": "حدد أرقام الصفوف",
  "rownumboxlabel": "أرقام أو نطاقات مفصولة بفواصل (مثل 1،3،5 أو 20:30 أو seq(2,10,by=2)، الإيجابي يحتفظ، السلبي يزيل)",
  "help": {
    "title": "تحديد مجموعة حسب الموضع",
    "r_help": "help(slice, package ='dplyr')",
    "body": "\nهذا يحدد مجموعة بيانات وفقًا لموضع الصف.\n<br/><br/>\n<b>حدد اسم مجموعة البيانات الجديدة:</b> اسم مجموعة البيانات حيث سيتم تخزين البيانات المحددة\n<br/><br/>\n<b>المتغيرات التي سيتم فرزها أولاً:</b> المتغيرات المستخدمة لفرز الصفوف قبل أي تحديد. هذا سيؤثر فقط على الخيارات التي تحدد عدد الصفوف، مثل \nأول/آخر N صفوف، أول/آخر نسبة من الصفوف، وحدد أرقام الصفوف. سيكون دائمًا في ترتيب تصاعدي.\n<br/><br/>\n<b>المجموعات التي سيتم تحديدها ضمنها:</b> عدم تحديد أي متغيرات سيحدد وفقًا لموضع الصف في مجموعة البيانات الكاملة. تحديد المتغيرات سيحدد وفقًا لموضع الصف\nضمن المجموعات المحددة بواسطة جميع تركيبات القيم للمتغيرات المحددة.\n<br/><br/>\n<b>نوع المجموعة الفرعية</b>\n<br/><br/>\n<b>أول N صفوف:</b> يحتفظ بأول N صفوف من مجموعة البيانات بشكل عام أو ضمن المجموعات\n<br/><br/>\n<b>آخر N صفوف:</b> يحتفظ بآخر N صفوف من مجموعة البيانات بشكل عام أو ضمن المجموعات\n<br/><br/>\n<b>الصفوف ذات أقل N قيم لمتغير:</b> يحتفظ بالصفوف التي تحتوي على أقل القيم المرتبة لمتغير محدد بشكل عام أو ضمن المجموعات. على سبيل المثال، تحديد 10 سيحتفظ \nبالصفوف ذات أقل 10 قيم لمتغير.\n<br/><br/>\n<b>الصفوف ذات أعلى N قيم لمتغير:</b> يحتفظ بالصفوف التي تحتوي على أعلى القيم المرتبة لمتغير محدد بشكل عام أو ضمن المجموعات. على سبيل المثال، تحديد 10 سيحتفظ \nبالصفوف ذات أعلى 10 قيم لمتغير.\n<br/><br/>\n<b>أول نسبة من الصفوف:</b> يحتفظ بالصفوف في أعلى نسبة من مجموعة البيانات بشكل عام أو ضمن المجموعات. على سبيل المثال، تحديد .10 سيحتفظ بأعلى 10% من مجموعة البيانات \nوفقًا لعدد الصفوف الإجمالي.\n<br/><br/> \n<b>آخر نسبة من الصفوف:</b> يحتفظ بالصفوف في أدنى نسبة من مجموعة البيانات بشكل عام أو ضمن المجموعات. على سبيل المثال، تحديد .10 سيحتفظ بأدنى 10% من مجموعة البيانات \nوفقًا لعدد الصفوف الإجمالي.\n<br/><br/>\n<b>الصفوف ضمن أدنى نسبة لمتغير:</b> يحتفظ بالصفوف في أدنى نسبة لمتغير محدد، بشكل عام أو ضمن المجموعات. على سبيل المثال، تحديد .10 سيحتفظ \nبالأدنى 10% لمتغير (الحد الأدنى إلى النسبة المئوية العاشرة).\n<br/><br/>\n<b>الصفوف ضمن أعلى نسبة لمتغير:</b> يحتفظ بالصفوف في أعلى نسبة لمتغير محدد، بشكل عام أو ضمن المجموعات. على سبيل المثال، تحديد .10 سيحتفظ \nبالأعلى 10% لمتغير (النسبة المئوية 90 إلى الحد الأقصى).\n<br/><br/>\n<b>حدد أرقام الصفوف:</b> يحتفظ بالصفوف المحددة بالأرقام الدقيقة. على سبيل المثال، تحديد 1،3،5 سيحتفظ بالصفوف الأولى والثالثة والخامسة. تحديد 20:30 سيحتفظ بالصفوف من 20 \nإلى 30. تحديد seq(2,10,by=2) سيحتفظ بالصفوف ذات الأرقام الزوجية حتى الصف العاشر.\n<br/><br/>\n<b>تضمين القيم المتساوية:</b> يحدد ما إذا كان يجب تضمين القيم المتساوية أم لا. على سبيل المثال، إذا كنت تريد الصفوف لأدنى 10 قيم لمتغير وظهرت القيمة العاشرة الأدنى \nأكثر من مرة، فإن تضمين القيم المتساوية سيحتفظ بجميع الصفوف التي تساوي القيمة المكررة. \n<br/><br/>\nلاحظ أن تحديد قيم سلبية لـ N أو النسبة يزيل الصفوف المقابلة من مجموعة البيانات. على سبيل المثال، تحديد -10 لأولى N صفوف سيزيل \nأول 10 صفوف. تحديد -.10 لأول نسبة من الصفوف، سيزيل أول 10% من الصفوف.\n<br/><br/>\n<b>حزم R المطلوبة:</b> dplyr\n\t\t\t"
  }
}