{
  "title": "تحديث الدمج",
  "navigation": "تحديث الدمج",
  "join": "انضم إلى الخريطة",
  "description": "تحديث الدمج يقوم بتحديث مجموعة بيانات واحدة بالقيم من مجموعة بيانات أخرى.",
  "out": "أدخل اسم مجموعة البيانات المدمجة",
  "in1": "اختر مجموعة البيانات الأولى",
  "in2": "اختر مجموعة البيانات الثانية",
  "label1": "خيارات الدمج",
  "upsert": "تحديث المتغيرات في مجموعة البيانات الأولى (اليسار) مع المطابقات من مجموعة البيانات الثانية (اليمين)، وإدراج غير المطابقات",
  "update": "تحديث المتغيرات في مجموعة البيانات الأولى (اليسار) مع المطابقات من مجموعة البيانات الثانية (اليمين)، تجاهل غير المطابقات",
  "insert": "إدراج غير المطابقات فقط في مجموعة البيانات الأولى (اليسار)",
  "patch": "تحديث المتغيرات فقط التي تحتوي على قيم مفقودة في مجموعة البيانات الأولى (اليسار) مع المطابقات من مجموعة البيانات الثانية (اليمين)",
  "delete": "حذف الصفوف من مجموعة البيانات الأولى (اليسار) التي تتطابق مع مجموعة البيانات الثانية (اليمين)",
  "help": {
    "title": "تحديث الدمج",
    "r_help": "help(rows_upsert, package=dplyr)",
    "body": "\n            <b>الوصف</b></br>\n            تحديث الدمج يقوم بتحديث مجموعة بيانات بالقيم من مجموعة بيانات ثانية بناءً على مطابقة اسم المتغير الدقيق للملاحظات التي تحتوي على قيم متطابقة لمتغير خريطة الانضمام. \n\t\t\t<br/>يجب عليك تحديد متغير واحد أو أكثر في مجموعة البيانات النشطة وفي مجموعة البيانات المستهدفة المحددة التي تريد إجراء الانضمام عليها.\n\t\t\t<br/>سيتم حفظ النتائج في مجموعة بيانات جديدة.\n\t\t\t<br/><br/>\n\t\t\t<b>خيارات الدمج</b>\n\t\t\t<br/><br/>\n\t\t\t<b>تحديث المتغيرات في مجموعة البيانات الأولى (اليسار) مع المطابقات من مجموعة البيانات الثانية (اليمين)، وإدراج غير المطابقات:</b> هذه مجموعة من تحديث المتغيرات في مجموعة البيانات اليسرى للمطابقات وإنشاء صفوف جديدة للصفوف غير المطابقة.\n\t\t\t<br/><br/>\n\t\t\t<b>تحديث المتغيرات في مجموعة البيانات الأولى (اليسار) مع المطابقات من مجموعة البيانات الثانية (اليمين)، تجاهل غير المطابقات:</b> هذا يقوم فقط بتحديث المتغيرات الموجودة في مجموعة البيانات اليسرى للمطابقات. يتم تجاهل الصفوف غير المطابقة.\n\t\t\t<br/><br/>\n\t\t\t<b>إدراج غير المطابقات فقط في مجموعة البيانات الأولى (اليسار):</b> هذا يبقي جميع الصفوف المطابقة في مجموعة البيانات اليسرى سليمة. يتم إضافة الصفوف غير المطابقة فقط من مجموعة البيانات اليمنى إلى مجموعة البيانات اليسرى.\n\t\t\t<br/><br/>\n\t\t\t<b>تحديث المتغيرات فقط التي تحتوي على قيم مفقودة في مجموعة البيانات الأولى (اليسار) مع المطابقات من مجموعة البيانات الثانية (اليمين)، تجاهل غير المطابقات:</b>  هذا يقوم بتحديث الصفوف التي تتطابق، ولكن فقط عندما تكون القيم في مجموعة البيانات اليسرى مفقودة (أي NA).\n\t\t\t<br/><br/>\n\t\t\t<b>حذف الصفوف من مجموعة البيانات الأولى (اليسار) التي تتطابق مع مجموعة البيانات الثانية (اليمين):</b>  هذا يقوم فقط بحذف الصفوف من مجموعة البيانات اليسرى التي تتطابق مع الصفوف في مجموعة البيانات اليمنى.\n\t\t\t<br/><br/>\n            <b>حزم R المطلوبة:</b> dplyr\n"
  }
}