{
  "title": "عوامل تضخيم التباين",
  "navigation": "VIF",
  "modelselector1": "اختر نموذجًا من الفئات التالية (الفئة بين قوسين) نموذج خطي (lm)، نماذج خطية عامة (glm)، انحدار لوجستي مرتب أو انحدار بروبيت (polr)، نماذج لوج-خطية متعددة الحدود (multinom)، البقاء (coxph)",
  "help": {
    "title": "عوامل تضخيم التباين",
    "r_help": "help(vif, package='car')",
    "body": "\n                <b>الوصف</b></br>\nتحسب عوامل التضخيم للتباين وعوامل التضخيم العامة للتباين للنماذج الخطية، والنماذج الخطية العامة، وغيرها من النماذج.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code> \nvif(mod, ...)\n## طريقة S3 الافتراضية:\nvif(mod, ...)\n## طريقة S3 لفئة 'merMod'\nvif(mod, ...)\n</code> <br/>\n<b>المعطيات</b><br/>\n<ul>\n<li>\nmod: لطريقة الافتراضية، كائن يستجيب لـ coef و vcov و model.matrix، مثل كائن lm أو glm.\n</li>\n<li>\n... غير مستخدم.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nإذا كانت جميع المصطلحات في نموذج خطي غير موزون تحتوي على 1 df، فسيتم حساب عوامل التضخيم المعتادة.\n</br>\nإذا كانت أي مصطلحات في نموذج خطي غير موزون تحتوي على أكثر من 1 df، فسيتم حساب عوامل التضخيم العامة (Fox و Monette، 1992). يمكن تفسير هذه على أنها التضخيم في حجم بيضة الثقة أو الشكل البيضاوي للمعاملات للمصطلح مقارنة بما يمكن الحصول عليه للبيانات المتعامدة.\n</br>\nتكون عوامل التضخيم العامة غير متغيرة بالنسبة لترميز المصطلحات في النموذج (طالما أن الفضاء الفرعي للأعمدة في مصفوفة النموذج المتعلقة بكل مصطلح غير متغير). لضبط أبعاد الشكل البيضاوي للثقة، تقوم الدالة أيضًا بطباعة GVIF^[1/(2*df)] حيث df هو درجات الحرية المرتبطة بالمصطلح.\n</br>\nمن خلال تعميم إضافي، فإن التنفيذ هنا قابل للتطبيق أيضًا على أنواع أخرى من النماذج، وخاصة النماذج الخطية الموزونة، والنماذج الخطية العامة، ونماذج التأثيرات المختلطة.\n</br>\n<b>القيمة</b><br/>\nمتجه من عوامل التضخيم، أو مصفوفة تحتوي على صف واحد لكل مصطلح في النموذج، وأعمدة لـ GVIF و df و GVIF^[1/(2*df)].<br/>\n<b>أمثلة</b><br/>\n<code> \n## مثال سخيف...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>الحزمة</b></br>\ncar</br>\n<b>المساعدة</b></br>\nللحصول على مساعدة مفصلة، انقر على أيقونة R في الزاوية العلوية اليمنى من هذه النافذة المنبثقة أو قم بتشغيل الأمر التالي في محرر صيغة R help(vif, package=\"car\")\n                "
  }
}