{
  "title": "اختبار ويلكوكسون، عينات مستقلة",
  "navigation": "اختبار ويلكوكسون، عينات مستقلة",
  "tvarbox1": "متغير الاستجابة (واحد)",
  "tvarbox2": "عامل (واحد) بمستويين فقط",
  "label1": "الفرضية البديلة",
  "twosided": "المجموعة 1 - المجموعة 2 != مو",
  "greater": "المجموعة 1 - المجموعة 2 > مو",
  "less": "المجموعة 1 - المجموعة 2 < مو",
  "label2": "طريقة الاختبار",
  "default": "افتراضي",
  "exact": "دقيق",
  "normal": "تقريب عادي",
  "contingency": "تقريب عادي (تصحيح الاستمرارية)",
  "textbox1": "فترة الثقة",
  "textbox2": "الفرضية الصفرية (مو)",
  "help": {
    "title": "اختبار ويلكوكسون، عينات مستقلة",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>الوصف</b></br>\nيجري اختبارات ويلكوكسون لعينة واحدة وعينتين على متجهات البيانات؛ يُعرف الأخير أيضًا باسم اختبار 'مان-ويتني'.\n<br/>\n<b>الاستخدام</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## طريقة S3 الافتراضية:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## طريقة S3 لفئة 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>المعطيات</b><br/>\n<ul>\n<li>\nx: متجه عددي لقيم البيانات. سيتم حذف القيم غير المحددة (مثل، اللانهاية أو المفقودة).\n</li>\n<li>\ny: متجه عددي اختياري لقيم البيانات: كما هو الحال مع x، سيتم حذف القيم غير المحددة.\n</li>\n<li>\nalternative: سلسلة حرفية تحدد الفرضية البديلة، يجب أن تكون واحدة من \"two.sided\" (افتراضي)، \"greater\" أو \"less\". يمكنك تحديد الحرف الأول فقط.\n</li>\n<li>\nmu: رقم يحدد معلمة اختيارية تستخدم لتشكيل الفرضية الصفرية. انظر 'التفاصيل'.\n</li>\n<li>\npaired: منطقية تشير إلى ما إذا كنت تريد اختبارًا مقترنًا.\n</li>\n<li>\nexact: منطقية تشير إلى ما إذا كان يجب حساب قيمة p الدقيقة.\n</li>\n<li>\ncorrect: منطقية تشير إلى ما إذا كان يجب تطبيق تصحيح الاستمرارية في التقريب العادي لقيمة p.\n</li>\n<li>\nconf.int: منطقية تشير إلى ما إذا كان يجب حساب فترة الثقة.\n</li>\n<li>\nconf.level: مستوى الثقة للفترة.\n</li>\n<li>\nformula: صيغة من الشكل lhs ~ rhs حيث lhs هو متغير عددي يعطي قيم البيانات و rhs هو عامل بمستويين يعطي المجموعات المقابلة.\n</li>\n<li>\ndata: مصفوفة أو إطار بيانات اختياري (أو مشابه: انظر model.frame) يحتوي على المتغيرات في الصيغة. بشكل افتراضي، يتم أخذ المتغيرات من البيئة (الصيغة).\n</li>\n<li>\nsubset: متجه اختياري يحدد مجموعة فرعية من الملاحظات التي سيتم استخدامها.\n</li>\n<li>\nna.action: دالة تشير إلى ما يجب أن يحدث عندما تحتوي البيانات على NAs. الافتراضي هو getOption(\"na.action\").\n</li>\n<li>\n...: مزيد من المعطيات التي سيتم تمريرها إلى أو من الطرق.\n</li>\n</ul>\n<b>التفاصيل</b></br>\nواجهة الصيغة تنطبق فقط على اختبارات العينتين.</br>\nإذا تم إعطاء x فقط، أو إذا تم إعطاء كل من x و y وكان paired = TRUE، يتم إجراء اختبار ويلكوكسون للرتب الموقعة للفرضية الصفرية بأن توزيع x (في حالة العينة الواحدة) أو x - y (في حالة العينتين المقترنتين) متماثل حول مو.</br>\nبخلاف ذلك، إذا تم إعطاء كل من x و y وكان paired = FALSE، يتم إجراء اختبار ويلكوكسون لمجموع الرتب (المكافئ لاختبار مان-ويتني: انظر الملاحظة). في هذه الحالة، الفرضية الصفرية هي أن توزيعات x و y تختلف بفارق موقع مو والبديل هو أنها تختلف بفارق موقع آخر (والبديل الأحادي \"greater\" هو أن x يتم نقله إلى يمين y).</br>\nبشكل افتراضي (إذا لم يتم تحديد exact)، يتم حساب قيمة p الدقيقة إذا كانت العينات تحتوي على أقل من 50 قيمة محددة ولا توجد روابط. بخلاف ذلك، يتم استخدام تقريب عادي.</br>\nاختياريًا (إذا كانت المعطيات conf.int صحيحة)، يتم حساب فترة ثقة غير معلمية ومقدر للوسيط الزائف (حالة العينة الواحدة) أو لفارق المعلمات الموقعية x-y. (الوسيط الزائف لتوزيع F هو الوسيط لتوزيع (u+v)/2، حيث u و v مستقلان، كل منهما بتوزيع F. إذا كان F متماثلًا، فإن الوسيط الزائف والوسيط يتطابقان. انظر هولاندر وولف (1973)، الصفحة 34.) لاحظ أنه في حالة العينتين، المقدر لفارق المعلمات الموقعية لا يقدر الفارق في الوسيطات (وهو مفهوم خاطئ شائع) بل الوسيط للفارق بين عينة من x وعينة من y.</br>\nإذا كانت قيم p الدقيقة متاحة، يتم الحصول على فترة ثقة دقيقة بواسطة الخوارزمية الموضحة في باور (1972)، ويتم استخدام مقدر هودجز-ليهمان. بخلاف ذلك، يتم بناء فترة الثقة المقدمة وتقدير النقطة على تقريب عادي. هذه مصححة للاستمرارية للفترة ولكن ليس للتقدير (حيث يعتمد التصحيح على البديل).</br>\nمع العينات الصغيرة، قد لا يكون من الممكن تحقيق تغطيات فترة ثقة عالية جدًا. إذا حدث ذلك، سيتم إعطاء تحذير وسيتم استبدال فترة بتغطية أقل.</br>\n<b>القيمة</b><br/>\nقائمة مع فئة \"htest\" تحتوي على المكونات التالية:\nstatistic: قيمة إحصائية الاختبار مع اسم يصفها.</br>\nparameter: المعلمة (المعلمات) للتوزيع الدقيق لإحصائية الاختبار.</br>\np.value: قيمة p للاختبار.</br>\nnull.value: معلمة الموقع مو.</br>\nalternative: سلسلة حرفية تصف الفرضية البديلة.</br>\nmethod: نوع الاختبار المطبق.</br>\ndata.name: سلسلة حرفية تعطي أسماء البيانات.</br>\nconf.int: فترة ثقة لمعلمة الموقع. (تكون موجودة فقط إذا كانت المعطيات conf.int = TRUE.)</br>\nestimate: تقدير لمعلمة الموقع. (تكون موجودة فقط إذا كانت المعطيات conf.int = TRUE.)</br>\n<b>الحزمة</b></br>\nstats</br>\n<b>المساعدة</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}