{
    "title": "ANOVA & Likelihood Ratio Test",
    "navigation": "ANOVA & Likelihood Ratio",
    "label1": "ANOVA is performed for models with the following classes (R classes in parenthesis) Linear models (lm), Generalized linear models (glm), Negative-binomial log linear model (negbin), Linear model using generalized least squares (gls), Survival regression model (survreg), Proportional hazard model (coxph), Loess regression (loess)",
    "label2": "**NOTE: Likelihood test is not supported for models created via Model Tuning (class train),",
    "modelselector1": "Select a model",
    "help": {
        "title": "ANOVA & Likelihood Ratio Test",
        "r_help": "help(anova,package='stats')",
        "body": "\n                <b>Description</b></br>\nANOVA Tables: Computes analysis of variance tables and performs likelihood ratio tests for a fitted model object.  For Mixed effects models, the ANOVA-like table for random effects is displayed. \n<br/>\n<b>Usage</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject:  an object containing the results returned by a model fitting function (e.g., lm or glm).\n</li>\n</ul>\n<b>Value</b><br/>\nThis (generic) function returns an object of class anova. These objects represent analysis-of-variance and analysis-of-deviance tables. When given a single argument it produces a table which tests whether the model terms are significant. When given a sequence of objects, anova tests the models against one another in the order specified.<br/>\nThe print method for anova objects prints tables in a ‘pretty’ form.<br/>\n<b>Warning</b><br/>\nThe comparison between two or more models will only be valid if they are fitted to the same dataset. This may be a problem if there are missing values and R's default of na.action = na.omit is used.<br/>\n<b>Package</b></br>\nstats</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command in the R syntax editor help(anova,package='stats')</br></br>\n<b>Description</b></br>\nLikelihood Ratio Test of Nested Models: lrtest is a generic function for carrying out likelihood ratio tests. The default method can be employed for comparing nested (generalized) linear models (see details below).\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Default S3 method:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## S3 method for class 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject: an object. See below for details.\n</li>\n<li>\n...: further object specifications passed to methods. See below for details.\n</li>\n<li>\nname: a function for extracting a suitable name/description from a fitted model object. By default the name is queried by calling formula.\n</li>\n<li>\ndata: a data frame containing the variables in the model.\n</li>\n</ul>\n<b>Details</b></br>\nlrtest is intended to be a generic function for comparisons of models via asymptotic likelihood ratio tests. The default method consecutively compares the fitted model object object with the models passed in .... Instead of passing the fitted model objects in ..., several other specifications are possible. The updating mechanism is the same as for waldtest: the models in ... can be specified as integers, characters (both for terms that should be eliminated from the previous model), update formulas or fitted model objects. Except for the last case, the existence of an update method is assumed. See waldtest for details.<br/>\nSubsequently, an asymptotic likelihood ratio test for each two consecutive models is carried out: Twice the difference in log-likelihoods (as derived by the logLik methods) is compared with a Chi-squared distribution.<br/>\nThe \"formula\" method fits a lm first and then calls the default method.<br/>\n<b>Value</b><br/>\nAn object of class \"anova\" which contains the log-likelihood, degrees of freedom, the difference in degrees of freedom, likelihood ratio Chi-squared statistic and corresponding p value.\n<b>Examples</b><br/>\n<code> \n## with data from Greene (1993):<br/>\n## load data and compute lags<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## various equivalent specifications of the LR test<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>Description</b></br>\nANOVA-Like Table for Random-Effects: Compute an ANOVA-like table with tests of random-effect terms in the model. Each random-effect term is reduced or removed and likelihood ratio tests of model reductions are presented in a form similar to that of drop1. rand is an alias for ranova.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nmodel: a linear mixed effect model fitted with lmer() (inheriting from class lmerMod).\n</li>\n<li>\nreduce.terms: if TRUE (default) random-effect terms are reduced (if possible). If FALSE random-effect terms are simply removed.\n</li>\n</ul>\n<b>Details</b></br>\nIf the model is fitted with REML the tests are REML-likelihood ratio tests.<br/>\nA random-effect term of the form (f1 + f2 | gr) is reduced to terms of the form (f2 | gr) and (f1 | gr) and these reduced models are compared to the original model. If reduce.terms is FALSE (f1 + f2 | gr) is removed instead.<br/>\nA random-effect term of the form (f1 | gr) is reduced to (1 | gr) (unless reduce.terms is FALSE).<br/>\nA random-effect term of the form (1 | gr) is not reduced but simply removed.<br/>\nA random-effect term of the form (0 + f1 | gr) or (-1 + f1 | gr) is reduced (if reduce.terms = TRUE) to (1 | gr).<br/>\nA random-effect term of the form (1 | gr1/gr2) is automatically expanded to two terms: (1 | gr2:gr1) and (1 | gr1) using findbars.<br/>\nIn this exposition it is immaterial whether f1 and f2 are factors or continuous variables.<br/>\n<b>Value</b><br/>\nAn ANOVA-like table with single term deletions of random-effects inheriting from class anova and data.frame with the columns:</br>\nnpar: number of model parameters.</br>\nlogLik: the log-likelihood for the model. Note that this is the REML-logLik if the model is fitted with REML.</br>\nAIC: the AIC for the model evaluated as -2*(logLik - npar). Smaller is better.</br>\nLRT: the likelihood ratio test statistic; twice the difference in log-likelihood, which is asymptotically chi-square distributed.</br>\nDf: degrees of freedom for the likelihood ratio test: the difference in number of model parameters.</br>\nPr(>Chisq) :the p-value.</br>\n<b>Warning</b></br>\nIn certain cases tests of non-nested models may be generated. An example is when (0 + poly(x, 2) | gr) is reduced (the default) to (1 | gr). To our best knowledge non-nested model comparisons are only generated in cases which are statistical nonsense anyway (such as in this example where the random intercept is suppressed).</br>\nNote: Note that anova can be used to compare two models and will often be able to produce the same tests as ranova. This is, however, not always the case as illustrated in the examples.</br>\n<b>Examples</b><br/>\n<code> \n# Test reduction of (Days | Subject) to (1 | Subject):<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # 2 df test<br/>\n# This test can also be achieved with anova():<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# Illustrate reduce.test argument:<br/>\n# Test removal of (Days | Subject):<br/>\nranova(fm1, reduce.terms = FALSE) # 3 df test<br/>\n# The likelihood ratio test statistic is in this case:<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() is not always able to perform the same tests as ranova(),<br/>\n# for example:<br/>\nanova(fm1, fm3, refit=FALSE) # compares REML with ML and should not be used<br/>\nanova(fm1, fm3, refit=TRUE) # is a test of ML fits and not what we seek<br/>\n# Also note that the lmer-fit needs to come first - not an lm-fit:<br/>\n# anova(fm3, fm1) # does not work and gives an error<br/>\n# ranova() may not generate all relevant test:<br/>\n# For the following model ranova() indicates that we should not reduce<br/>\n# (TVset | Assessor):\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Assessor), data=TVbo)<br/>\nranova(fm)<br/>\n# However, a more appropriate model is:<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Assessor), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm and fm2 has essentially the same fit to data but fm uses 5 parameters more than fm.<br/>\n</code> <br/>\n<b>Package</b></br>\nlmerTest</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command in the R syntax editor help(ranova, package ='lmerTest')\n                "
    }
}