{
    "title": "ANOVA, one way with blocks",
    "navigation": "ANOVA, 1 way with blocks",
    "tvarbox1": "Response variable (one)",
    "tvarbox2": "Fixed effect",
    "blockVar": "Blocking variable(s)",
    "chk1": "Histogram of residuals",
    "chk2": "Post-hoc analysis",
    "help": {
        "title": "ANOVA, one way with blocks",
        "r_help": "help(Anova, package='car')",
        "body": "\n<b>Description</b></br>\nAnova Tables for Various Statistical Models​\nCalculates type-II or type-III analysis-of-variance tables for model objects produced by lm, glm, multinom (in the nnet package), polr (in the MASS package), coxph (in the survival package),coxme (in the coxme pckage), svyglm (in the survey package), rlm (in the MASS package), lmer in the lme4 package, lme in the nlme package, and (by the default method) for most models with a linear predictor and asymptotically normal coefficients (see details below). For linear models, F-tests are calculated; for generalized linear models, likelihood-ratio chisquare, Wald chisquare, or F-tests are calculated; for multinomial logit and proportional-odds logit models, likelihood-ratio tests are calculated. Various test statistics are provided for multivariate linear models produced by lm or manova. Partial-likelihood-ratio tests or Wald tests are provided for Cox models. Wald chi-square tests are provided for fixed effects in linear and generalized linear mixed-effects models. Wald chi-square or F tests are provided in the default case.​\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nmod: lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm, or other suitable model object.​\n</li>\n<li>\ntype: type of test, \"II\", \"III\", 2, or 3.​\n</li>\n</ul>\n<b>Details</b></br>\nThe designations \"type-II\" and \"type-III\" are borrowed from SAS, but the definitions used here do not correspond precisely to those employed by SAS. Type-II tests are calculated according to the principle of marginality, testing each term after all others, except ignoring the term's higher-order relatives; so-called type-III tests violate marginality, testing each term in the model after all of the others. This definition of Type-II tests corresponds to the tests produced by SAS for analysis-of-variance models, where all of the predictors are factors, but not more generally (i.e., when there are quantitative predictors). Be very careful in formulating the model for type-III tests, or the hypotheses tested will not make sense.​</br>\nAs implemented here, type-II Wald tests are a generalization of the linear hypotheses used to generate these tests in linear models.​</br>\nFor tests for linear models, multivariate linear models, and Wald tests for generalized linear models, Cox models, mixed-effects models, generalized linear models fit to survey data, and in the default case, Anova finds the test statistics without refitting the model. The svyglm method simply calls the default method and therefore can take the same arguments.​</br>\n<b>Value</b><br/>\nAn object of class \"anova\", or \"Anova.mlm\", which usually is printed. For objects of class \"Anova.mlm\", there is also a summary method, which provides much more detail than the print method about the MANOVA, including traditional mixed-model univariate F-tests with Greenhouse-Geisser and Huynh-Feldt corrections.​​</br>\n<b>Package</b></br>\nAnova</br>\n<b>Help</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>Description</b></br>\nPost-hoc mean separation tests. To perform post-hoc mean separation tests for each main effect factor variable we will use the emmeans package.  The linear model under consideration is called model, created the lm function above.  \n<br/>\n<b>Usage</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>Package</b></br>\nFSA;car;emmeans;ggplot2;multcomp</br>\n<b>Help</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
    }
}