{
    "title": "ANOVA, one-way with random blocks",
    "navigation": "ANOVA, 1 way (random blocks)",
    "tvarbox1": "Response Variable",
    "tvarbox2": "Fixed Effect",
    "blockVar": "Blocking Variable(s)",
    "Post_hoc": "Post-hoc analysis",
    "chk1": "Histogram of residuals",
    "help": {
        "title": "ANOVA, one-way with random blocks",
        "r_help": "help(lmer, package ='lme4')",
        "body": "\n<b>Description</b></br>\nFit a linear mixed-effects model (LMM) to data, via REML or maximum likelihood.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nlmer(formula, data = NULL, REML = TRUE, control = lmerControl(),\n        start = NULL, verbose = 0L, subset, weights, na.action,\n        offset, contrasts = NULL, devFunOnly = FALSE, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nformula: a two-sided linear formula object describing both the fixed-effects and random-effects part of the model, with the response on the left of a ~ operator and the terms, separated by +operators, on the right. Random-effects terms are distinguished by vertical bars (|) separating expressions for design matrices from grouping factors. Two vertical bars (||) can be used to specify multiple uncorrelated random effects for the same grouping variable. (Because of the way it is implemented, the ||-syntax works only for design matrices containing numeric (continuous) predictors; to fit models with independent categorical effects, see dummy or the lmer_alt function from the afex package.)\n</li>\n<li>\ndata: an optional data frame containing the variables named in formula. By default the variables are taken from the environment from which lmer is called. While data is optional, the package authors strongly recommend its use, especially when later applying methods such as update and drop1 to the fitted model (such methods are not guaranteed to work properly if data is omitted). If data is omitted, variables will be taken from the environment of formula (if specified as a formula) or from the parent frame (if specified as a character vector).\n</li>\n<li>\nREML: logical scalar - Should the estimates be chosen to optimize the REML criterion (as opposed to the log-likelihood)?\nna.action: a function that indicates what should happen when the data contain NAs. The default action (na.omit, inherited from the 'factory fresh' value of getOption(\"na.action\")) strips any observations with any missing values in any variables.\n</li>\n</ul>\n<b>Value</b></br>\nAn object of class merMod (more specifically, an object of subclass lmerMod), for which many methods are available (e.g. methods(class=\"merMod\"))</br>\n<b>Package</b></br>\nlme4</br>\n<b>Help</b></br>\nhelp(lmer, package ='lme4')</br></br>\n<b>Description</b></br>\nDescription Methods for Function anova in Package lmerTest\n<br/>\n<b>Usage</b>\n<br/>\n<code> \n## S4 method for signature 'merModLmerTest' anova(object, ... , ddf=\"Satterthwaite\", type=3)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject: object of class \"merModLmerTest\" ... object of class \"merModLmerTest\". Then the model comparison statistisc will be calculated\n</li>\n<li>\nddf: By default the Satterthwaite’s approximation to degrees of freedom is calculated. If ddf=\"Kenward-Roger\", then the Kenward-Roger’s approximation is calculated using KRmodcomp function from pbkrtest package. If ddf=\"lme4\" then the anova table that comes from lme4 package is returned.\n</li>\n<li>\nType: type of hypothesis to be tested. Could be type=3 or type=2 or type = 1 (The definition comes from SAS theory) Details According to (Goodnight, J.H. 1976) the behaviour of the type 3 hypothesis is not fully studied for the situations with missing cells (where observations are missing at some factor-level combination). A warning is returned in such cases.\n</li>\n</ul>\n<b>Details</b></br>\nAccording to (Goodnight, J.H. 1976) the behaviour of the type 3 hypothesis is not fully studied for the situations with missing cells (where observations are missing at some factor-level combination). A warning is returned in such cases.</br>\n<b>Package</b></br>\nlme4;lmerTest;rcompanion;ggplot2;multcomp</br>\n<b>Help</b></br>\nhttps://cran.r-project.org/web/packages/lmerTest/lmerTest.pdf</br>\nhelp(nagelkerke, package ='rcompanion')</br>\nhelp(emmeans,package=\"cld\")</br>\nhelp(cld,package='emmeans')</br>\n<b>Reference material</b></br>\nhttp://rcompanion.org/handbook/I_07.html\n"
    }
}