{
    "title": "Bartlett's Test",
    "navigation": "Bartlett's Test",
    "tvarbox1": "Response variable",
    "tvarbox2": "Numeric or factors variables",
    "help": {
        "title": "Bartlett's Test",
        "r_help": "help(bartlett.test, package=stats)",
        "body": "\n<b>Description</b></br>\nPerforms Bartlett's test of the null that the variances in each of the groups (samples) are the same.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nbartlett.test(x, ...)</br>\n## Default S3 method:</br>\nbartlett.test(x, g, ...)</br>\n## S3 method for class 'formula'</br>\nbartlett.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nArguments\nx: a numeric vector of data values, or a list of numeric data vectors representing the respective samples, or fitted linear model objects (inheriting from class \"lm\").\n</li>\n<li>\ng: a vector or factor object giving the group for the corresponding elements of x. Ignored if x is a list.\n</li>\n<li>\nformula: a formula of the form lhs ~ rhs where lhs gives the data values and rhs the corresponding groups.\n</li>\n<li>\ndata: an optional matrix or data frame (or similar: see model.frame) containing the variables in the formula formula. By default the variables are taken from environment(formula).\n</li>\n<li>\nsubset: an optional vector specifying a subset of observations to be used.\n</li>\n<li>\nna.action: a function which indicates what should happen when the data contain NAs. Defaults to getOption(\"na.action\").\n</li>\n<li>\n...: further arguments to be passed to or from methods.\n</li>\n</ul>\n<b>Details</b></br>\nIf x is a list, its elements are taken as the samples or fitted linear models to be compared for homogeneity of variances. In this case, the elements must either all be numeric data vectors or fitted linear model objects, g is ignored, and one can simply use bartlett.test(x) to perform the test. If the samples are not yet contained in a list, use bartlett.test(list(x, ...)).</br>\nOtherwise, x must be a numeric data vector, and g must be a vector or factor object of the same length as x giving the group for the corresponding elements of x.</br>\n<b>Value</b><br/>\nA list of class \"htest\" containing the following components:<br/>\nstatistic: Bartlett's K-squared test statistic.<br/>\nparameter: the degrees of freedom of the approximate chi-squared distribution of the test statistic.<br/>\np.value: the p-value of the test.<br/>\nmethod: the character string \"Bartlett test of homogeneity of variances\".<br/>\ndata.name: a character string giving the names of the data.<br/>\n<b>Examples</b><br/>\n<code> \nDataset <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))\nResult_Bartlett_Test = bartlett.test(sales ~ interaction(Dataset$Gender),data=Dataset)\n</code> <br/>\n<b>Package</b></br>\nstats</br>\n<b>Help</b></br>\nhelp(bartlett.test, package=stats)\n"
    }
}