{
    "title": "Bonferroni Outlier Test",
    "navigation": "Outlier Test",
    "label1": "Select a model of one of the following classes (class in parenthesis)- Linear model (lm), Generalized linear model (glm)",
    "modelselector1": "Select a model",
    "help": {
        "title": "Bonferroni Outlier Test",
        "r_help": "help(outlierTest, package='car')",
        "body": "\n                <b>Description</b></br>\nReports the Bonferroni p-values for testing each observation in turn to be a mean-shift outlier, based Studentized residuals in linear (t-tests), generalized linear models (normal tests), and linear mixed models.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## S3 method for class 'lm'<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## S3 method for class 'lmerMod'<br/>\noutlierTest(model, ...)<br/>\n## S3 method for class 'outlierTest'<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nmodel: an lm, glm, or lmerMod model object; the \"lmerMod\" method calls the \"lm\" method and can take the same arguments.\n</li>\n<li>\ncutoff: observations with Bonferroni p-values exceeding cutoff are not reported, unless no observations are nominated, in which case the one with the largest Studentized residual is reported.\n</li>\n<li>\nn.max: maximum number of observations to report (default, 10).\n</li>\n<li>\norder: report Studenized residuals in descending order of magnitude? (default, TRUE).\n</li>\n<li>\nlabels: an optional vector of observation names.\n</li>\n<li>\n...: arguments passed down to methods functions.\n</li>\n<li>\nx: outlierTest object.\n</li>\n<li>\ndigits: number of digits for reported p-values.\n</li>\n</ul>\n<b>Details</b></br>\nFor a linear model, p-values reported use the t distribution with degrees of freedom one less than the residual df for the model. For a generalized linear model, p-values are based on the standard-normal distribution. The Bonferroni adjustment multiplies the usual two-sided p-value by the number of observations. The lm method works for glm objects. To show all of the observations set cutoff=Inf and n.max=Inf.<br/>\n<b>Value</b><br/>\nan object of class outlierTest, which is normally just printed.<br/>\n<b>Examples</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>Package</b></br>\ncar</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command in the R syntax editor help(outlierTest, package=\"car\")\n                "
    }
}