{
    "title": "Boxplot with multi-vari grouping",
    "navigation": "Boxplot, Multi-Vari",
    "response": "Variable to use for boxplot (a numeric variable)",
    "YaxisGroup": "Y variable (a category) variable for Y-axis",
    "XaxisGroup": "X variable (a category) variable for X-axis",
    "withinXaxisGroup": "One or more grouping (category) variable(s) to group boxplots within x-axis group",
    "connectMeanPointsChk": "Connect the mean points",
    "showMinMaxNumberChk": "Show min and max value per Y-axis category value on the plot",
    "showMeanNumberChk": "Show mean value on the plot",
    "showMedianNumberChk": "Show median value on the plot",
    "showQuantileNumberChk": "Show quantile (Q1 and Q3) value on the plot",
    "showStatTableChk": "Print all stats in a table",
    "chartTitle": "Enter a title",
    "x_title": "X axis label",
    "y_title": "Y axis label",
    "meanPointColor": "Select a color for mean points (After color selection, click outside the control to apply)",
    "meanPointSize": "Mean point size (default = 1.15)",
    "boxPlotWidth": "Boxplot vertical width (default = 0.4)",
    "factorLevelOccuranceOrderChk": "Reorder all category variable levels in the order of their occurrence for plotting",
    "legends": "Show Legends and if so, position of Legends (default is right)",
    "help": {
        "title": "Boxplot with special grouping (Multi-Vari)",
        "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tOrganizing subgroups (i.e. sample group) for Process Capability and other subgroup analysis\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tAnalysis such as Process Capability analysis assumes that data are entered in the order they were collected (chronological order). This means that all observations from the same subgroup must appear in consecutive rows of the dataset. A subgroup ID column is typically used to define which rows belong to the same subgroup.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tIf this condition is not met (for example, if rows from the same subgroup are scattered throughout the dataset and not placed next to each other), then the subgroup IDs need to be recalibrated.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tRecalibration means:\n\t\t\t\t<br/>\n\t\t\t\tA new subgroup number is assigned whenever the subgroup ID changes from one row to the next.\n\t\t\t\t<br/>\n\t\t\t\tIf the same subgroup ID reappears later but is not adjacent to its previous occurrence, it will be treated as a new subgroup.\n\t\t\t\t<br/>\n\t\t\t\tIn other words, only identical values that appear next to each other are considered part of the same subgroup. Identical values separated by other subgroups will be split into separate subgroups during recalibration.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tThe recalibrated sample number variable in the dataset is needed to perform many analysis e.g. Process Capability, Shewhart charts like xbar,R,S, etc \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
    }
}