{
    "title": "Chi-squared Test",
    "navigation": "Chi-squared Test",
    "target": "Selected variables",
    "proportions": "Test against equal proportions or enter proportions to test against. If your variable is gender, leave this control blank to test for equal proportions. To test for 20% females, 80% males, enter 0.2,0.8. Enter a proportion for every level. Proportions must total to 1.",
    "help": {
        "title": "Chi-squared Test",
        "r_help": "help(chisq.test, package=stats)",
        "body": "\n<b>Description</b></br>\nchisq.test performs chi-squared contingency table tests and goodness-of-fit tests.\n<br/>\n<b>Usage</b>\n<br/>\n<code>\nchisq.test(x, y = NULL, correct = TRUE,\n            p = rep(1/length(x), length(x)), rescale.p = FALSE,\n            simulate.p.value = FALSE, B = 2000)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: a numeric vector or matrix. x and y can also both be factors.\n</li>\n<li>\ny: a numeric vector; ignored if x is a matrix. If x is a factor, y should be a factor of the same length.\n</li>\n<li>\ncorrect: a logical indicating whether to apply continuity correction when computing the test statistic for 2 by 2 tables: one half is subtracted from all |O - E| differences; however, the correction will not be bigger than the differences themselves. No correction is done if simulate.p.value = TRUE.\n</li>\n<li>\np: a vector of probabilities of the same length of x. An error is given if any entry of p is negative.\n</li>\n<li>\nrescale.p: a logical scalar; if TRUE then p is rescaled (if necessary) to sum to 1. If rescale.p is FALSE, and p does not sum to 1, an error is given.\n</li>\n<li>\nsimulate.p.value: a logical indicating whether to compute p-values by Monte Carlo simulation.\n</li>\n<li>\nB: an integer specifying the number of replicates used in the Monte Carlo test.\n</li>\n</ul>\n<b>Description</b><br/>\nIf x is a matrix with one row or column, or if x is a vector and y is not given, then a goodness-of-fit test is performed (x is treated as a one-dimensional contingency table). The entries of x must be non-negative integers. In this case, the hypothesis tested is whether the population probabilities equal those in p, or are all equal if p is not given.\nIf x is a matrix with at least two rows and columns, it is taken as a two-dimensional contingency table: the entries of x must be non-negative integers. Otherwise, x and y must be vectors or factors of the same length; cases with missing values are removed, the objects are coerced to factors, and the contingency table is computed from these. Then Pearson's chi-squared test is performed of the null hypothesis that the joint distribution of the cell counts in a 2-dimensional contingency table is the product of the row and column marginals.<br/>\nIf simulate.p.value is FALSE, the p-value is computed from the asymptotic chi-squared distribution of the test statistic; continuity correction is only used in the 2-by-2 case (if correct is TRUE, the default). Otherwise the p-value is computed for a Monte Carlo test (Hope, 1968) with B replicates.\nIn the contingency table case simulation is done by random sampling from the set of all contingency tables with given marginals, and works only if the marginals are strictly positive. Continuity correction is never used, and the statistic is quoted without it. Note that this is not the usual sampling situation assumed for the chi-squared test but rather that for Fisher's exact test.<br/>\nIn the goodness-of-fit case simulation is done by random sampling from the discrete distribution specified by p, each sample being of size n = sum(x). This simulation is done in R and may be slow.<br/>\n<b>Value</b></br>\nA list with class \"htest\" containing the following components:</br>\nstatistic:the value the chi-squared test statistic.</br>\nparameter: the degrees of freedom of the approximate chi-squared distribution of the test statistic, NA if the p-value is computed by Monte Carlo simulation.</br>\np.value: the p-value for the test.</br>\nmethod: a character string indicating the type of test performed, and whether Monte Carlo simulation or continuity correction was used.</br>\ndata.name: a character string giving the name(s) of the data.</br>\nobserved: the observed counts.</br>\nexpected: the expected counts under the null hypothesis.</br>\nresiduals: the Pearson residuals, (observed - expected) / sqrt(expected).</br>\nstdres: standardized residuals, (observed - expected) / sqrt(V), where V is the residual cell variance (Agresti, 2007, section 2.4.5 for the case where x is a matrix, n * p * (1 - p) otherwise).​​</br>\n<b>Examples</b><br/>\n<code> \n## From Agresti(2007) p.39\nM <- as.table(rbind(c(762, 327, 468), c(484, 239, 477)))</br>\ndimnames(M) <- list(gender = c(\"F\", \"M\"),</br>\n                    party = c(\"Democrat\",\"Independent\", \"Republican\"))</br>\n(Xsq <- chisq.test(M))  # Prints test summary</br>\nXsq$observed   # observed counts (same as M)</br>\nXsq$expected   # expected counts under the null</br>\nXsq$residuals  # Pearson residuals</br>\nXsq$stdres     # standardized residuals</br>\n</br>\n## Effect of simulating p-values</br>\nx <- matrix(c(12, 5, 7, 7), ncol = 2)</br>\nchisq.test(x)$p.value           # 0.4233</br>\nchisq.test(x, simulate.p.value = TRUE, B = 10000)$p.value</br>\n                                # around 0.29!</br>\n</code> <br/>\n<b>Package</b></br>\nstats</br>\n<b>Help</b></br>\nhelp(chisq.test, package ='caret')      \n"
    }
}