{
    "title": "Compare N Models",
    "navigation": "Compare N Models",
    "label1": "Compares N models.",
    "label2": "Select models of the following classes (R class is in parenthesis below)",
    "label3": "Linear models (lm), Generalized linear model (glm), Linear mixed effects model (lme), Ordered Logistic or Probit Regression (polr), Proportional hazard model (coxph), Linear model using generalized least squares (gls), Survival regression model (survreg), Local Polynomial Regression Fitting (loess), Non-linear least square model (nls), Multinomial Log-Linear Models (multinom)",
    "label4": "**NOTE: Models created from Model Tuning  (class train) are not supported",
    "modelselector1": "Select one or more models to compare:",
    "help": {
        "title": "Compare N Models",
        "r_help": "help(anova,package='stats')",
        "body": "\n                <b>\nCompares 2 nested modes using a F or a Chi-sq test depending on estimation. F tests are used for least squares estimation, chi-sq test are used for maximum likelihood estimation. Both models should be created on the same dataset as differences in missing values can cause problems</b></br>\n<b>Description</b></br>\nAnova Tables: Computes analysis of variance tables and performs likelihood ratio tests for a fitted model object.  \n<br/>\n<b>Usage</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject:  an object containing the results returned by a model fitting function (e.g., lm or glm).\n</li>\n</ul>\n<b>Value</b><br/>\nThis (generic) function returns an object of class anova. These objects represent analysis-of-variance and analysis-of-deviance tables. When given a single argument it produces a table which tests whether the model terms are significant. When given a sequence of objects, anova tests the models against one another in the order specified.<br/>\nThe print method for anova objects prints tables in a ‘pretty’ form.<br/>\n<b>Warning</b><br/>\nThe comparison between two or more models will only be valid if they are fitted to the same dataset. This may be a problem if there are missing values and R's default of na.action = na.omit is used.<br/>\n<b>Package</b></br>\nstats</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command in the R syntax editor help(anova,package='stats')</br></br>\n<b>Description</b></br>\nLikelihood Ratio Test of Nested Models: lrtest is a generic function for carrying out likelihood ratio tests. The default method can be employed for comparing nested (generalized) linear models (see details below).\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Default S3 method:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## S3 method for class 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject: an object. See below for details.\n</li>\n<li>\n...: further object specifications passed to methods. See below for details.\n</li>\n<li>\nname: a function for extracting a suitable name/description from a fitted model object. By default the name is queried by calling formula.\n</li>\n<li>\ndata: a data frame containing the variables in the model.\n</li>\n</ul>\n<b>Details</b></br>\nlrtest is intended to be a generic function for comparisons of models via asymptotic likelihood ratio tests. The default method consecutively compares the fitted model object object with the models passed in .... Instead of passing the fitted model objects in ..., several other specifications are possible. The updating mechanism is the same as for waldtest: the models in ... can be specified as integers, characters (both for terms that should be eliminated from the previous model), update formulas or fitted model objects. Except for the last case, the existence of an update method is assumed. See waldtest for details.<br/>\nSubsequently, an asymptotic likelihood ratio test for each two consecutive models is carried out: Twice the difference in log-likelihoods (as derived by the logLik methods) is compared with a Chi-squared distribution.<br/>\nThe \"formula\" method fits a lm first and then calls the default method.<br/>\n<b>Value</b><br/>\nAn object of class \"anova\" which contains the log-likelihood, degrees of freedom, the difference in degrees of freedom, likelihood ratio Chi-squared statistic and corresponding p value.\n<b>Examples</b><br/>\n<code> \n## with data from Greene (1993):<br/>\n## load data and compute lags<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## various equivalent specifications of the LR test<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
    }
}