{
    "title": "Competing Risks, one group",
    "navigation": "Competing Risks, one group",
    "timevar": "Time to event or censor",
    "eventvar": "Events (0 = censor, 1 = event 1, 2 = event 2, ...)",
    "eventnum": "Event Code",
    "singleeventchkbox": "Plot for a Single Event",
    "printallest": "Estimate Table Including All Times",
    "printspecest": "Estimate Table for Specific Times",
    "spectimes": "Specify times as time1, time2, time3, etc. or as seq(1,5,by=1)",
    "styleoptions": "Style Options",
    "axisoptions": "Axis Options",
    "label12": "Click on the ? button on the top right of the dialog for details on sample datasets and the data format supported.",
    "titleboxall": "Plot Title (all events plot)",
    "titleboxsingle": "Plot Title (single event plot)",
    "plottitlesizelabel": "Plot Title Size (5-50)",
    "themedropdown": "Plot Theme",
    "label1": "Legend (all events plot)",
    "legendpos": "Position",
    "legendtitle": "Title",
    "eventlabels": "Event Labels (specify labels separated by commas in order of event codes: e.g. 'Event 1', 'Event 2', etc; not censor code)",
    "legendfontsize": "Legend Labels Size (5-50)",
    "label2": "Number at Risk",
    "natriskchkbox": "Include Number at Risk",
    "risktableprop": "Risk Table Height(0-1)",
    "risktablevaluesize": "Risk Table Value Size (1-15)",
    "risktabletitlesize": "Risk Table Title Size (5-50)",
    "risktableaxislabelsize": "Risk Table Axis Label Size (5-50)",
    "risktableticklabelsize": "Risk Table Tick Label Size (5-50)",
    "risktableclean": "Remove Axes and Gridlines from Risk Table",
    "label3": "Line Options",
    "linesize": "Size (0-5)",
    "colorpalette": "Color Palette (all events plot)",
    "linecolor": "Color (single event plot)",
    "label4": "Confidence Interval",
    "cichkbox": "include 95% CI",
    "labelblank": "",
    "cistyle": "Style",
    "citransparency": "Transparency (0-1)",
    "censorchkbox": "Include Censored Times",
    "label5": "Incidence Axis",
    "incaxislabelall": "Label (all events plot)",
    "incaxislabelsingle": "Label (single event plot)",
    "label6": "Scale",
    "defbutton": "proportion",
    "pctbutton": "percent",
    "label7": "Axis Limits and Tick Mark Increments (0-1)",
    "incaxismin": "Minimum",
    "incaxismax": "Maximum",
    "incaxisinc": "Increment",
    "label8": "Time Axis",
    "timeaxislabel": "Label",
    "label9": "Axis Limits and Tick Mark Increments",
    "timeaxismin": "Minimum",
    "timeaxismax": "Maximum",
    "timeaxisinc": "Increment",
    "label10": "Note: Maximum can be specified without Increment being specified. Increment cannot be specified without Maximum being specified.",
    "axislabelsize": "Axis Label Size (5-50)",
    "ticklabelsize": "Axis Tick Mark Label Size (5-50)",
    "help": {
        "title": "Competing Risks, One Group",
        "r_help": "help(survfit, package = 'survival')",
        "body": "\n\t\t\tSee sample dataset in the install directory, the default location is at drive letter:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\melanoma_upd.RData. The variable time should be entered as the time to event or censor and the variable death should be entered as the Events.<br/>\t\t\t\n            This dataset is an updated version of the melanoma dataset in the MASS package.\n            <br/>\n            <br/>\n            A competing risk is an event whose occurrence precludes the occurrence of the primary event of interest.  Doing a standard Kaplan-Meier analysis in such cases is biased and overestimates event risk.  This dialog is used to estimate the cumulative risk of having the primary event after the start of follow-up for that event (or time zero), when one or more competing risks are present.  The sum of the cumulative incidences for each event equals the cumulative incidence for any event.  Subjects need to be at risk for all events starting at time zero.  Cumulative incidence plots for all events (separate curves for each event on the same plot), and optionally for a specific event by itself, are provided. \n            <br/>\n            An introduction to the topic of competing risks can be found in \"Introduction to the Analysis of Survival Data in the Presence of Competing Risks\" by Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Time to event or censor:</b> For each subject, the length of time to the first event, if an event occurred, or last follow-up for events, if no events occurred.\n            <br/><br/>\n            <b>Events:</b> Numeric indicator of which event occurred (1=event 1, 2=event 2, etc.) or when no events occurred (0=censor) for each subject\n            <br/><br/>\n            <b>Plot for a Single Event:</b> Whether you want to plot the cumulative incidence for a specific event by itself.  The <b>Event Code</b> corresponds to the event that will be plotted.\n            <br/><br/>\n            <b>Estimate Table Including All Times:</b> Option to include a table listing the cumulative incidence probabilities and 95% confidence intervals for every observed time in the dataset\n            <br/>\n            <br/>\n\t\t\t<b>Estimate Table for Specific Times:</b> Option to include a table that has the survival estimate probabilities for a user-selected set of times.\n\t\t\t<br/><br/>\n\t\t\t<b>Specify times as time1, time2, time3, etc. or as seq(1,5,by=1):</b> These are the specific times that will be included in the table for specific times.  They can be specified individually with commas, or as a sequence of evenly-spaced values.\n\t\t\t<br/><br/>\n            Tables are output with the sample size, the number of subjects with each event, the restricted mean time in state, and the median follow-up time.  The median follow-up time is computed using the reverse Kaplan-Meier estimator, which treats true events as censored observations and true censored observations as events.  Thus, the \"event\" in this estimator is \"following the subjects for as long as the study could\".\n            <br/>\n            A table of cumulative incidence estimates is provided at each observed time in the dataset, with 95% confidence intervals. \n            <br/>\n            <br/>\n            <b>Required R Packages:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n            <br/>\n            <br/>\n            <br/>\n            <b>Style Options</b>\n            <br/>\n            <br/>\n            <b>Plot Title (all events plot):</b> Title of the plot displaying all events; delete all text for no title\n            <br/><br/>\n            <b>Plot Title (single event plot):</b> Title of the plot displaying the selected single event; delete all text for no title\n\t\t\t<br/><br/>\n\t\t\t<b>Plot Title Size:</b> Size of the plot titles.\n\t\t\t<br/><br/>\n            <b>Plot Theme:</b> General style of the plot\n            <br/><br/>\n            <b>Legend options:</b>\n            <br/>\n            The <b>Position</b> option controls the location of the legend (top, bottom, left, right).  The <b>Title</b> is the title of the legend.  To remove the title, remove all text from the textbox.  <b>Event Labels</b> are used to show text for each numeric event code instead of the codes.  If you specify any labels, all events must be labeled.\n\t\t\tThe <b>Legend Labels Size</b> option controls the size of all text contained in the legend.\n            <br/>\n            <br/>\n            <b>Number at Risk:</b>\n\t\t\t<br/>\n\t\t\tOptionally, include a table for the number of subjects still at risk over time at the bottom of the plots.  The <b>Risk Table Height</b> controls the proportion of the plotting area that the table will take up.\n\t\t\tThe <b>Risk Table Value Size</b> controls the size of the numbers at risk. The <b>Risk Table Title Size</b> controls the size of the title for the number at risk table.\n\t\t\tThe <b>Risk Table Axis Label Size</b> controls the size of the axis labels. \n\t\t\tThe <b>Risk Table Tick Label Size</b> controls the size of the tick mark labels. If it's desired to remove all axes and gridlines \n\t\t\tfrom the number at risk table, the <b>Remove Axes and Gridlines from Risk Table</b> option can be checked.  This will only include the numbers at risk in the table.           \n            <br/><br/>\n            <b>Line Options:</b>\n            <br/>\n            <b>Size</b> controls the thickness. The <b>Color</b> options control the color palette used for the lines in the all events plot and the color of the line in the single event plot.  Color schemes mimicing scientific journals are also provided.  One can optionally include a 95% confidence interval for the estimates in either a <b>ribbon</b> (shaded area) or <b>step</b> (line) format.  <b>Transparency</b> controls how dark the ribbon is and is ignored when the step option is selected.\n\t\t\t<br/><br/>\n\t\t\t<b>Include Censored Times:</b> Censored times (when subjects become no longer at risk for the events) can be included as a rug near the time axis of both plots. This is more useful in smaller datasets or in cases of smaller numbers of censored subjects.\n            <br/><br/><br/>\n\t\t\t<b>Axis Options</b>\n            <br/>\n            <br/>\n            The <b>Label</b> option specifies the text label for the axis.  The <b>Axis Limits</b> specifies the minimum and maximum values of the axis.  The <b>Tick Mark Increments</b> option controls the spacing of the tick marks on the axis.  The increments on the time axis also control the times for the optional number at risk table.\n            <br/>\n            The incidence axis <b>Scale</b> option specifies whether you want the estimates to be on a proportion (0-1) or percent (0-100) scale.\n\t\t\t<br/><br/>\n\t\t\t<b>Axis Label Size:</b>  This controls the size of both the incidence and time axis label sizes.\n\t\t\t<br/><br/>\n\t\t\t<b>Axis Tick Mark Label Size:</b>  This controls the size of both the incidence and time axis tick mark label sizes.\t\t\t\t\n"
    }
}