{
    "title": "Competing Risks, compare groups",
    "navigation": "Competing Risks, compare groups",
    "timevar": "Time to event or censor",
    "eventvar": "Events (0 = censor, 1 = event 1, 2 = event 2, ...)",
    "groupvarlabel": "Group",
    "eventnum": "Event Code",
    "singleeventchkbox": "Plot for a Single Event",
    "printallest": "Estimate Table Including All Times",
    "printspecest": "Estimate Table for Specific Times",
    "spectimes": "Specify times as time1, time2, time3, etc. or as seq(1,5,by=1)",
    "styleoptions": "Style Options",
    "axisoptions": "Axis Options",
    "titleboxall": "Plot Title (all events plots)",
    "titleboxsingle": "Plot Title (single event plot)",
    "plottitlesizelabel": "Plot Title Size (5-50)",
    "themedropdown": "Plot Theme",
    "label1": "Legend",
    "legendpos": "Position",
    "keywidthlabel": "Key Width (cm; combined plot only)",
    "legendeventslabel": "Events",
    "legendtitle": "Title",
    "eventlabels": "Labels (specify labels separated by commas in order of event codes: e.g. 'Event 1', 'Event 2', etc; not censor code)",
    "legendgroupslabel": "Groups",
    "grouplabels": "Labels (specify labels separated by commas in order of groups: e.g. 'Group 1', 'Group 2', etc.)",
    "legendfontsize": "Legend Labels Size (5-50)",
    "wraplabelfontsize": "Event Label Size for Plot by Event (5-50)",
    "label2": "Number at Risk",
    "natriskchkbox": "Include Number at Risk",
    "risktableprop": "Risk Table Height(0-1)",
    "risktablevaluesize": "Risk Table Value Size (1-15)",
    "risktabletitlesize": "Risk Table Title Size (5-50)",
    "risktableaxislabelsize": "Risk Table Axis Label Size (5-50)",
    "risktableticklabelsize": "Risk Table Tick Label Size (5-50)",
    "risktableclean": "Remove Axes and Gridlines from Risk Table",
    "label3": "Line Options",
    "linesize": "Size (0-5)",
    "colorpalette": "Color Palette",
    "label4": "Confidence Interval",
    "cichkbox": "Include 95% CI",
    "labelblank": "",
    "cistyle": "Style",
    "citransparency": "Transparency (0-1)",
    "censorlabel": "Censored Times",
    "censorchkbox": "Include Censored Times",
    "censorsize": "Size (0-10)",
    "pvaluelabel": "P-Value (single event plot only)",
    "pvaluechkbox": "Include p-value",
    "pvaluelocationx": "X-Axis (Time) Location",
    "pvaluelocationy": "Y-Axis (Probability) Location",
    "pvaluesize": "Size (1-20)",
    "pvalueaccuracy": "Accuracy (0-1)",
    "label5": "Incidence Axis",
    "incaxislabelall": "Label (all events plots)",
    "incaxislabelsingle": "Label (single event plot)",
    "label6": "Scale",
    "defbutton": "proportion",
    "pctbutton": "percent",
    "label7": "Axis Limits and Tick Mark Increments (0-1)",
    "incaxismin": "Minimum",
    "incaxismax": "Maximum",
    "incaxisinc": "Increment",
    "label8": "Time Axis",
    "timeaxislabel": "Label",
    "label9": "Axis Limits and Tick Mark Increments",
    "timeaxismin": "Minimum",
    "timeaxismax": "Maximum",
    "timeaxisinc": "Increment",
    "label10": "Note: Maximum can be specified without Increment being specified. Increment cannot be specified without Maximum being specified.",
    "axislabelsize": "Axis Label Size (5-50)",
    "ticklabelsize": "Axis Tick Mark Label Size (5-50)",
    "help": {
        "title": "Competing Risks, Compare Groups",
        "r_help": "help(survfit, package = 'survival')",
        "body": "\n            <br/>\n            A competing risk is an event whose occurrence precludes the occurrence of the primary event of interest.  Doing a standard Kaplan-Meier analysis in such cases is biased and overestimates event risk.  This dialog is used to estimate the cumulative risk of having the primary event after the start of follow-up for that event (or time zero), when one or more competing risks are present.  The sum of the cumulative incidences for each event equals the cumulative incidence for any event.  Subjects need to be at risk for all events starting at time zero.  Cumulative incidence plots for all events (separate curves for each event on the same plot), and optionally for a specific event by itself, are provided. \n            <br/>\n            An introduction to the topic of competing risks can be found in \"Introduction to the Analysis of Survival Data in the Presence of Competing Risks\" by Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Time to event or censor:</b> For each subject, the length of time to the first event, if an event occurred, or last follow-up for events, if no events occurred.\n            <br/><br/>\n            <b>Events:</b> Numeric indicator of which event occurred (1=event 1, 2=event 2, etc.) or when no events occurred (0=censor) for each subject\n            <br/><br/>\n            <b>Plot for a Single Event:</b> Whether you want to plot the cumulative incidence for a specific event by itself.  The <b>Event Code</b> corresponds to the event that will be plotted.\n            <br/><br/>\n            <b>Estimate Table Including All Times:</b> Option to include a table listing the cumulative incidence probabilities and 95% confidence intervals for every observed time in the dataset\n            <br/>\n            <br/>\n\t\t\t<b>Estimate Table for Specific Times:</b> Option to include a table that has the cumlative incidence probabilities for a user-selected set of times.\n\t\t\t<br/><br/>\n\t\t\t<b>Specify times as time1, time2, time3, etc. or as seq(1,5,by=1):</b> These are the specific times that will be included in the table for specific times.  They can be specified individually with commas, or as a sequence of evenly-spaced values.\n\t\t\t<br/><br/>\t\t\t\n            Tables are output with the sample size, the number of subjects with each event, the restricted mean time in state, and the median follow-up time.  The median follow-up time is computed using the reverse Kaplan-Meier estimator, which treats true events as censored observations and true censored observations as events.  Thus, the \"event\" in this estimator is \"following the subjects for as long as the study could\".\n            <br/>\n            A table of cumulative incidence estimates is provided at each observed time in the dataset, with 95% confidence intervals. \n            <br/>\n            <br/>\n            <b>Required R Packages:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>Style Options</b>\n            <br/>\n            <br/>\n            <b>Plot Title (all events plots):</b> Title of the plots displaying all events; delete all text for no title\n            <br/><br/>\n            <b>Plot Title (single event plot):</b> Title of the plot displaying the selected single event; delete all text for no title\n\t\t\t<br/><br/>\n\t\t\t<b>Plot Title Size:</b> Size of the plot titles.\n\t\t\t<br/><br/>\n            <b>Plot Theme:</b> General style of the plot\n            <br/><br/>\n            <b>Legend options:</b>\n            <br/>\n            The <b>Position</b> option controls the location of the legend (top, bottom, left, right).  <b>Key Width</b> is used to change the width of the legend keys in the plot that combines all events and all groups.  This can be used to make the line types more readable in the legend.\n\t\t\t<b>Event Title</b> is the title for the part of the legend delineating the events.  <b>Group Title</b> is the title for the part of the legend delineating the groups.  Delete the text if no title is desired.  <b>Event Labels</b> are used to show text for each numeric event code instead of the codes.  <b>Group Labels</b> are used to change the text for the groups.  If you specify any labels, all labels must be specified.\n\t\t\tThe <b>Legend Labels Size</b> option controls the size of all text contained in the legend.\n\t\t\tThe <b>Event Label Size for Plot by Event</b> option controls the size of the event name text in the plot that tiles by event type.\n            <br/>\n            <br/>\n            <b>Number at Risk:</b>\n\t\t\t<br/>\n\t\t\tOptionally, include a table for the number of subjects still at risk over time at the bottom of the plots.  This is not provided for the plot that tiles by event for space and readability reasons.  The <b>Risk Table Height</b> controls the proportion of the plotting area that the table will take up.\n\t\t\tThe <b>Risk Table Value Size</b> controls the size of the numbers at risk. The <b>Risk Table Title Size</b> controls the size of the title for the number at risk table.\n\t\t\tThe <b>Risk Table Axis Label Size</b> controls the size of the axis labels. \n\t\t\tThe <b>Risk Table Tick Label Size</b> controls the size of the tick mark labels. If it's desired to remove all axes and gridlines \n\t\t\tfrom the number at risk table, the <b>Remove Axes and Gridlines from Risk Table</b> option can be checked.  This will only include the numbers at risk in the table.           \n            <br/><br/>\n            <b>Line Options:</b>\n            <br/>\n            <b>Size</b> controls the thickness. The <b>Color Palette</b> option controls the color palette used for the lines in all plots.  Color schemes mimicing scientific journals are also provided.  One can optionally include a 95% confidence interval for the estimates in either a <b>ribbon</b> (shaded area) or <b>step</b> (line) format.  <b>Transparency</b> controls how dark the ribbon is and is ignored when the step option is selected.\n\t\t\t<br/><br/>\n\t\t\t<b>Include Censored Times:</b> Censored times (when subjects become no longer at risk for the events) can be included as plus signs on the lines. This is more useful in smaller datasets or in cases of smaller numbers of censored subjects.  They are not provided in the plot that overlays all events and groups due to readability reasons.\n\t\t\t<b>Size</b> controls the size of the censored time plus signs.\n\t\t\t<br/><br/>\n\t\t\t<b>Include p-value</b> can be used to include the Gray's test p-value of the selected event on the single event plot.  <b>X-Axis (Time) Location</b> and <b>Y-Axis (Probability) Location</b> provide the (X, Y) coordinates of the p-value on the plot.\n\t\t\t<b>Size</b> controls the size of the p-value on the plot.  <b>Accuracy</b> controls the accuracy of the p-value.  For example, the default value of 0.0001 would display p-values no smaller than 0.0001.  Any p-value smaller than 0.0001 would be displayed as \"p<0.0001\". \n            <br/><br/><br/>\n\t\t\t<b>Axis Options</b>\n            <br/>\n            <br/>\n            The <b>Label</b> options specifiy the text label for the axis.  The <b>Axis Limits</b> specifies the minimum and maximum values of the axis.  The <b>Tick Mark Increments</b> option controls the spacing of the tick marks on the axis.  The increments on the time axis also control the times for the optional number at risk table.\n            <br/>\n            The incidence axis <b>Scale</b> option specifies whether you want the estimates to be on a proportion (0-1) or percent (0-100) scale.\n\t\t\t<br/><br/>\n\t\t\t<b>Axis Label Size:</b>  This controls the size of both the incidence and time axis label sizes.\n\t\t\t<br/><br/>\n\t\t\t<b>Axis Tick Mark Label Size:</b>  This controls the size of both the incidence and time axis tick mark label sizes.\n"
    }
}