{
    "title": "Character To Date",
    "navigation": "Character To Date",
    "labelInfo": "If the conversion of the date time character variable to date and time data type is successful, it will always create the new date variable with YYYY-MM-DD if only date is available, and YYYY-MM-DD HH:MM:SS, or YYYY-MM-DD HH:MM:SS.xxx with milliseconds if time is avaiable",
    "label1": "Select a suffix or prefix for converted variable",
    "suffix": "Suffix",
    "prefix": "Prefix",
    "prefixOrSuffix": "Enter a prefix or suffix",
    "Destination": "Select character variable to convert to date",
    "DateFormat": "Specify the date format of the character variable selected e.g. date only as 2024-10-07 (leave blank if only time and no date is available)",
    "TimeFormat": "Specify the time format of the character variable selected e.g. date time with milliseconds as 2024-10-07 16:34:56.789 (leave blank if only date and no time is available)",
    "TimeZone": "Select a time zone (default -nothing  selected is the local time zone of the PC)",
    "missingYear": "Missing Year: if year is missing in date character variable, type in the year, e.g. 2024. Leave blank to use current year",
    "missingMonth": "Missing Month: if month is missing in date character variable, type in the month, e.g. 03, Mar, or March for March. Leave blank to use current month",
    "missingDay": "Missing Day: if day is missing in date character variable, type in the day of the month, e.g. 17. Leave blank to use today",
    "missingHour": "Missing Hour: if hour is missing in date/time character variable, type in the hour, e.g. 7 or 16. Leave blank to use current hour",
    "missingMinute": "Missing Minute: if minute is missing in date/time character variable, type in the minute, e.g. 10 or 35. Leave blank to use current minute",
    "missingSeconds": "Missing Seconds: if seconds is missing in date/time character variable, type in the seconds, e.g. 17 or 59. Leave blank to use current seconds",
    "help": {
        "title": "Convert partial of full Date characters to Date data type",
        "r_help": "help(package=\"lubridate\")",
        "body": "\n<b>Description</b></br>\nConverts a date character string with partial or full date elements, i.e., date elements such as year, month, and day of the month to a date (POSIXct class) type. Select a format from the possible list of formats that represents the date character string (i.e., order and presence/absence of month, day, or year elements). \n<br/>\nMany string preparation steps are performed internally before calling the functions from lubridate package to convert the prepared character date string to a new POSIXct date variable.\n<br/>\n<br/>\nOPTIONS\n<br/>\nExpand the OPTIONS to fine-tune further whether to use the current year, month, or today if the year, month, or date elements are absent in the character date string variable\n<br/>\n<br/> \n\tDate Formatting choices for the selected character date string variable are:\n\t</br>\n\t</br>\n\tmonth day:\n\t</br>\n\tChoose this when the selected character date string only contains the month followed by a day and no year, such as 03/17, 05-25, Mar,15 , May-21, ...\n\t</br>\n\t</br>\n\tday month:\n\t</br>\n\tChoose this when the selected character date string only contains the day followed by the month and no year, such as 17/03, 25-05, 15,Mar , 21-May,...\n\t</br>\n\t</br>\n\tmonth year:\n\t</br>\n\tChoose this when the selected character date string only contains the month followed by the year and no day of the month, such as 03/2024, 05-2020, Mar,2023 , Jul-2018,...\n\t</br>\n\t</br>\n\tyear month:\n\t</br>\n\tChoose this when the selected character date string only contains the year followed by the month and no day of the month, such as 2024/03, 2020-05, 2023,Mar , 2018-Jul,...\n\t</br>\n\t</br>\n\tyear only:\n\t</br>\n\tChoose this when the selected character date string only year and no day or month, such as 2020, 2024, 1995, ....\n\t</br>\n\t</br>\n\tmonth only:\n\t</br>\n\tChoose this when the selected character date string only month and no day or year, such as 03, 11, Mar, November, ....\n\t</br>\n\t</br>\n\tday only:\n\t</br>\n\tChoose this when the selected character date string only day and no month or year, such as day of the month as 03, 17, 28, or day of the week as Mon, Saturday, ....\n\t</br>\n\t</br>\n\tyear month day:\n\t</br>\n\tChoose this when the selected character date string year, followed by month and day such as 2024/03/22, 2020-05-19, 2019,Mar,26,...\n\t</br>\n\t</br>\n\tmonth day year:\n\t</br>\n\tChoose this whenthe selected character date string contains the month, followed by day and year, such as 03/22/2024, 05-19-2020, Mar,26,2019,...\n\t</br>\n\t</br>\n\tday month year:\n\t</br>\n\tChoose this when the selected character date string contains a day, followed by a month and year, such as 22/03/2024, 19-05-2020, 26 March 2019,...\n\t</br>\n\t</br>\n\t</br>\n<b>Help</b></br>\nhelp(package=\"lubridate\")\n"
    }
}