{
    "title": "Character To Date & Time",
    "navigation": "Character To Date & Time",
    "labelInfo": "If the conversion of the date, time, or date time character variable to date only or date time data type is successful, it will always create the new date variable with YYYY-MM-DD format if only date is available, and YYYY-MM-DD HH:MM:SS, or YYYY-MM-DD HH:MM:SS.xxx with xxx milliseconds if time is available",
    "label1": "Select a suffix or prefix for converted variable",
    "suffix": "Suffix",
    "prefix": "Prefix",
    "prefixOrSuffix": "Enter a prefix or suffix",
    "Destination": "Select character variable to convert to date",
    "DateFormat": "Specify the format for the date portion of the character variable selected, e.g. date only as 2024-10-07 or date time as 2024-10-07 16:34:56 (leave blank if no date element is available)",
    "TimeFormat": "Specify the format for the time portion of the character variable selected, e.g. date time including milliseconds as 2024-10-07 16:34:56.789 or just time as 16:34:56 (leave blank if no time element is available)",
    "TimeZone": "Select a time zone (default -nothing selected is the local time zone of the PC)",
    "missingYear": "Missing Year: if year is missing in date character variable, type in the year, e.g. 2024. Leave blank to use current year",
    "missingMonth": "Missing Month: if month is missing in date character variable, type in the month, e.g. 03, Mar, or March for March. Leave blank to use current month",
    "missingDay": "Missing Day: if day is missing in date character variable, type in the day of the month, e.g. 17. Leave blank to use today",
    "missingHour": "Missing Hour: if hour is missing in date/time character variable, type in the hour, e.g. 7 or 16. Leave blank to use current hour",
    "missingMinute": "Missing Minute: if minute is missing in date/time character variable, type in the minute, e.g. 10 or 35. Leave blank to use current minute",
    "missingSeconds": "Missing Seconds: if seconds is missing in date/time character variable, type in the seconds, e.g. 17 or 59. Leave blank to use current seconds",
    "help": {
        "title": "Convert partial of full Date characters to Date data type",
        "r_help": "help(package=\"lubridate\")",
        "body": "\n\t\t\t<b>Description</b></br>\n\t\t\tConverts a date, time, or date time character string with partial or full date and time elements, i.e., date elements such as year, month, and day of the month to a date (POSIXct class) type or just the time such as Hour Min Sec Millisec, Hour Min Sec, .. to a full date (POSIXct class) type. \n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tSelect a format from the possible list of formats from date formats if only date elements are available in the selected character string\n\t\t\t<br/> \n\t\t\tSelect a time format the possible list of time formats if only time elements are available in the selected character string\n\t\t\t<br/>\n\t\t\tSelect both date and time formats from the date and time formats selection list if both date and time elements are available in the selected character string\n\t\t\t<br/>\n\t\t\tSelect the appropriate format that represents the date and time character string (i.e., order and presence/absence of month, day, or year or hour, min, seconds, or milliseconds elements)\n\t\t\t<br/>\n\t\t\tMany string preparation steps are performed internally before calling the functions from lubridate package to convert the prepared character date, time, or date time string to a new POSIXct date variable.\n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tOPTIONS\n\t\t\t<br/>\n\t\t\tExpand the OPTIONS to fine-tune further whether to use the current year, month, or today if the year, month, or date elements are absent in the character date string variable or current hour, minute, seconds if one or more time elements are missing from the character time string.\n\t\t\t<br/>\n\t\t\t<br/> \n\t\t\tDate Formatting choices for the selected character date string variable are:\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tmonth day:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string only contains the month followed by a day and no year, such as 03/17, 05-25, Mar,15 , May-21, ...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tday month:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string only contains the day followed by the month and no year, such as 17/03, 25-05, 15,Mar , 21-May,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tmonth year:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string only contains the month followed by the year and no day of the month, such as 03/2024, 05-2020, Mar,2023 , Jul-2018,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tyear month:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string only contains the year followed by the month and no day of the month, such as 2024/03, 2020-05, 2023,Mar, 2018-Jul,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tyear only:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string only year and no day or month, such as 2020, 2024, 1995, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tmonth only:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string only month and no day or year, such as 03, 11, Mar, November, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tday only:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string only day and no month or year, such as day of the month as 03, 17, 28, or day of the week as Mon, Saturday, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tyear month day:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string year, followed by month and day such as 2024/03/22, 2020-05-19, 2019,Mar,26,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tmonth day year:\n\t\t\t</br>\n\t\t\tChoose this whenthe selected character date string contains the month, followed by day and year, such as 03/22/2024, 05-19-2020, Mar,26,2019,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tday month year:\n\t\t\t</br>\n\t\t\tChoose this when the selected character date string contains a day, followed by a month and year, such as 22/03/2024, 19-05-2020, 26 March 2019,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tTime Formatting choices for the selected character date string variable are:\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tHour Min Sec\n\t\t\t</br>\n\t\t\tChoose this when the selected character date/time string contains Hour, followed by Minutes and Seconds, such as 22/03/2024 17:15:48, or just time as 17:15:48,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tHour Min Sec Millisec (or Microsec)\n\t\t\t</br>\n\t\t\tChoose this when the selected character date/time string contains Hour, followed by Minutes, Seconds, and Milliseconds, or Micro seconds, such as 22/03/2024 17:15:48.784, or just time as 17:15:48.784,17:15:48.784239,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMin Sec Millisec (or Microsec)\n\t\t\t</br>\n\t\t\tChoose this when the selected character time string contains Minutes, Seconds, and Milliseconds, or Micro seconds, such as just time 15:48.784,15:48.784239... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tHour Min \n\t\t\t</br>\n\t\t\tChoose this when the selected character date/time string contains Hour, followed by Minutes, such as 22/03/2024 17:15, or just time 17:15,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMin Sec\n\t\t\t</br>\n\t\t\tChoose this when the selected character time string contains Minutes and Seconds such as time as 15:48,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tSec Millisec (or Microsec)\n\t\t\t</br>\n\t\t\tChoose this when the selected character time string contains Seconds, and Milliseconds, or Micro seconds, such as time as 48.784, 55.784239,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tHour only \n\t\t\t</br>\n\t\t\tChoose this when the selected character time string contains only Hour such as time as 10, 14, or 22,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMin only\n\t\t\t</br>\n\t\t\tChoose this when the selected character time string contains only Minutes such as time as 10, 29, 44, or 59,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tSec only\n\t\t\t</br>\n\t\t\tChoose this when the selected character time string contains only Seconds such as time as 10, 29, 44, or 59,... \n\t\t\t</br>\n\t\t\t</br>\t\n\t\t\tMillisec only\n\t\t\t</br>\n\t\t\tChoose this when the selected character time string contains only Milliseconds such as time as 10, 290, 448, or 759,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMicrosec only\n\t\t\t</br>\n\t\t\tChoose this when the selected character time string contains only Microseconds such as time as 101, 2901, 448890, or 759123,... \n\t\t\t</br>\n\t\t\t</br>\n<b>Help</b></br>\nhelp(package=\"lubridate\")\n"
    }
}