{
    "title": "Coxcomb Plot",
    "navigation": "Coxcomb",
    "x": "X axis variable(s), specify a factor variable(s)",
    "y": "Y variable, specify a numeric variable",
    "fill": "Fill, specify a factor variable",
    "alpha": "Opacity (0-1)",
    "width": "Width",
    "rdgrp1": "Fill proportions",
    "flip": "Flip axis",
    "barcolor": "Bar color (After color selection, click outside the control to apply)",
    "specify_a_title": "Enter a title",
    "x_title": "X Axis Label",
    "y_title": "Y Axis Label",
    "Facetrow": "Facet row",
    "Facetcolumn": "Facet column",
    "Facetwrap": "Facet wrap",
    "Facetscale": "Facet scale",
    "help": {
        "title": "Coxcomb Plot",
        "r_help": "help(coord_polar, package='ggplot2')",
        "body": "\n            <b>Description</b></br>\nA Coxcomb/Bulls Eye chart (or a circle chart) is a circular statistical graphic, which is divided into slices/concentric circles to illustrate numerical proportion. In a Coxcomb/Bulls Eye chart, the width length of each concentric circle (and consequently its  area), is proportional to the quantity it represents. The quantity can be represented as a count or percentage.</br>​\nFacets can be optionally created by specifying a factor variable. You can also optionally specify themes, and specify a title and labels for the x and y axis.</br>\nWhen you specify multiple x variables, we create a separate Coxcomb/Bulls eye for each x variable.</br>\n<b>Usage</b>\n<br/>\n<code>\n#You can create a Bulls Eye chart for a single factor variable, a concentric circle will be created for each level of the factor variable. The width of the concentric circle is proportional to the counts of each level of the factor level. Here the factor variable will correspond to the fill as below<br/>\n#penguins is a dataset in the equatiomatic R package\nggplot(data=penguins,aes(x ='',fill=species)) +​\n                 geom_bar(alpha=1,width =0.9) +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"Count\",fill =\"var1\",title= \"Bulls Eye Chart  with Fill: species\")​</br></br>\n#You can create a Bulls Eye chart by specifying a scale/numeric variable as the y variable and a factor variable that serves as a fill. Here a concentric circle is created for each level of the fill factor variable. The width of the concentric circle is proportional to the sum of the y values at each level of the factor level. Here the factor variable will correspond to the fill as below<br/>\nggplot(data=penguins,aes(x ='', y = bill_length_mm, fill = species)) +​\n                 geom_bar(alpha=1,width =0.9,stat=\"identity\") +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"var1\",fill =\"var2\",title= \"Bulls Eye chart  with X aesthetic:,Y aesthetic: var1,Fill: var2\") </br></br>\n\n#You can create a Coxcomb plot by specifying an x variable, The slices are created for every level of the x variable, the radius of each slice is proportional to the count<br/>\n    ggplot(data=penguins, aes(x=island, )) +\n        geom_bar( alpha=1,width=1,) +\n        coord_polar(\"x\") +\n        labs(x=\"island\",  title= \"Coxcomb plot with X aesthetic: island\") +\n        xlab(\"island\") + ylab(\"Count\")</br></br>\n\n#You can generate a Coxcomb plot by specifying a X variable and a fill. Slices are created for each level of the x variable. Each slice is filled by the count of the cases in each level of the fill variable specified.\nggplot(data=penguins, aes(x=island,fill=species )) +\n\tgeom_bar( alpha=1, width=1) +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\",  title= \"Coxcomb plot with X aesthetic: island fill: species\") +\n\txlab(\"island\") + ylab(\"Count\")</br></br>\n\n\n#You can create a Coxcomb plot by specifying an x variable, y variable and fill. The slices are created for every level of the x variable and filled by the sum of the values of the y variable for each level of the variable specified in the fill. The slices are divided by levels of the fill variable. The area occupied by each level of the fill variable within the slice is proportional to the sum of the counts of the y variable that match the slice and fill variable.<br/>\nggplot(data=penguins, aes(x=island,y=bill_depth_mm,fill=species )) +\n\tgeom_bar( alpha=1,width=1,stat = \"identity\") +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\", y=\"bill_depth_mm\", title= \"Coxcomb plot with X aesthetic: island Y aesthetic: bill_depth_mm fill: species\") +\n\txlab(\"island\") + ylab(\"bill_depth_mm\")</br></br>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndata: The default dataset​\n</li>\n<li>\naes(): Generate aesthetic mappings that describe how variables in the data are mapped to visual properties (aesthetics) of geoms.​\n</li>\n<li>\nx: (Optional) A factor/categorical variable. The length of the bar corresponds to the counts of each level of the factor variable.​\n</li>\n<li>\nY: (Optional) a numeric variable\n</li>\n<li>\nfill: (Optional)An optional factor/categorical variable to group the counts of the levels in x: (see above)​\n</li>\n<li>\ngeom_bar(): Creates the bar graph, position =\"fill\" fills the bar with a percentage of each grouping level.​\n</li>\n<li>\nCoor_polar(): The polar coordinate system is most commonly used for pie charts, which are a stacked bar chart in polar coordinates.\n</li>\n<li>\nLabs(): Change axis labels and legend titles(This is optional)​\n</li>\n<li>\nfacet_grid(): Lay out panels in a grid(This is optional)​\n</li>\n<li>\ntheme_calc(): Specifies the calculator theme(This is optional)​\n</li>\n<li>\ncoord_flip(): Flip axis(This is optional)​\n</li>\n<li>\nalpha: Controls opacity, takes values between 0-1. 1 means no opacity.\n</li>\n</ul>\n<b>Package</b></br>\nggplot2;ggthemes;</br>\n<b>Help</b></br>\nhelp(coord_polar, package=ggplot2)</br>\nOther: Click the R Help button to get detailed R help. You can also enter help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n    "
    }
}