{
    "title": "Cox, Basic",
    "navigation": "Cox, Basic",
    "helplabel": "Click on the ? button on the top right of the dialog for details on sample datasets and the data format supported.",
    "modelname": "Enter Model Name",
    "timevar": "Time to event or censor",
    "eventvar": "Events (1 = event 1, 0 = censor)",
    "destvars": "Independent Variables",
    "weightvar": "Weights (optional)",
    "tiemethod": "Tied Time Method",
    "forestplotbox": "Forest Plot",
    "diagnosticsbox": "Model Diagnostics",
    "martscalebox": "Null Model Martingale Residual Axis Minimum Value (-Inf to 1):",
    "devbox": "Analysis of Deviance (Type II)",
    "devtype": "Test Statistic",
    "help": {
        "title": "Cox, Basic",
        "r_help": "help(coxph, package = 'survival')",
        "body": "\n\t\t\tSee sample dataset in the install directory, the default location is at drive letter:&bsol;program files&bsol;BioStat Prime&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. The variable Followup_time should be entered as the time to event or censor and the variable Event should be entered as the Events (1 = event, 0 = censor). Sex, age and bmi can be the independent variables. \n\t\t\t<br/>\n            The event variable must be numeric, factors are not allowed. If you have an event variable that is of type factor with 2 values for e.g. 0 and 1, convert it to numeric\n\t\t\tThis dataset is an updated version of the mockstudy dataset in the arsenal package.\n\t\t\t<br/><br/>\n            <b>Cox Proportional Hazards Model</b>\n            <br/>\n            <br/>\n            Fits a Cox proportional hazards model for time-to-event data with censored observations.  Model fitting statistics, parameter estimates, and hazard ratios are provided.  Options available include the tied time method, model diagnostics such as proportional hazards and covariate functional form assessments, and a forest plot of hazard ratios with confidence intervals.  The model is fit using the coxph function in the survival package.\n            <br/>\n            <br/>\n            <b>Time:</b> Time to event for those experiencing the event or time to last follow-up for those not experiencing the event\n            <br/><br/>\n            <b>Event:</b> Numerical event indicator; 1=event, 0=censor\n            <br/><br/>\n            <b>Independent Variables:</b> Independent variables to include in the model.  Factors, strings, and logical variables will be dummy coded.\n            <br/><br/>\n            <b>Weights:</b> Numeric variable for observation weights. Useful in situations where each record should not be counted as one observation. \n            <br/>\n            <br/>\n            <b>Required packages:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Click the Get R Help button to get detailed R help about the coxph function.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Options</b>\n            <br/>\n            <br/>\n            <b>Tied Time Method:</b>\n            <br/>\n            Method of breaking tied observed times.  Efron is usually the better choice when there aren't many tied times.  The exact method can be beneficial if there are many tied times, as in discrete time situations, but can take a little longer for the model to be fit. \n            <br/>\n            <br/>\n            <b>Forest Plot:</b>\n            <br/>\n            Plot of hazard ratios and confidence intervals for each predictor in the model.\n            <br/>\n            <br/>\n            <b>Model Diagnostics:</b>\n            <br/>\n            If selected, proportional hazards tests and plots will be provided, in addition to assessments of functional form for each covariate in the model.  The null model Martingale residual axis minimum value option might need to be changed so that all residuals appear in the plot. To get functional form assessments, you must specify only numeric predictors and have no missing data. See Variables > Missing Values > Remove NAs.\n            <br/>\n            <br/>\n            <b>Analysis of Deviance (Type II):</b>\n            Global test of each predictor in the model.  Multi-degree of freedom tests will be provided for effects with more than 2 levels.  Wald and Likelihood ratio tests can be obtained, with likelihood ratios tests having better small sample properties.\n            \n"
    }
}