{
    "title": "Date Order Check",
    "navigation": "Date Order Check",
    "datevarslabel": "Date Variables (specify earliest to latest; same class; at least 2)",
    "compgrplabel": "Comparison",
    "compgrpnote": "Note: This is the comparison between all dates specified above that will be checked for order errors, e.g. values should be date1<date2<date3.",
    "ltlabel": "<",
    "ltelabel": "<=",
    "idvarslabel": "Row Identification Variables (optional)",
    "dateerrorboxlabel": "Create dataset with date error variable",
    "dateerrordatanamelabel": "Dataset name",
    "dateerrorvarlabel": "Date error variable name",
    "help": {
        "title": "Date Order Check",
        "r_help": "help('<', package = 'base')",
        "body": "\nThis creates a list of rows in the active dataset where date variable values are not in a specified order.  This helps identify potential date variable errors when dates or \ntimes are needed for an analysis.  For example, if three date columns are supposed to be in the order of date1 < date2 < date3, this dialog will print all observations where \nthe values of those variables do not follow that order.  Missing date values are allowed in the specified variables and will not be used for any comparisons.\n<br/><br/>\n<b>Date Variables (specify earliest to latest; same class; at least 2):</b>  Specify at least 2 date variables in the order of earliest to latest.  These can be any date class \n(POSIXct, Date), but all variables specified must be the same date class.  If not, an error will result.\n<br/><br/>\n<b>Comparison:</b>  Specify the comparison operator used to compare the date values.  \"<\" means less than and \"<=\" means less than or equal to.  If \"<\" is chosen, then dates that\nare equal will be flagged as errors.  If \"<=\" is chosen, then dates that are equal will not be flagged as errors.\n<br/><br/>\n<b>Row Identification Variables (optional):</b>  Specify one or more variables that may be useful to identify the rows.  For example, subject identification number.  These will \nbe included in the list of errors.  If no variables are specified, the row number of the dataset will be the only identifier.\n<br/><br/>\n<b>Create dataset with date error variable:</b>  This will create a separate data set with the original data and a variable indicating whether each observation has a date order \nerror (coded as 1=date order error and 0=no date order error).  The <b>Dataset name</b> is the desired name of this data set and <b>Date error variable name</b> is the desired name \nof the date order error variable in this data set.\n\t\t"
    }
}