{
    "title": "Decision Trees",
    "navigation": "Decision Trees",
    "TxtTreeName": "Enter model Name",
    "TreeGenChkbox": "Don't re-generate if tree already exists",
    "dependent": "Dependent variable",
    "independent": "Independent variable(s)",
    "weights": "Survey weights",
    "TxtMinSplit": "Minimum split",
    "minBucket": "Minimum bucket",
    "TxtCP": "Complexity parameter",
    "maxDepth": "Maximum depth",
    "PruneTreeChkbox": "Prune tree",
    "rd0": "Don't prune",
    "rd1": "Use optimal complexity parameter",
    "rd2": "Specify complexity parameter",
    "TxtCPPrune": "Enter complexity parameter",
    "PlotCVChkbox": "Plot cross-validation",
    "PlotRSQRChkbox": "Plot R-squared ",
    "OptvarPlots": "Plots",
    "OptvarPreprune": "PrePruning",
    "OptvarPrune": "Prune Tree",
    "help": {
        "title": "Decision Trees",
        "r_help": "help(rpart, package ='rpart')",
        "body": "\n                <b>Note</b></br>\n                Dependent variables can be factor, ordinal, string, logical and numeric</br>\n                Independent Variables can be factor, ordinal, string, logical and numeric</br></br>\n                <b>Description</b></br>\n                Fit a Recursive Partitioning and Regression Tree model\n                <br/>\n                <b>Usage</b>\n                <br/>\n                <code> \n                rpart(formula, data, weights, subset, na.action = na.rpart, method,\n                      model = FALSE, x = FALSE, y = TRUE, parms, control, cost, ...)\n                </code> <br/>\n                <b>Arguments</b><br/>\n                <ul>\n                <li>\n                formula: a formula, with a response but no interaction terms. If this a a data frame, that is taken as the model frame (see model.frame).\n                </li>\n                <li>\n                data: an optional data frame in which to interpret the variables named in the formula.\n                </li>\n                <li>\n                weights: optional case weights.\n                </li>\n                <li>\n                subset: optional expression saying that only a subset of the rows of the data should be used in the fit.\n                </li>\n                <li>\n                na.action: the default action deletes all observations for which y is missing, but keeps those in which one or more predictors are missing.\n                </li>\n                <li>\n                method: one of \"anova\", \"poisson\", \"class\" or \"exp\". If method is missing then the routine tries to make an intelligent guess. If y is a survival object, then method = \"exp\" is assumed, if y has 2 columns then method = \"poisson\" is assumed, if y is a factor then method = \"class\" is assumed, otherwise method = \"anova\" is assumed. It is wisest to specify the method directly, especially as more criteria may added to the function in future.\n                Alternatively, method can be a list of functions named init, split and eval. Examples are given in the file ‘tests/usersplits.R’ in the sources, and in the vignettes ‘User Written Split Functions’.\n                </li>\n                <li>\n                model: if logical: keep a copy of the model frame in the result? If the input value for model is a model frame (likely from an earlier call to the rpart function), then this frame is used rather than constructing new data.\n                </li>\n                <li>\n                x: keep a copy of the x matrix in the result.\n                </li>\n                <li>\n                y: keep a copy of the dependent variable in the result. If missing and model is supplied this defaults to FALSE.\n                </li>\n                <li>\n                parms: optional parameters for the splitting function.<br/>\n                Anova splitting has no parameters.<br/>\n                Poisson splitting has a single parameter, the coefficient of variation of the prior distribution on the rates. The default value is 1.<br/>\n                Exponential splitting has the same parameter as Poisson.<br/>\n                For classification splitting, the list can contain any of: the vector of prior probabilities (component prior), the loss matrix (component loss) or the splitting index (component split). The priors must be positive and sum to 1. The loss matrix must have zeros on the diagonal and positive off-diagonal elements. The splitting index can be gini or information. The default priors are proportional to the data counts, the losses default to 1, and the split defaults to gini.<br/>\n                </li>\n                <li>\n                control: a list of options that control details of the rpart algorithm. See rpart.control.\n                </li>\n                <li>\n                cost: a vector of non-negative costs, one for each variable in the model. Defaults to one for all variables. These are scalings to be applied when considering splits, so the improvement on splitting on a variable is divided by its cost in deciding which split to choose.\n                </li>\n                <li>\n                ...: arguments to rpart.control may also be specified in the call to rpart. They are checked against the list of valid arguments.\n                </li>\n                </ul>\n                <b>Details</b></br>\n                This differs from the tree function in S mainly in its handling of surrogate variables. In most details it follows Breiman et. al (1984) quite closely. R package tree provides a re-implementation of tree.\n                <b>Value</b></br>\n                An object of class rpart. See rpart.object.</br>\n                <b>References</b></br>\n                Breiman L., Friedman J. H., Olshen R. A., and Stone, C. J. (1984) Classification and Regression Trees. Wadsworth.</br>\n                <b>See Also</b></br>\n                rpart.control, rpart.object, summary.rpart, print.rpart</br>\n                <b>Examples</b></br>\n                fit <- rpart(Kyphosis ~ Age + Number + Start, data = kyphosis)</br>\n                fit2 <- rpart(Kyphosis ~ Age + Number + Start, data = kyphosis,\n                              parms = list(prior = c(.65,.35), split = \"information\"))</br>\n                fit3 <- rpart(Kyphosis ~ Age + Number + Start, data = kyphosis,\n                              control = rpart.control(cp = 0.05))</br>\n                par(mfrow = c(1,2), xpd = NA) # otherwise on some devices the text is clipped</br>\n                plot(fit)</br>\n                text(fit, use.n = TRUE)</br>\n                plot(fit2)</br>\n                text(fit2, use.n = TRUE)</br>\n                <b>Package</b></br>\n                rpart;rpart.plot;partykit</br>\n                <b>Help</b></br>\n                help(rpart, package ='rpart')</br></br>\n                <b>Description</b></br>\n                Control for Rpart Fits. Various parameters that control aspects of the rpart fit.\n                <br/>\n                <b>Usage</b>\n                <br/>\n                <code> \n                rpart.control(minsplit = 20, minbucket = round(minsplit/3), cp = 0.01, \n                              maxcompete = 4, maxsurrogate = 5, usesurrogate = 2, xval = 10,\n                              surrogatestyle = 0, maxdepth = 30, ...)\n                </code> <br/>\n                <b>Arguments</b><br/>\n                <ul>\n                <li>\n                minsplit: the minimum number of observations that must exist in a node in order for a split to be attempted.\n                </li>\n                <li>\n                minbucket: the minimum number of observations in any terminal <leaf> node. If only one of minbucket or minsplit is specified, the code either sets minsplit to minbucket*3 or minbucket to minsplit/3, as appropriate.\n                </li>\n                <li>\n                cp: complexity parameter. Any split that does not decrease the overall lack of fit by a factor of cp is not attempted. For instance, with anova splitting, this means that the overall R-squared must increase by cp at each step. The main role of this parameter is to save computing time by pruning off splits that are obviously not worthwhile. Essentially,the user informs the program that any split which does not improve the fit by cp will likely be pruned off by cross-validation, and that hence the program need not pursue it.\n                </li>\n                <li>\n                maxcompete: the number of competitor splits retained in the output. It is useful to know not just which split was chosen, but which variable came in second, third, etc.\n                </li>\n                <li>\n                maxsurrogate: the number of surrogate splits retained in the output. If this is set to zero the compute time will be reduced, since approximately half of the computational time (other than setup) is used in the search for surrogate splits.\n                </li>\n                <li>\n                usesurrogate: how to use surrogates in the splitting process. 0 means display only; an observation with a missing value for the primary split rule is not sent further down the tree. 1means use surrogates, in order, to split subjects missing the primary variable; if all surrogates are missing the observation is not split. For value 2 ,if all surrogates are missing, then send the observation in the majority direction. A value of 0 corresponds to the action of tree, and 2 to the recommendations of Breiman et.al (1984).\n                </li>\n                <li>\n                xval: number of cross-validations.\n                </li>\n                <li>\n                surrogatestyle: controls the selection of a best surrogate. If set to 0 (default) the program uses the total number of correct classification for a potential surrogate variable, if set to 1 it uses the percent correct, calculated over the non-missing values of the surrogate. The first option more severely penalizes covariates with a large number of missing values.\n                </li>\n                <li>\n                maxdepth: Set the maximum depth of any node of the final tree, with the root node counted as depth 0. Values greater than 30 rpart will give nonsense results on 32-bit machines.\n                </li>\n                <li>\n                ...: mop up other arguments.\n                </li>\n                </ul>\n                <b>Value</b></br>\n                A list containing the options. \n                      "
    }
}