{
    "title": "Diagnostic Testing",
    "navigation": "Diagnostic Testing",
    "outvar": "Outcome Variable (1=positive, 0=negative):",
    "testvar": "Test Variable (1=positive, 0=negative):",
    "cilevel": "Confidence Level:",
    "help": {
        "title": "Diagnostic Testing",
        "r_help": "help(epi.tests,package=epiR)",
        "body": "\n<b>Description</b></br>\nThis computes various measures appropriate in diagnostic testing studies for a binary test versus a binary gold standard outcome for detecting a \"disease\".<br/>\nOutcome Variable: Variable containing the values for the gold standard.  This must be a numeric variable coded as 1 = \"disease\" positive and 0 = \"disease\" negative, since the computations depend on this order.<br/>\nTest Variable: Variable containing the values for the test under consideration.  This must be a numeric variable coded as 1 = \"disease\" positive and 0 = \"disease\" negative, since the computations depend on this order.<br/>\nConfidence Level: Desired confidence interval level<br/>\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nepi.tests(dat, conf.level = 0.95)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndat: An object of class table containing the individual cell frequencies created by tabulating the outcome and test variable. The Outcome Variable contains the values for the gold standard.  This must be a numeric variable coded as 1 = \"disease\" positive and 0 = \"disease\" negative, since the computations depend on this order. The test variable contains the values for the test under consideration.  This must be a numeric variable coded as 1 = \"disease\" positive and 0 = \"disease\" negative, since the computations depend on this order.\n</li>\n<li>\nConfidence Level: Desired confidence interval level\n</li>\n</ul>\n<b>Details</b></br>\nExact binomial confidence limits are calculated for test sensitivity, specificity, and positive and negative predictive value (see Collett 1999 for details).</br>\nConfidence intervals for positive and negative likelihood ratios are based on formulae provided by Simel et al. (1991).</br>\nDiagnostic accuracy is defined as the proportion of all tests that give a correct result. Diagnostic odds ratio is defined as how much more likely will the test make a correct diagnosis than an incorrect diagnosis in patients with the disease (Scott et al. 2008). The number needed to diagnose is defined as the number of paitents that need to be tested to give one correct positive test. Youden's index is the difference between the true positive rate and the false positive rate. Youden's index ranges from -1 to +1 with values closer to 1 if both sensitivity and specificity are high (i.e. close to 1).</br>\n<b>Value</b></br>\nSee detailed help below to access R help that will describe the values returned</br>\n<b>Package</b></br>\nepiR;DescTools</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command help(epi.tests,package=epiR) by creating a R code chunk by clicking + in the output window\n\t\t\t"
    }
}