{
    "title": "Fit of univariate distributions to non-censored data (with P-value)",
    "navigation": "Distribution Fit P-value",
    "variableSelcted": "Select a variable that contains the distribution",
    "label1": "Be aware that the fit test for distributions usually takes a longer time to complete",
    "label2": "Fit test for various distributions",
    "normDistChk": "Normal",
    "weibullDistChk": "Weibull",
    "lnormDistChk": "Log Normal",
    "poissonDistChk": "Poisson",
    "expDistChk": "Exponential",
    "gammaDistChk": "Gamma",
    "nbinomDistChk": "Negative Binomial",
    "geomDistChk": "Geometric",
    "betaDistChk": "Beta",
    "unifDistChk": "Uniform",
    "logisDistChk": "Logistic",
    "cauchyDistChk": "Cauchy",
    "method": "Fitting method",
    "gof": "Goodness-of-fit (gof) - required only when 'mge' method of fitting is chosen above",
    "shoChiqTestChk": "Show results of Chi-squared test for continuous distribution",
    "showCompareTablesOnlyChk": "Show only the distribution comparison tables and graphs. You must uncheck this if you are selecting only one distribution",
    "bootstrapIter": "Bootstrap method is used to improve the accuracy of the p.value. The default iteration is 600. More iterations may improve accuracy but will take more time to compute",
    "help": {
        "title": "Fit of univariate distributions to non-censored data",
        "r_help": "help(fitdist, package = fitdistrplus)",
        "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tFit of univariate distributions to non-censored data by maximum likelihood (mle), moment matching (mme), quantile matching (qme) or maximizing goodness-of-fit estimation (mge) which is also known as minimizing distance estimation.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFor the detail help - use R help(fitdist, package = fitdistrplus) and help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tThe four possible fitting methods are described below:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWhen method=\"mle\" (default)\n\t\t\t\tMaximum likelihood estimation consists in maximizing the log-likelihood. A numerical optimization is carried out in mledist via optim to find the best values (see mledist for details).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWhen method=\"mme\"\n\t\t\t\tMoment matching estimation consists in equalizing theoretical and empirical moments. Estimated values of the distribution parameters are computed by a closed-form formula for the following distributions : \"norm\", \"lnorm\", \"pois\", \"exp\", \"gamma\", \"nbinom\", \"geom\", \"beta\", \"unif\" and \"logis\". Otherwise the theoretical and the empirical moments are matched numerically, by minimization of the sum of squared differences between observed and theoretical moments. In this last case, further arguments are needed in the call to fitdist: order and memp (see mmedist for details).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWhen method = \"qme\"\n\t\t\t\tQuantile matching estimation consists in equalizing theoretical and empirical quantile. A numerical optimization is carried out in qmedist via optim to minimize of the sum of squared differences between observed and theoretical quantiles. The use of this method requires an additional argument probs, defined as the numeric vector of the probabilities for which the quantile(s) is(are) to be matched (see qmedist for details).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWhen method = \"mge\"\n\t\t\t\tMaximum goodness-of-fit estimation consists in maximizing a goodness-of-fit statistics. A numerical optimization is carried out in mgedist via optim to minimize the goodness-of-fit distance. The use of this method requires an additional argument gof coding for the goodness-of-fit distance chosen. One can use the classical Cramer-von Mises distance (\"CvM\"), the classical Kolmogorov-Smirnov distance (\"KS\"), the classical Anderson-Darling distance (\"AD\") which gives more weight to the tails of the distribution, or one of the variants of this last distance proposed by Luceno (2006) (see mgedist for more details). This method is not suitable for discrete distributions.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWhen method = \"mse\"\n\t\t\t\tMaximum goodness-of-fit estimation consists in maximizing the average log spacing. A numerical optimization is carried out in msedist via optim.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tconvergence is \n\t\t\t\tan integer code for the convergence of optim/constrOptim defined as below or defined by the user in the user-supplied optimization function. 0 indicates successful convergence. 1 indicates that the iteration limit of optim has been reached. 10 indicates degeneracy of the Nealder-Mead simplex. 100 indicates that optim encountered an internal error.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tGoodness-of-fit statistics are computed by gofstat(). The Chi-squared statistic is computed using cells defined by the argument chisqbreaks or cells automatically defined from data, in order to reach roughly the same number of observations per cell, roughly equal to the argument meancount, or sligthly more if there are some ties. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFor continuous distributions, Kolmogorov-Smirnov, Cramer-von Mises and Anderson-Darling and statistics are also computed, as defined by Stephens (1986).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tStatistics of importance are Cramer-von Mises, Anderson-Darling and Kolmogorov statistics for continuous distributions and Chi-squared statistics for discrete ones ( \"binom\", \"nbinom\", \"geom\", \"hyper\" and \"pois\" )\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">For a good overview of distribution fit, see https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">For a good overview of distribution fit, see https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
    }
}