{
    "title": "Friedman Test",
    "navigation": "Friedman Test",
    "tvarbox1": "Response Variables, 2 or more",
    "help": {
        "title": "Friedman Test",
        "r_help": "help(friedman.test, package=stats)",
        "body": "\n<b>Description</b></br>\nPerforms a Friedman rank sum test with unreplicated blocked data.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## Default S3 method:\nfriedman.test(y, groups, blocks, ...)\n## S3 method for class 'formula'\nfriedman.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ny: either a numeric vector of data values, or a data matrix.\n</li>\n<li>\ngroups: a vector giving the group for the corresponding elements of y if this is a vector; ignored if y is a matrix. If not a factor object, it is coerced to one.\n</li>\n<li>\nblocks: a vector giving the block for the corresponding elements of y if this is a vector; ignored if y is a matrix. If not a factor object, it is coerced to one.\n</li>\n<li>\nformula: a formula of the form a ~ b | c, where a, b and c give the data values and corresponding groups and blocks, respectively.\n</li>\n<li>\ndata: an optional matrix or data frame (or similar: see model.frame) containing the variables in the formula formula. By default the variables are taken from environment(formula).\n</li>\n<li>\nsubset: an optional vector specifying a subset of observations to be used.\n</li>\n<li>\nna.action: a function which indicates what should happen when the data contain NAs. Defaults to getOption(\"na.action\").\n</li>\n<li>\n...: further arguments to be passed to or from methods.\n</li>\n</ul>\n<b>Details</b></br>\nfriedman.test can be used for analyzing unreplicated complete block designs (i.e., there is exactly one observation in y for each combination of levels of groups and blocks) where the normality assumption may be violated.</br>\nThe null hypothesis is that apart from an effect of blocks, the location parameter of y is the same in each of the groups.\nIf y is a matrix, groups and blocks are obtained from the column and row indices, respectively. NA's are not allowed in groups or blocks; if y contains NA's, corresponding blocks are removed.</br>\n<b>Value</b><br/>\nA list with class \"htest\" containing the following components:<br/>\nstatistic: the value of Friedman's chi-squared statistic.<br/>\nparameter: the degrees of freedom of the approximate chi-squared distribution of the test statistic.<br/>\np.value: the p-value of the test.<br/>\nmethod:the character string \"Friedman rank sum test\".<br/>\ndata.name:a character string giving the names of the data.​<br/>\n<b>Examples</b><br/>\n<code> \nDataframe <- data.frame(Expenses=c(20,23,19,25,26), Sales=c(48,50,55,51,49), Gender=c('m','f','f','m','m'), Deptt=c('Accounts', 'HR', 'Sales','Marketing','IT'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Sales,Expenses)))<br/>\nResult_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>Package</b></br>\nstats</br>\n<b>Help</b></br>\nhelp(friedman.test, package=stats)\n"
    }
}