{
    "title": "Generalized Linear Model",
    "navigation": "GLZM",
    "modelname": "Model name",
    "dependent": "Dependent variable",
    "offset": "Offset",
    "weights": "Weights",
    "family": "Select a family and link function",
    "theta": "Specify a value of theta (applied for the negative binomial family only)",
    "help": {
        "title": "Generalized Linear Model",
        "r_help": "help(glm, package ='stats')",
        "body": "\n            <b>Description</b></br>\n            glm is used to fit generalized linear models, specified by giving a symbolic description of the linear predictor and a description of the error distribution.\n            <br/>\nNOTE 1: A textbox is provided to specify the initial value of theta, this applies only to the negative binomial family. If omitted a moment estimator after an initial fit using a Poisson GLM is used.<br/>\nThe initial theta that is computed is displayed in the output above the GLM summary table.<br/>\nNOTE 2: When specifying a variable containing weights, be aware that since we use the option na.exlude to build the model, all NA values are automatically removed from the dependent and independent variables.<br/> \nThis can cause a mismatch as NA values are NOT automatically removed from the weighting variable. <br/>\nIn this situation you will see the error variable lengths differ (found for (weights))<br/>\nTo address this error go to Variables>Missing Values>Remove NAs and select the dependent, independent variables and the weighting variable to remove missing values from and rebuild the model.<br/>\nNOTE 3: Dummy code factor variables, when using the negative.bimonial family, see Variables > Compute > Dummy Code. \n            <br/>\n            <b>Usage</b>\n            <br/>\n            <code> \n            glm(formula, family = gaussian, data, weights, subset,\n                na.action, start = NULL, etastart, mustart, offset,\n                control = list(...), model = TRUE, method = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            formula: an object of class \"formula\" (or one that can be coerced to that class): a symbolic description of the model to be fitted. The details of model specification are given under ‘Details’.\n            </li>\n            <li>\n            family: a description of the error distribution and link function to be used in the model. For glm this can be a character string naming a family function, a family function or the result of a call to a family function. For glm.fit only the third option is supported. (See family for details of family functions.)\n            </li>\n            <li>\n            data: an optional data frame, list or environment (or object coercible by as.data.frame to a data frame) containing the variables in the model. If not found in data, the variables are taken from environment(formula), typically the environment from which glm is called.\n            </li>\n            <li>\n            weights: an optional vector of ‘prior weights’ to be used in the fitting process. Should be NULL or a numeric vector.\n            </li>\n            <li>\n            subset: an optional vector specifying a subset of observations to be used in the fitting process.\n            </li>\n            <li>\n            na.action: a function which indicates what should happen when the data contain NAs. The default is set by the na.action setting of options, and is na.fail if that is unset. The ‘factory-fresh’ default is na.omit. Another possible value is NULL, no action. Value na.exclude can be useful.\n            </li>\n            </ul>\n            <b>Details</b><br/>\n            A typical predictor has the form response ~ terms where response is the (numeric) response vector and terms is a series of terms which specifies a linear predictor for response. For binomial and quasibinomial families the response can also be specified as a factor (when the first level denotes failure and all others success) or as a two-column matrix with the columns giving the numbers of successes and failures. A terms specification of the form first + second indicates all the terms in first together with all the terms in second with any duplicates removed.<br/>\n            <b>Value</b><br/>\n            An object of class \"glm\" is a list containing at least the following components:\n            <ul>\n            <li>\n            coefficients: a named vector of coefficients\n            </li>\n            <li>\n            residuals: the working residuals, that is the residuals in the final iteration of the IWLS fit. Since cases with zero weights are omitted, their working residuals are NA.\n            </li>\n            <li>\n            fitted.values: the fitted mean values, obtained by transforming the linear predictors by the inverse of the link function.\n            </li>\n            <li>\n            rank: the numeric rank of the fitted linear model.\n            </li>\n            <li>\n            family: the family object used.\n            </li>\n            <li>\n            linear.predictors: the linear fit on link scale.\n            deviance: up to a constant, minus twice the maximized log-likelihood. Where sensible, the constant is chosen so that a saturated model has deviance zero.\n            </li>\n            <li>\n            aic\t: A version of Akaike's An Information Criterion, minus twice the maximized log-likelihood plus twice the number of parameters, computed via the aic component of the family. For binomial and Poison families the dispersion is fixed at one and the number of parameters is the number of coefficients. For gaussian, Gamma and inverse gaussian families the dispersion is estimated from the residual deviance, and the number of parameters is the number of coefficients plus one. For a gaussian family the MLE of the dispersion is used so this is a valid value of AIC, but for Gamma and inverse gaussian families it is not. For families fitted by quasi-likelihood the value is NA.\n            </li>\n            </ul>\n            <b>Package</b></br>\nglm</br>\n<b>Help</b></br>\nhelp(glm, package ='stats')\n"
    }
}