{
    "title": "Hypergeometric Quantiles",
    "navigation": "Hypergeometric Quantiles",
    "varvals": "Enter probabilities separated by a comma. Example: 0.3,0.2,0.5",
    "m": "m (number of white balls in the urn)",
    "n": "n (number of black balls in the urn)",
    "k": "k (number of balls drawn from the urn)",
    "labelSig": "Significance level",
    "lowtail": "Lower tail",
    "uptail": "Upper tail",
    "help": {
        "title": "Hypergeometric Quantiles",
        "r_help": "help(qhyper, package=stats)",
        "body": "\n\n            <b>Description</b>\n            <br/>\n            Density, distribution function, quantile function and random generation for the hypergeometric distribution.\n            <br/>\n            <b>Usage</b>\n            <br/>\n            <code>\n                dhyper(x, m, n, k, log = FALSE)\n                <br/>\n                phyper(q, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qhyper(p, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rhyper(nn, m, n, k)\n                <br/>\n            </code>\n            <br/>\n            <b>Arguments</b>\n            <br/>\n            <ul>\n                <li>x, q : vector of quantiles representing the number of white balls drawn without replacement from an urn which contains both black and white balls.</li>\n                \n                \n                <li>m : the number of white balls in the urn.</li>\n                \n                \n                <li>n : the number of black balls in the urn.</li>\n                \n                \n                <li>k : the number of balls drawn from the urn.</li>\n                \n                \n                <li>p : probability, it must be between 0 and 1.</li>\n                \n                \n                <li>nn : number of observations. If length(nn) > 1, the length is taken to be the number required.</li>\n                \n                \n                <li>log, log.p : logical; if TRUE, probabilities p are given as log(p).</li>\n                \n                \n                <li>lower.tail : logical; if TRUE (default), probabilities are P[X ≤ x], otherwise, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Details</b>\n            <br/>\n            The hypergeometric distribution is used for sampling without replacement. The density of this distribution with parameters m, n and k (named Np, N-Np, and n, respectively in the reference below) is given by\n            <br/>\n            <code>\n                p(x) = choose(m, x) choose(n, k-x) / choose(m+n, k)\n                for x = 0, …, k.\n            </code>\n            <br/>\n            Note that p(x) is non-zero only for max(0, k-n) <= x <= min(k, m).\n            <br/>\n            With p := m/(m+n) (hence Np = N \times p in the reference's notation), the first two moments are mean\n            <br/>\n            <code>E[X] = μ = k p</code>\n            <br/>\n            and variance\n            <br/>\n            <code>Var(X) = k p (1 - p) * (m+n-k)/(m+n-1),</code>\n            <br/>\n            which shows the closeness to the Binomial(k,p) (where the hypergeometric has smaller variance unless k = 1).\n            <br/>\n            The quantile is defined as the smallest value x such that F(x) ≥ p, where F is the distribution function.\n            <br/>\n            If one of m, n, k, exceeds .Machine$integer.max, currently the equivalent of qhyper(runif(nn), m,n,k) is used, when a binomial approximation may be considerably more efficient.\n            <br/>\n            <br/><b>Value</b>\n            <br/>\n            dhyper gives the density, phyper gives the distribution function, qhyper gives the quantile function, and rhyper generates random deviates.\n            <br/>\n            Invalid arguments will result in return value NaN, with a warning.\n            <br/>\n            The length of the result is determined by n for rhyper, and is the maximum of the lengths of the numerical arguments for the other functions.\n            <br/>\n            The numerical arguments other than n are recycled to the length of the result. Only the first elements of the logical arguments are used.            \n"
    }
}