{
    "title": "Install R Package(s)",
    "navigation": "Install R Package(s)",
    "package_name": "Please enter the name(s) of one or more package(s) separated by comma",
    "instruction_text": "\nNOTE: R package names are case sensitive. You can install multiple package names by using , as a separator\nExample 1: foreign\nExample 2: foreign, car, MASS",
    "instruction_text1": "\nNOTE: You must have write access to the path slected below else relaunch the application by selecting the run as \nadministrator option",
    "repository": "Enter the URL of the CRAN repository, the default https://cloud.r-project.org/ installs from the CRAN mirror closest to you.",
    "label1": "Example 1: foreign",
    "label2": "NOTE: The R logo that displays on the menu bar is the copyright property of the R foundation",
    "installPath": "Select the R library path where the R package will get installed",
    "help": {
        "title": "Install R Package(s)",
        "r_help": "help(install.packages)",
        "body": "\n            <b>Description</b></br>\n            Install or Update one or more R packages to the selected library path.</br>\n            NOTE:</br>\n            1. We will install all packages that the specified packages depend on, import or link to</br>\n            2. If you are updating an existing package, you must restart the BlueSky Statistics application.</br>\n            3. We will load the newly installed/updated package after installation.</br>\n            4. By default, we will always install to the users personal R library on the local machine.</br>\n            5. If the same R package is installed to the personal and system library location (The system library location is the default installation location that contains the packages \n                we ship out of the box with BlueSky Statistics), we load the package from the personal location.</br>\n            <br/>\n            <b>Usage</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Path to the user or system library\", repos = \"Path to the repository containing the package\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            pkgs: character vector of the names of packages whose current versions should be downloaded from the repository specified.\n            </li>\n            <li>\n            lib: character vector giving the library path on the local machine where to install the package(s) to. We always default to the user personal library location.\n            </li>\n            <li>\n            repos: character vector, the base URL(s) of the repositories to use, e.g., the URL of a CRAN mirror such as \"https://cloud.r-project.org\".\n            </li>\n            <li>\n            BSkypackageinstall: This is a flag that the BlueSky Statistics application uses internally to signal that \n            the package is installed via the menu and to pass it through.\n            </li>\n            </ul>\n            <b>Value</b><br/>\n            Invisible NULL.<br/>\n            <b>Examples</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Package</b></br>\n            broom</br>\n            <b>Help</b></br>\n            For detailed help click on the R icon on the top right hand side of this dialog overlay\n\n"
    }
}