{
    "title": "Interval Plot",
    "navigation": "Interval Plot",
    "response": "Y variable, specify a numeric variable",
    "Fixed": "X variable - Specify one or more grouping (category) variable(s)",
    "confidenceInterval": "Specify a confidence interval value between 0 and 1 e.g. 0.95",
    "showIntervalValuesChk": "Show mean and interval values on the plot",
    "showGroupValuesonXaxisChk": "Show group values on the x axis",
    "supressIntervalsChk": "Show interval bars on the plot",
    "priintStatTableChk": "Print table with mean and interval values",
    "facet_xChk": "Segment the plot using the first group",
    "jitterPointsChk": "Spread (jitter effect) the overlapping/crowded points for a group",
    "groupColorLegendChk": "Show color legend per group combination",
    "chartTitle": "Enter a title",
    "x_title": "X axis label",
    "y_title": "Y axis label",
    "labelColor1": "Choose a color for the scatter point",
    "labelColor2": "Choose a color for the interval bar",
    "angleXaxis_text": "Angle to slant x-axis text values (default 0 for no slanting)",
    "angleYaxis_text": "Angle to slant y-axis text values (default 0 for no slanting)",
    "label1": "Horizontal lines",
    "yIntercept": "Enter comma separated Y intercept value(s) for the horizontal lines, e.g. 100, 200, 300",
    "hLineColor": "Select a color for line(s) and label(s)  (After color selection, click outside the control to apply)",
    "lineType": "Select the type of line",
    "horizontalLinelabel": "Specify comma separated labels (no enclosing quotes) for the horizontal line(s)",
    "horizontalLinelabel_angle_text": "Angle to slant horizontal line label text (default 0 for no slanting)",
    "label2": "Note: Greater values move the text lower, smaller values move the text higher",
    "addHoriRefLines": "Add reference lines",
    "xyLimits": "Y axis limits",
    "label5": "Specify a range for Y axis values",
    "rangeYValues": "Specify the Y axis range, for e.g. 0,100",
    "labelHori_HorizontalJustification": "Note: greater values place the text to the left, smaller values move the text to the right",
    "verticalJustification": "Control the vertical justification of the label",
    "hori_HorizontalJustification": "Control the horizontal justification of the label",
    "addlLabelHlineTextPositionOffset": "Additional adjustments to position the label text for horizontal lines",
    "horiMovementHReflineLabel": "Move text horzontally left or right - use any number with + or - sign",
    "nobreaklineHRefLabelandValueChk": "Check this box to remove the break line between label value and label text",
    "vertiMovementHReflineLabel": "Move text vertically up or down - use any number with + or - sign",
    "help": {
        "title": "Interval Plot",
        "r_help": "help(ggplot, package='ggplot2')",
        "body": "\n\t\t\t<b>Description</b></br>\n\t\t\tCreates a scatter plot, allows you to group points by one or more category (factor) variables \n\t\t\tYou can Optionally add or remove Intervals on the plot (mean and interval bounds of the mean per group)\n\t\t\tYou can Optionally add or remove a table showing the mean and interval bounds of the mean per group\n\t\t\tYou can add multiple horizontal reference lines with respective labels per reference line\n\t\t\t<br/>\n    "
    }
}