{
    "title": "Kaplan-Meier Estimation, One Group",
    "navigation": "Kaplan-Meier Estimation, One Group",
    "timevar": "Time to event or censor",
    "eventvar": "Event (1 = event, 0 = censor)",
    "label1": "Plot Type",
    "survivalradio": "Survival",
    "inciradio": "Failure",
    "printallest": "Estimate Table Including All Times",
    "printspecest": "Estimate Table for Specific Times",
    "spectimes": "Specify times as time1, time2, time3, etc. or as seq(1,5,by=1)",
    "styleoptions": "Style Options",
    "axisoptions": "Axis Options",
    "label12": "Click on the ? button on the top right of the dialog for details on sample datasets and the data format supported.",
    "titlebox": "Plot Title",
    "plottitlesizelabel": "Plot Title Size (5-50)",
    "themedropdown": "Plot Theme",
    "label2": "Number at Risk",
    "natriskchkbox": "Include Number at Risk",
    "risktableprop": "Risk Table Height (0-1)",
    "risktablepos": "Risk Table Position",
    "risktablevaluesize": "Risk Table Value Size (1-15)",
    "risktabletitlesize": "Risk Table Title Size (5-50)",
    "risktableaxislabelsize": "Risk Table Axis Label Size (5-50)",
    "risktableticklabelsize": "Risk Table Tick Label Size (5-50)",
    "risktableclean": "Remove Axes and Gridlines from Risk Table",
    "label3": "Line Options",
    "linesize": "Size (0-5)",
    "linecolor": "Color",
    "label4": "Confidence Interval",
    "cichkbox": "include 95% CI",
    "cistyle": "Style",
    "citransparency": "Transparency (0-1)",
    "label5": "Censored Times",
    "censorchkbox": "Include Censored Times",
    "censorsize": "Size (0-10)",
    "medsurvivalline": "Indicate Median Survival (h=horizontal, v=vertical)",
    "label6": "Survival Axis",
    "survaxislabel": "Label",
    "axislabelsize": "Axis Label Size (5-50)",
    "label7": "Scale",
    "defbutton": "proportion",
    "pctbutton": "percent",
    "survaxislimits": "Axis limits on proportion scale (0-1) - enter 'c(min, max)'",
    "survtickinc": "Tick Mark Increments (0-1)",
    "label8": "Time Axis",
    "timeaxislabel": "Label",
    "timeaxislimits": "Axis Limits (NULL is default, enter 'c(min,max)' to change e.g. 'c(0,20) )'",
    "timetickinc": "Tick Mark Increments (NULL is default, enter a number to change, min=0)",
    "ticklabelsize": "Axis Tick Mark Label Size (5-50)",
    "help": {
        "title": "Kaplan-Meier Estimation, One Group",
        "r_help": "help(ggsurvplot, package = 'survminer')",
        "body": "\n\t\t\tSee sample dataset in the install directory, the default location is at drive letter:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. The variable Followup_time should be entered as the time to event or censor and the variable Event should be entered as the Event (1 = event, 0 = censor).<br/>\n            This dataset is an updated version of the mockstudy dataset in the arsenal package.<br/><br/>\t\t\n            <b>Kaplan-Meier survival curves</b>\n            <br/>\n            <br/>\n            These are used to estimate the cumulative risk of not having some event (or conversely, having some event) over a length of time after the start of follow-up for that event (or time zero).  Subjects need to be at risk for the event starting at time zero.\n            <br/>\n            <br/>\n            <b>Time:</b> Length of time to either an event, if the event occurred, or last follow-up for that event, if the event did not occur, for each subject\n            <br/><br/>\n            <b>Event:</b> Numeric indicator of whether or not the event occurred (1=event, 0=censor) for each subject\n            <br/><br/>\n            <b>Plot Type:</b> Whether you want to plot the probability of not having the event (survival) or having the event (failure)\n            <br/><br/>\n            <b>Estimate Table Including All Times:</b> Option to include a table that has the survival and event estimate probabilities for each observed time in the dataset\n            <br/>\n            <br/>\n\t\t\t<b>Estimate Table for Specific Times:</b> Option to include a table that has the survival estimate probabilities for a user-selected set of times.\n\t\t\t<br/><br/>\n\t\t\t<b>Specify times as time1, time2, time3, etc. or as seq(1,5,by=1):</b> These are the specific times that will be included in the table for specific times.  They can be specified individually with commas, or as a sequence of evenly-spaced values.\n\t\t\t<br/><br/>\n            Tables are output with the sample size, the number of subjects with the event, the median survival time (if defined), the restricted mean survival time, and the median follow-up time.  The median follow-up time is computed using the reverse Kaplan-Meier estimator, which treats true events as censored observations and true censored observations as events.  Thus, the \"event\" in this estimator is \"following the subjects for as long as the study could\".\n            <br/>\n            A table of Kaplan-Meier survival and event estimates is provided at each observed time in the dataset, with 95% confidence intervals. \n            <br/>\n            <br/>\n            <b>Required Packages:</b> survival, broom, survminer, dplyr, arsenal, ggthemes \n            <br/>\n            <br/>\n            <br/>           \n            <b>Style Options</b>\n            <br/>\n            <br/>\n            <b>Plot Title:</b> Title of the plot; delete all text for no title\n            <br/><br/>\n\t\t\t<b>Plot Title Size:</b> Size of the plot title.\n\t\t\t<br/><br/>\n            <b>Plot Theme:</b> General style of the plot\n            <br/><br/>\n            <b>Include Number at Risk:</b> Optionally, include a table for the number of subjects still at risk over time at the bottom of the plot.  <b>Risk Table Position</b> specifies whether you want the table outside the axes or inside the axes.  The <b>Risk Table Height</b> controls the proportion of the plotting area that the table will take up.  This option is ignored when the risk table position is inside the axes. \n\t\t\tThe <b>Risk Table Value Size</b> controls the size of the numbers at risk. The <b>Risk Table Title Size</b> controls the size of the title for the number at risk table.\n\t\t\tThe <b>Risk Table Axis Label Size</b> controls the size of the axis labels.\n\t\t\tThe <b>Risk Table Tick Label Size</b> controls the size of the tick mark labels for the times in the number at risk table. If it's desired to remove all axes and gridlines \n\t\t\tfrom the number at risk table, the <b>Remove Axes and Gridlines from Risk Table</b> option can be checked.  This will only include the numbers at risk in the table.\n            <br/>\n            <br/>\n            <b>Line Options:</b>\n            <b>Size</b> controls the thickness and <b>Color</b> controls the color of the plotted line.  One can optionally include a 95% confidence interval for the estimates in either a <b>ribbon</b> (shaded area) or <b>step</b> (line) format.  <b>Transparency</b> controls how dark the ribbon is and is ignored when the step option is selected.  <b>Censored Times</b> (when subjects become no longer at risk for the event) can be indicated on the line with \"+\" symbols.  The size of the \"+\" symbols can be adjusted.  The <b>Indicate Median Survival</b> option will include horizontal or vertical lines at the time when 50% of the subjects are estimated to have had the event.  The median time is undefined if the survival curve does not cross 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Axis Options</b>\n            <br/> \n            <br/> \n            The <b>Label</b> option specifies the text label for the axis.  The <b>Axis Limits</b> specifies the minimum and maximum values of the axis.  The <b>Tick Mark Increments</b> option controls the spacing of the tick marks on the axis.  The increments on the time axis also control the times for the optional number at risk table.\n            <br/> \n            The survival axis <b>Scale</b> option specifies whether you want the estimates to be on a proportion (0-1) or percent (0-100) scale.\n\t\t\t<br/><br/>\n\t\t\t<b>Axis Label Size:</b>  This controls the size of both the survival and time axis label sizes.\n\t\t\t<br/><br/>\n\t\t\t<b>Axis Tick Mark Label Size:</b>  This controls the size of both the survival and time axis tick mark label sizes.\n"
    }
}