{
    "title": "Kruskal-Wallis Rank Sum Test",
    "navigation": "Kruskal-Wallis Test",
    "tvarbox1": "Response variable",
    "tvarbox2": "Factor variable",
    "label1": "Estimation method",
    "default": "Asymptotic",
    "exact": "Exact NOTE: factor variable must have exactly 2 levels or else an error will display",
    "normal": "Monte Carlo",
    "header": "NOTE: When selecting the exact estimation method, the factor variable must have exactly 2 levels else an error will display",
    "padjust": "Multiple comparison adjustment",
    "ties": "Options for handling ties",
    "simulations": "Enter the number of simulations",
    "help": {
        "title": "Kruskal-Wallis Rank Sum Test",
        "r_help": "help(kruskal.test, package=stats)",
        "body": "\n<b>Description</b></br>\nPerforms a Kruskal-Wallis rank sum test.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nkruskal.test(x, ...)\n## Default S3 method:\nkruskal.test(x, g, ...)\n## S3 method for class 'formula'\nkruskal.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nArguments\nx: a numeric vector of data values, or a list of numeric data vectors. Non-numeric elements of a list will be coerced, with a warning.\n</li>\n<li>\ng: a vector or factor object giving the group for the corresponding elements of x. Ignored with a warning if x is a list.\n</li>\n<li>\nformula: a formula of the form response ~ group where response gives the data values and group a vector or factor of the corresponding groups.\n</li>\n<li>\ndata: an optional matrix or data frame (or similar: see model.frame) containing the variables in the formula formula. By default the variables are taken from environment(formula).\n</li>\n<li>\nsubset: an optional vector specifying a subset of observations to be used.\n</li>\n<li>\nna.action: a function which indicates what should happen when the data contain NAs. Defaults to getOption(\"na.action\").\n</li>\n<li>\n...: further arguments to be passed to or from methods.\n</li>\n</ul>\n<b>Details</b></br>\nkruskal.test performs a Kruskal-Wallis rank sum test of the null that the location parameters of the distribution of x are the same in each group (sample). The alternative is that they differ in at least one.</br>\nIf x is a list, its elements are taken as the samples to be compared, and hence have to be numeric data vectors. In this case, g is ignored, and one can simply use kruskal.test(x) to perform the test. If the samples are not yet contained in a list, use kruskal.test(list(x, ...)).</br>\nOtherwise, x must be a numeric data vector, and g must be a vector or factor object of the same length as x giving the group for the corresponding elements of x.</br>\n<b>Value</b><br/>\nA list with class \"htest\" containg the following components:<br/>\nstatistic: the Kruskal-Wallis rank sum statistic<br/>\nparameter: the degrees of freedom of the approximate chi-squared distribution of the test statistic<br/>\np.value: the p-value of the test<br/>\nmethod: the character string \"Kruskal-Wallis rank sum test\"<br/>\ndata.name: a character string giving the names of the data<br/>\n<b>Description</b></br>\nMultiple Comparison Adjustment</br>\nThe adjustment methods include the Bonferroni correction (\"bonferroni\") in which the p-values are multiplied by the number of comparisons. Less conservative corrections are also included by Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), Hommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" or its alias \"fdr\"), and Benjamini & Yekutieli (2001) (\"BY\"), respectively. A pass-through option (\"none\") is also included. The set of methods are contained in the p.adjust.methods vector for the benefit of methods that need to have the method as an option and pass it on to p.adjust.</br>\nThe first four methods are designed to give strong control of the family-wise error rate. There seems no reason to use the unmodified Bonferroni correction because it is dominated by Holm's method, which is also valid under arbitrary assumptions.</br>\nHochberg's and Hommel's methods are valid when the hypothesis tests are independent or when they are non-negatively associated (Sarkar, 1998; Sarkar and Chang, 1997). Hommel's method is more powerful than Hochberg's, but the difference is usually small and the Hochberg p-values are faster to compute.</br>\nThe \"BH\" (aka \"fdr\") and \"BY\" method of Benjamini, Hochberg, and Yekutieli control the false discovery rate, the expected proportion of false discoveries amongst the rejected hypotheses. The false discovery rate is a less stringent condition than the family-wise error rate, so these methods are more powerful than the others.</br>\n</br>\nTest Method for pairwise group comparisons:</br>\nDefault: an exact p-value is computed if the samples contain less than 50 finite values and there are no ties.  Otherwise, a normal approximation is used.</br>\nExact: an exact p-value is computed; not recommended for large sample sizes due to computation time</br>\nNormal Approximation: p-values using a normal approximation are computed</br>\nWith Continuity Correction: p-values using a normal approximation with a continuity correction are computed </br>\n<b>Package</b></br>\nstats</br>\n<b>Help</b></br>\nhelp(kruskal.test, package=stats)\n"
    }
}