{
    "title": "Multidimensional Scaling",
    "navigation": "Multidimensional Scaling",
    "betRows": "Between rows",
    "betVariables": "Between variables",
    "textSize": "Text size",
    "textPos": "Text position",
    "destination": "Select variables",
    "maxDimensions": "Maximum dimensions",
    "label1": "Distance matrix",
    "computationMethod": "Computation method",
    "power": "Power of Minkowski distance",
    "dispDist": "Display distance matrix",
    "saveDims": "Save dimensions to a new dataset",
    "datasetName": "Optionally enter a dataset name to save dimensions to",
    "label2": "Advanced options",
    "scalingMethod": "Scaling method",
    "maxIter": "Maximum number of iterations (*Not applicable for classical metric)",
    "plotResults": "Plot results",
    "help": {
        "title": "Multidimensional Scaling",
        "r_help": "help(cmdscale, package=stats)",
        "body": "\n<b>Description</b></br>\nThere are different types of MDS algorithms, including</br>\n<b>Classical multidimensional scaling</b></br>\nPreserves the original distance metric, between points, as well as possible. That is the fitted distances on the MDS map and the original distances are in the same metric. Classic MDS belongs to the so-called metric multidimensional scaling category.</br>\nIt's also known as principal coordinates analysis. It's suitable for quantitative data.</br></br>\n<b>Non-metric multidimensional scaling</b></br>\nIt's also known as ordinal MDS. Here, it's not the metric of a distance value that is important or meaningful, but its value in relation to the distances between other pairs of objects.</br>\nOrdinal MDS constructs fitted distances that are in the same rank order as the original distance. For example, if the distance of apart objects 1 and 5 rank fifth in the original distance data, then they should also rank fifth in the MDS configuration.</br>\nIt's suitable for qualitative data.</br>\nWe use the following R functions</br>\ncmdscale() [stats package]: Compute classical (metric) multidimensional scaling.</br>\nisoMDS() [MASS package]: Compute Kruskal's non-metric multidimensional scaling (one form of non-metric MDS).</br>\nsammon() [MASS package]: Compute sammon's non-linear mapping (one form of non-metric MDS).</br>\nAll these functions take a distance object as the main argument and k is the desired number of dimensions in the scaled output. By default, they return two dimension solutions, but we can change that through the parameter k which defaults to 2.</br>\n<br/>\nOptions to display the distance matrix, save the dimensions to a new dataset and plot the dimensions can be selected. </br>\nWhen classical metric scaling method is selected, we display the eigen values, goodness of fit statistic and the screeplot. For other scaling methods we display the stress value.\n<b>Help</b></br>\nFor detailed help run the following commands help(dist, package=\"stats\") or help(cmdscale, package ='stats') or help(isoMDS, package = \"MASS\") or help(sammon, package =\"MASS\") in the BioStat Prime R editor.           \n<br/>\n<br/>\n"
    }
}