{
    "title": "Wilcoxon Test, paired samples",
    "navigation": "Wilcoxon Test, paired samples",
    "tvarbox1": "First Variable (one)",
    "tvarbox2": "Second Variable (one)",
    "label1": "Aternative Hypothesis",
    "twosided": "Difference != mu",
    "greater": "Difference > mu",
    "less": "Difference < mu",
    "label2": "Test Method",
    "default": "Default",
    "exact": "Exact",
    "normal": "Normal Approximation",
    "contingency": "Normal Approximation (Continuity correction)",
    "textbox1": "Confidence interval",
    "textbox2": "Null hypothesis (mu)",
    "help": {
        "title": "Wilcoxon Test, paired samples",
        "r_help": "help(wilcox.test, package=stats)",
        "body": "\n<b>Description</b></br>\nPerforms one- and two-sample Wilcoxon tests on vectors of data; the latter is also known as ‘Mann-Whitney’ test.\n<br/>\n<b>Usage</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Default S3 method:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## S3 method for class 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: numeric vector of data values. Non-finite (e.g., infinite or missing) values will be omitted.\n</li>\n<li>\ny: an optional numeric vector of data values: as with x non-finite values will be omitted.\n</li>\n<li>\nalternative: a character string specifying the alternative hypothesis, must be one of \"two.sided\" (default), \"greater\" or \"less\". You can specify just the initial letter.\n</li>\n<li>\nmu: a number specifying an optional parameter used to form the null hypothesis. See ‘Details’.\n</li>\n<li>\npaired: a logical indicating whether you want a paired test.\n</li>\n<li>\nexact: a logical indicating whether an exact p-value should be computed.\n</li>\n<li>\ncorrect: a logical indicating whether to apply continuity correction in the normal approximation for the p-value.\n</li>\n<li>\nconf.int: a logical indicating whether a confidence interval should be computed.\n</li>\n<li>\nconf.level: confidence level of the interval.\n</li>\n<li>\nformula: a formula of the form lhs ~ rhs where lhs is a numeric variable giving the data values and rhs a factor with two levels giving the corresponding groups.\n</li>\n<li>\ndata: an optional matrix or data frame (or similar: see model.frame) containing the variables in the formula formula. By default the variables are taken from environment(formula).\n</li>\n<li>\nsubset: an optional vector specifying a subset of observations to be used.\n</li>\n<li>\nna.action: a function which indicates what should happen when the data contain NAs. Defaults to getOption(\"na.action\").\n</li>\n<li>\n...: further arguments to be passed to or from methods.\n</li>\n</ul>\n<b>Details</b></br>\nThe formula interface is only applicable for the 2-sample tests.</br>\nIf only x is given, or if both x and y are given and paired is TRUE, a Wilcoxon signed rank test of the null that the distribution of x (in the one sample case) or of x - y (in the paired two sample case) is symmetric about mu is performed.</br>\nOtherwise, if both x and y are given and paired is FALSE, a Wilcoxon rank sum test (equivalent to the Mann-Whitney test: see the Note) is carried out. In this case, the null hypothesis is that the distributions of x and y differ by a location shift of mu and the alternative is that they differ by some other location shift (and the one-sided alternative \"greater\" is that x is shifted to the right of y).</br>\nBy default (if exact is not specified), an exact p-value is computed if the samples contain less than 50 finite values and there are no ties. Otherwise, a normal approximation is used.</br>\nOptionally (if argument conf.int is true), a nonparametric confidence interval and an estimator for the pseudomedian (one-sample case) or for the difference of the location parameters x-y is computed. (The pseudomedian of a distribution F is the median of the distribution of (u+v)/2, where u and v are independent, each with distribution F. If F is symmetric, then the pseudomedian and median coincide. See Hollander & Wolfe (1973), page 34.) Note that in the two-sample case the estimator for the difference in location parameters does not estimate the difference in medians (a common misconception) but rather the median of the difference between a sample from x and a sample from y.</br>\nIf exact p-values are available, an exact confidence interval is obtained by the algorithm described in Bauer (1972), and the Hodges-Lehmann estimator is employed. Otherwise, the returned confidence interval and point estimate are based on normal approximations. These are continuity-corrected for the interval but not the estimate (as the correction depends on the alternative).</br>\nWith small samples it may not be possible to achieve very high confidence interval coverages. If this happens a warning will be given and an interval with lower coverage will be substituted.</br>\n<b>Value</b><br/>\nA list with class \"htest\" containing the following components:\nstatistic: the value of the test statistic with a name describing it.</br>\nparameter: the parameter(s) for the exact distribution of the test statistic.</br>\np.value: the p-value for the test.</br>\nnull.value: the location parameter mu.</br>\nalternative: a character string describing the alternative hypothesis.</br>\nmethod: the type of test applied.</br>\ndata.name: a character string giving the names of the data.</br>\nconf.int: a confidence interval for the location parameter. (Only present if argument conf.int = TRUE.)</br>\nestimate: an estimate of the location parameter. (Only present if argument conf.int = TRUE.)</br>\n<b>Package</b></br>\nstats</br>\n<b>Help</b></br>\nhelp(wilcox.test, package=stats)\n    "
    }
}