{
    "title": "Parameter Level Estimates",
    "navigation": "Parameter Estimates",
    "label1": "Models of the following classes are supported, classes are listed in parenthesis below ",
    "label2": "Linear models (lm), Generalized linear models (glm), Multinomial log-linear (multinom), Quantile regression (rq), Robust linear regression (rlm), Survival curve object (survfit), Linear mixed effects model (lme), Proportional hazards regression object (coxph), Parametric survival regression model (survreg), Ordered logistic/Probit regression (polr), Factor analysis (factanal), Lasso and Elastic-net regularized generalized linear models (glmnet)",
    "modelselector1": "Select a model",
    "help": {
        "title": "Parameter Level Estimates",
        "r_help": "help(tidy, package ='broom')",
        "body": "\n                <b>Description</b></br>\nDisplays parameter estimates of the selected model\n<br/>\n<b>Usage</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: model or other R object to convert to single-row data frame\n</li>\n</ul>\n<b>Details</b></br>\nDisplays parameter estimates of the following models</br>\nLinear models (model class lm)</br>\nGeneralized linear models (model class glm)</br>\nMultinomial Log-Linear Models (model class multinom)</br>\nOrdered logistic or Probit Regression (model class polr)</br>\nLasso and Elastic-Net Regularized Generalized Linear Models (model class glmnet)</br>\nRobust linear regression (model class rlm)</br>\nQuantile Regression (model class rq)</br>\nlinear mixed effects model (lme)</br>\nProportional hazards regression object (coxph)</br>\nParametric survival regression model (survreg)</br>\nFactor analysis (factanal)</br>\n<b>Value</b></br>\nA tibble::tibble() with information about model components.</br>\nterm: The name of the regression term.</br>\nestimate: The estimated value of the regression term.</br>\nstd.error: The standard error of the regression term.</br>\nstatistic: The value of a statistic, almost always a T-statistic, to use in a hypothesis that the regression term is non-zero.</br>\np.value: The two-sided p-value associated with the observed statistic.</br>\nconf.low: The low end of a confidence interval for the regression term. Included only if conf.int = TRUE.</br>\nconf.high: The high end of a confidence interval for the regression term. Included only if conf.int = TRUE.</br>\nIf the linear model is an mlm object (multiple linear model), there is an additional column:</br>\nresponse: Which response column the coefficients correspond to (typically Y1, Y2, etc)</br>\n<b>Package</b></br>\nbroom</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command in the R syntax editor help(tidy, package ='broom')\n"
    }
}