{
    "title": "Pareto Chart",
    "navigation": "Pareto Chart",
    "label1": "Three options - Long format (default) i.e. defects and counts in vertical columns, Wide format i.e. defects as column names and counts as row, and Compute counts from Raw data",
    "selectLongRad": "Option 1: Long format - choose defects category and defect counts",
    "selectWideRad": "Option 2: Wide format - Columns names will be used as defects category and 1st row (default) will be used as counts",
    "selectRawRad": "Option 3: Raw data - compute counts to plot pareto chart",
    "rownumForCounts": "Row number (default 1st row) to be used for counts",
    "defects": "Variable (e.g. categories) to plot",
    "counts": "(Optional) Variable to use as counts to plot",
    "grouping": "(Optional) Grouping variable to plot multiple Pareto plots side-by-side",
    "uniformBarOrderChk": "Plot bars in the same alphabetical order (across groups). Uncheck for ordering bars based on descending frequency (within each group)",
    "grouping2": "(Optional) A grouping variable to plot multiple Pareto side-by-side",
    "rawVariable": "Variable (e.g. categories) with raw data",
    "mainTitle": "Enter a chart title",
    "xlab": "X axis label",
    "ylab": "Y axis label",
    "ylab2": "Y axis label on the right Y axis",
    "RefCumFreqLine": "Draw a horizontal reference line for a specified cumulative % (e.g., type 80 for 80%) - leave blank for no line",
    "legends": "Show Legends and if so, position of Legends (default is right)",
    "percentStep": "Percentage step to be used as tickmarks for the second y-axis on the right side",
    "digits": "Number of decimal points for stat table",
    "help": {
        "title": "Pareto Chart",
        "r_help": "help(pareto.chart, package = qcc)",
        "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tpareto.chart function to create a table of statistics and plot a Pareto chart\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFor the detail help - use R help(pareto.chart, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tTo try this, you may use the sample dataset file called defects_frequency_pareto_chart.xlsx. Open the file in the data grid with file open menu\n\t\t\t\t<br/>\n\t\t\t"
    }
}