{
    "title": "Pie Chart",
    "suppressLabels": "Suppress all labels for counts and percentages",
    "optionsLabels": "Options for labels",
    "suppressThreshold": "Suppress labels for counts and percentage below the specified threshold percentage",
    "radius": "Specify a radius to display labels (increasing the radius moves labels outwards)",
    "radiusNote": "Note: Above option does not apply when the option to display concentric circles is selected.",
    "navigation": "Pie Chart",
    "concentricCircles": "Display concentric circles (Applies only when X axis variable specified)",
    "x": "X axis, specify factor variable(s)",
    "y": "Y variable, specify a numeric variable",
    "fill": "Fill, specify a factor variable",
    "alpha": "Opacity (0-1)",
    "width": "Width",
    "rdgrp1": "Fill proportions",
    "flip": "Flip axis",
    "barcolor": "Bar color (After color selection, click outside the control to apply)",
    "specify_a_title": "Enter a title",
    "x_title": "X axis label",
    "y_title": "Y axis label",
    "Facetrow": "Facet row",
    "Facetcolumn": "Facet column",
    "Facetwrap": "Facet wrap",
    "Facetscale": "Facet scale",
	"facets_lbl" : "Facets",
    "help": {
        "title": "Pie Chart",
        "r_help": "help(coord_polar, package='ggplot2')",
        "body": "\n            <b>Description</b></br>\n            A pie chart (or a circle chart) is a circular statistical graphic, which is divided into slices to illustrate numerical proportion. In a pie chart, the arc length of each slice (and consequently its central angle and area), is proportional to the quantity it represents. The quantity can be represented as a count or percentage.\n            Facets can be optionally created by specifying a factor variable. You can also optionally specify themes, and specify a title and labels for the x and y axis.</br>\n            When you specify multiple x variables, we create a separate pie chart for each x variable. </br>\n            Radius allows you to control the placement of the labels. A radius of 1 places the labels in the center of the pie, a radius of 1.6 places the labels outside the pie.</br>\n            The outer light grey circle represents the count or total. See text at the bottom of the pie chart for details.\n            <br/>\n            <b>Usage</b>\n            <br/>\n            <code>\n            #You can create a pie chart for a single factor variable, the pies will represent the counts of each level of the factor level. Here the factor variable will correspond to the fill<br/>\n            ggplot(data=penguins, aes(x='', fill=species )) +\n\tgeom_bar( alpha=1,width=1,) +\n\tcoord_polar(\"y\") +\n\tlabs(  title= \"Pie chart with fill: species\") +\n\tylab(\"\") + \n\txlab(\"Count\")</br></br>\n            #You can create a pie chart  by specifying a scale/numeric variable as the y variable,  and filling the slices of the pie by a factor variable. The pies are filled by summing the values of the y variable for each  level of the factor variable, see example below<br/>\n            ggplot(data = penguins, aes(x = \"\", y = bill_length_mm, fill = species)) + geom_bar(alpha = 1,\n                width = 0.9, stat = \"identity\") + coord_polar(\"y\") </br></br>\n    #You can specify a x variable, y variable and fill. The slices are created for every level of the x variable and filled by the sum of the values of the y variable for each level of the variable specified in the fill.<br/>\n    ggplot(data = penguins, aes(x = island, y = bill_length_mm, fill = species)) + geom_bar(alpha = 1,\n        width = 0.9, stat = \"identity\")<br/><br/>\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data: The default dataset​\n            </li>\n            <li>\n            aes():    Generate aesthetic mappings that describe how variables in the data are mapped to visual properties (aesthetics) of geoms.​\n            </li>\n            <li>\n            x: (Optional) A factor/categorical variable. The length of the bar corresponds to the counts of each level of the factor variable.​\n            </li>\n            <li>\n            Y: (Optional) a numeric variable\n            </li>\n            <li>\n            fill: (Optional)An optional factor/categorical variable to group the counts of the levels in x: (see above)​\n            </li>\n            <li>\n            geom_bar(): Creates the bar graph, position =\"fill\" fills the bar with a percentage of each grouping level.​\n            </li>\n            <li>\n            Coor_polar(): The polar coordinate system is most commonly used for pie charts, which are a stacked bar chart in polar coordinates.\n            </li>\n            <li>\n            Labs(): Change axis labels and legend titles(This is optional)​\n            </li>\n            <li>\n            facet_grid(): Lay out panels in a grid(This is optional)​\n            </li>\n            <li>\n            theme_calc(): Specifies the calculator theme(This is optional)​\n            </li>\n            <li>\n            coord_flip(): Flip axis(This is optional)​\n            </li>\n            <li>\n            alpha: Controls opacity, takes values between 0-1. 1 means no opacity.\n            </li>\n            </ul>\n            <b>Package</b></br>\n            ggplot2;ggthemes;</br>\n            <b>Help</b></br>\n            help(coord_polar, package=ggplot2)</br>\n            Other: Click the R Help button to get detailed R help. You can also enter help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​            \n    "
    }
}