{
    "title": "Sample Size, Precision of an Odds Ratio",
    "navigation": "Odds Ratio",
    "howtouse": "Specify either the sample size or the confidence interval width and the other will be computed",
    "n1": "Group 1 Sample Size",
    "width": "Confidence Interval Width",
    "ratio": "Ratio of Group 2 to Group 1 Sample Size",
    "prop1": "Group 1 Outcome Proportion",
    "prop2": "Group 2 Outcome Proportion",
    "conflevel": "Confidence Level (0-1)",
    "method": "Confidence Interval Method",
    "help": {
        "title": "Sample Size, Precision of an Odds Ratio",
        "r_help": "help(prec_or, package ='presize')",
        "body": "\nThis is an assessment of sample size for an odds ratio based on confidence interval width.  It computes the sample size or the confidence interval width when the user \nspecifies the other.\n<br/><br/>\n<b>Group 1 Sample Size:</b> Specify the number of subjects in group 1\n<br/><br/>\n<b>Confidence Interval Width:</b> Specify the confidence interval width desired.  The width of a confidence interval is a measure of precision of an estimate and is the upper bound minus the lower bound.\n<br/><br/>\n<b>Ratio of Group 2 to Group 1 Sample Size:</b> Specify the ratio of the group 2 sample size to the group 1 sample size.  A value of 1 means equal sample sizes.\n<br/><br/>\n<b>Group 1 Outcome Proportion:</b> Specify the proportion of subjects in group 1 with the 'positive' outcome\n<br/><br/>\n<b>Group 2 Outcome Proportion:</b> Specify the proportion of subjects in group 2 with the 'positive' outcome\n<br/><br/>\nNote that the odds ratio will correspond to the odds of the 'positive' outcome in group 1 relative to the odds of the 'positive' outcome in group 2.\n<br/><br/>\n<b>Confidence Level:</b> Specify the desired level of the confidence interval\n<br/><br/>\n<b>Confidence Interval Method:</b> Specify the type of adjusted confidence interval to use. Woolf (woolf), Gart (gart), and Independence-smoothed logit (indip_smooth) belong to \na general family of adjusted confidence intervals, adding 0 (woolf) to each cell, 0.5 (gart) to each cell, or an adjustment for each cell based on observed data \n(independence-smoothed). In gart and indip_smooth, estimate of the CI is not possible if p1 = 0, in which case the OR becomes 0, but the lower level of the CI is > 0. Further, \nif p1 = 1 and p2 < 1, or if p1 > 0 and p2 = 0, the OR becomes ∞, but the upper limit of the CI is finite. For the approximate intervals, gart and indip_smooth are the recommended \nintervals (Fagerland et al. 2011).\n<br/><br/>\n<b>Required R Packages:</b> presize\n\t\t\t"
    }
}