{
    "title": "Single Sample Proportion Test",
    "navigation": "Single sample",
    "tvarbox1": "Numeric or factor with 2 levels/values only",
    "label1": "Alternative hypothesis",
    "test1": "Proportion != Hypothesized proportion",
    "test2": "Proportion > Hypothesized proportion",
    "test3": "Proportion < Hypothesized proportion",
    "txtbox1": "Confidence level",
    "txtbox2": "Null hypothesis (Hypothesized proportion in range 0-1)",
    "chkbox1": "With continuity correction",
    "dataInCols": "One or more variables contain samples",
    "summarized": "Summarized data",
    "noOfEvents": "No of events",
    "noOfTrials": "No of trials",
    "method": "Select method",
    "help": {
        "title": "Single Sample Proportion Test",
        "r_help": "help(prop.test, package=stats)",
        "body": "\n<b>Description</b></br>\nprop.test can be used for testing the null that the proportions (probabilities of success) in several groups are the same, or that they equal certain given values.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: a vector of counts of successes, a one-dimensional table with two entries, or a two-dimensional table (or matrix) with 2 columns, giving the counts of successes and failures, respectively.\n</li>\n<li>\nn: a vector of counts of trials; ignored if x is a matrix or a table.\n</li>\n<li>\np: a vector of probabilities of success. The length of p must be the same as the number of groups specified by x, and its elements must be greater than 0 and less than 1.\n</li>\n<li>\nalternative: a character string specifying the alternative hypothesis, must be one of \"two.sided\" (default), \"greater\" or \"less\". You can specify just the initial letter. Only used for testing the null that a single proportion equals a given value, or that two proportions are equal; ignored otherwise.\n</li>\n<li>\nconf.level: confidence level of the returned confidence interval. Must be a single number between 0 and 1. Only used when testing the null that a single proportion equals a given value, or that two proportions are equal; ignored otherwise.\n</li>\n<li>\ncorrect: a logical indicating whether Yates' continuity correction should be applied where possible.\n</li>\n</ul>\n<b>Details</b></br>\nOnly groups with finite numbers of successes and failures are used. Counts of successes and failures must be nonnegative and hence not greater than the corresponding numbers of trials which must be positive. All finite counts should be integers.</br>\nIf p is NULL and there is more than one group, the null tested is that the proportions in each group are the same. If there are two groups, the alternatives are that the probability of success in the first group is less than, not equal to, or greater than the probability of success in the second group, as specified by alternative. A confidence interval for the difference of proportions with confidence level as specified by conf.level and clipped to [-1,1] is returned. Continuity correction is used only if it does not exceed the difference of the sample proportions in absolute value. Otherwise, if there are more than 2 groups, the alternative is always \"two.sided\", the returned confidence interval is NULL, and continuity correction is never used.</br>\nIf there is only one group, then the null tested is that the underlying probability of success is p, or .5 if p is not given. The alternative is that the probability of success is less than, not equal to, or greater than p or 0.5, respectively, as specified by alternative. A confidence interval for the underlying proportion with confidence level as specified by conf.level and clipped to [0,1] is returned. Continuity correction is used only if it does not exceed the difference between sample and null proportions in absolute value. The confidence interval is computed by inverting the score test.</br>\nFinally, if p is given and there are more than 2 groups, the null tested is that the underlying probabilities of success are those given by p. The alternative is always \"two.sided\", the returned confidence interval is NULL, and continuity correction is never used.</br>\n<b>Value</b><br/>\nA list with class \"htest\" containing the following components:</br>\nstatistic: the value of Pearson's chi-squared test statistic.</br>\nparameter: the degrees of freedom of the approximate chi-squared distribution of the test statistic.</br>\np.value: the p-value of the test.</br>\nestimate: a vector with the sample proportions x/n.</br>\nconf.int: a confidence interval for the true proportion if there is one group, or for the difference in proportions if there are 2 groups and p is not given, or NULL otherwise. In the cases where it is not NULL, the returned confidence interval has an asymptotic confidence level as specified by conf.level, and is appropriate to the specified alternative hypothesis.</br>\nnull.value: the value of p if specified by the null, or NULL otherwise.</br>\nalternative: a character string describing the alternative.</br>\nmethod: a character string indicating the method used, and whether Yates' continuity correction was applied.</br>\ndata.name: a character string giving the names of the data.</br>\n<b>Package</b></br>\nstats</br>\n<b>Help</b></br>\nhelp(prop.test, package ='stats')\n"
    }
}