{
    "title": "Random Forest",
    "label1": "Random forest can be run in supervised or unsupervised node. To run in unsupervised mode, don't specify a dependent variable.",
    "navigation": "Random Forest",
    "modelname": "Enter model name",
    "dependentvar": "Dependent variable",
    "independentvars": "Independent variable(s)",
    "ntree": "No. of trees",
    "mtry": "mtry",
    "proximity": "Proximity:",
    "newds": "Specify dataset name to store proximity:",
    "predictor": "Save predicted values:",
    "newcolname": "Specify new column name for predicted values:",
    "help": {
        "title": "Random Forest",
        "r_help": "help(randomForest,package='randomForest')",
        "body": "\n                <b>Description</b></br>\nrandomForest implements Breiman's random forest algorithm (based on Breiman and Cutler's original Fortran code) for classification and regression. It can also be used in unsupervised mode for assessing proximities among data points.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nrandomForest(x, y=NULL,  ntree=500, importance=FALSE, proximity, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx : A data frame or a matrix of predictors, or a formula describing the model to be fitted (for the print method, an randomForest object).\n</li>\n<li>\ny: A response vector. If a factor, classification is assumed, otherwise regression is assumed. If omitted, randomForest will run in unsupervised mode.\n</li>\n<li>\nntree : Number of trees to grow. This should not be set to too small a number, to ensure that every input row gets predicted at least a few times.\n</li>\n<li>\nimportance : Should importance of predictors be assessed? \n</li>\n<li>\nproximity : Should proximity measure among the rows be calculated?\n</li>\n<li>\n... : optional parameters to be passed to the low level function randomForest.default.\n</li>\n</ul>\n<b>Value</b><br/>\nAn object of class randomForest, which is a list with the following components:<br/>\ncall: the original call to randomForest<br/>\ntype: one of regression, classification, or unsupervised.<br/>\npredicted: the predicted values of the input data based on out-of-bag samples.<br/>\nimportance:\ta matrix with nclass + 2 (for classification) or two (for regression) columns. For classification, the first nclass columns are the class-specific measures computed as mean descrease in accuracy. The nclass + 1st column is the mean descrease in accuracy over all classes. The last column is the mean decrease in Gini index. For Regression, the first column is the mean decrease in accuracy and the second the mean decrease in MSE. If importance=FALSE, the last measure is still returned as a vector.<br/>\nimportanceSD: The “standard errors” of the permutation-based importance measure. For classification, a p by nclass + 1 matrix corresponding to the first nclass + 1 columns of the importance matrix. For regression, a length p vector.<br/>\nlocalImp: a p by n matrix containing the casewise importance measures, the [i,j] element of which is the importance of i-th variable on the j-th case. NULL if localImp=FALSE.<br/>\nntree: number of trees grown.<br/>\nmtry: number of predictors sampled for spliting at each node.<br/>\nforest: (a list that contains the entire forest; NULL if randomForest is run in unsupervised mode or if keep.forest=FALSE.<br/>\nerr.rate: (classification only) vector error rates of the prediction on the input data, the i-th element being the (OOB) error rate for all trees up to the i-th.<br/>\nconfusion: (classification only) the confusion matrix of the prediction (based on OOB data).<br/>\nvotes: (classification only) a matrix with one row for each input data point and one column for each class, giving the fraction or number of (OOB) ‘votes’ from the random forest.<br/>\noob.times: number of times cases are ‘out-of-bag’ (and thus used in computing OOB error estimate)<br/>\nproximity: if proximity=TRUE when randomForest is called, a matrix of proximity measures among the input (based on the frequency that pairs of data points are in the same terminal nodes).<br/>\nmse\t: (regression only) vector of mean square errors: sum of squared residuals divided by n.<br/>\nrsq\t: (regression only) “pseudo R-squared”: 1 - mse / Var(y).<br/>\ntest: if test set is given (through the xtest or additionally ytest arguments), this component is a list which contains the corresponding predicted, err.rate, confusion, votes (for classification) or predicted, mse and rsq (for regression) for the test set. If proximity=TRUE, there is also a component, proximity, which contains the proximity among the test set as well as proximity between test and training data.<br/>\n<b>Package</b></br>\nrandomForest​;BlueSky</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command in the R syntax editor</br>\nhelp(randomForest,package='randomForest')\n                "
    }
}