{
    "title": "Reliability Analysis (McDonald's Omega)",
    "navigation": "McDonald's Omega",
    "tvarbox1": "All Items",
    "help": {
        "title": "McDonald's Omega",
        "r_help": "help(omega, package=psych)",
        "body": "\n            <b>Description</b></br>\nCalculate McDonald's omega estimates of general and total factor saturation\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nomega(m,nfactors=3,fm=\"minres\",n.iter=1,p=.05,poly=FALSE,key=NULL,\n    flip=TRUE,digits=2, title=\"Omega\",sl=TRUE,labels=NULL,\nplot=TRUE,n.obs=NA,rotate=\"oblimin\",Phi=NULL,option=\"equal\",covar=FALSE, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nm​: A correlation matrix, or a data.frame/matrix of data, or (if Phi) is specified, an oblique factor pattern matrix\n</li>\n<li>\nnfactors: The number of grouped factors\n</li>\n<li>\nfm​: factor method (the default is minres) fm=\"pa\" for principal axes, fm=\"minres\" for a minimum residual (OLS) solution, fm=\"pc\" for principal components (see note), or fm=\"ml\" for maximum likelihood.\n</li>\n<li>\nn.iter: How many replications to do in omega for bootstrapped estimates​\n</li>\n<li>\np: probability of two tailed conference boundaries\n</li>\n<li>\ndigits​: if specified, round the output to digits​\n</li>\n<li>\npoly: should the correlation matrix be found using polychoric/tetrachoric or normal Pearson correlations\n</li>\n<li>\nkey​: a vector of +/- 1s to specify the direction of scoring of items. The default is to assume all items are positively keyed, but if some items are reversed scored, then key should be specified.​\n</li>\n</ul>\n<b>Value</b><br/>\nomega hierarchical: The ω_h coefficient<br/>\nomega.lim: The limit of ω_h as the test becomes infinitly large<br/>\nomega total: The omega_t coefficient<br/>\nalpha: Cronbach's α<br/>\nschmid: The Schmid Leiman transformed factor matrix and associated matrices<br/>\nschmid$sl: The g factor loadings as well as the residualized factors<br/>\nschmid$orthog: Varimax rotated solution of the original factors<br/>\nschmid$oblique: The oblimin or promax transformed factors<br/>\nschmid$phi: the correlation matrix of the oblique factors<br/>\nschmid$gloading: The loadings on the higher order, g, factor of the oblimin factors<br/>\nkey: A vector of -1 or 1 showing which direction the items were scored.<br/>\nmodel: a list of two elements, one suitable to give to the sem function for structure equation models, the other, to give to the lavaan package.<br/>\nsem: The output from a sem analysis<br/>\nomega.group: The summary statistics for the omega total, omega hierarchical (general) and omega within each group.<br/>\nscores: Factor score estimates are found for the Schmid-Leiman solution. To get scores for the hierarchical model see the note in detailed R help.<br/>\nvarious fit statisticsvarious fit statistics, see output<br/>\n<b>Package</b></br>\npsych​</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command help(omega, package=psych) by creating a R code chunk by clicking + in the output window\n\t\t\t"
    }
}