{
    "title": "Reliability Analysis (Cronbach's Alpha)",
    "navigation": "Cronbachs Alpha",
    "tvarbox1": "All Items",
    "tvarbox2": "Enter items above that are reverse scored",
    "help": {
        "title": "Cronbach's Alpha",
        "r_help": "help(alpha, package=psych)",
        "body": "\n            <b>Reliability statistics table gives you​</b></br>\n•\tCronbach’s alpha: Cronbach’s α (values ≥ .7 or .8 indicate good reliability; Kline (1999))​<br/>\n•\tstd.alpha: The standarized alpha based upon the correlations​<br/>\n•\tGuttman’s lambda 6 (calculated from the squared multiple correlation or ‘smc’)​​<br/>\n•\taverage_r: average inter-item correlation (this is used to calculate std.alpha)​​<br/>\n•\tmean: scale mean (the mean of the means of all individuals)​​<br/>\n•\tsd: scale standard deviation​​<br/></br>\n<b>Interpreting reliability if an item is dropped​</b></br>\n•\tRefers to the overall Cronbach’s alpha when that particular item (in the row) has been dropped/deleted</br>\n•\tWhen the raw Cronbach’s alpha values of any row is greater than the overall α in the reliability statistics table above, this means that dropping that particular item in the row will increase the overall Cronbach’s alpha of the scale.​</br>\n•\tThe other columns of this table refer to how the other statistics will change if that particular item has been dropped/deleted.​</br>\n<b>How to interpret ‘Item statistics’?​</b></br>\n•\traw.r: The correlation of each item with the total score, not corrected for item overlap.​</br>\n•\tr.drop: item-total correlation without that item itself (i.e., item-rest correlation or corrected item-total correlation); low item-total correlations indicate that the item doesn’t correlate well with the scale overall​</br>\n•\tr.cor: item-total correlation corrected for item overlap and scale reliability​</br>\n•\tmean and sd: mean and sd of the scale if that item is dropped​</br>\n•\tAll items should correlate with the total score, so we’re looking for items that don’t correlate with the overall score from the scale. If r.drop values are less than about .3, it means that particular item doesn’t correlate very well with the scale overall.​</br>​</br>\n<b>How to interpret the final frequency table?​​</b></br>\n•\tThis table tells us what percentage of people gave each response to each of the items (i.e., if you have a 5-point scale, then it tells you how many percent of responses were 1, 2, 3, 4, or 5).​</br>\n•\tThis helps you check the distribution of responses and whether everyone is giving the same responses (which will lead to low reliability).​</br>\nIf your scale contains items that are reversed scored, you need to specify them. The keys argument allows you to.</br> </br> \n\n<b>Description</b></br>\nFind two estimates of reliability: Cronbach's alpha and Guttman's Lambda 6.​\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nalpha(x, keys=NULL,cumulative=FALSE, title=NULL, max=10,na.rm = TRUE,​\n   check.keys=FALSE,n.iter=1,delete=TRUE,use=\"pairwise\",warnings=TRUE,n.obs=NULL)​\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx​: A data.frame or matrix of data, or a covariance or correlation matrix​\n</li>\n<li>\nkeys​: If some items are to be reversed keyed, then either specify the direction of all items or just a vector of which items to reverse​\n</li>\n<li>\ntitle​: Any text string to identify this run​\n</li>\n<li>\ncumulative​: should means reflect the sum of items or the mean of the items. The default value is means.​\n</li>\n<li>\nmax​: the number of categories/item to consider if reporting category frequencies. Defaults to 10, passed to link{response.frequencies}​\n</li>\n<li>\nna.rm​: The default is to remove missing values and find pairwise correlations​\n</li>\n<li>\ncheck.keys​: if TRUE, then find the first principal component and reverse key items with negative loadings. Give a warning if this happens.​\n</li>\n<li>\nn.iter​: Number of iterations if bootstrapped confidence intervals are desired​\n</li>\n<li>\ndelete​: Delete items with no variance and issue a warning​\n</li>\n<li>\nuse​: Options to pass to the cor function: \"everything\", \"all.obs\", \"complete.obs\", \"na.or.complete\", or \"pairwise.complete.obs\". The default is \"pairwise\"​\n</li>\n<li>\nwarnings​: By default print a warning and a message that items were reversed. Suppress the message if warnings = FALSE​\n</li>\n<li>\nn.obs​: If using correlation matrices as input, by specify the number of observations, we can find confidence intervals​\n</li>\n</ul>\n<b>Details</b></br>\nAlpha is one of several estimates of the internal consistency reliability of a test.​​</br>\n<b>Value</b><br/>\ntotal​: a list containing​​</br>\nraw_alpha​: alpha based upon the covariances​​</br>\nstd.alpha​: The standarized alpha based upon the correlations​​</br>\nG6(smc)​: Guttman's Lambda 6 reliability​</br>\naverage_r​: The average inter-item correlation​​</br>\nmean​: For data matrices, the mean of the scale formed by summing the items​​</br>\nsd​: For data matrices, the standard deviation of the total score​​</br>\nalpha.drop​: A data frame with all of the above for the case of each item being removed one by one.​​</br>\nitem.stats​: A data frame including​​</br>\nn​: number of complete cases for the item​​</br>\nraw.r​: The correlation of each item with the total score, not corrected for item overlap.​​</br>\nstd.r​: The correlation of each item with the total score (not corrected for item overlap) if the items were all standardized​​</br>\nr.cor​: Item whole correlation corrected for item overlap and scale reliability​​</br>\nr.drop​: Item whole correlation for this item against the scale without this item​​</br>\nmean​: for data matrices, the mean of each item​​</br>\nsd​: For data matrices, the standard deviation of each item​​</br>\nresponse.freq​: For data matrices, the frequency of each item response (if less than 20)​​</br>\nboot​: a 6 column by n.iter matrix of boot strapped resampled values​​</br>\nUnidim​: An index of unidimensionality​​</br>\nFit​: The fit of the off diagonal matrix​​</br>\n<b>Package</b></br>\npsych</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command help(alpha, package=psych) by creating a R code chunk by clicking + in the output window\n\n\t\t\t"
    }
}