{
    "title": "Reshape, wide to long",
    "label2": "Choose the variables to reshape or alternately choose the variables not to reshape. In the latter case, all remaining variables will be reshaped into column(s)",
    "navigation": "Longer",
    "label0": "You can choose to save the results to a new dataset or overwrite the existing dataset",
    "label1": "Options",
    "advanced": "Advanced",
    "New": "Save results to a new dataset",
    "newdatasetname": "Enter a dataset name",
    "Existing": "Overwrite existing dataset",
    "label12": "Enter variable name(s) for new repeated factor variable(s)",
    "repeatedMeasure": "NOTE: When specifying multiple variable names that store repeated factors, separate them by comma for e.g. Month, Day. You must also click advanced to specify \nhow the variable names get created.",
    "repeatedValue": "Variable name for the repeated value e.g. Count",
    "labelChoice": "Select one of the options below",
    "subsetvars": "Option1: Select variable(s) to reshape into one or more variable(s)",
    "names_sep": "Option2: Specify a character or regular expression to split column names to create values for variable names. Takes the same specification as separate(), and can either be a numeric vector (specifying positions to break on), or a single string (specifying a regular expression to split on)",
    "names_pattern": "Option1: A regular expression containing matching groups (()). The matching part of the regular expression between the () will be used to create variable names.",
    "dontReshape": "Option2: Select variable(s) not to reshape (all remaining variables will be reshaped into column(s))",
    "removeNA": "Remove rows where repeated value is NA.",
    "makeString": "Make the repeated factor a R string type instead of a factor",
    "label3": "If there are multiple new variables created for repeated factors, the options below control how the column names get broken up. Select one of the 2 options below.",
    "help": {
        "title": "Reshape (wide to long)",
        "r_help": "help(pivot_longer, package=tidyr)",
        "body": "\n<b>Description</b></br>\nSee video at <a href=\" https://youtu.be/ypLXqmFp3jY\">Reshape wide to long</a></br>\nTakes a wide dataset and converts it to a long dataset by converting columns into key value pairs\nPivot_longer takes multiple columns and collapses into key-value pairs, duplicating all other columns as needed. You use pivot_longer() when you notice that you have columns that are not variables.</br>\nType in vignette(\"pivot\") in the R editor to see the R help. If there are multiple columns to create, you need to specify arguments to specify now the column names are constructed.</br>\nIn this case, click advanced to enter a regular expression that specifies how variables should be created from column names.</br>\nNOTE: When specifying multiple variables for the repeated factor(s) separate them by ,\n<br/>\n<b>Usage</b>\n<br/>\n<code> \npivot_longer( cols=c(col1, col2...),names_to=\"key\",values_to=\"value\",values_drop_na = TRUE)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ncols: Columns to pivot into longer format.\n</li>\n<li>\nvalues_to: A string specifying the name of the column to create from the data stored in cell values. If names_to is a character containing the special .value sentinel, this value will be ignored, and the name of the value column will be derived from part of the existing column names.If empty, all variables are selected, exclude a variable y with -y. When excluding variables all remaining variables are pivoted to long.\n</li>\n<li>\nvalues_drop_na: If TRUE, will drop rows that contain only NAs in the value_to column. This effectively converts explicit missing values to implicit missing values, and should generally be used only when missing values in data were created by its structure.\n</li>\n<li>\nnames_sep: takes the same specification as separate(), and can either be a numeric vector (specifying positions to break on), or a single string (specifying a regular expression to split on).</br>\nLets say the columns are Height_1_1, Height_1_2, Weight_1_1, Weight_1_2, Sagur_1_1, Sagur_2_1 where the 1st number is the month and the 2nd the week, specifying _ as the separator will result in 3 variables being created, the first variable with values Height, Weight, Sagur, the second with values 1 and 2, and the 3rd with values 1 and 2.</br>\nType help(regex) in the R code editor for more details\n</li>\n<li>\nnames_pattern: takes the same specification as extract(), a regular expression containing matching groups (()).\ntakes the same specification as separate(), and can either be a numeric vector (specifying positions to break on), or a single string (specifying a regular expression to split on).</br>\nLets say the columns are Height_33.1_1, Height_44.1_2, Weight_66.1_1, Weight_55.1_2, where the 2 digits after the 1st underscore are to be ignored, the digit after the . is month and digit after the last _ is week.</br>\nThe regular expressions that extract the values of the new variables need to be in (). The regular expression will be (.*)_.*.(.*)_(.)</br> \nNote: . in a regular expression means any character</br> \n* means 0 or more, so .* means 0 or more characters</br> \nSo the string    can be interpreted as looking for a pattern of</br> \n(.*) 0 or more characters followed by</br> \n _ an underscore followed by</br> \n .*. one or more characters followed by the . (escaping the . with a  indicates that its the character itself followed by</br> \n.* one or more characters followed by</br> \n_ underscore followed by</br> \n. a single character</br> \nAll the patterns between the () form values of each of the 3 new factor variables</br> \n</li>\n</ul>\n<b>Value</b><br/>\nReturns the reshaped dataset\n<br/>\n<b>Package</b></br>\ntidyr</br>\n<b>Help</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
    }
}