{
    "title": "Risk Set Matching",
    "navigation": "Risk Set Matching",
    "newdatasetnamelabel": "Dataset name to store matched data",
    "groupvarlabel": "Event variable (1=event, 0=censor)",
    "timevarlabel": "Time variable",
    "calipervarslabel": "Variables for matching (numeric)",
    "caliperslabel": "Specify calipers in order of matching variables separated by commas, e.g. 5, 2; specify 0 for exact matches",
    "ratiolabel": "Number of controls per case",
    "repeatcontrolslabel": "Allow controls to be matched more than once",
    "supercontrolslabel": "Don't allow cases to be matched to other cases",
    "help": {
        "title": "Risk Set Matching",
        "body": "\n            Performs risk set subject matching within a cohort.  Those with the outcome event (cases) are matched to those who have not had the event (controls) and are in the risk set at the event time of the case.  This is a nested case/control design.  Baseline variables known at cohort entry are also used to match cases and controls.\n\t\t\t<br/><br/>\n\t\t\tBaseline variables for which values have to match exactly and values matching within numerical calipers are supported. Controls are randomly selected from among all eligible controls for each case.\n\t\t\t<br/><br/>\n\t\t\tThe output dataset containing the matched data will contain the original variables, the event indicator (\"failed\"), and a variable identifying the matched set (\"match.num\").\n\t\t\t<br/><br/>\n\t\t\tObservations with any missing values for variables involved in the matching process are removed prior to matching.\n\t\t\t<br/><br/>\n\t\t\tA brief introduction to nested case/control designs can be found in:\n\t\t\tEssebag V , et al. The nested case-control study in cardiology. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>Dataset name to store matched data:</b>\n\t\t\t<br/>Name of output dataset containing the matched subject sets.\n\t\t\t<br/><br/>\n\t\t\t<b>Event variable (1=event, 0=censor):</b>\n\t\t\t<br/>Name of variable indicating those with events.  Must be numeric with 1=event and 0=censor.\n\t\t\t</br><br/>\n\t\t\t<b>Variables for matching:</b>\n\t\t\t<br/>Specify the baseline variables for which you want the case/control sets to be matched.  These must be numeric.\n\t\t\t<br/><br/>\n\t\t\t<b>Specify calipers in order of matching variables separated by commas:</b>\n\t\t\t<br/>Specify the numeric caliper values for each of the variables, in order of the variables. Exact matches should use a caliper of 0. \n\t\t\tFor example, if age (in years) was specified with a caliper of 5, that means the controls must be within +/- 5 years of their matched case.\n\t\t\tEach matching variable must have a caliper value specified.\n\t\t\t<br/><br/>\n\t\t\t<b>Number of controls per case:</b>\n\t\t\t<br/>This is the maximum number of controls that will be matched to each case.  Some matched sets may have less than this value if suitable matches cannot be identified.\n            <br/><br/>\n\t\t\t<b>Allow controls to be matched more than once:</b>\n\t\t\t<br/>Specify whether or not you want controls to potentially be matched to more than one case.  We recommend this option to be selected to avoid bias.\n            <br/><br/>\n\t\t\t<b>Don't allow cases to be matched to other cases:</b>\n\t\t\t<br/>Specify whether to allow cases to be considered as controls before the case event time.  We recommend not selecting this option to avoid bias.  Not selecting this option means a case is in the control risk set pool, and eligible to be matched to another case, up until their event time.\n            <br/><br/>\n            <b>Required R packages:</b> dplyr, tidyr\n"
    }
}