{
    "title": "ROUT Outlier Detection",
    "navigation": "ROUT Outlier Test",
    "variableListSelcted": "Select one or more variables",
    "adjPvalue": "Adjust p-values from comparing means",
    "FDR_Q": "Specify maximum (default 1%) desired False Discovery Rate (FDR)",
    "plotShowOutliersChk": "Plot to show all points including outliers, if any",
    "showOnlyOuliersInSummaryTableChk": "Show analysis summary table with only outliers, if any",
    "showAllPointsInSummaryTableChk": "Show analysis summary table with all points",
    "help": {
        "title": "ROUT (Robust Regression) method for Outlier Detection",
        "r_help": "help(rlm, package = MASS)",
        "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tROUT (Robust regression and Outlier removal) is a powerful and modern method for detecting one or more outliers. \n\t\t\t\tOriginally developed for nonlinear regression, the ROUT approach can be adapted for general use, \n\t\t\t\tincluding identifying outliers in a variable (a column data of a dataset).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tROUT combines two powerful ideas:\n\t\t\t\t<br/>\n\t\t\t\tRobust model fitting — which limits the influence (i.e. little impact) of potential outliers while estimating central trends.\n\t\t\t\t<br/>\n\t\t\t\tFalse Discovery Rate (FDR) — a statistical control method that determines how many of the detected outliers might actually be false positives.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tAdjustment P-value methods:\n\t\t\t\t<br/>\n\t\t\t\tThe adjustment P-value methods include the Bonferroni correction (\"bonferroni\") in which the p-values are multiplied by \n\t\t\t\tthe number of comparisons. Less conservative corrections are also included by Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\t\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" or its alias \"fdr\"), and Benjamini & Yekutieli (2001) (\"BY\"), \n\t\t\t\trespectively. A pass-through option (\"none\") is also included. The set of methods are contained in the p.adjust.methods vector \n\t\t\t\tfor the benefit of methods that need to have the method as an option and pass it on to p.adjust.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tThe first four methods are designed to give strong control of the family-wise error rate. There seems no reason to use the \n\t\t\t\tunmodified Bonferroni correction because it is dominated by Holm's method, which is also valid under arbitrary assumptions.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tHochberg's and Hommel's methods are valid when the hypothesis tests are independent or when they are non-negatively associated \n\t\t\t\t(Sarkar, 1998; Sarkar and Chang, 1997). Hommel's method is more powerful than Hochberg's, but the difference is usually small \n\t\t\t\tand the Hochberg p-values are faster to compute.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tThe \"BH\" (aka \"fdr\") and \"BY\" methods of Benjamini, Hochberg, and Yekutieli control the false discovery rate, the expected \n\t\t\t\tproportion of false discoveries amongst the rejected hypotheses. The false discovery rate is a less stringent condition than \n\t\t\t\tthe family-wise error rate, so these methods are more powerful than the others.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDetect the outliers in a variable i.e., Y values (no X variable needed)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tInternal analysis steps:\n\t\t\t\t<br/>\n\t\t\t\tAssign dummy X values: 1, 2, ..., n\n\t\t\t\t<br/>\n\t\t\t\tFit model: Y = M (i.e., a constant mean), using robust regression (rlm from MASS pkg)\n\t\t\t\t<br/>\n\t\t\t\tCompute residuals from the robust fit\n\t\t\t\t<br/>\n\t\t\t\tUse studentized residuals\n\t\t\t\t<br/>\n\t\t\t\tApply False Discovery Rate (FDR) correction with a user-defined Q (default is 1%)\n\t\t\t\t<br/>\n\t\t\t\tMark outliers where FDR-adjusted p-value < Q/100\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSee more details \n\t\t\t\t<br/>\n\t\t\t\thelp(rlm, package = MASS)\n\t\t\t\t<br/>\n\t\t\t\thelp(psi.huber, package = MASS)\n\t\t\t\t<br/>\n\t\t\t\thelp(p.adjust, package = stats)\n\t\t\t\t<br/>\n\t\t\t"
    }
}