{
    "title": "Predicted survival probabilities",
    "label100": "This dialog outputs the predicted survival probability at one or more \nspecified follow-up times. \nThe following requirements must be met.\n1. You must have built a cox regression model on a dataset where 1=event, 0=censor. \n2. The dataset that you want to generate predictions for must have all the independent variables used to create \nthe original model. \n3. The timescale used for the follow-up time must match the timescale used to create the original model. \n4. If you want predictions for a single observation, you need to create a new dataset with that observation.",
    "navigation": "Cox scoring",
    "filterModels": "Filter models by class",
    "modelSelection": "Select a model to score a dataset",
    "label1": "Diagnostic tests",
    "followUpTime": "Specify one or more follow-up times e.g. 1200, 1250, predicted survival probabilities will be generated for each follow-up time",
    "levelOfInterest": "When the variable to predict has 2 levels, specify the level of interest. The confusion matrix and related statistics are displayed with the specified level of interest as the reference",
    "label12": "Test results: As soon as a model is selected, we will run tests to see whether dependent variables specified in the model are \navailable in the dataset to be scored. The results will be displayed here",
    "label2": "Save survival probabilities.",
    "label3": "Predicted probabilities are stored as new variables with prefix below prepended to the original event variable name",
    "label4": "**For dependent variables with 2 levels, the 2nd level is treated as the positive level. See Data > Factor Levels > Reorder Levels Manually to change the order of factor levels and rebuild the model.",
    "conflevel": "Save confidence intervals for individual predicted values  **(Valid only for linear models (class lm))",
    "roctable": "Show ROC table (**For binary dependent variables only)",
    "colname": "Specify column name prefix",
    "label5": "**Checking the checkbox above will incur a performance penalty for large datasets.",
    "level": "Specify the confidence level",
    "confusioncheck": "Generate Confusion Matrix",
    "help": {
        "title": "Score A Dataset Using A Model",
        "r_help": "help(predict, package='stats')",
        "body": "\n    WHEN MULTIPLE TIME PERIODS ARE SPECIFIED, A CONFUSION MATRIX AND ROC CURVE ARE GENERATED FOR THE FIRST TIME PERIOD ONLY\n    <b>Description</b></br>\n    Model scoring does the following</br>\n    1. Scores the current dataset using the selected prebuilt model. Stores predictions with the specified confidence interval in the current dataset using the specified prefix.</br>\n    2. Optionally creates a confusion matrix and a ROC curve</br>\n    3. In the case where you are scoring a training dataset that contains the dependent variable/variable to predict and and the dependent variable has 2 levels, you have the option to select the reference level/level of interest.<br/>\n    4. The confusion matrix and related statistics are created using the specified level of interest.<br/>\n    See details on the predict function and confusion matrix below\n    <br/>\n    <br/>\n    <b>Description</b></br>\n    predict is a generic function for making predictions using the selected model. \n    <br/>\n    <b>Usage</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Arguments</b><br/>\n    <ul>\n    <li>\n    modelname:a model object for which prediction is desired.\n    </li>\n    <li>\n    prefix:prefix string that will be used to create new variables containing the predictions.\n    </li>\n    <li>\n    datasetname: is the current dataset to score and save predictions to.\n    </li>\n    </ul>\n    <b>Details</b></br>\n    Stores predictions with the specified confidence interval in the current dataset using the specified prefix.</br>\n    <b>Package</b></br>\n    stats</br>\n    <b>Help</b></br>\n    For detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command help(predict, package ='stats') in the R editor window\n    </br>\n    </br>\n    <b>Description</b></br>\n    Creates a confusion matrix by cross-tabulating the observed and predicted classes with associated statistics. \n    <br/>\n    <b>Usage</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Arguments</b><br/>\n    <ul>\n    <li>\n    modelname : a model object for which confusion matrix is desired.\n    </li>\n    <li>\n    showCofusionMatrix:  logical, if TRUE the confusion matrix is generated (if it applies), if FALSE, confusion matrix is not generated.\n    </li>\n    <li>\n    predictions : an object that is returned as a result of predict() call.\n    </li>\n    <li>\n    datasetname: is the current datasetname using which we want to make predictions.\n    </li>\n    </ul>\n    <b>Details</b></br>\n    Displays the confusion matrix using the function confusionMatrix in the package caret</br>\n    <b>Package</b></br>\n    caret</br>\n    <b>Help</b></br>\n    For detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command help(confusionMatrix, package ='caret') in the R editor window\n                "
    }
}