{
    "title": "SEM",
    "residualCovHeatmap": "Heatmap of deviation between observed and model-Implied covariance matrices",
    "observedCorr": "Observed correlations",
    "modelImpliedCorr": "Model implied correlations",
    "residualCorr": "Deviation between observed and fitted correlations",
    "residualCorrHeatmap": "Heatmap of deviation between observed and model-Implied correlations matrices",
    "intercepts1": "The intercepts of the observed variables",
    "intercepts": "Show intercepts",
    "means": "The intercepts/means of the latent variables",
    "residuals1": "The residual variances of the observed variables",
    "residual_covariances": "The residual covariances of the observed variables",
    "lv_variances": "The (residual) variances of the latent variables",
    "lv_covariances": "The (residual) covariances of the latent variables",
    "regressions": "All regression coefficients in the model",
    "loadings": "Loadings of the observed variables on their respective latent variables",
    "multiGrpOptions": "Multiple group options",
    "multiGrpSrc": "Source variables",
    "multiGrpDependent": "Grouping variables",
    "modelname": "Enter a name of the model",
    "mediationSrcCtrl": "Source relationships",
    "mediationDestCtrl": "Mediation parameters",
    "navigation": "SEM",
    "modelTermsDst": "Relationship",
    "modelTerms": "Predictor",
    "modelTerms1": "Outcome",
    "sem": "Latent variables",
    "sem_model_terms": "Structural parameters",
    "semSuppCtrl": "First order factors",
    "sem2": "Second order factors",
    "label1": "Select an item from the predictor and the outcome lists and click on the button with an arrow to move the selected items to the relationship list",
    "label2": "Select an item from the predictor and the outcome lists and click on the button with an arrow to move the selected items to the relationship list",
    "label3": "Information",
    "label4": "Additional outputs",
    "label5": "Covariances and correlations (see help)",
    "label6": "R-squared",
    "label7": "Save predicted",
    "label9": "Constraints",
    "coVarTerms": "1st variable/factor",
    "coVarTerms1": "2nd variable/factor",
    "coVarDst": "Selected covariances",
    "optionsCoVarTerms": "Covariances",
    "parameterizeFormula": "Show parameter labels",
    "modelOptions": "Model options",
    "method": "Select a method and approach (if applicable)",
    "approach": "ML likelihood approach",
    "missing": "Missing values",
    "addFitMeasures": "Additional fit measures",
    "mardiaSkew": "Mardia's skew (Only complete cases)",
    "mardiaKurt": "Mardia's kurtosis (Only complete cases)",
    "observed": "Observed covariances",
    "modelImplied": "Model-implied (fitted) covariances",
    "residual": "Deviation between observed and fitted covariances",
    "r2squareNone": "None",
    "r2squareEndo": "Endogenous",
    "factorScores": "Factor scores (variables saved with prefix FS)",
    "indicators": "Indicators (variables saved with prefix I)",
    "dependentVars": "Dependent variables (variables saved with prefix DV)",
    "label8": "Modification Indices",
    "modIndices": "Modification Indices",
    "highLowIndices": "Hide low indices",
    "threshold": "Threshold",
    "residuals": "Show residuals",
    "includeThresholds": "Show thresholds",
    "edgeLabels": "Select options for edge labels",
    "layout": "Options for how the nodes should be placed",
    "rotate": "Position of the exogenous variables when tree or tree2 layout is used",
    "abbNodeLabels": "No of characters to abbreviate node labels to",
    "abbEdgeLabels": "No of characters to abbreviate edge labels to",
    "label101": "Paths",
    "label102": "Layout",
    "label103": "Nodes",
    "semPlotOptions": "Plot options",
    "manifestShapes": "Manifest shapes",
    "latentShapes": "Latent shapes",
    "outputOptions": "Output options",
    "label104": "Standardized solutions",
    "stdall": "The standardized estimates are based on the variances of both (continuous) observed and latent variables",
    "stdlv": "The standardized estimates are on the variances of the (continuous) latent variables only",
    "stdnox": "The standardized estimates are based on both the variances of both (continuous) observed and latent variables, but not the variances of exogenous covariates",
    "label105": "Standard errors",
    "label106": "Bootstrap settings",
    "automatic": "Automatic",
    "standard": "Standard",
    "robust": "Robust",
    "pseudoML": "Pseudo ML",
    "bootstrap": "Bootstrap",
    "percentiles": "Percentiles",
    "normal": "Normal",
    "adjustedBiasCorrected": "Adjusted bias-corrected",
    "basic": "basic",
    "bootstratRep": "Bootstrap repetitions",
    "autoComputeCovar": "Automatically compute covariances",
    "equalityConstraints1": "Relationships",
    "sem3": "Equality constraints",
    "help": {
        "title": "SEM",
        "r_help": "help(sem, package=lavaan)",
        "body": "\n<b>Description</b></br>\nStructural Equation Modeling (SEM) utilizes the lavaan package (0.6.16) estimation and works with the traditional LISREL sem formulation (rather than Bentler-Weeks, RAMpath, or LISCOMP formulations).  Estimation defaults to maximum likelihood and uses NLMINB (quasi-Newton) using the normal likelihood approach (rather than the Wishart likelihood method).   Standard errors are based on expected (rather than observed) information matrices, but observed, expected, and deviations may be examined using heat maps.  Normality screening (i.e., Mardia's skew and kurtosis) are provided.   The user may specify models with and without continuous latent variables (i.e., measurement modeling) at both lower and higher orders, as well as structural models (i.e., path modeling).  Equality constraints, mediation, and multigroup analysis are possible.   A host of estimation methods (e.g., varieties of maximum likelihood, least squares, and James-Stein) are supported. Numerous fit statistics are available upon request (e.g., GFI, aGFI, ECVI, etc.), and a small subset (i.e., CFI, TLI, SRMR, RMSEA, AIC, BC) are provided by default. Confidence intervals utilizing various bootstrapping functions may also be obtained. Diagrams of models are produced using semPlot (1.1.6).  \n</br>\n</br>\nWhen you click on Covariances on the dialog, you will see that the checkbox, automatically compute covariances is checked. You can delete an automatically computed covariance by selecting the covariance and clicking the trash icon. When you delete a covariance, we suppress it in the code generated. If you want to undo the supression, you must manually add it again or delete and recreate the latent variable or higher order factor that is part of the covariance you want to undo the suppression for.\n</br>\n</br>\nWhen a grouping variable is selected (click on Multi-group options on the dialog), you need to select the checkbox \"The intercepts of the observed variables\" and the checkbox \"The intercepts/means of the latent variables\"\nJust checking the 1st checkbox gives you more flexibility.\n</br>\nDescription for the fit functions are below</br>\n\"ML\" maximum likelihood</br>\n\"GLS\": generalized least squares. For complete data only.</br>\n\"WLS\": weighted least squares (sometimes called ADF estimation). For complete data only.</br>\n\"DWLS\": diagonally weighted least squares</br>\n\"ULS\": unweighted least squares</br>\n\"DLS\": distributionally-weighted least squares</br>\n\"PML\": pairwise maximum likelihood</br>\nMany estimators have robust variants, meaning that they provide robust standard errors and a scaled test statistic. For example, for the maximum likelihood estimator, lavaan provides the following robust variants:</br>\n\"MLM\": maximum likelihood estimation with robust standard errors and a Satorra-Bentler scaled test statistic. For complete data only.</br>\n\"MLMVS\": maximum likelihood estimation with robust standard errors and a mean- and variance adjusted test statistic (aka the Satterthwaite approach). For complete data only.</br>\n\"MLMV\": maximum likelihood estimation with robust standard errors and a mean- and variance adjusted test statistic (using a scale-shifted approach). For complete data only.</br>\n\"MLF\": for maximum likelihood estimation with standard errors based on the first-order derivatives, and a conventional test statistic. For both complete and incomplete data.</br>\n\"MLR\": maximum likelihood estimation with robust (Huber-White) standard errors and a scaled test statistic that is (asymptotically) equal to the Yuan-Bentler test statistic. For both complete and incomplete data.</br>\n</br>\nTBD\nHande the documentation of the label see help\nWe need to document the situation around the degrees of freedom basically when a grouping variable is selected, you need to select\nthe checkbox \"The intercepts of the observed variables\" and the checkbox \"The intercepts/means of the latent variables\"\nJust checking the 1st checkbox gives you more flexibility.\n<b>Package</b></br>\nlavaan;semPlot;semTools</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command in the R syntax editor</br>\nhelp(sem, package='lavaan')\n\n\n"
    }
}