{
    "title": "Shewhart charts (I-MR)",
    "navigation": "Shewhart charts (I-MR)",
    "variableSelcted2": "Variable (observed data) to chart",
    "dateVariable": "(Optional) date variable to show dates on the x-axis of the plot",
    "plotTimeSeriesChk": "(Optional)Plot a time series of the variable (observed data)",
    "dateUnitStr": "(Optional) Choose a grouping date unit (e.g. week, quarter, etc) for the date values, otherwise dates values will be auto-calculated",
    "dateUnitInteger": "(Optional) An additional grouping date unit (e.g. 1 day, 2 week, 1 quarter, etc) for the date values",
    "printStatChk": "Print stats in addition to charts",
    "printObjectSummaryChk": "Print QCC object summary",
    "printTestSummaryChk": "Print summary from the tests for special causes",
    "printTestDetailChk": "Print details from the tests for special causes",
    "markTestNumberChk": "Mark Test Number on the chart (only the first test number will be marked if more than one tests found to be violated by a data point)",
    "ocCurvesChk": "Plot operating characteristic curves where applicable (must have equal sample sizes)",
    "rowsTobeUsed": "Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedAsNewData": "New Data - grouped Rows to be used as New Data to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12) - new data to plot but not included in the computations",
    "additionalPhasesLabel": "Specify data to Chart additional phases (limited to max of 10 phases to be practical to plot on a single chart)",
    "rowsTobeUsedPhase2": "Phase 2 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedPhase3": "Phase 3 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedPhase4": "Phase 4 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedPhase5": "Phase 5 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedPhase6": "Phase 6 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedPhase7": "Phase 7 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedPhase8": "Phase 8 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedPhase9": "Phase 9 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "rowsTobeUsedPhase10": "Phase 10 Grouped Rows to be used to Chart ( e.g.  specify as 1:25 or 1,4,5,7:12)",
    "phaseNames": "Specify phase names (comma separated) for a multi-phase chart - default phase names are Phase 1, Phase 2, ...",
    "nsigmas": "Sigma - number of sigmas to use for computing control limits. It is ignored when the confidence.level argument is provided",
    "confidence_level": "Confidence Level - value between 0 and 1 specifying the confidence level of the computed probability limits",
    "sdWarnLimits": "Add additional limit lines (comma separated) on the plot at the specific std. deviations (e.g. 1.5, 2)",
    "digits": "Digits - number of digits to display",
    "lower": "LSL - numeric value of lower specification limit to plot a LSL line",
    "upper": "USL - numeric value of upper specification limit to plot a USL line",
    "addlSpecLines": "Add additional Spec lines on the I chart plot (comma separated e.g. 73.98, 74.01, 74.03)",
    "addlSpecLinesLabel": "Label for the additional Spec lines (comma separated e.g. Spec 1, Spec 2, Spec 3)",
    "addlSpecLinesMR": "Add additional Spec lines on the MR plot (comma separated e.g. 0.02, 0.04, 0.06)",
    "addlSpecLinesLabelMR": "Label for the additional Spec lines (comma separated e.g. Spec 1, Spec 2, Spec 3)",
    "I_XbarOne_Stddev": "I chart - standard deviation method to be used",
    "MR_R_Stddev": "MR chart - standard deviation method to be used",
    "performTestLabel": "Perform selected tests for special causes",
    "test1Chk": "Perform test 1",
    "test2Chk": "Perform test 2",
    "test3Chk": "Perform test 3",
    "test4Chk": "Perform test 4",
    "test5Chk": "Perform test 5",
    "test6Chk": "Perform test 6",
    "test7Chk": "Perform test 7",
    "test8Chk": "Perform test 8",
    "test1": "One point more than Kσ from center line (default 3)",
    "test2": "K points in a row on the same side of the center line (defualt 9)",
    "test3": "K points in a row, all increasing or all decreasing (default 6)",
    "test4": "K points in a row, alternating up and down (defult 14)",
    "test5": "K out of K+1 points more than 2σ from the center line same side (defualt 2 out of 2+1)",
    "test6": "K out of K+1 points more than 1σ from center line same side (default 4 out of 4+1)",
    "test7": "K points in a row within 1σ of center line either side (default 15)",
    "test8": "K points in a row more than 1σ from center line either side (defualt 8)",
    "sigmaSymbol": "If the sigma symbol 'σ' is not printed correctly in the output, specify a character or string e.g. s or sigma in place of σ symbol",
    "help": {
        "title": "Shewhart charts (I-MR)",
        "r_help": "help(qcc, package = qcc)",
        "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tqcc function to to perform statistical quality control and to plot Shewhart charts\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFor the detail help - use R help(qcc, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFor additional help with the std deviation methods - use R help(sd.xbar.one, package = qcc) and help(sd.R, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tTo try this, you may load the dataset called pistonrings from the qcc package with Load Dataset menu by selecting qcc package and then select pistonrings dataset\n\t\t\t\t<br/>\n\t\t\t\tChoose diameter to variable(observed..), click run\n\t\t\t\t<br/>\n\t\t\t\tAdditionally, type 1:20 in Grouped rows to be used, click run \n\t\t\t\t<br/>\n\t\t\t\tTo plot a chart with multple phase\n\t\t\t\t<br/>\n\t\t\t\tType 25:30 in Phase 2 Grouped rows\n\t\t\t\t<br/>\n\t\t\t\tType 31:38 in Phase 3 Grouped rows\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFollow the qcc tutorial at https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
    }
}