{
    "title": "Simple Rasch Model",
    "navigation": "Simple Rasch Model",
    "modelname": "Enter model name",
    "destinationvars": "Desitination variable(s)",
    "estimationlbl": "Estimation",
    "rad1": "Use CML estimation",
    "chk1": "Compute standardized error",
    "chk2": "Normalize parameters to sum (0)",
    "rad2": "Use MML estimation",
    "help": {
        "title": "Simple Rasch Model",
        "r_help": "help(RM, package='eRm')",
        "body": "\n            <b>Description</b>\n            <br/>\n            Creates a Simple Rasch model using CML or MML estimation.\n            <br/><br/>\n            For CML estimation, we invoke eRm::RM to compute the parameter estimates of a Rasch model for binary item responses by using CML estimation.\n            <br/><br/>\n            For MML estimation, we invoke TAM::tam.mml to generate parameter estimates of a uni-dimensional  model \n            <br/><br/>\n            <b>Usage for CML estimation</b>\n            <br/>\n            <code>\n            eRm::RM(X, se = TRUE, sum0 = TRUE, etaStart) \n            </code>\n            <br/><br/>\n            <b>Arguments</b>\n            <br/>          \n            <ul>\n            <li>\n            X:  Input 0/1 data matrix or data frame; rows represent individuals, columns represent items. Missing values are inserted as NA.\n            </li>\n            <li>\n            W:  Design matrix for the Rasch model. If omitted, the function will compute W automatically.\n            </li>\n            <li>\n            se: If TRUE, the standard errors are computed.\n            </li>\n            <li>\n            sum0: If TRUE, the parameters are normed to sum-0 by specifying an appropriate W. If FALSE, the first parameter is restricted to 0.\n            </li>\n            <li>\n            etaStart: A vector of starting values for the eta parameters can be specified. If missing, the 0-vector is used.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>Usage for MML estimation</b>\n            <br/>\n            <code>\n            tam.mml(resp,verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Arguments</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Data frame with polytomous item responses k=0,...,K. Missing responses must be declared as NA.\n            </li>\n            <li>\n            irtmodel: For fixed item slopes (in tam.mml) options include PCM (partial credit model), PCM2 (partial credit model with ConQuest parametrization 'item+item*step' and RSM (rating scale model; the ConQuest parametrization 'item+step'). \n            <br/>\n            For estimated item slopes (only available in tam.mml.2pl) options are 2PL (all slopes of item categories are estimated; Nominal Item Response Model), GPCM (generalized partial credit model in which every item gets one and only slope parameter per dimension) and 2PL.groups (subsets of items get same item slope estimates) and a design matrix E on item slopes in the generalized partial credit model (GPCM.design, see Examples). Note that item slopes cannot be estimated with faceted designs using the function tam.mml.mfr. However, it is easy to use pre-specified design matrices and apply some restrictions to tam.mml.2pl\n            </li>\n            <li>\n            verbose: Logical indicating whether output should be printed during iterations. \n            </li>\n            </ul>\n            <br/><br/>\n            <b>Packages</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>            \n            <b>Help</b>\n            <br/>\n            help(RM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
    }
}