{
    "title": "Subject Matching",
    "navigation": "Subject Matching",
    "newdatasetnamelabel": "Dataset name to store matched data",
    "groupvarlabel": "Case/control variable (control=lower value, case=higher value)",
    "notelabel": "Note: You must specify at least one variable for exact or caliper variables",
    "exactvarslabel": "Variables for exact matching",
    "calipervarslabel": "Variables for caliper matching",
    "caliperslabel": "Specify calipers in order of caliper variables separated by commas, e.g. 5, 2",
    "idvarlabel": "Subject ID variable",
    "ratiolabel": "Number of controls per case",
    "help": {
        "title": "Subject Matching",
        "r_help": "help(matchit, package = 'MatchIt')",
        "body": "\n            Performs nearest neighbor subject matching where a set of cases is matched to 1 or more controls.  This is appropriate for case/control studies and matched cohort studies.\n\t\t\t<br/><br/>\n\t\t\tVariables for which values have to match exactly and values matching within numerical calipers are supported.\n\t\t\tMatching is done without replacement (each subject can only be matched once) and the controls among the potential controls will be selected according to the data order for each case.\n\t\t\t<br/><br/>\n\t\t\tThe output dataset will contain the original data and two additional variables: 1) subclass: a variable identifying the matched set, and 2) weights: a matching case weight variable that can be used in subsequent analysis, if desired.\n\t\t\t<br/><br/>\n\t\t\t<b>Dataset name to store matched data:</b>\n\t\t\t<br/>Name of output dataset containing the matched subject sets.\n\t\t\t<br/><br/>\n\t\t\t<b>Case/control variable (control=lower value, case=higher value):</b>\n\t\t\t<br/>Name of variable indicating cases and controls.  Can be numeric, factor, or character.  \n\t\t\tIf a numeric variable, this must be coded as 0=control, 1=case.  If a factor variable, the lower ordered level will be the controls and the higher ordered level will be the cases.  \n\t\t\tIf a character variable, the lower ordered value (by alphabetic order) will be the controls, and the higher ordered value (by alphabetic order) will be the cases.\n\t\t\tSo to be safer we recommend coding as 0=control, 1=case.\n\t\t\t</br><br/>\n\t\t\t<b>Variables for exact matching:</b>\n\t\t\t<br/>Specify the variables for which you want the case/control sets to be exactly matched.  \n\t\t\tThis means the cases and controls in a matched set have exactly the same values for these variables. These can be character, date, numeric, factor, or ordinal variables.\n\t\t\t<br/><br/>\n\t\t\t<b>Variables for caliper matching:</b>\n\t\t\t<br/>Specify the variables for which you want the case/control sets to be matched on numerical caliper values.  The controls will be within a specified caliper width for each of these variables.\n\t\t\tThese can be numeric or date variables.  Each caliper variable must have a caliper value specified.\n\t\t\t<br/><br/>\n\t\t\t<b>Specify calipers in order of caliper variables separated by commas:</b>\n\t\t\t<br/>Specify the numeric caliper values for each of the caliper variables, in order of the caliper variables.  \n\t\t\tFor example, if age (in years) was specified with a caliper of 5, that means the controls must be within +/- 5 years of their matched case.\n\t\t\tEach caliper variable must have a caliper value specified. If there are no caliper variables, this field must be empty.\n\t\t\t<br/><br/>\n\t\t\t<b>Number of controls per case:</b>\n\t\t\t<br/>This is the maximum number of controls that will be matched to each case.  Some matched sets may have less than this value if suitable matches cannot be identified.\n            <br/><br/>\n            <b>Required R packages:</b> dplyr, tidyr, MatchIt\n"
    }
}