{
    "title": "Table, Advanced",
    "navigation": "Table, Advanced",
    "notelabel": "NOTE: At least one variable must be specified in at least one of the below: ANOVA Test, Kruskal-Wallis Test, Median Test, Pearson's Chi-Square Test, Fisher's Exact Test, Ordinal Trend Test, or No Test",
    "anovavarslabel": "Variables for ANOVA Test",
    "kwvarslabel": "Variables for Kruskal-Wallis Test",
    "medvarslabel": "Variables for Median Test",
    "chisqvarslabel": "Variables for Pearson's Chi-Square Test",
    "fishervarslabel": "Variables for Fisher's Exact Test",
    "ordvarslabel": "Variables for Ordinal Trend Test",
    "notestvarslabel": "Variables for No Test",
    "bygroupvarlabel": "Groups to Compare",
    "stratavarlabel": "Strata (optional)",
    "tabletitlelabel": "Table Title",
    "totalcolchkboxlabel": "Include total column",
    "groupvarchkboxlabel": "Include group variable name",
    "digitslabel": "Digits After Decimal",
    "contdigitslabel": "Continuous Values",
    "pctdigitslabel": "Percentages",
    "pvaluedigitslabel": "P-Values",
    "simplifylabel": "Simplify Multi-Row Variable Summaries to One Row (if possible)",
    "numericsimplifylabel": "Numeric Variables",
    "categorysimplifylabel": "Categorical Variables",
    "ordinalsimplifylabel": "Ordinal Variables",
    "datesimplifylabel": "Date Variables",
    "labelsimplifylabel": "Use Last Level in Label of Categorical Variables",
    "conflevellabel": "Confidence Level",
    "simchkboxlabel": "Simulate p-values for Pearson and Fisher",
    "simnumlabel": "Number of Simulations",
    "footnotechkboxlabel": "Test Names Footnote",
    "sampsizelabel": "Sample Size",
    "meanlabel": "Mean",
    "quantileslabel": "Quantiles",
    "otherlabel": "Other",
    "nmissanylabel": "Number Missing, if any",
    "nmissalwayslabel": "Number Missing, always",
    "meansdlabel": "Mean (SD)",
    "meancilabel": "Mean (CI)",
    "meanselabel": "Mean (SE)",
    "gmeanlabel": "Geometric Mean",
    "gmeansdlabel": "Geometric Mean (SD)",
    "gmeancilabel": "Geometric Mean (CI)",
    "trimmeancilabel": "Trimmed Mean (CI)",
    "trimpctlabel": "Specify Trimmed Mean Percent",
    "medianlabel": "Median",
    "medianq1q3label": "Median (25th %-ile, 75th %-ile)",
    "q1q3label": "(25th %-ile, 75th %-ile)",
    "iqrlabel": "Interquartile Range",
    "medianrangelabel": "Median (Range)",
    "medianmadlabel": "Median (Median Absolute Deviation)",
    "rangelabel": "Range",
    "minlabel": "Minimum",
    "maxlabel": "Maximum",
    "pct1label": "1st %-ile (CI)",
    "pct5label": "5th %-ile (CI)",
    "pct10label": "10th %-ile (CI)",
    "pct25label": "25th %-ile (CI)",
    "pct33label": "33 1/3 %-ile (CI)",
    "pct50label": "Median (CI)",
    "pct66label": "66 2/3 %-ile (CI)",
    "pct75label": "75th %-ile (CI)",
    "pct90label": "90th %-ile (CI)",
    "pct95label": "95th %-ile (CI)",
    "pct99label": "99th %-ile (CI)",
    "custquantlabel": "Custom %-ile (CI)",
    "custquantvaluelabel": "Specify %-ile",
    "skewnesslabel": "Skewness",
    "kurtosislabel": "Kurtosis",
    "sumlabel": "Sum",
    "sdlabel": "SD",
    "varlabel": "Variance",
    "gsdlabel": "Geometric Mean SD",
    "cvlabel": "Coefficient of Variation",
    "freqlabel": "Frequency",
    "freqtotallabel": "Frequency/Total",
    "freqpctlabel": "Frequency (%)",
    "propcilabel": "Proportion (CI)",
    "help": {
        "title": "Table, Advanced",
        "r_help": "help(tableby, package ='arsenal')",
        "body": "\nThis creates a table of summary statistics within groups to compare and a stratification variable to do the comparisons within.  One column for each group \nvariable category will be created.  The stratification variable categories will form additional rows for the table.  Various summary statistics and statistical tests can be \nspecified.\n<br/><br/>\nNote: Dates of any class will be converted to the Date class for summarization purposes only.  Your original dataset will be unchanged.  This also means summarized dates will be accurate to the day only.\n<br/><br/>\n<b>Groups to Compare:</b> Variable that defines the categories to compare\n<br/><br/>\n<b>Variables for ANOVA Test:</b> Specify numeric or date variables for group comparisons using the Analysis of Variance (ANOVA) test\n<br/><br/>\n<b>Variables for Kruskal-Wallis Test:</b> Specify numeric, date, or ordinal factor variables for group comparisons using the Kruskal-Wallis test\n<br/><br/>\n<b>Variables for Median Test:</b> Specify numeric or date variables for group comparisons using a test of medians\n<br/><br/>\n<b>Variables for Pearson's Chi-Square Test:</b> Specify nominal factor or ordinal factor variables for group comparisons using Pearson's Chi-Square test\n<br/><br/>\n<b>Variables for Fisher's Exact Test:</b> Specify nominal factor or ordinal factor variables for group comparisons using Fisher's Exact test\n<br/><br/>\n<b>Variables for Ordinal Trend Test:</b> Specify nominal factor or ordinal factor variables for group comparisons using a trend test.  For two groups, this is essentially the Cochran-Armitage trend test.\n<br/><br/>\n<b>Variables for No Test:</b> Specify variables that you want to summarize only within groups.  No statistical tests will be computed for these variables.\n<br/><br/>\nNote: You must specify at least one variable to summarize for a table to be produced.\n<br/><br/>\n<b>Strata (optional):</b> Variable that defines the categories within which the comparisons will be made\n<br/><br/>\n<b>Table Title:</b> specify the table title\n<br/><br/>\n<b>Include total column:</b> whether or not a total column is included in the table\n<br/><br/>\n<b>Include group variable name:</b> whether or not to include the group variable name in the table\n<br/><br/>\n<b>Digits After Decimal:</b> specify how many digits to display after the decimal point for continuous values, percentages, and p-values\n<br/><br/>\n<b>Simplify Multi-Row Variable Summaries to One Row (if possible):</b> For two-category categorical (factor/ordinal) variables or single summaries of numeric or date variables, \nyou can collapse the rows to have all variable names and statistics appear in a single row.  The summaries for the last category for each categorical variable will be shown. \nAny variable for which collapsing isn't possible will take up multiple rows.  Turning this option on/off can be done for each type of variable separately.\n<br/><br/>\n<b>Use Last Level in Label of Categorical Variables:</b> For simplified tables, this includes the last level of factor/ordinal variables in the row label.\n<br/><br/>\n<b>Confidence Level:</b> This sets the confidence level of the confidence intervals.\n<br/><br/>\n<b>Statistical Test Options</b>\n<br/><br/>\n<b>Statistical Tests:</b> Pearson and Fisher Simulations provides the ability to obtain simulated p-values for Pearson's chi-square tests and \nFisher's Exact tests.  This procedure creates Monte Carlo simulations the specified number of times (Number of Simulations).  This can be useful in cases where the standard \ncomputations, especially for Fisher's Exact test, result in computer memory errors.\n<br/><br/>\n<b>Test Names Footnote:</b> whether or not to include p-value footnotes listing the statistical tests done for each variable\n<br/><br/>\n<b>Numerical Statistics Options:</b>\n<br/>statistics that will be shown for numerical variables\n<br/><br/>\n<b>Categorical Statistics Options:</b> \n<br/>\nstatistics that will be shown for both nominal and ordered factors\n<br/><br/>\n<b>Date Statistics:</b>\n<br/>statistics that will be shown for date variables\n<br/><br/>\n<b>Note:</b> If you want to summarize a variable of a specific type, it is recommended that you select at least one statistic in that category that is not \"Number Missing, if any\".  If \"Number Missing, if any\" is the only option selected and no variables have a missing value, then an error will result. \n<br/><br/>\n<b>Required R Packages:</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
    }
}