{
    "title": "t Quantiles",
    "navigation": "t Quantiles",
    "prob": "Enter probabilities separated by a comma. Example: 0.3,0.2,0.5",
    "degoffree": "Degrees of freedom",
    "labelSig": "Significance level",
    "lowtail": "Lower tail",
    "uptail": "Upper tail",
    "help": {
        "title": "t Quantiles",
        "r_help": "help(qt, package=stats)",
        "body": "\n            ​​\n            <b>Description</b>\n            <br/>\n            Density, distribution function, quantile function and random generation for the t distribution with df degrees of freedom (and optional non-centrality parameter ncp).\n            <br/>\n            <b>Usage</b>\n            <br/>\n            <code>\n                dt(x, df, ncp, log = FALSE)\n                <br/>\n                pt(q, df, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qt(p, df, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rt(n, df, ncp)\n                <br/>\n            </code>\n            <br/>\n            <b>Arguments</b>\n            <br/>\n            <ul>\n                <li>x, q : vector of quantiles.</li>\n                \n                \n                <li>p : vector of probabilities.</li>\n                \n                \n                <li>n : number of observations. If length(n) > 1, the length is taken to be the number required.</li>\n                \n                \n                <li>df : degrees of freedom (> 0, maybe non-integer). df = Inf is allowed.</li>\n                \n                \n                <li>ncp : non-centrality parameter delta; currently except for rt(), only for abs(ncp) <= 37.62. If omitted, use the central t distribution.</li>\n                \n                \n                <li>log, log.p : logical; if TRUE, probabilities p are given as log(p).</li>\n                \n                \n                <li>lower.tail : logical; if TRUE (default), probabilities are P[X ≤ x], otherwise, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Details</b>\n            <br/>\n            The t distribution with df = n degrees of freedom has density\n            <br/>\n            <code>f(x) = Γ((n+1)/2) / (√(n π) Γ(n/2)) (1 + x^2/n)^-((n+1)/2)</code>\n            <br/>\n            for all real x. It has mean 0 (for n > 1) and variance n/(n-2) (for n > 2).\n            <br/>\n            The general non-central t with parameters (df, Del) = (df, ncp) is defined as the distribution of T(df, Del) := (U + Del) / √(V/df) where U and V are independent random variables, U ~ N(0,1) and V ~ χ^2(df) (see Chisquare).\n            <br/>\n            The most used applications are power calculations for t-tests:\n             Let T= (mX - m0) / (S/sqrt(n)) where mX is the mean and S the sample standard deviation (sd) of X_1, X_2, …, X_n which are i.i.d. N(μ, σ^2) Then T is distributed as non-central t with df= n - 1 degrees of freedom and non-centrality parameter ncp = (μ - m0) * sqrt(n)/σ.\n             <br/>\n            <br/><b>Value</b>\n            <br/>\n            dt gives the density, pt gives the distribution function, qt gives the quantile function, and rt generates random deviates.\n            <br/>\n            Invalid arguments will result in return value NaN, with a warning.\n            <br/>\n            The length of the result is determined by n for rt, and is the maximum of the lengths of the numerical arguments for the other functions.\n            <br/>\n            The numerical arguments other than n are recycled to the length of the result. Only the first elements of the logical arguments are used.\n            <br/>\n            <br/><b>Note</b>\n            <br/>\n            Supplying ncp = 0 uses the algorithm for the non-central distribution, which is not the same algorithm used if ncp is omitted. This is to give consistent behaviour in extreme cases with values of ncp very near zero.\n            <br/>\n            The code for non-zero ncp is principally intended to be used for moderate values of ncp: it will not be highly accurate, especially in the tails, for large values.            \n"
    }
}