{
    "title": "Variance Inflation Factors",
    "navigation": "VIF",
    "modelselector1": "Select a model of one of the following classes (class in parenthesis) Linear model (lm) Generalized linear models (glm) Ordered Logistic Or Probit Regression (polr) Multinomial Log-Linear Models (multinom), Cox regession models (coxph)",
    "help": {
        "title": "Variance Inflation Factors",
        "r_help": "help(vif, package='car')",
        "body": "\n                <b>Description</b></br>\nCalculates variance-inflation and generalized variance-inflation factors for linear, generalized linear, and other models.\n<br/>\n<b>Usage</b>\n<br/>\n<code> \nvif(mod, ...)\n## Default S3 method:\nvif(mod, ...)\n## S3 method for class 'merMod'\nvif(mod, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nmod: for the default method, an object that responds to coef, vcov, and model.matrix, such as an lm or glm object.\n</li>\n<li>\n... not used.\n</li>\n</ul>\n<b>Details</b></br>\nIf all terms in an unweighted linear model have 1 df, then the usual variance-inflation factors are calculated.</br>\nIf any terms in an unweighted linear model have more than 1 df, then generalized variance-inflation factors (Fox and Monette, 1992) are calculated. These are interpretable as the inflation in size of the confidence ellipse or ellipsoid for the coefficients of the term in comparison with what would be obtained for orthogonal data.</br>\nThe generalized vifs are invariant with respect to the coding of the terms in the model (as long as the subspace of the columns of the model matrix pertaining to each term is invariant). To adjust for the dimension of the confidence ellipsoid, the function also prints GVIF^[1/(2*df)] where df is the degrees of freedom associated with the term.</br>\nThrough a further generalization, the implementation here is applicable as well to other sorts of models, in particular weighted linear models, generalized linear models, and mixed-effects models.</br>\n<b>Value</b><br/>\nA vector of vifs, or a matrix containing one row for each term in the model, and columns for the GVIF, df, and GVIF^[1/(2*df)].<br/>\n<b>Examples</b><br/>\n<code> \n## A ridiculous example...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>Package</b></br>\ncar</br>\n<b>Help</b></br>\nFor detailed help click on the R icon on the top right hand side of this dialog overlay or run the following command in the R syntax editor help(vif, package=\"car\")\n                "
    }
}