{
  "title": "AIC",
  "navigation": "AIC",
  "modelselector1": "Selectați un model din una dintre următoarele clase (clasa în paranteză) Model liniar (lm) Modele liniare generalizate (glm) Regresie logistică ordonată sau Probit (polr) Modele log-lineare multinomiale (multinom)",
  "help": {
    "title": "AIC",
    "r_help": "help(AIC,package='stats')",
    "body": "\n                <b>Descriere</b></br>\nFuncție generică care calculează Akaike's ‘An Information Criterion’ pentru unul sau mai multe obiecte de model ajustate pentru care se poate obține o valoare de log-verosimilitate, conform formulei -2*log-verosimilitate + k*npar, unde npar reprezintă numărul de parametrii în modelul ajustat, iar k = 2 pentru AIC-ul obișnuit, sau k = log(n) (n fiind numărul de observații) pentru așa-numitul BIC sau SBC (criteriul bayesian Schwarz).\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nAIC(object, ..., k = 2)\nBIC(object, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: un obiect de model ajustat pentru care există o metodă logLik pentru a extrage log-verosimilitatea corespunzătoare, sau un obiect care moștenește din clasa logLik.\n</li>\n<li>\n... opțional mai multe obiecte de model ajustate.\n</li>\n<li>\nk: numeric, penalizarea pe parametru care trebuie utilizată; k = 2 este AIC-ul clasic.\n</li>\n</ul>\n<b>Detalii</b></br>\nAtunci când se compară modele ajustate prin verosimilitate maximă pentru aceleași date, cu cât AIC-ul sau BIC-ul este mai mic, cu atât se potrivește mai bine.\nTeoria AIC necesită ca log-verosimilitatea să fi fost maximizată: deși AIC poate fi calculat pentru modele care nu sunt ajustate prin verosimilitate maximă, valorile lor AIC nu ar trebui comparate.</br>\nExemple de modele care nu sunt ‘ajustate la aceleași date’ sunt cele în care răspunsul este transformat (modelele de viață accelerată sunt ajustate la log-timpuri) și unde tabelele de contingență au fost utilizate pentru a rezuma datele.</br>\nAcestea sunt funcții generice (cu generice S4 definite în pachetul stats4): cu toate acestea, metodele ar trebui să fie definite pentru funcția de log-verosimilitate logLik mai degrabă decât pentru aceste funcții: acțiunea metodelor lor implicite este de a apela logLik pe toate obiectele furnizate și de a asambla rezultatele. Rețineți că în mai multe cazuri comune logLik nu returnează valoarea la MLE: consultați pagina sa de ajutor.</br>\nLog-verosimilitatea și, prin urmare, AIC/BIC este definită doar până la o constantă aditivă. Diferite constante au fost utilizate convențional pentru scopuri diferite, astfel încât extractAIC și AIC pot oferi valori diferite (și o fac pentru modelele din clasa \"lm\": consultați ajutorul pentru extractAIC). Este necesară o atenție deosebită atunci când se compară ajustările de clase diferite (cu, de exemplu, o comparație între un GLM Poisson și gamma fiind lipsită de sens, deoarece unul are un răspuns discret, celălalt continuu).</br>\nBIC este definit ca AIC(object, ..., k = log(nobs(object))). Acest lucru necesită ca numărul de observații să fie cunoscut: metoda implicită caută mai întâi un atribut \"nobs\" pe valoarea returnată din metoda logLik, apoi încearcă genericul nobs, iar dacă niciuna nu reușește, returnează BIC ca NA.</br>\n<b>Valoare</b><br/>\nDacă este furnizat un singur obiect, o valoare numerică cu AIC-ul corespunzător (sau BIC, sau ..., în funcție de k).\nDacă sunt furnizate mai multe obiecte, un data.frame cu rânduri corespunzătoare obiectelor și coloane reprezentând numărul de parametrii în model (df) și AIC-ul sau BIC-ul.<br/>\n<b>Exemple</b><br/>\n<code> \nlm1 <- lm(Fertility ~ . , data = swiss)</br>\nAIC(lm1)</br>\nstopifnot(all.equal(AIC(lm1),<br/>\n                    AIC(logLik(lm1))))<br/>\nBIC(lm1)</br>\nlm2 <- update(lm1, . ~ . -Examination)</br>\nAIC(lm1, lm2)</br>\nBIC(lm1, lm2)</br>\n</code> <br/>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă în editorul de sintaxă R help(AIC,package='stats')\n                "
  }
}