{
  "title": "ANOVA & Testul raportului de verosimilitate",
  "navigation": "ANOVA & Testul raportului de verosimilitate",
  "label1": "ANOVA se efectuează pentru modele cu următoarele clase (clase R în paranteză) Modele liniare (lm), Modele liniare generalizate (glm), Model de regresie logaritmic negativ binomial (negbin), Model liniar utilizând cele mai mici pătrate generalizate (gls), Model de regresie de supraviețuire (survreg), Model de hazard proporțional (coxph), Regresie Loess (loess)",
  "label2": "**NOTĂ: Testul de verosimilitate nu este suportat pentru modelele create prin ajustarea modelului (clasa train),",
  "modelselector1": "Selectați un model",
  "help": {
    "title": "ANOVA & Testul raportului de verosimilitate",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>Descriere</b></br>\nTabele ANOVA: Calculează tabele de analiză a varianței și efectuează teste de raport de verosimilitate pentru un obiect model ajustat. Pentru modelele cu efecte mixte, tabelul de tip ANOVA pentru efectele aleatoare este afișat. \n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: un obiect care conține rezultatele returnate de o funcție de ajustare a modelului (de exemplu, lm sau glm).\n</li>\n</ul>\n<b>Valoare</b><br/>\nAceastă funcție (generică) returnează un obiect de clasă anova. Aceste obiecte reprezintă tabele de analiză a varianței și a devianței. Când se dă un singur argument, produce un tabel care testează dacă termenii modelului sunt semnificativi. Când se dă o secvență de obiecte, anova testează modelele între ele în ordinea specificată.<br/>\nMetoda de printare pentru obiectele anova afișează tabele într-o formă „frumoasă”.<br/>\n<b>Atenție</b><br/>\nCompararea între două sau mai multe modele va fi validă doar dacă acestea sunt ajustate pe același set de date. Acest lucru poate fi o problemă dacă există valori lipsă și valoarea implicită a lui R, na.action = na.omit, este utilizată.<br/>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă în editorul de sintaxă R help(anova,package='stats')</br></br>\n<b>Descriere</b></br>\nTestul raportului de verosimilitate al modelelor înnăscute: lrtest este o funcție generică pentru efectuarea testelor de raport de verosimilitate. Metoda implicită poate fi utilizată pentru compararea modelelor liniare (generalizate) înnăscute (vezi detalii mai jos).\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Metoda implicită S3:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Metoda S3 pentru clasa 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: un obiect. Vezi mai jos pentru detalii.\n</li>\n<li>\n...: specificații suplimentare ale obiectului transmise metodelor. Vezi mai jos pentru detalii.\n</li>\n<li>\nname: o funcție pentru extragerea unui nume/descriere adecvat dintr-un obiect model ajustat. Implicit, numele este interogat apelând formula.\n</li>\n<li>\ndata: un cadru de date care conține variabilele din model.\n</li>\n</ul>\n<b>Detalii</b></br>\nlrtest este destinat să fie o funcție generică pentru comparațiile modelelor prin teste de raport de verosimilitate asimptotice. Metoda implicită compară consecutiv obiectul modelului ajustat cu modelele transmise în .... În loc să se transmită obiectele modelului ajustat în ..., sunt posibile mai multe specificații. Mecanismul de actualizare este același ca pentru waldtest: modelele din ... pot fi specificate ca întregi, caractere (ambele pentru termenii care ar trebui eliminate din modelul anterior), formule de actualizare sau obiecte de model ajustat. Cu excepția ultimului caz, se presupune existența unei metode de actualizare. Vezi waldtest pentru detalii.<br/>\nSubsequent, un test de raport de verosimilitate asimptotic pentru fiecare două modele consecutive este efectuat: De două ori diferența în log-verosimilitate (așa cum este derivată de metodele logLik) este comparată cu o distribuție Chi-pătrată.<br/>\nMetoda \"formula\" ajustează mai întâi un lm și apoi apelează metoda implicită.<br/>\n<b>Valoare</b><br/>\nUn obiect de clasă \"anova\" care conține log-verosimilitatea, gradele de libertate, diferența în gradele de libertate, statisticile Chi-pătrate de raport de verosimilitate și valoarea p corespunzătoare.\n<b>Exemple</b><br/>\n<code> \n## cu date din Greene (1993):<br/>\n## încărcați datele și calculați întârzierile<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## diverse specificații echivalente ale testului LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>Descriere</b></br>\nTabel de tip ANOVA pentru efecte aleatoare: Calculează un tabel de tip ANOVA cu teste ale termenilor de efecte aleatoare din model. Fiecare termen de efect aleator este redus sau eliminat, iar testele de raport de verosimilitate ale reducerilor modelului sunt prezentate într-o formă similară cu cea a drop1. rand este un alias pentru ranova.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmodel: un model liniar cu efecte mixte ajustat cu lmer() (moștenind din clasa lmerMod).\n</li>\n<li>\nreduce.terms: dacă este TRUE (implicit), termenii de efect aleator sunt reduși (dacă este posibil). Dacă este FALSE, termenii de efect aleator sunt pur și simplu eliminați.\n</li>\n</ul>\n<b>Detalii</b></br>\nDacă modelul este ajustat cu REML, testele sunt teste de raport de verosimilitate REML.<br/>\nUn termen de efect aleator de forma (f1 + f2 | gr) este redus la termeni de forma (f2 | gr) și (f1 | gr) și aceste modele reduse sunt comparate cu modelul original. Dacă reduce.terms este FALSE (f1 + f2 | gr) este eliminat în schimb.<br/>\nUn termen de efect aleator de forma (f1 | gr) este redus la (1 | gr) (cu excepția cazului în care reduce.terms este FALSE).<br/>\nUn termen de efect aleator de forma (1 | gr) nu este redus, ci pur și simplu eliminat.<br/>\nUn termen de efect aleator de forma (0 + f1 | gr) sau (-1 + f1 | gr) este redus (dacă reduce.terms = TRUE) la (1 | gr).<br/>\nUn termen de efect aleator de forma (1 | gr1/gr2) este extins automat la două termeni: (1 | gr2:gr1) și (1 | gr1) folosind findbars.<br/>\nÎn această expunere, nu contează dacă f1 și f2 sunt factori sau variabile continue.<br/>\n<b>Valoare</b><br/>\nUn tabel de tip ANOVA cu ștergeri de termeni unici de efecte aleatoare moștenind din clasa anova și un data.frame cu coloanele:</br>\nnpar: numărul de parametri ai modelului.</br>\nlogLik: log-verosimilitatea pentru model. Rețineți că aceasta este logLik REML dacă modelul este ajustat cu REML.</br>\nAIC: AIC pentru model evaluat ca -2*(logLik - npar). Mai mic este mai bine.</br>\nLRT: statistica testului de raport de verosimilitate; de două ori diferența în log-verosimilitate, care este distribuită asimptotic chi-pătrată.</br>\nDf: gradele de libertate pentru testul de raport de verosimilitate: diferența în numărul de parametri ai modelului.</br>\nPr(>Chisq) :valoarea p.</br>\n<b>Atenție</b></br>\nÎn anumite cazuri, teste ale modelelor non-înăscute pot fi generate. Un exemplu este atunci când (0 + poly(x, 2) | gr) este redus (implicit) la (1 | gr). După cunoștințele noastre, comparațiile între modele non-înăscute sunt generate doar în cazuri care sunt de fapt nonsens statistic (cum ar fi în acest exemplu în care interceptul aleator este suprimat).</br>\nNotă: Rețineți că anova poate fi utilizat pentru a compara două modele și va putea adesea să producă aceleași teste ca ranova. Aceasta, totuși, nu este întotdeauna cazul, așa cum este ilustrat în exemple.</br>\n<b>Exemple</b><br/>\n<code> \n# Testați reducerea (Zile | Subiect) la (1 | Subiect):<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # test cu 2 df<br/>\n# Acest test poate fi realizat și cu anova():<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# Ilustrați argumentul reduce.test:<br/>\n# Testați eliminarea (Zile | Subiect):<br/>\nranova(fm1, reduce.terms = FALSE) # test cu 3 df<br/>\n# Statistica testului de raport de verosimilitate este în acest caz:<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() nu este întotdeauna capabil să efectueze aceleași teste ca ranova(),<br/>\n# de exemplu:<br/>\nanova(fm1, fm3, refit=FALSE) # compară REML cu ML și nu ar trebui utilizat<br/>\nanova(fm1, fm3, refit=TRUE) # este un test al ajustărilor ML și nu ceea ce căutăm<br/>\n# De asemenea, rețineți că ajustarea lmer trebuie să vină prima - nu o ajustare lm:<br/>\n# anova(fm3, fm1) # nu funcționează și dă o eroare<br/>\n# ranova() poate să nu genereze toate testele relevante:<br/>\n# Pentru următorul model, ranova() indică că nu ar trebui să reducem<br/>\n# (TVset | Evaluator):\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Evaluator), data=TVbo)<br/>\nranova(fm)<br/>\n# Cu toate acestea, un model mai adecvat este:<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Evaluator), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm și fm2 au esențialmente aceeași ajustare la date, dar fm folosește cu 5 parametri mai mult decât fm.<br/>\n</code> <br/>\n<b>Pachet</b></br>\nlmerTest</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă în editorul de sintaxă R help(ranova, package ='lmerTest')\n                "
  }
}