{
  "title": "ANOVA, o cale cu blocuri",
  "navigation": "ANOVA, 1 cale cu blocuri",
  "tvarbox1": "Variabila de răspuns (una)",
  "tvarbox2": "Efect fix",
  "blockVar": "Variabila(e) de blocare",
  "chk1": "Histogramă a reziduurilor",
  "chk2": "Analiză post-hoc",
  "help": {
    "title": "ANOVA, o cale cu blocuri",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>Descriere</b></br>\nTabele Anova pentru diverse modele statistice​\nCalculează tabele de analiză a varianței de tip II sau III pentru obiecte de model produse de lm, glm, multinom (în pachetul nnet), polr (în pachetul MASS), coxph (în pachetul survival), coxme (în pachetul coxme), svyglm (în pachetul survey), rlm (în pachetul MASS), lmer în pachetul lme4, lme în pachetul nlme, și (prin metoda implicită) pentru cele mai multe modele cu un predictor liniar și coeficienți asimptotic normal (vezi detalii mai jos). Pentru modelele liniare, se calculează teste F; pentru modelele liniare generalizate, se calculează chi-pătratul raportului de verosimilitate, chi-pătratul Wald sau teste F; pentru modelele logit multinomiale și logit cu șanse proporționale, se calculează teste de raport de verosimilitate. Diverse statistici de test sunt furnizate pentru modelele liniare multivariate produse de lm sau manova. Testele de raport de verosimilitate parțială sau testele Wald sunt furnizate pentru modelele Cox. Testele chi-pătrat Wald sunt furnizate pentru efectele fixe în modelele mixte liniare și liniare generalizate. Testele chi-pătrat Wald sau teste F sunt furnizate în cazul implicit.​\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmod: lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm, sau alt obiect de model adecvat.​\n</li>\n<li>\ntype: tipul de test, \"II\", \"III\", 2, sau 3.​\n</li>\n</ul>\n<b>Detalii</b></br>\nDenominațiile \"tip-II\" și \"tip-III\" sunt împrumutate din SAS, dar definițiile utilizate aici nu corespund precis celor folosite de SAS. Testele de tip-II sunt calculate conform principiului marginalității, testând fiecare termen după toți ceilalți, exceptând ignorarea rudelor de ordin superior ale termenului; așa-numitele teste de tip-III încalcă marginalitatea, testând fiecare termen din model după toți ceilalți. Această definiție a testelor de tip-II corespunde testelor produse de SAS pentru modelele de analiză a varianței, unde toți predictorii sunt factori, dar nu mai general (adică, când există predictori cantitativi). Fii foarte atent la formularea modelului pentru testele de tip-III, altfel ipotezele testate nu vor avea sens.​</br>\nAșa cum este implementat aici, testele Wald de tip-II sunt o generalizare a ipotezelor liniare utilizate pentru a genera aceste teste în modelele liniare.​</br>\nPentru teste pentru modele liniare, modele liniare multivariate și teste Wald pentru modele liniare generalizate, modele Cox, modele mixte, modele liniare generalizate ajustate pentru date de sondaj, și în cazul implicit, Anova găsește statisticile de test fără a reîncadra modelul. Metoda svyglm pur și simplu apelează metoda implicită și, prin urmare, poate lua aceleași argumente.​</br>\n<b>Valoare</b><br/>\nUn obiect de clasă \"anova\", sau \"Anova.mlm\", care de obicei este imprimat. Pentru obiectele de clasă \"Anova.mlm\", există de asemenea o metodă de rezumat, care oferă mult mai multe detalii decât metoda de imprimare despre MANOVA, inclusiv teste F univariate tradiționale cu corecții Greenhouse-Geisser și Huynh-Feldt.​​</br>\n<b>Pachet</b></br>\nAnova</br>\n<b>Ajutor</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>Descriere</b></br>\nTeste de separare a mediei post-hoc. Pentru a efectua teste de separare a mediei post-hoc pentru fiecare variabilă factor principal, vom folosi pachetul emmeans. Modelul liniar luat în considerare se numește model, creat prin funcția lm de mai sus.  \n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>Pachet</b></br>\nFSA;car;emmeans;ggplot2;multcomp</br>\n<b>Ajutor</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
  }
}