{
  "title": "Construiește un model ajustat cu resampling Bootstrap",
  "navigation": "Resampling Bootstrap",
  "modelname": "Introduceți numele pentru modelul ajustat",
  "iterator": "Introduceți numărul de iterații de resampling",
  "dependent": "Variabila de prezis",
  "levelOfInterest": "Când variabila de prezis are 2 niveluri, specificați nivelul de interes. Matricea de confuzie și statisticile aferente sunt afișate cu nivelul de interes specificat ca referință",
  "independent": "Variabile independente",
  "label1": "UNELE MODELE OBIECT LA VALORI ÎN MISSING SAU VARIABILE DEPENDENTE CARE SUNT FACTORI. PENTRU GESTIONAREA VALORILOR ÎN MISSING, VEZI [ VARIABILE > VALORI ÎN MISSING ] ȘI PENTRU CODIFICAREA DUMMY A VARIABILELOR FACTOR, VEZI [ VARIABILE > CALCULEAZĂ > COD DUMMY ]. Faceți clic pe ? iconița din colțul din dreapta sus al dialogului pentru detalii.",
  "ModelSelection": "Selectați o categorie de model și apoi tipul de model",
  "help": {
    "title": "Construiește un model ajustat cu resampling Bootstrap",
    "r_help": "help(train, package=caret)",
    "body": "\n<b>Descriere</b></br>\nResampling-ul Bootstrap folosește funcțiile trainControl și train din pachetul caret pentru a crea un model ajustat/optimizat.<br/>\nUn model ajustat este construit prin resampling-ul rezultatelor pe baza parametrilor de ajustare. Rezultatele ajustării sunt afișate sub tabelele de la baza ieșirii<br/>\nOdată ce modelul ajustat este construit, facem predicții folosind modelul ajustat împotriva setului de date de antrenament (folosit pentru a construi modelul) și afișăm matricea de confuzie și statisticile aferente.<br/>\nNOTĂ: vezi URL-ul la https://www.blueskystatistics.com/Articles.asp?ID=330 pentru detalii despre modelele care necesită variabile dependente să fie codificate dummy și cerințele corespunzătoare pentru variabilele dependente acceptate. De asemenea, unele modele nu acceptă valori în missing, dacă există erori afișate când se construiește modelul, eliminați valorile în missing.<br/>\nModelul ajustat este stocat în obiectul de clasă train cu un nume pe care l-ați specificat în controlul textbox.<br/>\nValorile parametrilor selectate pentru modelul final ajustat sunt afișate la baza ieșirii.<br/>\nÎn cazul predictorilor cu 2 niveluri, aveți opțiunea de a selecta nivelul de referință/nivelul de interes.<br/>\nMatricea de confuzie și statisticile aferente sunt create folosind nivelul de interes specificat.<br/>\n<code> \ntrain_control <- caret::trainControl(method=\"boot\", number=5)<br/>\n#Sintaxă generală<br/>\ntunedModel <- caret::train(x = datele de eșantion pentru a antrena modelul, y = variabila dependentă, trControl = train_control, method = \"modelul de utilizat\", prob.model=TRUE )<br/>\n#Sintaxă populată de exemplu<br/>\ntunedModel <- caret::train(as.data.frame(TrainData), dependentVariable, trControl=train_control, method = \"adaboost\", preProcess = NULL, prob.model = TRUE )<br/>\n</code>\nGenerăm o matrice de confuzie și statistici de acuratețe pentru modelul ajustat. Acest lucru se face astfel\n<ul>\n<li>\nGenerăm valori prezise din setul de date de antrenament apelând funcția predict pe modelul optimizat de clasă train (Intern, predict.train este funcția din pachetul caret pe care R o apelează)<br/>\n<code> \nvaloriPrezise = predict(modelulAjustat returnat de funcția train)<br/>\n</code> <br/>\n</li>\n<li>\nCalculăm statisticile de acuratețe din matricea de confuzie generată astfel<br/>\n<code> \ncaret::confusionMatrix (predicții = valoriPrezise, referință = variabila dependentă a modelului)<br/>\n</code> \n</li>\n</ul>\nPuteți folosi modelul final ajustat/optimizat pentru a evalua un set de date. Pentru a face acest lucru, urmați pașii de mai jos<br/>\n1. Mergeți la setul de date pe care doriți să-l evaluați. Notă: Numele variabilelor din setul de date care urmează să fie evaluate (a.k.a. variabile independente) trebuie să se potrivească cu numele variabilelor pe care le-ați folosit în setul de date pentru a crea inițial modelul ajustat. Dacă nu, va apărea o eroare. Acest mesaj de eroare va apărea sub secțiunea de teste de diagnosticare pe dialogul de evaluare a modelului, vezi punctul 2 de mai jos. <br/>\n2. Deschideți dialogul de evaluare a modelului sub Evaluarea modelului>Predict>Evaluarea modelului. <br/>\n3. Selectați un model pe care doriți să-l folosiți pentru a evalua setul de date. Puteți filtra modelele pe care le-ați construit după clasă. <br/>\n4. Odată ce ați selectat modelul, specificați un prefix pentru a stoca valorile prezise. Puteți salva opțional intervalele de încredere pentru predicții și genera o matrice de confuzie. Trebuie să specificați un prefix pentru variabila care conține predicțiile/scorurile. Predicțiile și probabilitățile prezise, acolo unde este cazul, sunt stocate ca variabile noi la sfârșitul setului de date. De exemplu, dacă prefixul specificat este AA, predicțiile sunt stocate într-o variabilă AA_original numele variabilei dependente_Predicții, probabilitățile prezise sunt stocate într-o variabilă AA_Level1_PredictedProbs. <br/>\n5. Faceți clic pe butonul Rulați pentru a evalua setul de date. <br/>\n<b>Pachet</b></br>\ncaret</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat faceți clic pe pictograma R din colțul din dreapta sus al acestui dialog sau rulați următoarea comandă help(train, package ='caret') în fereastra editorului R\n"
  }
}