{
  "title": "Acord Categorial",
  "navigation": "Acord Categorial",
  "ratervars": "Variabile Rater:",
  "cilevel": "Nivel de Încredere:",
  "options": "Avansat",
  "categLabels": "Specificați opțional toate evaluările posibile separate prin , de exemplu 1,2,3,4,5 sau \"scăzut\",\"mediu\",\"ridicat\" ",
  "weightschkbox": "Arată greutățile categoriilor",
  "weights": "Selectați greutățile categoriilor",
  "N": "Dimensiunea populației finite (dacă există)",
  "help": {
    "title": "Acord Categorial",
    "r_help": "help(fleiss.kappa.raw, package=irrCAC)",
    "body": "\n<b>Descriere</b></br>\nCalculează procentul de acord, kappa lui Conger/Cohen, kappa lui Fleiss, AC1/AC2 al lui Gwet, alpha lui Krippendorff și coeficientul Brennan-Prediger între mai mulți evaluatori (2, 3, +) atunci când datele de intrare reprezintă evaluările brute raportate pentru fiecare subiect și fiecare evaluator. Versiuni neponderate și ponderate ale acestor statistici sunt disponibile, cu diferite metode de ponderare a categoriilor.</br>\nValorile lipsă sunt incorporate în calculele de acord pe șansă conform lui Gwet (2014).</br>\nDe asemenea, oferim opțiunea de a afișa ponderile categoriilor de evaluare.</br>\nPentru mai multe informații, consultați: </br></br>Gwet, K.L. (2014, ISBN:978-0970806284). “Manual de Fiabilitate Inter-Rater,” Ediția a 4-a. Advanced Analytics, LLC\n</br></br>Klein, D. (2018) doi:https://doi.org/10.1177/1536867X1801800408. “Implementarea unui cadru general pentru evaluarea acordului inter-rater în Stata,” The Stata Journal Volumul 18, Numărul 4, pp. 871-901.</br></br> \n<b>Utilizare</b>\n<br/>\n<br/>\n<ul>\n<li>\n<b>Variabile Rater:</b>  Variabile corespunzătoare fiecărui evaluator unde fiecare coloană reprezintă un evaluator și fiecare rând un subiect. Acestea pot fi variabile numerice, factor, ordinale sau de caracter.</br>\n</li>\n<li>\n<b>Nivel de Încredere:</b>  Nivelul de încredere asociat cu intervalul de încredere. Valoarea sa implicită este 0.95.</br>\n</li>\n<li>\n<b>Arată greutățile categoriilor:</b> arată greutățile numerice pentru categoriile evaluatorilor conform greutăților selectate. Greutatea selectată ar trebui să corespundă apropierei dorite între categorii.\n</li>\n<li>\n<b>Selectați greutățile categoriilor:</b> Un parametru obligatoriu care este fie o variabilă de tip șir, fie o matrice. Șirul descrie una dintre greutățile predefinite și trebuie să ia una dintre valorile (\"neponderat\",\"cadratic\", \"ordinal\", \"linear\", \"radical\", \"raport\", \"circular\", \"bipolar\"). </br>\nDacă acest parametru este o matrice, atunci trebuie să fie o matrice pătrată qxq unde q este numărul de categorii posibile în care un subiect poate fi clasificat. Dacă unele dintre cele q categorii posibile nu sunt utilizate, atunci se recomandă cu tărie specificarea listei complete de categorii posibile. În caz contrar, programul s-ar putea să nu funcționeze.</br>\nNOTĂ: Specificarea unei matrice NU este suportată în sintaxă. Trebuie să lipiți codul și să editați pentru a specifica o matrice.</br>\n</li>\n<li>\n<b>Dimensiunea populației finite (dacă există):</b> Parametru opțional care reprezintă dimensiunea populației (dacă există). Poate fi utilizat pentru a efectua o corecție a populației finite la varianță. Valoarea sa implicită este infinită.\n</li>\n<li>\n<b>Specificați opțional toate evaluările posibile:</b> Listă opțională utilizată în cazul în care niciun evaluator nu folosește o categorie posibilă. Dacă nu este specificat nimic, se presupune că categoriile observate sunt întregul set de categorii.\n</li>\n</ul>\n<b>Pachet R</b></br>\nirrCAC</br>\n<b>Ajutor</b></br>\nAcest dialog folosește funcțiile pa.coeff.raw, conger.kappa.raw, fleiss.kappa.raw, gwet.ac1.raw, krippen.alpha.raw și bp.coeff.raw.\nPentru ajutor detaliat, consultați ajutorul pachetului irrCAC la meniul cu trei puncte > Ajutor > Ajutor Pachet R.\n"
  }
}