{
  "title": "Coeficientul de corelație de concordanță, evaluatori multipli",
  "navigation": "Coeficientul de corelație de concordanță, evaluatori multipli",
  "ratervars": "Variabilele evaluatorilor, cel puțin 2",
  "cilevel": "Nivel de încredere:",
  "bootsamp": "Numărul de eșantioane bootstrap",
  "plotoptionslabel": "Opțiuni de grafic",
  "plotchkbox": "Grafice de dispersie pentru toate perechile de evaluatori",
  "plottitle": "Titlu",
  "varlabels": "Etichete pentru variabile (dacă sunt utilizate, trebuie specificate etichetele pentru toate variabilele, în ordine, ca 'eticheta 1', 'eticheta 2', etc.)",
  "plottheme": "Tema graficului",
  "help": {
    "title": "Coeficientul de corelație de concordanță, evaluatori multipli",
    "r_help": "help(epi.occc,package=epiR)",
    "body": "\nCoeficientul de corelație de concordanță (CCC) măsoară acordul între observatori care măsoară aceleași subiecte pe aceeași scară pentru date continue. CCC poate varia între \n-1 și 1, cu 1 fiind acord perfect și 0 fiind fără acord. Valorile negative indică un acord negativ, dar este rar în practică. CCC-ul general și CCC-urile pereche \n(toate perechile de evaluatori) sunt calculate cu intervale de încredere bootstrap percentil și ajustate bootstrap percentil. Orice observație cu o valoare lipsă pentru variabilele evaluatorilor specificate \neste eliminată din analiză.\n<br/><br/>\n<b>Variabilele evaluatorilor:</b> Variabile care conțin valorile furnizate de observatori; trebuie să fie numerice\n<br/>\n<b>Interval de încredere:</b> Nivelul dorit al intervalului de încredere pentru CCC\n<br/>\n<b>Numărul de eșantioane bootstrap:</b> Numărul dorit de eșantioane bootstrap de la datele originale pentru a calcula intervalele de încredere. Cel puțin 1000 este recomandat, \n dacă este practic fezabil.\n<br/>\n<b>Grafice de dispersie pentru toate perechile de evaluatori:</b> Opțiunea de a crea grafice de dispersie pentru toate perechile de evaluatori într-un format de matrice.   \n<br/><br/>\n<b>Pachete R necesare:</b> epiR, boot, GGally, ggthemes\n                "
  }
}