{
  "title": "Test Chi-pătrat",
  "navigation": "Test Chi-pătrat",
  "target": "Variabile selectate",
  "proportions": "Testați împotriva proporțiilor egale sau introduceți proporții pentru a testa. Dacă variabila dvs. este sexul, lăsați acest control gol pentru a testa proporții egale. Pentru a testa 20% femei, 80% bărbați, introduceți 0.2,0.8. Introduceți o proporție pentru fiecare nivel. Proporțiile trebuie să totalizeze 1.",
  "help": {
    "title": "Test Chi-pătrat",
    "r_help": "help(chisq.test, package=stats)",
    "body": "\n<b>Descriere</b></br>\nchisq.test efectuează teste de tabel de contingență chi-pătrat și teste de bună potrivire.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code>\nchisq.test(x, y = NULL, correct = TRUE,\n            p = rep(1/length(x), length(x)), rescale.p = FALSE,\n            simulate.p.value = FALSE, B = 2000)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: un vector numeric sau o matrice. x și y pot fi, de asemenea, ambele factori.\n</li>\n<li>\ny: un vector numeric; ignorat dacă x este o matrice. Dacă x este un factor, y ar trebui să fie un factor de aceeași lungime.\n</li>\n<li>\ncorrect: un logic care indică dacă să se aplice corecția de continuitate atunci când se calculează statisticile testului pentru tabele 2 pe 2: o jumătate este scăzută din toate diferențele |O - E|; totuși, corecția nu va fi mai mare decât diferențele în sine. Nicio corecție nu se face dacă simulate.p.value = TRUE.\n</li>\n<li>\np: un vector de probabilități de aceeași lungime ca x. Se dă o eroare dacă orice intrare din p este negativă.\n</li>\n<li>\nrescale.p: un scalar logic; dacă este TRUE, atunci p este redimensionat (dacă este necesar) pentru a suma la 1. Dacă rescale.p este FALSE și p nu suma la 1, se dă o eroare.\n</li>\n<li>\nsimulate.p.value: un logic care indică dacă să se calculeze valorile p prin simulare Monte Carlo.\n</li>\n<li>\nB: un întreg care specifică numărul de replicări utilizate în testul Monte Carlo.\n</li>\n</ul>\n<b>Descriere</b><br/>\nDacă x este o matrice cu un rând sau o coloană, sau dacă x este un vector și y nu este dat, atunci se efectuează un test de bună potrivire (x este tratat ca un tabel de contingență unidimensional). Intrările din x trebuie să fie întregi non-negative. În acest caz, ipoteza testată este dacă probabilitățile populației sunt egale cu cele din p, sau sunt toate egale dacă p nu este dat.\nDacă x este o matrice cu cel puțin două rânduri și coloane, este considerată un tabel de contingență bidimensional: intrările din x trebuie să fie întregi non-negative. În caz contrar, x și y trebuie să fie vectori sau factori de aceeași lungime; cazurile cu valori lipsă sunt eliminate, obiectele sunt transformate în factori, iar tabelul de contingență este calculat din acestea. Apoi, se efectuează testul chi-pătrat Pearson al ipotezei nule că distribuția comună a numărului de celule dintr-un tabel de contingență bidimensional este produsul marjei de rând și coloană.<br/>\nDacă simulate.p.value este FALSE, valoarea p este calculată din distribuția chi-pătrat asimptotică a statisticii testului; corecția de continuitate este utilizată doar în cazul 2 pe 2 (dacă correct este TRUE, implicit). În caz contrar, valoarea p este calculată pentru un test Monte Carlo (Hope, 1968) cu B replicări.\nÎn cazul tabelului de contingență, simularea se face prin eșantionare aleatorie din setul tuturor tabelelor de contingență cu margini date și funcționează doar dacă marginile sunt strict pozitive. Corecția de continuitate nu este niciodată utilizată, iar statistica este citată fără ea. Rețineți că aceasta nu este situația obișnuită de eșantionare presupusă pentru testul chi-pătrat, ci mai degrabă că pentru testul exact Fisher.<br/>\nÎn cazul bună potrivire, simularea se face prin eșantionare aleatorie din distribuția discretă specificată de p, fiecare eșantion având dimensiunea n = suma(x). Această simulare se face în R și poate fi lentă.<br/>\n<b>Valoare</b></br>\nO listă cu clasa \"htest\" conținând următoarele componente:</br>\nstatistic: valoarea statisticii testului chi-pătrat.</br>\nparameter: gradele de libertate ale distribuției chi-pătrat aproximative a statisticii testului, NA dacă valoarea p este calculată prin simulare Monte Carlo.</br>\np.value: valoarea p pentru test.</br>\nmethod: un șir de caractere care indică tipul de test efectuat și dacă simularea Monte Carlo sau corecția de continuitate a fost utilizată.</br>\ndata.name: un șir de caractere care oferă numele datelor.</br>\nobserved: numerele observate.</br>\nexpected: numerele așteptate sub ipoteza nulă.</br>\nresiduals: reziduurile Pearson, (observat - așteptat) / sqrt(așteptat).</br>\nstdres: reziduurile standardizate, (observat - așteptat) / sqrt(V), unde V este varianta reziduală a celulei (Agresti, 2007, secțiunea 2.4.5 pentru cazul în care x este o matrice, n * p * (1 - p) în alt caz).​​</br>\n<b>Exemple</b><br/>\n<code> \n## Din Agresti(2007) p.39\nM <- as.table(rbind(c(762, 327, 468), c(484, 239, 477)))</br>\ndimnames(M) <- list(sex = c(\"F\", \"M\"),</br>\n                    partid = c(\"Democrat\",\"Independent\", \"Republican\"))</br>\n(Xsq <- chisq.test(M))  # Afișează rezumatul testului</br>\nXsq$observed   # numerele observate (aceleași ca M)</br>\nXsq$expected   # numerele așteptate sub nul</br>\nXsq$residuals  # reziduurile Pearson</br>\nXsq$stdres     # reziduurile standardizate</br>\n</br>\n## Efectul simulării valorilor p</br>\nx <- matrix(c(12, 5, 7, 7), ncol = 2)</br>\nchisq.test(x)$p.value           # 0.4233</br>\nchisq.test(x, simulate.p.value = TRUE, B = 10000)$p.value</br>\n                                # în jur de 0.29!</br>\n</code> <br/>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(chisq.test, package ='caret')      \n"
  }
}