{
  "title": "Kappa lui Cohen",
  "navigation": "Kappa lui Cohen",
  "obs1var": "Observator 1:",
  "obs2var": "Observator 2:",
  "cilevel": "Nivel de Încredere:",
  "label1": "Greutăți ale Categoriilor",
  "equal": "Cicchetti-Allison (spațiere egală)",
  "quadratic": "Fleiss-Cohen (categorizare quadratică)",
  "agreeplot": "Grafic de Acord și statistici Bangdiwala",
  "help": {
    "title": "Kappa lui Cohen",
    "r_help": "help(Kappa,package=vcd)",
    "body": "\n                <b>Descriere</b></br>\nKappa lui Cohen măsoară acordul între doi observatori care măsoară aceleași subiecte. Kappa neponderat este pentru categorii neordonate, în timp ce kappa ponderat este pentru categorii ordonate. Pentru kappa ponderat, se acordă mai multă greutate cu cât categoriile sunt mai apropiate. Kappa poate varia între -1 și 1, cu 1 fiind acord perfect și 0 nu mai bun decât șansa. Valorile negative indică un acord mai rău decât șansa, dar este rar în practică. Observatorii trebuie să măsoare subiecții pe aceeași scară cu toate categoriile utilizate de fiecare observator. Acest lucru produce un tabel de contingență pătrat. Un tabel de contingență și statisticile kappa sunt furnizate.</br>\nObservator 1: Variabilă care conține valorile furnizate de un observator; poate fi fie numerică, fie un factor</br>\nObservator 2: Variabilă care conține valorile furnizate de un al doilea observator; poate fi fie numerică, fie un factor</br>\nNivel de Încredere: Nivelul dorit al intervalului de încredere pentru statisticile kappa</br>\nGreutăți ale Categoriilor: Greutatea dorită pentru nivelurile de dezacord ale categoriilor</br>\nGrafic de Acord și statistici Bangdiwala: opțiune de a produce un grafic de acord cu statisticile Bangdiwala</br>\n<b>Pachet</b></br>\ngmodels;vcd</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă help(Kappa,package=vcd) creând un chunk de cod R făcând clic pe + în fereastra de ieșire\n                "
  }
}