{
  "title": "Riscuri Competing, compară grupurile",
  "navigation": "Riscuri Competing, compară grupurile",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (0 = cenzură, 1 = eveniment 1, 2 = eveniment 2, ...)",
  "groupvarlabel": "Grup",
  "eventnum": "Cod Eveniment",
  "singleeventchkbox": "Plotează pentru un singur eveniment",
  "printallest": "Tabel de estimare inclusiv toate timpurile",
  "printspecest": "Tabel de estimare pentru timpi specifici",
  "spectimes": "Specificați timpi ca time1, time2, time3, etc. sau ca seq(1,5,by=1)",
  "styleoptions": "Opțiuni de stil",
  "axisoptions": "Opțiuni axă",
  "titleboxall": "Titlu plot (toate graficele evenimentelor)",
  "titleboxsingle": "Titlu plot (graficele unui singur eveniment)",
  "plottitlesizelabel": "Dimensiunea titlului plot (5-50)",
  "themedropdown": "Tema plotului",
  "label1": "Legendă",
  "legendpos": "Poziție",
  "keywidthlabel": "Lățimea cheii (cm; plot combinat doar)",
  "legendeventslabel": "Evenimente",
  "legendtitle": "Titlu",
  "eventlabels": "Etichete (specificați etichete separate prin virgule în ordinea codurilor evenimentelor: de exemplu, 'Eveniment 1', 'Eveniment 2', etc; nu codul de cenzură)",
  "legendgroupslabel": "Grupuri",
  "grouplabels": "Etichete (specificați etichete separate prin virgule în ordinea grupurilor: de exemplu, 'Grup 1', 'Grup 2', etc.)",
  "legendfontsize": "Dimensiunea etichetelor legendei (5-50)",
  "wraplabelfontsize": "Dimensiunea etichetei evenimentului pentru plot pe eveniment (5-50)",
  "label2": "Număr la risc",
  "natriskchkbox": "Includeți numărul la risc",
  "risktableprop": "Înălțimea tabelului de risc (0-1)",
  "risktablevaluesize": "Dimensiunea valorii tabelului de risc (1-15)",
  "risktabletitlesize": "Dimensiunea titlului tabelului de risc (5-50)",
  "risktableaxislabelsize": "Dimensiunea etichetei axei tabelului de risc (5-50)",
  "risktableticklabelsize": "Dimensiunea etichetei de tick a tabelului de risc (5-50)",
  "risktableclean": "Eliminați axele și liniile de grilă din tabelul de risc",
  "label3": "Opțiuni linie",
  "linesize": "Dimensiune (0-5)",
  "colorpalette": "Paleta de culori",
  "label4": "Interval de încredere",
  "cichkbox": "Includeți CI de 95%",
  "labelblank": "",
  "cistyle": "Stil",
  "citransparency": "Transparență (0-1)",
  "censorlabel": "Timpi cenzurați",
  "censorchkbox": "Includeți timpi cenzurați",
  "censorsize": "Dimensiune (0-10)",
  "pvaluelabel": "P-Valoare (graficele unui singur eveniment doar)",
  "pvaluechkbox": "Includeți p-valoarea",
  "pvaluelocationx": "Locația pe axa X (Timp)",
  "pvaluelocationy": "Locația pe axa Y (Probabilitate)",
  "pvaluesize": "Dimensiune (1-20)",
  "pvalueaccuracy": "Precizie (0-1)",
  "label5": "Axa incidenței",
  "incaxislabelall": "Etichetă (toate graficele evenimentelor)",
  "incaxislabelsingle": "Etichetă (grafica unui singur eveniment)",
  "label6": "Scală",
  "defbutton": "proporție",
  "pctbutton": "percent",
  "label7": "Limitele axei și incrementurile etichetei de tick (0-1)",
  "incaxismin": "Minim",
  "incaxismax": "Maxim",
  "incaxisinc": "Increment",
  "label8": "Axa timpului",
  "timeaxislabel": "Etichetă",
  "label9": "Limitele axei și incrementurile etichetei de tick",
  "timeaxismin": "Minim",
  "timeaxismax": "Maxim",
  "timeaxisinc": "Increment",
  "label10": "Notă: Maximul poate fi specificat fără a specifica Increment. Incrementul nu poate fi specificat fără a specifica Maximul.",
  "axislabelsize": "Dimensiunea etichetei axei (5-50)",
  "ticklabelsize": "Dimensiunea etichetei de tick a axei (5-50)",
  "help": {
    "title": "Riscuri Competing, Compară Grupuri",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n            <br/>\n            Un risc concurent este un eveniment a cărui apariție împiedică apariția evenimentului principal de interes. Efectuarea unei analize standard Kaplan-Meier în astfel de cazuri este părtinitoare și supraestimează riscul de eveniment. Acest dialog este utilizat pentru a estima riscul cumulativ de a avea evenimentul principal după începutul urmării pentru acel eveniment (sau timpul zero), atunci când unul sau mai multe riscuri concurente sunt prezente. Suma incidențelor cumulative pentru fiecare eveniment este egală cu incidența cumulativă pentru orice eveniment. Subiecții trebuie să fie la risc pentru toate evenimentele începând de la timpul zero. Graficele de incidență cumulativă pentru toate evenimentele (curbe separate pentru fiecare eveniment pe același grafic), și opțional pentru un eveniment specific de sine stătător, sunt furnizate. \n            <br/>\n            O introducere în subiectul riscurilor concurente poate fi găsită în \"Introducere în analiza datelor de supraviețuire în prezența riscurilor concurente\" de Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Timp până la eveniment sau cenzură:</b> Pentru fiecare subiect, lungimea timpului până la primul eveniment, dacă a avut loc un eveniment, sau ultima urmărire pentru evenimente, dacă nu au avut loc evenimente.\n            <br/><br/>\n            <b>Evenimente:</b> Indicator numeric al evenimentului care a avut loc (1=eveniment 1, 2=eveniment 2, etc.) sau când nu au avut loc evenimente (0=cenzură) pentru fiecare subiect\n            <br/><br/>\n            <b>Plotează pentru un singur eveniment:</b> Dacă doriți să plotați incidența cumulativă pentru un eveniment specific de sine stătător. <b>Codul Evenimentului</b> corespunde evenimentului care va fi plotat.\n            <br/><br/>\n            <b>Tabel de estimare inclusiv toate timpurile:</b> Opțiune de a include un tabel care listează probabilitățile de incidență cumulativă și intervalele de încredere de 95% pentru fiecare timp observat în setul de date\n            <br/>\n            <br/>\n\t\t\t<b>Tabel de estimare pentru timpi specifici:</b> Opțiune de a include un tabel care are probabilitățile de incidență cumulativă pentru un set de timpi selectați de utilizator.\n\t\t\t<br/><br/>\n\t\t\t<b>Specificați timpi ca time1, time2, time3, etc. sau ca seq(1,5,by=1):</b> Aceștia sunt timpii specifici care vor fi incluși în tabel pentru timpi specifici. Pot fi specificați individual cu virgule, sau ca o secvență de valori uniform distribuite.\n\t\t\t<br/><br/>\t\t\t\n            Tabelele sunt generate cu dimensiunea eșantionului, numărul de subiecți cu fiecare eveniment, timpul mediu restricționat în stare, și timpul median de urmărire. Timpul median de urmărire este calculat folosind estimatorul Kaplan-Meier invers, care tratează evenimentele adevărate ca observații cenzurate și observațiile cenzurate adevărate ca evenimente. Astfel, \"evenimentul\" în acest estimator este \"urmărirea subiecților cât mai mult timp posibil\".\n            <br/>\n            O tabelă de estimări ale incidenței cumulative este furnizată la fiecare timp observat în setul de date, cu intervale de încredere de 95%. \n            <br/>\n            <br/>\n            <b>Pachete R necesare:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>Opțiuni de stil</b>\n            <br/>\n            <br/>\n            <b>Titlu plot (toate graficele evenimentelor):</b> Titlul graficelor care afișează toate evenimentele; ștergeți tot textul pentru a nu avea titlu\n            <br/><br/>\n            <b>Titlu plot (grafica unui singur eveniment):</b> Titlul graficului care afișează evenimentul selectat; ștergeți tot textul pentru a nu avea titlu\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea titlului plot:</b> Dimensiunea titlurilor graficelor.\n\t\t\t<br/><br/>\n            <b>Tema plotului:</b> Stilul general al graficului\n            <br/><br/>\n            <b>Opțiuni legendă:</b>\n            <br/>\n            Opțiunea <b>Poziție</b> controlează locația legendei (sus, jos, stânga, dreapta). <b>Lățimea cheii</b> este utilizată pentru a schimba lățimea cheilor legendei în graficul care combină toate evenimentele și toate grupurile. Acest lucru poate fi utilizat pentru a face tipurile de linii mai ușor de citit în legendă.\n\t\t\t<b>Titlu Eveniment</b> este titlul pentru partea legendei care delimitează evenimentele. <b>Titlu Grup</b> este titlul pentru partea legendei care delimitează grupurile. Ștergeți textul dacă nu este dorit un titlu. <b>Etichetele Evenimentelor</b> sunt utilizate pentru a arăta text pentru fiecare cod numeric de eveniment în loc de coduri. <b>Etichetele Grupurilor</b> sunt utilizate pentru a schimba textul pentru grupuri. Dacă specificați orice etichete, toate etichetele trebuie să fie specificate.\n\t\t\tOpțiunea <b>Dimensiunea Etichetelor Legendei</b> controlează dimensiunea tuturor textelor conținute în legendă.\n\t\t\tOpțiunea <b>Dimensiunea Etichetei Evenimentului pentru Plot pe Eveniment</b> controlează dimensiunea textului numelui evenimentului în graficul care se împarte pe tipul de eveniment.\n            <br/>\n            <br/>\n            <b>Număr la risc:</b>\n\t\t\t<br/>\n\t\t\tOpțional, includeți un tabel pentru numărul de subiecți care sunt încă la risc în timp la baza graficelor. Acesta nu este furnizat pentru graficul care se împarte pe eveniment din motive de spațiu și lizibilitate. <b>Înălțimea Tabelului de Risc</b> controlează proporția zonei de plotare pe care tabelul o va ocupa.\n\t\t\t<b>Dimensiunea Valorii Tabelului de Risc</b> controlează dimensiunea numerelor la risc. <b>Dimensiunea Titlului Tabelului de Risc</b> controlează dimensiunea titlului pentru tabelul numărului la risc.\n\t\t\t<b>Dimensiunea Etichetei Axei Tabelului de Risc</b> controlează dimensiunea etichetelor axei. \n\t\t\t<b>Dimensiunea Etichetei de Tick a Tabelului de Risc</b> controlează dimensiunea etichetelor de tick. Dacă se dorește eliminarea tuturor axelor și liniilor de grilă \n\t\t\tdin tabelul numărului la risc, opțiunea <b>Eliminați Axele și Liniile de Grilă din Tabelul de Risc</b> poate fi bifată. Aceasta va include doar numerele la risc în tabel.           \n            <br/><br/>\n            <b>Opțiuni Linie:</b>\n            <br/>\n            <b>Dimensiune</b> controlează grosimea. Opțiunea <b>Paleta de Culori</b> controlează paleta de culori utilizată pentru liniile din toate graficele. Schemele de culori care imită jurnalele științifice sunt de asemenea furnizate. Se poate include opțional un interval de încredere de 95% pentru estimări fie într-un format <b>ribbon</b> (zonă umbrită) sau <b>step</b> (linie). <b>Transparența</b> controlează cât de întunecată este panglica și este ignorată atunci când opțiunea pas este selectată.\n\t\t\t<br/><br/>\n\t\t\t<b>Includeți Timpi Cenzurați:</b> Timpii cenzurați (când subiecții nu mai sunt la risc pentru evenimente) pot fi incluși ca semne plus pe linii. Acest lucru este mai util în seturi de date mai mici sau în cazurile unui număr mai mic de subiecți cenzurați. Aceștia nu sunt furnizați în graficul care suprapune toate evenimentele și grupurile din motive de lizibilitate.\n\t\t\t<b>Dimensiune</b> controlează dimensiunea semnelor plus de timp cenzurat.\n\t\t\t<br/><br/>\n\t\t\t<b>Includeți p-valoarea</b> poate fi utilizată pentru a include p-valoarea testului Gray pentru evenimentul selectat pe graficul unui singur eveniment. <b>Locația pe axa X (Timp)</b> și <b>Locația pe axa Y (Probabilitate)</b> oferă coordonatele (X, Y) ale p-valoarei pe grafic.\n\t\t\t<b>Dimensiune</b> controlează dimensiunea p-valoarei pe grafic. <b>Precizie</b> controlează precizia p-valoarei. De exemplu, valoarea implicită de 0.0001 ar afișa p-valori nu mai mici de 0.0001. Orice p-valoare mai mică de 0.0001 ar fi afișată ca \"p<0.0001\". \n            <br/><br/><br/>\n\t\t\t<b>Opțiuni Axă</b>\n            <br/>\n            <br/>\n            Opțiunile <b>Etichetă</b> specifică eticheta textului pentru axă. Opțiunea <b>Limitele Axei</b> specifică valorile minime și maxime ale axei. Opțiunea <b>Incrementurile Etichetei de Tick</b> controlează distanțarea etichetelor de tick pe axă. Incrementurile pe axa timpului controlează de asemenea timpii pentru tabelul opțional număr la risc.\n            <br/>\n            Opțiunea <b>Scală</b> a axei incidenței specifică dacă doriți ca estimările să fie pe o scară de proporție (0-1) sau procent (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Etichetei Axei:</b>  Aceasta controlează dimensiunea atât a etichetelor axei incidenței, cât și a axei timpului.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Etichetei de Tick a Axei:</b>  Aceasta controlează dimensiunea atât a etichetelor de tick ale axei incidenței, cât și a axei timpului.\n      "
  }
}