{
  "title": "Compară Curbele ROC",
  "navigation": "Compară Curbele ROC",
  "outcomevar": "Variabilă de rezultat binară (numerică/factor)",
  "predprobvars": "Variabile de probabilitate prezisă din fiecare model, specificați cel puțin 2",
  "outcomeorderlabel": "Valoarea 'Pozitivă' a rezultatului",
  "outcomeorderhigh": "Valoare ordonată mai mare",
  "outcomeorderlow": "Valoare ordonată mai mică",
  "specopt": "Plotează specificitatea în loc de 1-specificitate",
  "cilevel": "Nivel de încredere",
  "multcompopt": "Ajustare pentru comparații multiple",
  "multcompmethod": "Metoda de comparație multiplă",
  "plotoptions": "Opțiuni de plotare",
  "plottitle": "Titlul plotului",
  "plottitlesize": "Dimensiunea titlului plotului (5-50)",
  "themedropdown": "Tema plotului",
  "lineoptionslabel": "Opțiuni pentru linii",
  "linesize": "Dimensiunea liniei (0-5)",
  "colorpalette": "Paleta de culori",
  "axisoptionslabel": "Opțiuni pentru axă",
  "axislabelsize": "Dimensiunea etichetei axei (5-50)",
  "ticklabelsize": "Dimensiunea etichetei marcajului axei (5-50)",
  "legendoptionslabel": "Opțiuni pentru legendă",
  "legendtitle": "Titlu",
  "legendpos": "Poziție",
  "curvelabels": "Etichete pentru curbe, specificați ca 'Eticheta 1', 'Eticheta 2', 'Eticheta 3'; folosiți \\n în cadrul unei etichete pentru o întrerupere de linie",
  "legendfontsize": "Dimensiunea etichetelor din legendă (5-50)",
  "help": {
    "title": "Compară Curbele ROC",
    "r_help": "help(roc.test, package = 'pROC')",
    "body": "\nAcest dialog compară curbele caracteristice de operare a receptorului (ROC) având un set de probabilități prezise dintr-un model (de exemplu, regresie logistică). Fiecare model trebuie să fi fost ajustat folosind aceeași ordonare a variabilei de rezultat. Oferă un tabel cu ariile individuale sub curbele ROC cu intervale de încredere, un tabel cu comparații pereche folosind testul DeLong și un set suprapus de curbe ROC. Subiecții cu valori lipsă pentru rezultat sau probabilitățile prezise sunt eliminați astfel încât fiecare model să fie evaluat pe același set de subiecți. Consultați Evaluarea Modelului > Predicție > Scorarea Modelului pentru a obține probabilitățile prezise din modelele candidate. \n<br/><br/><br/>\n<b>Variabilă de rezultat binară:</b> Rezultatul binar utilizat pentru predicții. Trebuie să fie numeric sau factor.\n<br/><br/>\n<b>Variabile de probabilitate prezisă din fiecare model:</b> Specificați coloanele de probabilitate prezisă din fiecare model ajustat pe care doriți să le comparați.\n<br/><br/>\n<b>Valoarea 'Pozitivă' a rezultatului:</b> Specificați dacă valoarea ordonată mai mare sau mai mică a variabilei de rezultat binară specificate ar trebui considerată valoarea 'pozitivă'. Acesta este nivelul la care se referă probabilitățile prezise. De exemplu, dacă rezultatul binar a fost codificat ca 0/1, valoarea ordonată mai mare ar însemna că 1 este răspunsul 'pozitiv' și valoarea ordonată mai mică ar însemna că 0 este răspunsul 'pozitiv'. \n<br/><br/>\n<b>Plotează specificitatea în loc de 1-specificitate:</b> Aceasta schimbă axa x a plotului curbei ROC pentru a folosi specificitatea în schimb. Axa va scădea de la 1 la 0, pe măsură ce mergeți de la stânga la dreapta.\n<br/><br/> \n<b>Nivel de încredere:</b> Nivelul de încredere pentru intervalele de arie a curbei ROC\n<br/><br/>\n<b>Ajustare pentru comparații multiple:</b> Aplicați o ajustare pentru comparații multiple la comparațiile pereche ale ariilor curbelor ROC.\n<br/><br/><br/>\n<b>Opțiuni de plotare:</b>\n<br/><br/>\n<b>Titlul plotului:</b> Specificați titlul pentru plot. Poate fi eliminat.\n<br/><br/>\n<b>Tema plotului:</b> Specificați tema generală pentru plot\n<br/><br/>\n<b>Opțiuni pentru linii:</b>\n<br/><br/>\n<b>Dimensiunea liniei:</b> Specificați dimensiunea liniilor pe plotul curbei ROC\n<br/><br/>\n<b>Paleta de culori:</b> Specificați paleta de culori utilizată pentru liniile curbei ROC\n<br/><br/>\n<b>Opțiuni pentru axă:</b>\n<br/><br/>\n<b>Dimensiunea etichetei axei:</b> Specificați dimensiunea etichetelor axei utilizate pe plot.\n<br/><br/>\n<b>Dimensiunea etichetei marcajului axei:</b> Specificați dimensiunea etichetelor marcajului axei.\n<br/><br/>\n<b>Opțiuni pentru legendă:</b>\n<br/><br/>\n<b>Poziție:</b> Specificați poziția legendei în plot. Poate fi dreapta, sus, jos sau stânga.\n<br/><br/>\n<b>Titlu:</b> Specificați titlul pentru legendă. Poate fi eliminat.\n<br/><br/>\n<b>Etichete pentru curbe:</b> Specificați etichetele curbelor utilizate în legendă corespunzătoare ordinii curbelor (curba 1, curba 2, curba 3, etc.). Specificarea nimic nu va produce etichete pentru curbe de 1, 2, 3, etc. Dacă specificați orice etichete, trebuie să specificați etichete pentru toate curbele. Ordinea curbelor este aceeași cu ordinea specificată a probabilităților prezise.\n<br/><br/>\n<b>Dimensiunea etichetelor din legendă:</b> Dimensiunea tuturor textelor din legendă.\n<br/><br/>\n<b>Pachete R necesare:</b> pROC, ggthemes, RColorBrewer, ggsci, ggplot2\n"
  }
}