{
  "title": "Interval de încredere",
  "navigation": "Interval de încredere",
  "label1": "Selectați un model din una dintre următoarele clase. (Clasa R este listată între paranteze mai jos)",
  "label2": "Model liniar (lm), Model liniar generalizat (glm), Cele mai mici pătrate neliniare (nls), Regresie logistică/probit ordonată (polr), Modele log-lineare multinomiale (multinom), Modele de regresie Cox (coxph)",
  "label3": "Pe baza",
  "modelselector1": "Selectați un model",
  "conlevel": "Interval de încredere",
  "lr": "Statistica raportului de verosimilitate",
  "wald": "Statistica Wald",
  "help": {
    "title": "Interval de încredere",
    "r_help": "help(confint,package='stats')",
    "body": "\n                <b>Descriere</b></br>\nCalculează intervale de încredere pentru unul sau mai mulți parametri într-un model ajustat. Există o metodă implicită și o metodă pentru obiecte care moștenesc din clasa \"lm\". Modelele lm și coxph folosesc doar metoda Wald.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nconfint(object, parm, level = 0.95, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: un obiect de model ajustat.\n</li>\n<li>\nparm: o specificare a parametrilor pentru care se vor da intervale de încredere, fie un vector de numere, fie un vector de nume. Dacă lipsește, toți parametrii sunt considerați.\n</li>\n<li>\nlevel: nivelul de încredere solicitat.\n</li>\n<li>\n...: argumente care vor fi transmise metodelor.\n</li>\n</ul>\n<b>Detalii</b></br>\nconfint este o funcție generică. Metoda implicită presupune normalitate și necesită metode adecvate coef și vcov să fie disponibile. Metoda implicită poate fi apelată direct pentru comparație cu alte metode.</br>\nPentru obiectele din clasa \"lm\", formulele directe bazate pe valorile t sunt utilizate.</br>\nExistă metode stub în pachetul stats pentru clasele \"glm\" și \"nls\" care apelează cele din pachetul MASS (dacă este instalat): dacă spațiul de nume MASS a fost încărcat, metodele sale vor fi utilizate direct. (Aceste metode sunt bazate pe verosimilitatea profilului.)</br>\n<b>Valoare</b></br>\nO matrice (sau vector) cu coloane care oferă limitele inferioare și superioare ale intervalului de încredere pentru fiecare parametru. Acestea vor fi etichetate ca (1-level)/2 și 1 - (1-level)/2 în % (implicit 2.5% și 97.5%).</br>\n<b>Exemple</b><br/>\n<code> \nfit <- lm(100/mpg ~ disp + hp + wt + am, data = mtcars)<br/>\nconfint(fit)<br/>\nconfint(fit, \"wt\")<br/>\n## din exemplul(glm)\ncounts <- c(18,17,15,20,10,20,25,13,12)\noutcome <- gl(3, 1, 9); treatment <- gl(3, 3)\nglm.D93 <- glm(counts ~ outcome + treatment, family = poisson())\nconfint(glm.D93) # necesită MASS să fie instalat\nconfint.default(glm.D93)  # bazat pe normalitatea asimptotică\n</code> <br/>\n<b>Pachet</b></br>\nstats;MASS;knitr</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă în editorul de sintaxă R help(confint , package='stats')\n                "
  }
}