{
  "title": "Grafic Coxcomb",
  "navigation": "Coxcomb",
  "x": "Variabilă pe axa X, specificați o variabilă factor",
  "y": "Variabilă Y, specificați o variabilă numerică",
  "fill": "Umplere, specificați o variabilă factor",
  "alpha": "Opacitate (0-1)",
  "width": "Lățime",
  "rdgrp1": "Proporții de umplere",
  "flip": "Răsturnați axa",
  "barcolor": "Culoarea barei (După selectarea culorii, faceți clic în afara controlului pentru a aplica)",
  "specify_a_title": "Introduceți un titlu",
  "x_title": "Eticheta axei X",
  "y_title": "Eticheta axei Y",
  "Facetrow": "Rând de fațete",
  "Facetcolumn": "Coloană de fațete",
  "Facetwrap": "Împachetare de fațete",
  "Facetscale": "Scală de fațete",
  "help": {
    "title": "Grafic Coxcomb",
    "r_help": "help(coord_polar, package='ggplot2')",
    "body": "\n            <b>Descriere</b></br>\nUn grafic Coxcomb/Bulls Eye (sau un grafic circular) este un grafic statistic circular, care este împărțit în felii/cercuri concentrice pentru a ilustra proporția numerică. Într-un grafic Coxcomb/Bulls Eye, lungimea lățimii fiecărui cerc concentric (și, prin urmare, aria sa) este proporțională cu cantitatea pe care o reprezintă. Cantitatea poate fi reprezentată ca un număr sau procent.</br>​\nFațetele pot fi create opțional prin specificarea unei variabile factor. De asemenea, puteți specifica opțional teme și un titlu și etichete pentru axele x și y.</br>\nCând specificați mai multe variabile x, creăm un grafic Coxcomb/Bulls Eye separat pentru fiecare variabilă x.</br>\n<b>Utilizare</b>\n<br/>\n<code>\n#Puteți crea un grafic Bulls Eye pentru o singură variabilă factor, un cerc concentric va fi creat pentru fiecare nivel al variabilei factor. Lățimea cercului concentric este proporțională cu numărul fiecărui nivel al nivelului factorului. Aici variabila factor va corespunde umplerii, după cum urmează<br/>\n#penguins este un set de date în pachetul R equatiomatic\nggplot(data=penguins,aes(x ='',fill=species)) +​\n                 geom_bar(alpha=1,width =0.9) +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"Număr\",fill =\"var1\",title= \"Grafic Bulls Eye cu Umplere: species\")​</br></br>\n#Puteți crea un grafic Bulls Eye specificând o variabilă scală/numerică ca variabilă y și o variabilă factor care servește ca umplere. Aici un cerc concentric este creat pentru fiecare nivel al variabilei factor de umplere. Lățimea cercului concentric este proporțională cu suma valorilor y la fiecare nivel al nivelului factorului. Aici variabila factor va corespunde umplerii, după cum urmează<br/>\nggplot(data=penguins,aes(x ='', y = bill_length_mm, fill = species)) +​\n                 geom_bar(alpha=1,width =0.9,stat=\"identity\") +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"var1\",fill =\"var2\",title= \"Grafic Bulls Eye cu estetică X:, estetică Y: var1, Umplere: var2\") </br></br>\n\n#Puteți crea un grafic Coxcomb specificând o variabilă x. Feliile sunt create pentru fiecare nivel al variabilei x, raza fiecărei felii este proporțională cu numărul<br/>\n    ggplot(data=penguins, aes(x=island, )) +\n        geom_bar( alpha=1,width=1,) +\n        coord_polar(\"x\") +\n        labs(x=\"island\",  title= \"Grafic Coxcomb cu estetică X: island\") +\n        xlab(\"island\") + ylab(\"Număr\")</br></br>\n\n#Puteți genera un grafic Coxcomb specificând o variabilă X și o umplere. Feliile sunt create pentru fiecare nivel al variabilei x. Fiecare felie este umplută de numărul cazurilor în fiecare nivel al variabilei de umplere specificate.\nggplot(data=penguins, aes(x=island,fill=species )) +\n\tgeom_bar( alpha=1, width=1) +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\",  title= \"Grafic Coxcomb cu estetică X: island umplere: species\") +\n\txlab(\"island\") + ylab(\"Număr\")</br></br>\n\n\n#Puteți crea un grafic Coxcomb specificând o variabilă x, o variabilă y și o umplere. Feliile sunt create pentru fiecare nivel al variabilei x și umplute de suma valorilor variabilei y pentru fiecare nivel al variabilei specificate în umplere. Feliile sunt împărțite în funcție de nivelurile variabilei de umplere. Aria ocupată de fiecare nivel al variabilei de umplere în cadrul feliei este proporțională cu suma numărului variabilei y care se potrivește cu felia și variabila de umplere.<br/>\nggplot(data=penguins, aes(x=island,y=bill_depth_mm,fill=species )) +\n\tgeom_bar( alpha=1,width=1,stat = \"identity\") +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\", y=\"bill_depth_mm\", title= \"Grafic Coxcomb cu estetică X: island estetică Y: bill_depth_mm umplere: species\") +\n\txlab(\"island\") + ylab(\"bill_depth_mm\")</br></br>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndata: Setul de date implicit​\n</li>\n<li>\naes(): Generați mapări estetice care descriu modul în care variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geoms.​\n</li>\n<li>\nx: (Opțional) O variabilă factor/categorială. Lungimea barei corespunde numărului fiecărui nivel al variabilei factor.​\n</li>\n<li>\nY: (Opțional) o variabilă numerică\n</li>\n<li>\numplere: (Opțional) O variabilă factor/categorială opțională pentru a grupa numerele nivelurilor în x: (vezi mai sus)​\n</li>\n<li>\ngeom_bar(): Creează graficul cu bare, poziția =\"fill\" umple bara cu un procent din fiecare nivel de grupare.​\n</li>\n<li>\nCoor_polar(): Sistemul de coordonate polare este cel mai frecvent utilizat pentru graficele de tip plăcintă, care sunt un grafic cu bare stivuite în coordonate polare.\n</li>\n<li>\nLabs(): Schimbați etichetele axelor și titlurile legendelor (Aceasta este opțional)​\n</li>\n<li>\nfacet_grid(): Așezați panourile într-o grilă (Aceasta este opțional)​\n</li>\n<li>\ntheme_calc(): Specifică tema calculatorului (Aceasta este opțional)​\n</li>\n<li>\ncoord_flip(): Răsturnați axa (Aceasta este opțional)​\n</li>\n<li>\nalpha: Controlează opacitatea, ia valori între 0-1. 1 înseamnă fără opacitate.\n</li>\n</ul>\n<b>Pachet</b></br>\nggplot2;ggthemes;</br>\n<b>Ajutor</b></br>\nhelp(coord_polar, package=ggplot2)</br>\nAltele: Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n    "
  }
}