{
  "title": "Cox, Fine-Gray",
  "navigation": "Cox, Fine-Gray",
  "modelname": "Introduceți numele modelului",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (0 = cenzură, 1 = eveniment 1, 2 = eveniment 2, ...)",
  "eventcodelabel": "Cod Eveniment",
  "modelterms": "Constructor de expresii pentru variabilele independente",
  "stratavarslabel": "Variabile de stratificare (opțional)",
  "weightvar": "Greutăți (opțional)",
  "tiemethod": "Metoda timpului legat",
  "diagnosticsbox": "Diagnosticare Model",
  "martminlabel": "Valoarea minimă a axei reziduale martingale a modelului nul (-Inf la 1)",
  "anovachkboxlabel": "Analiza devianței (Tip II)",
  "help": {
    "title": "Cox, Fine-Gray",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nSe potrivește un model de hazard proporțional Fine-Gray pentru datele de tip timp-până-la-eveniment cu observații cenzurate atunci când riscurile concurente sunt prezente. Modelele Fine-Gray modelează efectul \nal covariatelor asupra funcției de incidență cumulativă. O alternativă este să se modeleze efectul covariatelor asupra hazardului specific cauzei, pentru care se pot folosi modelele standard de regresie Cox.\nO introducere în subiectul riscurilor concurente poate fi găsită în \"Introducerea în analiza datelor de supraviețuire în prezența riscurilor concurente\" de Peter Austin, \net. al., Circulation, 2016; 133:601-609.\n<br/><br/>\nStatisticile de ajustare a modelului, estimările parametrilor și rapoartele de hazard sunt furnizate. Opțiunile disponibile includ metoda timpului legat și diagnosticarea modelului. Modelul este ajustat folosind funcțiile \nfinegray și coxph din pachetul survival.\n<br/><br/>\n<b>Introduceți numele modelului:</b> Specificați numele modelului în care vor fi stocate rezultatele.\n<br/><br/>\n<b>Timp până la eveniment sau cenzură:</b> Timp până la primul eveniment pentru cei care experimentează un eveniment sau timp până la ultima urmărire pentru cei care nu experimentează niciun eveniment.\n<br/><br/>\n<b>Evenimente (0 = cenzură, 1 = eveniment 1, 2 = eveniment 2, ...):</b> Indicator numeric al evenimentului; 0=cenzură, 1=eveniment 1, 2=eveniment 2, etc.\n<br/><br/>\n<b>Cod Eveniment:</b> Selectați evenimentul de interes pe care doriți să-l modelați. Poate fi selectat sau introdus manual.\n<br/><br/>\n<b>Constructor de formule:</b> Construiți termeni de inclus în model. Factorii, șirurile și variabilele logice vor fi codificate dummy. Butoanele furnizate vă permit să specificați efecte principale, efecte factoriale complete (efecte principale și toate interacțiunile cu variabilele implicate), polinoame, interacțiuni specifice și să ștergeți termeni din listă. Interacțiunile \ncu variabilele de stratificare sunt permise.\n<br/><br/>\n<b>Variabile de stratificare:</b> Specificați una sau mai multe variabile de stratificare. Acestea pot fi variabile numerice, factori, factori ordonați sau variabile de tip caracter. Stratele împart \nsuiectele în grupuri separate, fiecare grup având o funcție de hazard de bază distinctă. Dacă sunt date mai multe variabile de stratificare, se folosește o funcție de hazard de bază separată pentru fiecare combinație de niveluri ale variabilelor de stratificare.\n<br/><br/>\n<b>Greutăți:</b> Variabilă numerică pentru greutățile observației. Utilă în situațiile în care fiecare înregistrare nu ar trebui să fie considerată o observație.\n<br/><br/>\n<b>Metoda timpului legat:</b> Metoda de rupere a timpilor observați legați. Efron este de obicei cea mai bună alegere atunci când nu există mulți timpi legați.\n<br/><br/>\n<b>Diagnosticare Model:</b> Dacă este selectat, se va evalua proporționalitatea hazardului și forma funcțională a covariatelor, inclusiv graficele relevante. \nDacă există variabile de stratificare sau predictori non-numerici, graficele formei funcționale nu vor fi produse. \n<b>Valoarea minimă a axei reziduale martingale a modelului nul</b> ar putea necesita modificări pentru a vedea toate reziduurile martingale.\n<br/><br/>\n<b>Analiza devianței (Tip II):</b> Dacă este selectat, vor fi furnizate teste pentru variabile întregi (inclusiv teste cu grade de libertate multiple pentru covariatele cu mai multe categorii). Testele Wald \nsunt utilizate.\n<br/><br/>\n<b>Pachete R necesare:</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nFaceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R despre funcția coxph. Mergeți la Ajutor-> Ajutor Funcție R pentru a obține mai multe informații despre funcția finegray, care creează \ndatasetul necesar.\n"
  }
}