{
  "title": "Cox, Stratificat",
  "navigation": "Cox, Stratificat",
  "modelname": "Introduceți numele modelului",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (1 = eveniment 1, 0 = cenzură)",
  "modelterms": "Constructor de expresii pentru variabilele independente",
  "stratavarslabel": "Variabile de stratificare",
  "weightvar": "Greutăți (opțional)",
  "tiemethod": "Metoda timpului legat",
  "diagnosticsbox": "Diagnosticare a modelului",
  "help": {
    "title": "Cox, Stratificat",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n            Se potrivește un model Cox proporțional stratificat pentru datele de timp până la eveniment cu observații cenzurate. Acesta este un model Cox care permite o funcție de hazard de bază separată pentru fiecare nivel de strat. Statistici de ajustare a modelului, estimări ale parametrilor și rapoarte de hazard sunt furnizate. Opțiunile disponibile includ metoda timpului legat și diagnosticarea modelului. Modelul este ajustat folosind funcția coxph din pachetul survival. \n            <br/>\n            <br/>\n            <b>Timp până la eveniment sau cenzură:</b> Timpul până la eveniment pentru cei care experimentează evenimentul sau timpul până la ultima urmărire pentru cei care nu experimentează evenimentul\n            <br/><br/>\n            <b>Evenimente (1=eveniment, 0=cenzură):</b> Indicator numeric al evenimentului; 1=eveniment, 0=cenzură\n            <br/><br/>\n            <b>Constructor de formulă:</b> Construiți termeni de inclus în model. Factorii, șirurile și variabilele logice vor fi codificate dummy. Butoanele furnizate vă permit să specificați efecte principale, efecte factoriale complete (efecte principale și toate interacțiunile cu variabilele implicate), polinoame, interacțiuni specifice și să ștergeți termeni din listă. Interacțiunile cu variabilele de stratificare sunt permise.\n            <br/><br/>\n\t\t\t<b>Variabile de stratificare:</b> Specificați una sau mai multe variabile de stratificare. Acestea pot fi variabile numerice, factori, factori ordonați sau variabile de tip caracter. Straturile împart subiecții în grupuri separate, fiecare grup având o funcție de hazard de bază distinctă. Dacă sunt date mai multe variabile de stratificare, se folosește o funcție de hazard de bază separată pentru fiecare combinație de niveluri ale variabilelor de stratificare.\n\t\t\t<br/><br/>\n            <b>Greutăți:</b> Variabil numeric pentru greutățile observației. Util în situațiile în care fiecare înregistrare nu ar trebui să fie numărată ca o observație. \n            <br/>\n            <br/>\n            <b>Pachete necesare:</b> survival, broom, survminer\n            <br/>\n            <br/>\n            Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R despre funcția coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opțiuni</b>\n            <br/>\n            <br/>\n            <b>Metoda timpului legat:</b>\n            <br/>\n            Metoda de rupere a timpilor observați legați. Efron este de obicei cea mai bună alegere atunci când nu există multe timpuri legate. Metoda exactă poate fi benefică dacă există multe timpuri legate, așa cum se întâmplă în situații de timp discret, dar poate dura puțin mai mult pentru a se ajusta modelul. \n            <br/>\n            <br/>\n            <b>Diagnosticare a modelului:</b>\n            <br/>\n            Dacă este selectat, teste și grafice de hazard proporțional vor fi furnizate, în plus față de un grafic de reziduuri Martingale.\n      "
  }
}