{
  "title": "Cox, covariabile binare dependente de timp",
  "navigation": "Cox, covariabile binare dependente de timp",
  "modelname": "Introduceți numele modelului",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (1 = eveniment 1, 0 = cenzură)",
  "modelterms": "Constructor de expresii pentru variabilele independente",
  "switchtimeslabel": "Variabile de timp de expunere pentru covariabilele dependente de timp",
  "tdprefixlabel": "Prefix pentru covariabilele dependente de timp",
  "subjectidlabel": "Identificator subiect",
  "weightvar": "Greutăți (opțional)",
  "tiemethod": "Metoda timpului legat",
  "forestplotbox": "Grafic forestier",
  "diagnosticsbox": "Diagnosticarea modelului",
  "martscalebox": "Valoarea minimă a axei reziduale Martingale a modelului nul (-Inf la 1):",
  "devbox": "Analiza devianței (Tip II)",
  "devtype": "Statistică de test",
  "startstopboxlabel": "Arată setul de date (început, sfârșit)",
  "startstopnamelabel": "Numele setului de date",
  "help": {
    "title": "Cox, covariabile binare dependente de timp",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nSe potrivește un model Cox de riscuri proporționale pentru datele de timp până la eveniment cu observații cenzurate care include una sau mai multe covariabile binare dependente de timp \"expunere\". Acest tip de \ncovariabilă este una în care apariția unui \"da\" poate avea loc după începutul urmării și odată ce acel \"da\" apare, rămâne un \"da\" pentru durata urmării. Un exemplu \nar fi respingerea unui grefon post-transplant (adică înainte ca respingerea să aibă loc, pacientul nu a fost \"expus\"; după ce respingerea are loc, pacientul a fost \"expus\").  \nTratarea unei astfel de covariabile ca fiind cunoscută la începutul urmării este o formă de a privi în viitor și duce la estimări părtinitoare (cunoscută și sub numele de \"părtinirea timpului nemuritor\").\n<br/><br/>\nStatisticile de potrivire a modelului, estimările parametrilor și rapoartele de risc sunt furnizate. Opțiunile disponibile includ metoda timpului legat, graficele forestiere, diagnosticarea modelului și capacitatea \nde a vizualiza setul de date de proces de numărare subiacente care este creat. O tabelă care descrie datele procesului de numărare este furnizată ca o verificare că aceste date sunt create \napropriat.\n<br/><br/>  \nSumarizarea datelor procesului de numărare:\n<br/>\n<b>devreme:</b> timp când predictorul se schimbă înainte de începerea timpului de urmărire<br/>\n<b>târziu:</b> timp când predictorul se schimbă după ce urmărirea se încheie<br/>\n<b>în interior:</b> timp când predictorul se schimbă în perioada de urmărire<br/>\n<b>în avans:</b> timp când predictorul se schimbă la începutul urmării<br/>\n<b>în urmă:</b> timp când predictorul se schimbă la sfârșitul urmării<br/>\n<b>limită:</b> timp când predictorul se schimbă fie la începutul, fie la sfârșitul urmării\n<br/><br/>\nPentru mai multe informații despre această tabelă, consultați vignetta covariabilelor dependente de timp la <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>.  \n<br/><br/>\nModelul este ajustat folosind funcția coxph din pachetul survival.\n<br/><br/>\n<b>Introduceți numele modelului:</b> Numele în care vor fi stocate rezultatele modelului\n<br/><br/>\n<b>Timp până la eveniment sau cenzură:</b> Timp până la evenimentul de rezultat pentru cei care experimentează evenimentul sau timp până la ultima urmărire pentru cei care nu experimentează evenimentul de rezultat\n<br/><br/>\n<b>Evenimente (1=eveniment, 0=cenzură):</b> Indicator numeric al evenimentului; 1=eveniment, 0=cenzură\n<br/><br/>\n<b>Constructor de formule:</b> Construiți termeni de inclus în model. Factori, șiruri și variabile logice vor fi codificate dummy. Butoanele furnizate vă permit să specificați efecte principale, efecte factoriale complete (efecte principale și toate interacțiunile cu variabilele implicate), polinoame, interacțiuni specifice și să ștergeți termeni din listă.\n<br/><br/>\n<b>Variabile de timp de expunere pentru covariabilele dependente de timp:</b> Variabile numerice care stochează timpul când subiectul a fost prima dată \"expus\". Acest lucru trebuie să fie pe aceeași scară de timp ca \nvariabila de timp. Valorile lipsă ar trebui utilizate pentru subiecții care nu au fost niciodată expuși. Fiecare variabilă specificată aici va crea o covariabilă dependentă de timp separată. Un timp specificat presupune că un subiect nu este expus înainte de acest timp și expus după acest timp (adică atunci când predictorul se schimbă de la \"nu\" la \"da\"). Specificarea doar a valorilor pozitive înseamnă \n că subiecții nu sunt expuși pentru o perioadă de timp după începerea urmării. Specificarea unor timpuri pozitive și negative indică că unii subiecți au fost expuși după și unii înainte de \nînceperea timpului de urmărire, respectiv. Dacă știți că un subiect a fost expus înainte de timpul de început al urmării, dar nu știți exact când, atunci puteți folosi orice timp negativ \nși modelul va trata corect acel subiect ca fiind expus pentru întreaga sa perioadă de urmărire. Dacă subiecții sunt expuși după urmărire, atunci ei sunt tratați corect ca nefiind expuși pentru întreaga lor perioadă de urmărire.\n<br/><br/>\n<b>Prefix pentru covariabilele dependente de timp:</b> Prefix dorit care va fi folosit pentru fiecare covariabilă dependentă de timp specificată în câmpul <b>Variabile de timp de expunere</b>. Numele fiecărei covariabile dependente de timp va începe cu acest prefix.\n<br/><br/>\n<b>Identificator subiect:</b> Variabila care stochează identificatorul subiectului. Acest lucru este necesar pentru scopuri de creare a setului de date de proces de numărare subiacente.\n<br/><br/>\n<b>Greutăți:</b> Variabilă numerică pentru greutățile observației. Utilă în situații în care fiecare înregistrare nu ar trebui să fie numărată ca o observație.\n<br/><br/>\n<b>Opțiuni:</b>\n<br/><br/>\n<b>Metoda timpului legat:</b> Metoda de rupere a timpilor observați legați. Efron este de obicei cea mai bună alegere atunci când nu există mulți timpi legați. Metoda exactă poate fi benefică dacă \nexistă mulți timpi legați, cum ar fi în situații de timp discret, dar poate dura puțin mai mult pentru ca modelul să fie ajustat.\n<br/><br/>\n<b>Grafic forestier:</b> va crea un grafic forestier al rapoartelor de risc și intervalelor de încredere\n<br/><br/>\n<b>Arată setul de date (început, sfârșit):</b> Va arăta setul de date de proces de numărare subiacente utilizat în calcule. Acest lucru împarte timpul de urmărire al fiecărui subiect în părți, în funcție de \ncând covariabila dependentă de timp ar trebui să schimbe valorile.\n<br/><br/>\n<b>Diagnosticarea modelului:</b> Dacă este selectat, teste și grafice de riscuri proporționale vor fi furnizate, în plus față de evaluările formei funcționale pentru fiecare covariabilă din model.  \nOpțiunea minimă a axei reziduale Martingale a modelului nul ar putea necesita modificări astfel încât toate reziduurile să apară în grafic. Pentru a obține evaluările formei funcționale, trebuie să \nspecificați doar predictori numerici și să nu aveți date lipsă. Consultați Variabile > Valori lipsă > Eliminare NAs.\n<br/><br/>\n<b>Analiza devianței (Tip II):</b> Test global pentru fiecare predictor din model. Testele cu mai multe grade de libertate vor fi furnizate pentru efecte cu mai mult de 2 niveluri.  \nTestele Wald și raportul de verosimilitate pot fi obținute, testele raportului de verosimilitate având proprietăți mai bune pentru eșantioane mici.           \n<br/><br/>\n<b>Pachete necesare:</b> survival, broom, survminer, car\n"
  }
}