{
  "title": "Cox, Avansat",
  "navigation": "Cox, Avansat",
  "helplabel": "Faceți clic pe butonul ? din colțul din dreapta sus al dialogului pentru detalii despre seturile de date de probă și formatul de date acceptat.",
  "modelname": "Introduceți numele modelului",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (1 = eveniment 1, 0 = cenzură)",
  "modelterms": "Constructor de expresii pentru variabilele independente",
  "weightvar": "Greutăți (opțional)",
  "tiemethod": "Metoda timpului legat",
  "forestplotbox": "Plotul Forest",
  "diagnosticsbox": "Diagnosticarea modelului",
  "martscalebox": "Valoarea minimă a axei reziduale Martingale a modelului nul (-Inf până la 1):",
  "devbox": "Analiza devianței (Tip II)",
  "devtype": "Statistică de test",
  "help": {
    "title": "Cox, Avansat",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n\t\t\tConsultați setul de date de probă din directorul de instalare, locația implicită este la litera unității:&bsol;program files&bsol;BlueSky Statistics&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. Variabila Followup_time ar trebui introdusă ca timpul până la eveniment sau cenzură, iar variabila Event ar trebui introdusă ca Evenimente (1 = eveniment, 0 = cenzură). Sexul, vârsta și IMC-ul pot fi variabilele independente. \n\t\t\t<br/>\n\t\t\tAcest set de date este o versiune actualizată a setului de date mockstudy din pachetul arsenal.\n\t\t\t<br/><br/>\n            <b>Modelul Cox pentru riscuri proporționale</b>\n            <br/>\n            <br/>\n            Se potrivește un model Cox pentru riscuri proporționale pentru datele de timp până la eveniment cu observații cenzurate. Statisticile de potrivire a modelului, estimările parametrilor și raporturile de risc sunt furnizate. Opțiunile disponibile includ metoda timpului legat, diagnosticele modelului, cum ar fi evaluările riscurilor proporționale și formele funcționale ale covariatelor, și un plot forestier al raporturilor de risc cu intervale de încredere. Modelul este ajustat folosind funcția coxph din pachetul survival.\n            <br/>\n            <br/>\n            <b>Timp:</b> Timpul până la eveniment pentru cei care experimentează evenimentul sau timpul până la ultima urmărire pentru cei care nu experimentează evenimentul\n            <br/><br/>\n            <b>Eveniment:</b> Indicator numeric al evenimentului; 1=eveniment, 0=cenzură\n            <br/><br/>\n            <b>Variabile independente:</b> Variabilele independente de inclus în model. Factorii, șirurile și variabilele logice vor fi codificate dummy.\n            <br/><br/>\n            <b>Greutăți:</b> Variabil numeric pentru greutățile observațiilor. Util în situațiile în care fiecare înregistrare nu ar trebui să fie numărată ca o observație. \n            <br/>\n            <br/>\n            <b>Pachete necesare:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Faceți clic pe butonul Obțineți ajutor R pentru a obține ajutor detaliat R despre funcția coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opțiuni</b>\n            <br/>\n            <br/>\n            <b>Metoda timpului legat:</b>\n            <br/>\n            Metoda de rupere a timpilor observați legați. Efron este de obicei cea mai bună alegere atunci când nu există mulți timpi legați. Metoda exactă poate fi benefică dacă există mulți timpi legați, cum ar fi în situații de timp discret, dar poate dura puțin mai mult pentru a se potrivi modelului. \n            <br/>\n            <br/>\n            <b>Plotul Forest:</b>\n            <br/>\n            Plotul raporturilor de risc și intervalelor de încredere pentru fiecare predictor din model.\n            <br/>\n            <br/>\n            <b>Diagnosticarea modelului:</b>\n            <br/>\n            Dacă este selectat, teste și grafice pentru riscurile proporționale vor fi furnizate, în plus față de evaluările formei funcționale pentru fiecare covariată din model. Opțiunea minimă a axei reziduale Martingale a modelului nul ar putea necesita modificări pentru ca toate reziduurile să apară în plot. Pentru a obține evaluări ale formei funcționale, trebuie să specificați doar predictori numerici și să nu aveți date lipsă. Consultați Variabile > Valori lipsă > Eliminare NAs.\n            <br/>\n            <br/>\n            <b>Analiza devianței (Tip II):</b>\n            Test global pentru fiecare predictor din model. Testele cu mai multe grade de libertate vor fi furnizate pentru efectele cu mai mult de 2 niveluri. Testele Wald și raportul de verosimilitate pot fi obținute, testele raportului de verosimilitate având proprietăți mai bune pentru eșantioane mici.\n            \n      "
  }
}