{
  "title": "Creează un tabel de experiment pentru un studiu MSA Gage",
  "navigation": "Proiectare studiu MSA",
  "datasetname": "Numele tabelului studiului MSA Gage",
  "label1": "Detalii pentru Piese",
  "label2": "Detalii pentru Operatori",
  "factor1": "Numele variabilei Piesă (de exemplu, Piesă ca implicit)",
  "numOfFactorLevels1": "Numărul de Piese",
  "factorLevels1": "Lăsați gol pentru a genera automat valori sau specificați valori - exemplu: -1, 1, 'string1', 2, 0",
  "prefixForfactorLevels1": "Dacă generați automat, specificați orice Prefix. Dacă este gol, va crea valori ca 1,2,3,..",
  "factor2": "Numele variabilei Operator (de exemplu, Operator ca implicit)",
  "numOfFactorLevels2": "Numărul de Operatori",
  "factorLevels2": "Lăsați gol pentru a genera automat valori sau specificați valori - exemplu: -1, 1, 'string1', 2, 0",
  "prefixForfactorLevels2": "Dacă generați automat, specificați orice Prefix. Dacă este gol, va crea valori ca 1,2,3,..",
  "numOfBlocks": "Numărul de blocuri",
  "replicationVarName": "dacă nu este lăsat gol, numele pentru variabila de iterație de replicare dacă replicarea > 1",
  "replications": "Replicări",
  "repeatOnlyChk": "Repetați doar (în loc de replicare adevărată - nu este recomandat)",
  "randomizationChk": "Rasfoiți runde",
  "selectRandomSeedRad": "Generați automat sămânța aleatoare (unic de fiecare dată)",
  "selectFixedRandomSeedRad": "Alegeți așa cum este arătat sau schimbați manual următoarea sămânță aleatoare",
  "lbl1": "S-ar putea să nu fie nevoie să schimbați valoarea seminței de randomizare",
  "randomseeds": "Sămânța pentru randomizare",
  "sortByOperatorChk": "Sortează după Operator în fiecare replicare",
  "help": {
    "title": "Generați automat un tabel de experiment pentru un studiu MSA Gage",
    "r_help": "help(fac.design, package=DoE.base)",
    "body": "\n\t\t\t\t<b>Descriere</b></br>\n\t\t\t\tGenerează automat un tabel de studiu MSA pentru a configura runde de experiment cu detalii despre Piesă și Operator pe baza parametrilor specificați. \n\t\t\t\tDacă se folosesc valori non-numerice pentru Piesă și Operator, specificați între ghilimele simple, de exemplu 1,-1,'name1',0,'string2'\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tOdată ce detaliile rundei de experiment sunt generate automat, tabelul de runde va apărea pe interfața UI a grilei de date. \n\t\t\t\tTabelul de runde poate fi salvat (sau 'salvați ca' din meniul fișier) pentru a crea un fișier excel care să fie folosit pentru configurarea experimentelor\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}