{
    "title": "Tabel încrucișat",
    "navigation": "Tabel încrucișat",
    "label6": "Când sunt specificate mai multe variabile de rând și de coloană, generăm un tabel încrucișat separat pentru fiecare pereche de variabile de rând și coloană.",
    "rowlabel": "Variabilă de rând",
    "collabel": "Variabilă de coloană",
    "layerlabel": "Variabilă(i) strat",
    "weightlabel": "Greutate (una)",
    "label1": "Statistici",
    "chisqlabel": "Chi-pătrat",
    "chisqNoContCorrection": "Fără corecție de continuitate pentru testul Chi-pătrat",
    "chisqContCorrection": "Aplică corecție de continuitate pentru testul Chi-pătrat (Se aplică la un tabel 2x2)",
    "chisqSimulatePValues": "Calculează valorile p folosind simulare Monte Carlo",
    "chisqNoOfReplicates": "Numărul de replicări utilizate în testul Monte Carlo",
    "mcnemar": "McNemar",
    "mcnemarContCorrection": "Aplică corecție de continuitate pentru testul McNemar (Se aplică la un tabel 2x2)",
    "fisher": "Fisher",
    "fisherSimulatePValues": "Calculează valorile p folosind simulare Monte Carlo",
    "fisherNoOfReplicates": "Numărul de replicări utilizate în testul Monte Carlo",
    "fishersAlternative": "Ipoteza alternativă pentru testul exact Fisher",
    "label2": "Reziduuri",
    "unstandardized": "Ne-standardizat",
    "standardized": "Standardizat",
    "adjusted": "Ajustat",
    "label3": "Procente",
    "rowpercent": "Rând",
    "colpercent": "Coloană",
    "label4": "Numărări",
    "expected": "Așteptat",
    "label5": "Format de ieșire",
    "longTbl": "Tabel stil listă (Restricționează lățimea tabelului când sunt multe niveluri)",
	    "help": {
        "title": "Tabel încrucișat",
        "r_help": "help(CrossTable, package=gmodels)",
	"body":"<b>Descriere</b></br>
Creează o tabelă de tip cros cu variabile de rând, coloană și strat. Când sunt specificate mai multe variabile de rând și coloană, generăm o tabelă separată pentru fiecare pereche de variabile de rând și coloană. În plus, sunt afișate următoarele:<br/>
Numere așteptate<br/>
Procentele pe rând și pe coloană<br/>
Reziduuri nestandandardizate, standardizate și ajustate<br/>
Chi-pătrat cu raportul de șanse, statistici McNemar și Fisher<br/>
NOTĂ: Eliminăm automat toate rândurile în care fiecare număr este 0. Acest lucru poate afecta modul în care sunt rulate testele Chi-pătrat, McNemar și Fisher. De exemplu, te-ai putea aștepta la 3 rânduri și 2 coloane, deoarece variabila de rând are 3 nivele, iar variabila de coloană are 2 nivele. Totuși, dacă un nivel de rând are toate valorile 0, vei obține o tabelă 2*2. În timp ce simularea Monte Carlo cu testul Fisher rulează pe o tabelă 3*2, aceasta nu se aplică pentru o tabelă 2*2 și se va rula testul normal Fisher. 
<br/>
<b>Utilizare</b>
<br/>
<code> 
BSkyCrossTable(x,y,layere, greutate, nume_set_date, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE, long_table = FALSE )
</code> <br/>
<b>Argumente</b><br/>
<ul>
<li>
x: variabila de rând
</li>
<li>
y: variabila de coloană
</li>
<li>
layere: una sau mai multe variabile pentru straturi
</li>
<li>
greutate: o variabilă numerică care conține greutățile de frecvență
</li>
<li>
nume_set_date: Numele setului de date din care se aleg x, y și layerele (variabilele)
</li>
<li>
chisq: Dacă este TRUE, generează tabelul Chi-pătrat
</li>
<li>
prop.r: Procentele pe rând sunt generate dacă aceasta este TRUE
</li>
<li>
prop.c: Procentele pe coloană sunt generate dacă aceasta este TRUE
</li>
<li>
resid: Dacă este TRUE, sunt generate reziduuri nestandandardizate
</li>
<li>
sresid: Dacă este TRUE, sunt generate reziduuri standardizate
</li>
<li>
expected: Dacă este TRUE, sunt generate numerele așteptate
</li>
<li>
asresid: Dacă este TRUE, sunt generate reziduuri ajustate
</li>
<li>
long_table: Opțiunea pentru tabelă lungă a fost introdusă pentru a permite analiza făcută pe un număr mare de variabile. Alegerea formatului lung controlează lățimea tabelului de ieșire, făcând mai ușor vizualizarea rezultatelor fără a fi necesar să derulezi la dreapta în fereastra de ieșire.
</li>
</ul>
<b>Rezultate</b></br>
O listă cu rezultatele
<br/>
<b>Exemplu</b></br>
<code> 
BSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>
layere=c('type'),nume_set_date='Dataset2',<br/>
chisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>
resid=FALSE,sresid=FALSE,expected=FALSE,<br/>
asresid=FALSE)</br>
BSkyFormat(BSky_Multiway_Cross_Tab)</br>
</code> <br/>
<b>Pachet</b></br>
gmodels</br>
<b>Ajutor</b></br>
Pentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui dialog sau rulați comanda următoare: help(CrossTable, package=gmodels) creând un chunk de cod R dând clic pe + în fereastra de ieșire.
"
		}
}