{
  "title": "Crosstab",
  "navigation": "Crosstab",
  "label6": "Când sunt specificate mai multe variabile de rând și coloană, generăm un tabel de contingență separat pentru fiecare pereche de variabile de rând și coloană.",
  "rowlabel": "Variabilă de rând",
  "collabel": "Variabilă de coloană",
  "layerlabel": "Variabilă(e) de strat",
  "weightlabel": "Greutate (una)",
  "label1": "Statistici",
  "chisqlabel": "Chisq",
  "chisqNoContCorrection": "Fără corecție de continuitate pentru testul Chi-pătrat",
  "chisqContCorrection": "Aplică corecția de continuitate pentru testul Chi-pătrat (Se aplică unui tabel 2 pe 2)",
  "chisqSimulatePValues": "Calculează valorile p folosind simularea Monte Carlo",
  "chisqNoOfReplicates": "Numărul de replicări utilizate în testul Monte Carlo",
  "mcnemar": "McNemar",
  "mcnemarContCorrection": "Aplică corecția de continuitate pentru testul McNemar (Se aplică unui tabel 2 pe 2)",
  "fisher": "Fisher",
  "fisherSimulatePValues": "Calculează valorile p folosind simularea Monte Carlo",
  "fisherNoOfReplicates": "Numărul de replicări utilizate în testul Monte Carlo",
  "fishersAlternative": "Ipoteza alternativă pentru testul exact Fisher",
  "label2": "Reziduuri",
  "unstandardized": "Nerestricționat",
  "standardized": "Standardizat",
  "adjusted": "Ajustat",
  "label3": "Procente",
  "rowpercent": "Rând",
  "colpercent": "Coloană",
  "label4": "Număr",
  "expected": "Așteptat",
  "label5": "Format de ieșire",
  "longTbl": "Tabel de tip listă (Restricționează lățimea tabelului când sunt multe niveluri)",
  "help": {
    "title": "Crosstab",
    "r_help": "help(CrossTable, package=gmodels)",
    "body": "\n            <b>Descriere</b></br>\nCreează un tabel de contingență cu variabile de rând, coloană și strat. Când sunt specificate mai multe variabile de rând și coloană, generăm un tabel de contingență separat pentru fiecare pereche de variabile de rând și coloană. În plus, următoarele sunt afișate<br/>\nNumerele așteptate<br/>\nProcentele de rând și coloană<br/>\nReziduuri nerestricționate, standardizate și ajustate<br/>\nChisq cu raporturi de șanse, statistici McNemar și Fisher<br/>\nNOTĂ: Eliminăm automat toate rândurile în care fiecare număr este 0. Acest lucru poate afecta modul în care sunt efectuate testele Chisq, McNemar și Fisher. De exemplu, te poți aștepta la 3 rânduri și 2 coloane, deoarece variabila de rând are 3 niveluri, iar variabila de coloană 2 niveluri. Cu toate acestea, deoarece un nivel de rând are toate numerele 0, obții un tabel 2*2. În timp ce simularea Monte Carlo cu testul Fisher rulează pe un tabel 3*2, nu se aplică unui tabel 2*2 și se efectuează testul normal Fisher. \n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nBSkyCrossTable(x,y,layers, weight, datasetname, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE,long_table = FALSE )\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: variabilă de rând\n</li>\n<li>\ny: variabilă de coloană\n</li>\n<li>\nlayers: una sau mai multe variabile pentru straturi\n</li>\n<li>\nweights: o variabilă numerică care conține greutățile de frecvență\n</li>\n<li>\ndatasetname: Numele setului de date din care sunt alese x,y și straturile (variabile)\n</li>\n<li>\nchisq:  dacă este TRUE generează tabelul chi-pătrat\n</li>\n<li>\nprop.r: Procentele de rând sunt produse dacă aceasta este TRUE\n</li>\n<li>\nprop.c: Procentele de coloană sunt generate dacă aceasta este TRUE\n</li>\n<li>\nresid: dacă este TRUE, se generează reziduuri nerestricționate\n</li>\n<li>\nsresid: dacă este TRUE, se generează reziduuri standardizate\n</li>\n<li>\nexpected: Numerele așteptate sunt generate dacă aceasta este TRUE\n</li>\n<li>\nasresid:  dacă este TRUE, se generează reziduuri ajustate\n</li>\n<li>\nlong_table: Opțiunea tabelului lung este introdusă pentru a acomoda analiza efectuată pe un număr mare de variabile. Alegerea formatului lung controlează lățimea tabelului de ieșire, făcându-l ușor de vizualizat rezultatele fără a fi nevoie să derulezi spre dreapta în fereastra de ieșire. \n</li>\n</ul>\n<b>valoare</b></br>\nO listă cu rezultatele\n<br/>\n<b>Exemplu</b></br>\n<code> \nBSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>\nlayers=c('type'),datasetname='Dataset2',<br/>\nchisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>\nresid=FALSE,sresid=FALSE,expected=FALSE,<br/>\nasresid=FALSE)</br>\nBSkyFormat(BSky_Multiway_Cross_Tab)</br>\n</code> <br/>\n<b>Pachet</b></br>\ngmodels</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă help(CrossTable, package=gmodels) creând un chunk de cod R făcând clic pe + în fereastra de ieșire  \n    "
  }
}