{
  "title": "Verificare Ordine Date",
  "navigation": "Verificare Ordine Date",
  "datevarslabel": "Variabile de Date (specificați de la cea mai veche la cea mai recentă; aceeași clasă; cel puțin 2)",
  "compgrplabel": "Comparare",
  "compgrpnote": "Notă: Aceasta este comparația între toate datele specificate mai sus care vor fi verificate pentru erori de ordine, de exemplu, valorile ar trebui să fie date1<date2<date3.",
  "ltlabel": "<",
  "ltelabel": "<=",
  "idvarslabel": "Variabile de Identificare a Rândurilor (opțional)",
  "dateerrorboxlabel": "Creează set de date cu variabila de eroare de dată",
  "dateerrordatanamelabel": "Numele setului de date",
  "dateerrorvarlabel": "Numele variabilei de eroare de dată",
  "help": {
    "title": "Verificare Ordine Date",
    "r_help": "help('<', package = 'base')",
    "body": "\nAceasta creează o listă de rânduri în setul de date activ unde valorile variabilelor de dată nu sunt într-o ordine specificată.  Acest lucru ajută la identificarea potențialelor erori ale variabilelor de dată atunci când datele sau \ntimpurile sunt necesare pentru o analiză.  De exemplu, dacă trei coloane de date ar trebui să fie în ordinea date1 < date2 < date3, acest dialog va imprima toate observațiile unde \nvalorile acelor variabile nu respectă acea ordine.  Valorile de dată lipsă sunt permise în variabilele specificate și nu vor fi utilizate pentru nicio comparație.\n<br/><br/>\n<b>Variabile de Date (specificați de la cea mai veche la cea mai recentă; aceeași clasă; cel puțin 2):</b>  Specificați cel puțin 2 variabile de dată în ordinea de la cea mai veche la cea mai recentă.  Acestea pot fi orice clasă de dată \n(POSIXct, Date), dar toate variabilele specificate trebuie să fie aceeași clasă de dată.  Dacă nu, va rezulta o eroare.\n<br/><br/>\n<b>Comparare:</b>  Specificați operatorul de comparație utilizat pentru a compara valorile de dată.  \"<\" înseamnă mai mic decât și \"<=\" înseamnă mai mic sau egal cu.  Dacă \"<\" este ales, atunci datele care\nsunt egale vor fi marcate ca erori.  Dacă \"<=\" este ales, atunci datele care sunt egale nu vor fi marcate ca erori.\n<br/><br/>\n<b>Variabile de Identificare a Rândurilor (opțional):</b>  Specificați una sau mai multe variabile care pot fi utile pentru a identifica rândurile.  De exemplu, numărul de identificare al subiectului.  Acestea vor \nfi incluse în lista de erori.  Dacă nu sunt specificate variabile, numărul rândului din setul de date va fi singurul identificator.\n<br/><br/>\n<b>Creează set de date cu variabila de eroare de dată:</b>  Acest lucru va crea un set de date separat cu datele originale și o variabilă care indică dacă fiecare observație are o eroare de ordine a datei \n(codificată ca 1=eroare de ordine a datei și 0=fără eroare de ordine a datei).  <b>Numele setului de date</b> este numele dorit al acestui set de date și <b>Numele variabilei de eroare de dată</b> este numele dorit \nal variabilei de eroare de ordine a datei în acest set de date.\n\t\t"
  }
}