{
  "title": "Grafic Cullen și Frey cu descriptivi ai unei distribuții empirice pentru date ne-cenzurate",
  "navigation": "Analiza Distribuției (grafic Cullen și Frey)",
  "variableSelcted": "Selectați o variabilă care conține distribuția",
  "boot": "(Opțional) Valori boot de asimetrie și kurtosis. Dacă este specificat, trebuie să fie un întreg mai mare de 10",
  "discreteChk": "Discret - debifat (implicit) pentru uniform, normal, logistic, lognormal, beta și gamma. Bifat pentru poisson și binomial negativ",
  "method": "Neparțial (implicit) pentru valori estimate nepartiale ale statisticilor sau valori de eșantion pentru valori de eșantion",
  "help": {
    "title": "Descrierea unei distribuții empirice pentru date ne-cenzurate",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descriere</b></br>\n\t\t\t\tCalculează parametrii descriptivi ai unei distribuții empirice pentru date ne-cenzurate și oferă un grafic de asimetrie-kurtosis\n\t\t\t\t<br/>\n\t\t\t\tPentru ajutor detaliat - folosiți R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMinim, maxim, mediană, medie, sd de eșantion și estimări nepartiale (dacă metoda==\"sample\") sau prin default estimări nepartiale de \n\t\t\t\tasimetrie și valori de kurtosis ale lui Pearson sunt imprimate (Sokal și Rohlf, 1995). Un grafic de asimetrie-kurtosis, cum ar fi \n\t\t\t\tcel propus de Cullen și Frey (1999), este dat pentru distribuția empirică. Pe acest grafic, valorile pentru distribuțiile comune \n\t\t\t\tse afișează de asemenea ca un instrument pentru a ajuta alegerea distribuțiilor de potrivit pentru date. Pentru unele \n\t\t\t\tdistribuții (normal, uniform, logistic, exponențial de exemplu), există o singură valoare posibilă pentru asimetrie \n\t\t\t\tsi kurtosis (de exemplu, pentru o distribuție normală, asimetrie = 0 și kurtosis = 3), iar distribuția este astfel \n\t\t\t\treprezentată printr-un punct pe grafic. Pentru alte distribuții, zonele de valori posibile sunt reprezentate, constând în \n\t\t\t\tlinii (distribuții gamma și lognormal de exemplu), sau zone mai mari (distribuția beta de exemplu). \n\t\t\t\tDistribuția Weibull nu este reprezentată pe grafic, dar este indicată în legendă că formele apropiate de \n\t\t\t\tdistribuțiile lognormal și gamma pot fi obținute cu această distribuție.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPentru a lua în considerare incertitudinea valorilor estimate ale kurtosis și asimetrie din date, setul de date \n\t\t\t\tpoate fi bootstrapat prin fixarea argumentului boot la un întreg mai mare de 10. valorile boot de asimetrie și kurtosis \n\t\t\t\tcorespunzătoare eșantioanelor bootstrap sunt apoi calculate și raportate în culoare albastră pe graficul de asimetrie-kurtosis.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDacă discret este ADEVĂRAT, distribuțiile reprezentate sunt distribuțiile Poisson, binomial negativ și distribuția normală \n\t\t\t\tla care distribuțiile discrete anterioare pot converge. Dacă discret este FALS, acestea sunt distribuțiile uniform, normal, \n\t\t\t\tlogistic, lognormal, beta și gamma.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Pentru o bună prezentare generală a potrivirii distribuției, consultați https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}