{
  "title": "Plotul Forestier",
  "navigation": "Plotul Forestier",
  "modelselectorlabel": "Selectați Numele Modelului",
  "plotvarslabel": "Variabile de Plotat (nicio variabilă specificată plotează toate variabilele)",
  "varlabelslabel": "Etichete Variabile (specificați ca varname='eticheta' separate prin virgule, de exemplu, age='Vârsta în ani', bmi='Indicele de Masă Corporală'); se poate folosi \\n pentru întreruperi de linie în cadrul unei etichete",
  "notelabel": "NOTĂ: Schimbarea etichetelor necesită o re-fiting a modelului, astfel că datele mari ar putea dura",
  "label3": "NOTĂ: MODELELE CONSTRUITE UTILIZÂND REGLEZAREA MODELULUI (ANRENARE) NU SUNT SUPORTATE",
  "estimateoptlabel": "Opțiuni de Estimare",
  "estimatelabellabel": "Etichetă",
  "exponentiatelabel": "Forțează Exponentierea Estimării Parametrului",
  "linecolorlabel": "Culoarea Liniei",
  "pointshapelabel": "Forma Punctului",
  "pointsizelabel": "Dimensiunea Punctului (0-10 mm)",
  "styleoptlabel": "Opțiuni de Stil",
  "factorseplinelabel": "Numele Factorilor pe Linii Separate",
  "plotbandslabel": "Bande de Plotare",
  "textsizelabel": "Dimensiunea Textului (1-10 mm)",
  "estticklabelsizelabel": "Dimensiunea Etichetei Marcajului de Estimare (1-50)",
  "help": {
    "title": "Plotul Forestier",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nAcesta creează un plot al coeficientelor modelului, sau coeficientelor exponentiate, dintr-un model de regresie. Fiecare variabilă este plotată în propria sa linie cu totaluri, estimări de parametru, \nintervale de încredere de 95% și valori p. Variabilele pot fi etichetate pentru a permite o prezentare mai plăcută. În prezent, sunt suportate modelele de clasă lm (modele liniare), glm (modele liniare generalizate, \ncare includ logistic și Poisson), coxph (riscuri proporționale Cox) și rq (regresie cuantilă).\n<br/><br/>\n<b>Selectați Numele Modelului:</b> Alegeți numele modelului așa cum a fost specificat când modelul a fost ajustat. Acesta este un câmp obligatoriu.\n<br/><br/>\n<b>Variabile de Plotat:</b> Dacă aveți acces la datele care au creat modelul, puteți specifica un subset al variabilelor din model pentru a fi incluse în plot. Dacă nu sunt specificate variabile, \natunci se va reveni la toate variabilele incluse.\n<br/><br/>\n<b>Etichete Variabile:</b> Specificați etichete mai plăcute pentru a fi utilizate în locul numelui variabilei. Dacă o variabilă nu este etichetată, numele variabilei sau eticheta existentă a variabilei utilizate când \nthe model a fost ajustat (dacă există) va fi plotată. Acestea trebuie specificate într-un format variablename=\"eticheta\", separate prin virgule. Rețineți că includerea \\n într-o etichetă va forța\nîntreruperea unei linii în cadrul etichetei. Acest lucru înseamnă că puteți specifica etichete pe mai multe linii și ar putea fi avantajos pentru etichete lungi, deoarece etichetele lungi lăsate pe o singură linie lasă mai puțin spațiu pentru estimări. Facând \nun rezumat al modelului cu Evaluarea Modelului -> Rezumați -> Rezumați un Model va imprima variabilele modelului utilizate în cazul în care nu aveți acces la setul de date. NOTĂ: Există o \neroare curentă în pachetul forestmodel R care nu utilizează etichetele variabilelor pentru factorii din modelele Cox - dezvoltatorul pachetului a fost notificat. O alternativă până când pachetul este \nremediat este să re-fitați modelul cu variabile codificate dummy în loc de factori.\n<br/><br/><br/>\n<b>Opțiuni de Estimare:</b>\n<br/><br/>\n<b>Etichetă:</b> Etichetă opțională pentru coloana de estimare din plot. Regresia logistică și modelele Cox vor fi detectate automat și estimările vor fi etichetate ca \"Raport de Odds\" și \n\"Raport de Risc\", respectiv. Alte modele vor folosi implicit \"Estimare\" dacă nu specificați nimic.\n<br/><br/>   \n<b>Forțează Exponentierea Estimării Parametrului:</b> Alegeți aceasta pentru a forța valorile exp(coefficient) să fie afișate, adică 2.718 ridicat la puterea coeficientului. Coeficientii \nexponentiați sunt utilizați frecvent în modelele de riscuri proporționale Cox (pentru rapoarte de risc), regresia logistică (pentru rapoarte de odds), modelele log-binomiale (pentru riscuri relative) și regresia Poisson \n(pentru rapoarte de rată). Implicit, regresia logistică și modelele Cox vor fi detectate automat și exp(coefficient) va fi utilizat.\n<br/><br/>\n<b>Culoarea Liniei:</b> Culoarea liniei pentru intervalele de încredere.\n<br/><br/>\n<b>Forma Punctului:</b> Forma punctelor pentru estimările parametrilor din plot.\n<br/><br/>\n<b>Dimensiunea Punctului (0-10 mm):</b> Dimensiunea punctelor, în milimetri, pentru estimările parametrilor din plot. 0 mm ar elimina punctele. Implicit este 4 mm.\n<br/><br/><br/>\n<b>Opțiuni de Stil:</b>\n<br/><br/>\n<b>Numele Factorilor pe Linii Separate:</b> Alegeți aceasta pentru a afișa numele variabilelor factor pe o linie separată de nivelurile factorului.\n<br/><br/>\n<b>Bande de Plotare:</b> Alegeți aceasta pentru a afișa regiuni umbrite alternative pentru fiecare linie a plotului.\n<br/><br/>\n<b>Dimensiunea Textului (1-10 mm):</b> Dimensiunea textului, în milimetri, în plot. Implicit este 4 mm.\n<br/><br/>\nNotă: Dacă doriți să schimbați dimensiunea generală a plotului, dimensiunea plotului poate fi setată folosind butonul Temele din meniul cu trei puncte.\n<br/><br/>\n<b>Dimensiunea Etichetei Marcajului de Estimare (1-50):</b> Dimensiunea etichetelor marcajului pentru axa estimării.\n<br/><br/>\n<b>Pachete R Necesare:</b> forestmodel, arsenal, supraviețuire, quantreg, insight\n"
  }
}