{
  "title": "Model liniar generalizat",
  "navigation": "GLZM",
  "modelname": "Numele modelului",
  "dependent": "Variabila dependentă",
  "offset": "Offset",
  "weights": "Greutăți",
  "formulaBuilder": "Constructor de formulă",
  "family": "Selectați o familie și o funcție de legătură",
  "theta": "Specificați o valoare a lui theta (aplicată doar pentru familia binomială negativă)",
  "expCoefficients": "Exponentiați coeficienții",
  "help": {
    "title": "Model liniar generalizat",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>Descriere</b></br>\n            glm este folosit pentru a ajusta modele liniare generalizate, specificate prin oferirea unei descrieri simbolice a predictorului liniar și a unei descrieri a distribuției erorii.\n            <br/>\nNOTĂ 1: Un câmp de text este furnizat pentru a specifica valoarea inițială a lui theta, aceasta se aplică doar pentru familia binomială negativă. Dacă este omis, se folosește un estimator de moment după o ajustare inițială folosind un GLM Poisson.<br/>\nTheta inițială care este calculată este afișată în ieșirea de deasupra tabelului rezumat GLM.<br/>\nNOTĂ 2: Atunci când specificați o variabilă care conține greutăți, fiți conștienți că, deoarece folosim opțiunea na.exclude pentru a construi modelul, toate valorile NA sunt eliminate automat din variabilele dependente și independente.<br/> \nAceasta poate cauza o nepotrivire, deoarece valorile NA nu sunt eliminate automat din variabila de greutate. <br/>\nÎn această situație veți vedea eroarea lungimile variabilelor diferă (găsită pentru (greutăți))<br/>\nPentru a rezolva această eroare, mergeți la Variabile>Valori lipsă>Eliminați NAs și selectați variabilele dependente, independente și variabila de greutate pentru a elimina valorile lipsă și a reconstrui modelul.<br/>\nNOTĂ 3: Variabilele de codare dummy, atunci când folosiți familia binomială negativă, consultați Variabile > Calculați > Codare Dummy.<br/>\nNOTĂ 4: Interceptul este inclus în mod implicit, pentru a elimina interceptul introduceți -1 în constructorul de formulă\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code> \n            glm(formula, family = gaussian, data, weights, subset,\n                na.action, start = NULL, etastart, mustart, offset,\n                control = list(...), model = TRUE, method = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            formula: un obiect de clasă \"formula\" (sau unul care poate fi convertit în acea clasă): o descriere simbolică a modelului care trebuie ajustat. Detaliile specificației modelului sunt date în secțiunea ‘Detalii’.\n            </li>\n            <li>\n            family: o descriere a distribuției erorii și a funcției de legătură care trebuie utilizată în model. Pentru glm aceasta poate fi un șir de caractere care denumește o funcție de familie, o funcție de familie sau rezultatul unui apel la o funcție de familie. Pentru glm.fit doar a treia opțiune este acceptată. (Consultați family pentru detalii despre funcțiile de familie.)\n            </li>\n            <li>\n            data: un cadru de date opțional, listă sau mediu (sau obiect convertibil prin as.data.frame într-un cadru de date) care conține variabilele din model. Dacă nu este găsită în date, variabilele sunt preluate din environment(formula), de obicei mediu din care este apelat glm.\n            </li>\n            <li>\n            weights: un vector opțional de „greutăți anterioare” care trebuie utilizat în procesul de ajustare. Ar trebui să fie NULL sau un vector numeric.\n            </li>\n            <li>\n            subset: un vector opțional care specifică un subset de observații care trebuie utilizate în procesul de ajustare.\n            </li>\n            <li>\n            na.action: o funcție care indică ce ar trebui să se întâmple atunci când datele conțin NAs. Implicit este setat de setarea na.action a opțiunilor, și este na.fail dacă aceasta nu este setată. Implicitul „fabrica-nouă” este na.omit. O altă valoare posibilă este NULL, fără acțiune. Valoarea na.exclude poate fi utilă.\n            </li>\n            </ul>\n            <b>Detalii</b><br/>\n            Un predictor tipic are forma răspuns ~ termeni unde răspunsul este vectorul de răspuns (numeric) și termenii sunt o serie de termeni care specifică un predictor liniar pentru răspuns. Pentru familiile binomiale și quasibinomiale răspunsul poate fi de asemenea specificat ca un factor (când primul nivel denotă eșec și toate celelalte succes) sau ca o matrice cu două coloane cu coloanele oferind numerele de succese și eșecuri. O specificație a termenilor de forma primul + al doilea indică toți termenii din primul împreună cu toți termenii din al doilea, cu orice duplicate eliminate.<br/>\n            <b>Valoare</b><br/>\n            Un obiect de clasă \"glm\" este o listă care conține cel puțin următoarele componente:\n            <ul>\n            <li>\n            coeficienți: un vector numit de coeficienți\n            </li>\n            <li>\n            reziduuri: reziduurile de lucru, adică reziduurile în ultima iterație a ajustării IWLS. Deoarece cazurile cu greutăți zero sunt omise, reziduurile lor de lucru sunt NA.\n            </li>\n            <li>\n            valori ajustate: valorile medii ajustate, obținute prin transformarea predictorilor liniari prin inversa funcției de legătură.\n            </li>\n            <li>\n            rang: rangul numeric al modelului liniar ajustat.\n            </li>\n            <li>\n            familie: obiectul de familie utilizat.\n            </li>\n            <li>\n            predictori liniari: ajustarea liniară pe scala de legătură.\n            devianță: până la o constantă, minus de două ori log-verosimilitatea maximizată. Acolo unde este sensibil, constanta este aleasă astfel încât un model saturat să aibă devianță zero.\n            </li>\n            <li>\n            aic\t: O versiune a criteriului de informație Akaike, minus de două ori log-verosimilitatea maximizată plus de două ori numărul de parametrii, calculată prin componenta aic a familiei. Pentru familiile binomiale și Poisson dispersia este fixată la unu, iar numărul de parametrii este numărul de coeficienți. Pentru familiile gaussian, Gamma și gaussian invers dispersia este estimată din devianța reziduală, iar numărul de parametrii este numărul de coeficienți plus unu. Pentru o familie gaussiană MLE a dispersiei este utilizată, astfel aceasta este o valoare validă a AIC, dar pentru familiile Gamma și gaussian invers nu este. Pentru familiile ajustate prin quasi-verosimilitate valoarea este NA.\n            </li>\n            </ul>\n            <b>Pachet</b></br>\nglm</br>\n<b>Ajutor</b></br>\nhelp(glm, package ='stats')\n"
  }
}