{
  "title": "Estimarea Kaplan-Meier, Un Grup",
  "navigation": "Estimarea Kaplan-Meier, Un Grup",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Eveniment (1 = eveniment, 0 = cenzură)",
  "label1": "Tip de Grafic",
  "survivalradio": "Supraviețuire",
  "inciradio": "Eșec",
  "printallest": "Tabel de Estimare Inclusiv Toate Timpurile",
  "printspecest": "Tabel de Estimare pentru Timpuri Specifice",
  "spectimes": "Specificați timpii ca time1, time2, time3, etc. sau ca seq(1,5,by=1)",
  "styleoptions": "Opțiuni de Stil",
  "axisoptions": "Opțiuni de Axa",
  "label12": "Faceți clic pe butonul ? din colțul din dreapta sus al dialogului pentru detalii despre seturile de date de probă și formatul de date acceptat.",
  "titlebox": "Titlul Graficului",
  "plottitlesizelabel": "Dimensiunea Titlului Graficului (5-50)",
  "themedropdown": "Tema Graficului",
  "label2": "Numărul la Risc",
  "natriskchkbox": "Includeți Numărul la Risc",
  "risktableprop": "Înălțimea Tabelului de Risc (0-1)",
  "risktablepos": "Poziția Tabelului de Risc",
  "risktablevaluesize": "Dimensiunea Valorii Tabelului de Risc (1-15)",
  "risktabletitlesize": "Dimensiunea Titlului Tabelului de Risc (5-50)",
  "risktableaxislabelsize": "Dimensiunea Etichetei Axei Tabelului de Risc (5-50)",
  "risktableticklabelsize": "Dimensiunea Etichetei de Marcaj a Tabelului de Risc (5-50)",
  "risktableclean": "Eliminați Axe și Linii de Grilă din Tabelul de Risc",
  "label3": "Opțiuni pentru Linii",
  "linesize": "Dimensiune (0-5)",
  "linecolor": "Culoare",
  "label4": "Interval de Încredere",
  "cichkbox": "include 95% CI",
  "cistyle": "Stil",
  "citransparency": "Transparență (0-1)",
  "label5": "Timpi Cenzurați",
  "censorchkbox": "Includeți Timpi Cenzurați",
  "censorsize": "Dimensiune (0-10)",
  "medsurvivalline": "Indicați Supraviețuirea Mediană (h=orizontal, v=vertical)",
  "label6": "Axa Supraviețuirii",
  "survaxislabel": "Etichetă",
  "axislabelsize": "Dimensiunea Etichetei Axei (5-50)",
  "label7": "Scală",
  "defbutton": "proporție",
  "pctbutton": "procent",
  "survaxislimits": "Limitele axei pe scală de proporție (0-1) - introduceți 'c(min, max)'",
  "survtickinc": "Increment de Marcaj (0-1)",
  "label8": "Axa Timpului",
  "timeaxislabel": "Etichetă",
  "timeaxislimits": "Limitele Axei (NULL este implicit, introduceți 'c(min,max)' pentru a schimba de exemplu 'c(0,20)')",
  "timetickinc": "Increment de Marcaj (NULL este implicit, introduceți un număr pentru a schimba, min=0)",
  "ticklabelsize": "Dimensiunea Etichetei de Marcaj a Axei (5-50)",
  "help": {
    "title": "Estimarea Kaplan-Meier, Un Grup",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tVezi setul de date de probă în directorul de instalare, locația implicită este la litera unității:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. Variabila Followup_time ar trebui introdusă ca timpul până la eveniment sau cenzură și variabila Event ar trebui introdusă ca Eveniment (1 = eveniment, 0 = cenzură).<br/>\n            Acest set de date este o versiune actualizată a setului de date mockstudy din pachetul arsenal.<br/><br/>\t\t\n            <b>Curbele de supraviețuire Kaplan-Meier</b>\n            <br/>\n            <br/>\n            Acestea sunt folosite pentru a estima riscul cumulativ de a nu avea un anumit eveniment (sau invers, de a avea un anumit eveniment) pe o perioadă de timp după începutul urmării pentru acel eveniment (sau timpul zero). Subiecții trebuie să fie la risc pentru eveniment începând de la timpul zero.\n            <br/>\n            <br/>\n            <b>Timp:</b> Lungimea timpului până la un eveniment, dacă evenimentul a avut loc, sau ultima urmărire pentru acel eveniment, dacă evenimentul nu a avut loc, pentru fiecare subiect\n            <br/><br/>\n            <b>Eveniment:</b> Indicator numeric al faptului că evenimentul a avut loc sau nu (1=eveniment, 0=cenzură) pentru fiecare subiect\n            <br/><br/>\n            <b>Tip de Grafic:</b> Dacă doriți să reprezentați grafic probabilitatea de a nu avea evenimentul (supraviețuire) sau de a avea evenimentul (eșec)\n            <br/><br/>\n            <b>Tabel de Estimare Inclusiv Toate Timpurile:</b> Opțiune de a include un tabel care are probabilitățile de estimare a supraviețuirii și evenimentului pentru fiecare timp observat în setul de date\n            <br/>\n            <br/>\n\t\t\t<b>Tabel de Estimare pentru Timpuri Specifice:</b> Opțiune de a include un tabel care are probabilitățile de estimare a supraviețuirii pentru un set de timp selectat de utilizator.\n\t\t\t<br/><br/>\n\t\t\t<b>Specificați timpii ca time1, time2, time3, etc. sau ca seq(1,5,by=1):</b> Aceștia sunt timpii specifici care vor fi incluși în tabel pentru timpi specifici. Pot fi specificați individual cu virgule sau ca o secvență de valori uniform distribuite.\n\t\t\t<br/><br/>\n            Tabelele sunt generate cu dimensiunea eșantionului, numărul de subiecți cu evenimentul, timpul median de supraviețuire (dacă este definit), timpul median de supraviețuire restricționat și timpul median de urmărire. Timpul median de urmărire este calculat folosind estimatorul Kaplan-Meier invers, care tratează evenimentele adevărate ca observații cenzurate și observațiile cenzurate adevărate ca evenimente. Astfel, \"evenimentul\" în acest estimator este \"urmărirea subiecților cât mai mult timp posibil\".\n            <br/>\n            Un tabel de estimări Kaplan-Meier pentru supraviețuire și eveniment este furnizat la fiecare timp observat în setul de date, cu intervale de încredere de 95%. \n            <br/>\n            <br/>\n            <b>Pachete Necesare:</b> survival, broom, survminer, dplyr, arsenal, ggthemes \n            <br/>\n            <br/>\n            <br/>           \n            <b>Opțiuni de Stil</b>\n            <br/>\n            <br/>\n            <b>Titlul Graficului:</b> Titlul graficului; ștergeți tot textul pentru a nu avea titlu\n            <br/><br/>\n\t\t\t<b>Dimensiunea Titlului Graficului:</b> Dimensiunea titlului graficului.\n\t\t\t<br/><br/>\n            <b>Tema Graficului:</b> Stilul general al graficului\n            <br/><br/>\n            <b>Includeți Numărul la Risc:</b> Opțional, includeți un tabel pentru numărul de subiecți care sunt încă la risc în timp, la baza graficului.  <b>Poziția Tabelului de Risc</b> specifică dacă doriți tabelul în afara axelor sau în interiorul axelor.  <b>Înălțimea Tabelului de Risc</b> controlează proporția zonei de grafic pe care o va ocupa tabelul. Această opțiune este ignorată atunci când poziția tabelului de risc este în interiorul axelor. \n\t\t\t<b>Dimensiunea Valorii Tabelului de Risc</b> controlează dimensiunea numerelor la risc. <b>Dimensiunea Titlului Tabelului de Risc</b> controlează dimensiunea titlului pentru tabelul numărului la risc.\n\t\t\t<b>Dimensiunea Etichetei Axei Tabelului de Risc</b> controlează dimensiunea etichetelor axei.\n\t\t\t<b>Dimensiunea Etichetei de Marcaj a Tabelului de Risc</b> controlează dimensiunea etichetelor de marcaj pentru timpii din tabelul numărului la risc. Dacă se dorește eliminarea tuturor axelor și liniilor de grilă \n\t\t\tdin tabelul numărului la risc, opțiunea <b>Eliminați Axe și Linii de Grilă din Tabelul de Risc</b> poate fi bifată.  Aceasta va include doar numerele la risc în tabel.\n            <br/>\n            <br/>\n            <b>Opțiuni pentru Linii:</b>\n            <b>Dimensiunea</b> controlează grosimea și <b>Culoarea</b> controlează culoarea liniei reprezentate grafic. Se poate include opțional un interval de încredere de 95% pentru estimări fie într-un format <b>ribbon</b> (zonă umbrită) sau <b>step</b> (linie).  <b>Transparența</b> controlează cât de întunecată este zona umbrită și este ignorată atunci când opțiunea de pas este selectată.  <b>Timpii Cenzurați</b> (când subiecții nu mai sunt la risc pentru eveniment) pot fi indicați pe linie cu simboluri \"+\". Dimensiunea simbolurilor \"+\" poate fi ajustată.  Opțiunea <b>Indicați Supraviețuirea Mediană</b> va include linii orizontale sau verticale la momentul în care 50% dintre subiecți sunt estimați că au avut evenimentul. Timpul median este nedefinit dacă curba de supraviețuire nu trece de 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opțiuni de Axa</b>\n            <br/> \n            <br/> \n            Opțiunea <b>Etichetă</b> specifică eticheta text pentru axă. Opțiunea <b>Limitele Axei</b> specifică valorile minime și maxime ale axei. Opțiunea <b>Increment de Marcaj</b> controlează distanțarea marcajelor pe axă. Incrementul pe axa timpului controlează de asemenea timpii pentru tabelul opțional număr la risc.\n            <br/> \n            Opțiunea <b>Scală</b> a axei de supraviețuire specifică dacă doriți ca estimările să fie pe o scară de proporție (0-1) sau procent (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Etichetei Axei:</b>  Aceasta controlează dimensiunea atât a etichetelor axei de supraviețuire, cât și a axei de timp.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Etichetei de Marcaj a Axei:</b>  Aceasta controlează dimensiunea atât a etichetelor de marcaj ale axei de supraviețuire, cât și a axei de timp."
  }
}