{
  "title": "Fă Predicții cu KNN",
  "navigation": "Predicție cu KNN",
  "dataset_var": "Seturi de date deschise",
  "header": "KNN este un clasificator leneș, nu creează un model ajustat care poate fi folosit pentru a prezice ulterior. Se ajustează și face predicții în același timp. Trebuie să urmezi pașii de mai jos pentru a face predicții/score.",
  "NOTE1": "SETUL DE DATE ACTIV TREBUIE SĂ FIE SETUL DE DATE PE CARE VREI SĂ CONSTRUIEȘTI UN MODEL ȘI NU SETUL DE DATE PE CARE VREI SĂ ÎNREGISTREZI",
  "step1": "Pasul 1: Ca de obicei, trebuie să selectezi setul de date de antrenament în Datagrid înainte de a deschide acest dialog.",
  "step2": "Pasul 2: Selectează variabila dependentă din setul de date de antrenament folosit pentru a ajusta modelul.",
  "step3": "Pasul 3: Specifică variabilele independente din setul de date de antrenament.",
  "step4": "Pasul 4: Specifică numărul de vecini care vor fi folosiți pentru a construi modelul.",
  "step5": "Pasul 5: Introdu un prefix de variabilă pentru noua variabilă care conține predicțiile.",
  "step6": "Pasul 6: Specifică setul de date la care se vor adăuga predicțiile. Acesta trebuie să conțină aceleași variabile independente folosite pentru a antrena modelul.",
  "dependentvar": "Variabila dependentă (din setul de date de antrenament)",
  "independentvars": "Variabila(e) independent(e) (din setul de date de antrenament)",
  "Seed": "Setează Seed",
  "datasetToScore": "Set de date pentru scor/predicție",
  "Group2": "Parametrii de ajustare pentru KNN",
  "noneighbhors": "Nr. de vecini (Când o valoare nu este specificată, valoarea implicită este setată la rădăcina pătrată a numărului de observații din setul de date)",
  "testDatasetName": "Introdu numele setului de date pentru a face predicții",
  "predictedValues": "Introdu prefixul variabilei pentru valorile prezise. O nouă variabilă este creată prin adăugarea prefixului la numele variabilei dependente.",
  "help": {
    "title": "K Vecini Aproape",
    "r_help": "help(knn, package ='class')",
    "body": "\n                <b>Descriere</b></br>\nk-Nearest Neighbor Classification\n<br/>\n<b>Notă: </b></br>\nVezi textul de ajutor pe dialog\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nknn(train= dataset1, test, cl, k = 1, l = 0, prob = FALSE, use.all = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ntrain: Acesta este setul de date sursă (activ) folosit pentru a crea un model ajustat.\n</li>\n<li>\ntest: Acesta este setul de date în care valorile prezise vor fi salvate când prefixul specificat este folosit. O nouă variabilă este creată prin adăugarea prefixului la variabila dependentă specificată din setul de date sursă.\n</li>\n<li>\ncl: factor de clasificări adevărate din setul de date folosit pentru a ajusta modelul\n</li>\n<li>\nk: numărul de vecini considerați.\n</li>\n<li>\nl: votul minim pentru o decizie definitivă, altfel îndoială. (Mai precis, mai puțin de k-l voturi de dezacord sunt permise, chiar dacă k este crescut prin egalitate.)\n</li>\n<li>\nprob: Dacă aceasta este adevărată, proporția voturilor pentru clasa câștigătoare este returnată ca atribut prob.\n</li>\n<li>\nuse.all: controlează gestionarea egalităților. Dacă este adevărat, toate distanțele egale cu cea de-a k-a cea mai mare sunt incluse. Dacă este fals, o selecție aleatorie de distanțe egale cu cea de-a k-a este aleasă pentru a folosi exact k vecini.\n</li>\n</ul>\n<b>Valoare</b></br>\nFactor de clasificări ale setului de testare. îndoiala va fi returnată ca NA.</br>\n<b>Pachet</b></br>\ncaret;class</br>\n<b>Ajutor</b></br>\nhelp(knn, package ='class')\n                "
  }
}