{
  "title": "Raporturi de probabilitate și plotare a coeficientelor",
  "navigation": "Raporturi de probabilitate și plotare a coeficientelor",
  "label1": "Selectați un model (modelele de clasă Rm, dRm și eRm sunt acceptate)",
  "label1b": "Dacă nu sunt disponibile modele, trebuie să creați mai întâi un model selectând Ajustare Model -> IRT -> Model Rasch Simplu și alegeți estimarea CML",
  "modelselector1": "Selectați un model",
  "spcr": "Criterii de divizare",
  "destination": "Selectați variabilele pentru a plota coeficientele",
  "help": {
    "title": "Raporturi de probabilitate și plotare a coeficientelor",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>Descriere</b></br>\n                Acest test LR se bazează pe divizarea subgrupurilor de subiecți.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \n## Metodă S3 pentru clasa 'Rm'\n<br/>\nLRtest(object, splitcr = \"median\", se = TRUE)\n<br/>\n## Metodă S3 pentru clasa 'LR'\n<br/>\nplotGOF(x, beta.subset = \"all\", main = \"Verificare grafică a modelului\", xlab, ylab,\n    tlab = \"item\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: Obiect de clasă \"Rm\".\n</li>\n<li>\nsplitcr: Criteriu de divizare pentru scorul brut al subiecților. \"all.r\" corespunde unei divizări complete a scorului brut, \"median\" folosește mediana ca criteriu de divizare, \"mean\" efectuează o divizare pe medie. Opțional, splitcr poate fi, de asemenea, un vector care atribuie fiecărei persoane un anumit subgrup (de exemplu, conform unui criteriu extern). Acest vector poate fi numeric, caracter sau un factor.\n</li>\n<li>\nse: controlează calculul erorilor standard în submodele (implicit: TRUE)\n</li>\n<li>\nx: Obiect de clasă \"LR\". De asemenea, utilizat pentru vizualizarea potrivirii elementelor individuale.\n</li>\n<li>\nbeta.subset: Dacă \"all\", toate elementele sunt plotate. În caz contrar, poate fi specificat un vector numeric de subset.\n</li>\n<li>\ntlab: Specificarea etichetelor elementelor: \"item\" tipărește numele elementelor, \"number\" oferă întregi corespunzătoare ordinii parametrilor beta, dacă \"none\" nu sunt tipărite etichete. \"identify\" permite o etichetare interactivă. Inițial, nu sunt tipărite etichete, după ce se face clic aproape de un punct de element, eticheta corespunzătoare este adăugată. Procesul de identificare se încheie prin clic pe al doilea buton și selectând 'Stop' din meniu, sau din meniul 'Stop' de pe fereastra grafică. Pentru mai multe informații și operațiuni de bază, consultați identify.\n</li>\n<li>\nconf: pentru plotarea elipselor de încredere pentru parametrii elementelor. Dacă conf = NULL (implicit), nu sunt desenate elipse. În caz contrar, conf trebuie specificat ca o listă cu elemente opționale: gamma, este nivelul de încredere (numeric), col și lty, culoare și tip de linie (vezi par), care (vector de index numeric) specifică pentru care elemente sunt desenate elipsele (trebuie să fie un subset al beta.subset), și ia, logic, dacă elipsele trebuie desenate interactiv (cf., tlab = \"identify\" mai sus). Pentru detalii despre comportamentul implicit, dacă conf este specificat ca o listă goală, consultați Detalii și Exemple mai jos. Pentru a utiliza conf, obiectul LR x trebuie generat folosind opțiunea se = TRUE în LRtest(). Consultați help(MLoef) pentru mai multe detalii.\n</li>\n</ul>\n<b>Detalii</b></br>\nDacă setul de date conține valori lipsă și media sau mediana este specificată ca criteriu de divizare, mediile sau medianele sunt calculate pentru fiecare subgrup de valori lipsă și utilizate în consecință pentru divizarea scorului brut.\n<br/>\nCând se utilizează selecția interactivă pentru etichetarea punctelor individuale (tlab = \"identify\" și desenarea elipselor de încredere la anumite puncte (ia = TRUE), atunci mai întâi toate punctele plotate sunt etichetate și ulterior toate elipsele sunt generate. Ambele procese de identificare pot fi terminate prin clic pe al doilea buton al mouse-ului și selectând 'Stop' din meniu, sau din meniul 'Stop' de pe fereastra grafică.\n<br/>\nFolosind specificația care permite desenarea selectivă a elipselor pentru anumite elemente doar, de exemplu, care = 1:3 desenează elipse pentru elementele 1 până la 3 (atâta timp cât sunt incluse în beta.subset). Comportamentul implicit este desenarea elipselor pentru toate elementele. Elementul col din lista conf poate fi fie o specificație de culoare unică, cum ar fi \"blue\", fie un vector cu specificații de culoare pentru toate elementele. Lungimea trebuie să fie aceeași cu numărul de elipse care trebuie desenate. Pentru specificația culorii, se poate configura o paletă folosind palete standard (de exemplu, rainbow) sau palete din colorspace sau pachetul RColorBrewer. Un exemplu este dat mai jos.\n<br/>\nsumar și metodele de tipărire sunt disponibile pentru obiectele de clasă LR.\n<br/><br/>\n<b>Valoare</b><br/>\nLRtest returnează un obiect de clasă LR conținând:\n<br/><br/>\nLR: valoarea LR.\n<br/>\ndf: gradele de libertate ale statisticii testului.\n<br/>\nChisq: valoarea Chi-pătrat cu df corespunzătoare.\n<br/>\n<br/>\n<b>Pachet</b></br>\neRm\n<br/><br/>\n<b>Ajutor</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}