{
  "title": "Regresie liniară",
  "navigation": "Liniar, de bază",
  "modelname": "Introduceți numele modelului",
  "dependent": "Variabila dependentă",
  "independent": "Variabila(e) independent(e)",
  "nointercept": "Ignoră interceptul",
  "generateplotchk": "Plotează reziduurile vs ajustate, normal Q-Q, scală-locație și reziduurile vs leverage",
  "weights": "Specificați o variabilă cu greutăți",
  "help": {
    "title": "Regresie liniară",
    "r_help": "help(lm, package ='stats')",
    "body": "\n            <b>Descriere</b></br>\nConstruiește un model de regresie liniară. Apelează intern funcția lm din pachetul stats. Returnează un obiect numit BSkyLinearRegression care este un obiect de clasă lm. Afișează un rezumat al modelului, tabelul coeficientului, tabelul Anova și tabelul sumelor pătrate și plotează următoarele reziduuri vs. ajustate, normal Q-Q, cuantile teoretice, reziduuri vs. leverage. Puteți specifica opțional o variabilă cu greutăți și alege să ignorați interceptul.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nLinearRegModel1 <- lm(depVar~indepVars, dataset)​<br/>\n#Rezumatul modelului<br/>\nsummary(LinearRegModel1)<br/>\n#Afișarea tabelului Anova<br/>\nanova(LinearRegModel1)<br/>\n#Plotează reziduuri vs. ajustate, normal Q-Q, scală-locație, reziduuri vs. leverage<br/>\nplot(LinearRegModel1)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndepVar: Numele variabilei dependente. Dacă avem un set de date cars, cu o variabilă mpg pe care dorim să o prezicem mpg (variabila dependentă este mpg) introduceți mpg​\n</li>\n<li>\nindepVars: Numele variabilelor independente. Dacă avem un set de date cars, cu variabilele dependente putere motor, dimensiune motor, introduceți putere motor+dimensiune motor. Variabilele categorice sunt codificate automat.​\n</li>\n<li>\ndataset: Numele dataframe-ului. Când deschideți cadre de date sau seturi de date, de exemplu, fișiere csv, fișiere Excel, fișiere SAS în BlueSky Statistics, acestea sunt numite Dataset1, Dataset2, Dataset3, așa că introduceți Dataset1\n</li>\n</ul>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(lm, package ='stats')\n\t\t\t"
  }
}