{
  "title": "Grafic liniar",
  "navigation": "Puncte",
  "label1": "Faceți clic pe tab-ul de mai jos corespunzător tipului de grafic liniar pe care îl doriți. Implicit este conectat prin ordine.",
  "x": "Axa X",
  "y": "Axa Y, specificați o variabilă numerică (s)",
  "color": "Grup/Culoare, specificați o variabilă factor",
  "line": "După ordine",
  "linetype": "Un tip de linie separat va fi utilizat pentru fiecare nivel al variabilei factor",
  "stair": "Pași în trepte",
  "path": "După apariție",
  "lineChartType": "Faceți clic pe tipul de grafic liniar de mai jos",
  "alpha": "Opacitate (0-1)",
  "flipBox": "Răsturnați axa",
  "specify_a_title": "Introduceți un titlu",
  "x_title": "Eticheta axei X",
  "y_title": "Eticheta axei Y",
  "Facetrow": "Rând de fațete",
  "Facetcolumn": "Coloană de fațete",
  "Facetwrap": "Împachetare de fațete",
  "Facetscale": "Scală de fațete",
  "sizePoint": "Dimensiunea punctelor",
  "sizeLine": "Lățimea liniei",
  "facets_lbl" : "Fațete",
  "help": {
    "title": "Grafic liniar",
    "r_help": "help(geom_line, package=ggplot2)",
    "body": "\n            <b>Descriere</b></br>\n            Opțiunea de a utiliza un tip de linie diferit pentru fiecare nivel al variabilei factor specificate este oferită pentru a sprijini publicațiile care nu suportă culoare. \n            Creează un grafic liniar (conectat prin ordine) sau un grafic în trepte sau ordonează graficul liniar după apariția punctelor în setul de date. Faceți clic pe tab-ul corespunzător tipului de grafic liniar pe care îl doriți.</br>\n            Grafic liniar (conectat prin ordine): Un grafic liniar plotează o linie prin puncte definite de coordonatele x și y și le conectează în ordinea variabilelor de pe axa x. Când un grup/culoare este setat pe o variabilă factor, punctele sunt grupate după culoare și se generează o linie separată pentru fiecare grup. Fațetele pot fi create opțional specificând o variabilă factor. De asemenea, puteți specifica opțional teme și un titlu și etichete pentru axele x și y​</br>\n            Grafic în trepte: Un grafic liniar plotează o linie prin puncte definite de coordonatele x și y și creează un grafic în trepte, evidențiind exact când au loc schimbările. Când o culoare este setată pe o variabilă factor, punctele sunt grupate după culoare și se generează o linie separată pentru fiecare grup de culoare. Fațetele pot fi create opțional specificând o variabilă factor. De asemenea, puteți specifica opțional teme și un titlu și etichete pentru axele x și y​</br>\n            Ordinate după apariție: Un grafic liniar plotează o linie prin puncte definite de coordonatele x și y și le conectează în ordinea în care variabilele apar în setul de date. Când o culoare este setată pe o variabilă factor, punctele sunt grupate după culoare și se generează o linie separată pentru fiecare grup de culoare. Fațetele pot fi create opțional specificând o variabilă factor. De asemenea, puteți specifica opțional teme și un titlu și etichete pentru axele x și y​.</br>\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code> \n            #Grafic liniar<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_line( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\", title= \"Grafic liniar pentru ...\")<br/>\n            #Grafic în trepte<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_step( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Grafic liniar pentru ...\")<br/>\n            #Ordinate după apariție<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_path( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Grafic liniar pentru ...\")\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            data: Setul de date implicit​\n            </li>\n            <li>\n            aes(): Generați mapări estetice care descriu modul în care variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geoms.​\n            </li>\n            <li>\n            x: O variabilă numerică sau factor\n            </li>\n            <li>\n            y: variabila numerică/scală pentru care punctele sunt plotate pe axa y​\n            </li>\n            <li>\n            color: o variabilă factor opțională pentru a grupa punctele (după culoare)​\n            </li>\n            <li>\n            labs(): Schimbați etichetele axelor și titlurile legendelor (Aceasta este opțional)​\n            </li>\n            <li>\n            facet_grid(): Așezați panourile într-o grilă (Aceasta este opțional)​\n            </li>\n            <li>\n            theme_calc(): Specifică tema calculatorului (Aceasta este opțional)​\n            </li>\n            <li>\n            geom_line(): Conectează observațiile ordonate după valoarea x, vezi x:​\n            </li>\n            <li>\n            coord_flip(): Răsturnați axa (Aceasta este opțional)​\n            </li>\n            </ul>\n            <b>Pachet</b></br>\n            ggplot2;ggthemes;</br>\n            <b>Ajutor</b></br>\n            #Grafic liniar\n            help(geom_line, package='ggplot2')\n            #Grafic liniar în trepte\n            help(geom_step, package=ggplot2)\n            #Ordinea variabilelor\n            help(geom_path, package='ggplot2')\n            Alte: Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(labs), help(geom_line), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​            \n    "
  }
}