{
  "title": "Regresie Logistică",
  "navigation": "Logistică, de bază",
  "modelname": "Introduceți numele modelului",
  "dependent": "Variabila dependentă",
  "independent": "Variabila(e) independent(e)",
  "generateplotchk": "Plotați reziduurile vs ajustate, normal Q-Q, scale-location și reziduurile vs leverage",
  "destination2": "Specificați o variabilă cu greutăți",
  "help": {
    "title": "Regresie Logistică",
    "r_help": "help(glm, package ='stats')",
    "body": "\n<b>Descriere</b></br>\nConstruiește un model de regresie logistică binară. Folosim funcția glm, trecând parametrul family =binomial(link='logit'). Afișăm un rezumat al modelului, tabele de analiză a varianței și McFadden R2.<br/>\nPuteți evalua modelul selectând modelul creat în colțul din dreapta sus al ecranului principal al aplicației și selectând butonul Score. Puteți alege să afișați o matrice de confuzie și o curbă ROC<br/>\nNumele modelului implicit este Logistic1, pe care îl puteți schimba.<br/><br/>\nNOTĂ: Atunci când specificați o variabilă care conține greutăți, fiți conștienți că, deoarece folosim opțiunea na.exclude pentru a construi modelul, toate valorile NA sunt eliminate automat din variabilele dependentă și independentă.<br/>\nAceasta poate cauza o nepotrivire, deoarece valorile NA NU sunt eliminate automat din variabila de greutate. <br/>\nÎn această situație, veți vedea eroarea lungimile variabilelor diferă (găsită pentru (greutăți))<br/>\nPentru a rezolva această eroare, mergeți la Variabile>Valori Lipsă>Eliminați NAs și selectați variabilele dependentă, independentă și variabila de greutate pentru a elimina valorile lipsă și a reconstrui modelul.<br/>\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nmodelname <- glm(dependentVariable ~ var1+var2+var3...,family =binomial(link='logit'),data=datasetName)\n#Rezumatul modelului<br/>\nsummary(modelname)<br/>\n#Afișarea tabelului Anova<br/>\nanova(modelname)<br/>\n#Plotați reziduurile vs. ajustate, normal Q-Q, scale-location, reziduurile vs. leverage<br/>\nplot(modelname)<br/>\n#McFadden R2<br/>\npR2(Logistic1)<br/>\n#raporturi de șanse și interval de încredere de 95%<br/>\nexp(cbind(OR=coef(Logistic1), confint(Logistic1,level=0.95)))<br/>\n#Plotați modelul<br/>\nplot(Logistic1)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndepVar: Numele variabilei dependente.  Dacă avem un set de date cars, cu o variabilă clasă pe care dorim să o prezicem (variabila dependentă este clasa) introduceți clasa\n</li>\n<li>\nindepVars: Numele variabilelor independente, separate prin +. Dacă avem un set de date cars, cu variabila independentă puterea motorului, dimensiunea motorului, specificați puterea motorului+dimensiunea motorului). Variabilele categorice sunt codificate automat.​\n</li>\n<li>\ndata: Numele dataframe-ului. Când deschideți cadre de date sau seturi de date, de exemplu, fișiere csv, fișiere Excel, fișiere SAS în BlueSky Statistics, acestea sunt numite Dataset1, Dataset2, Dataset3. Așadar, introduceți data=Dataset1​\n</li>\n</ul>\n<b>Pachet</b></br>\nglm</br>\n<b>Ajutor</b></br>\nhelp(glm, package ='stats')</br>\n<b>Referințe</b></br>\nhttps://datascienceplus.com/perform-logistic-regression-in-r/</br>\nhttps://www.machinelearningplus.com/machine-learning/logistic-regression-tutorial-examples-r/</br>\n<b>Altele</b></br>\nFaceți clic pe pictograma Ajutor R pentru a obține ajutor detaliat R​</br>\n\t\t\t"
  }
}