{
  "title": "Quantilele Binomiale Negative",
  "navigation": "Quantilele Binomiale Negative",
  "varvals": "Introduceți probabilitățile separate prin virgulă. Exemplu: 0.3,0.2,0.5",
  "size": "Numărul țintă de succese",
  "prob": "Probabilitățile de succes",
  "labelSig": "Nivelul de semnificație",
  "lowtail": "Coada inferioară",
  "uptail": "Coada superioară",
  "help": {
    "title": "Quantilele Binomiale Negative",
    "r_help": "help(qnbinom, package=stats)",
    "body": "\n\n            <b>Descriere</b>\n            <br/>\n            Densitate, funcție de distribuție, funcție de quantile și generare aleatorie pentru distribuția binomială negativă cu parametrii size și prob.\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code>\n                dnbinom(x, size, prob, mu, log = FALSE)\n                <br/>\n                pnbinom(q, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qnbinom(p, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rnbinom(n, size, prob, mu)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumente</b>\n            <br/>\n            <ul>\n                <li>x : vector de quantile (numere întregi non-negative).</li>\n                \n                \n                <li>q : vector de quantile.</li>\n                \n                \n                <li>p : vector de probabilități.</li>\n                \n                \n                <li>n : numărul de observații. Dacă lungimea(n) > 1, lungimea este considerată a fi numărul necesar.</li>\n                \n                \n                <li>size : ținta pentru numărul de încercări reușite, sau parametru de dispersie (parametrul de formă al distribuției gamma de amestec). Trebuie să fie strict pozitiv, nu trebuie să fie întreg.</li>\n                \n                \n                <li>prob : probabilitatea de succes în fiecare încercare. 0 < prob <= 1.</li>\n                \n                \n                <li>mu : parametrizare alternativă prin medie: vezi 'Detalii'.</li>\n                \n                \n                <li>log, log.p : logic; dacă este TRUE, probabilitățile p sunt date ca log(p).</li>\n                \n                \n                <li>lower.tail : logic; dacă este TRUE (implicit), probabilitățile sunt P[X ≤ x], altfel, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalii</b>\n            <br/>\n            Distribuția binomială negativă cu size = n și prob = p are densitate\n            <br/>\n            <code>\n                Γ(x+n)/(Γ(n) x!) p^n (1-p)^x\n                pentru x = 0, 1, 2, …, n > 0 și 0 < p ≤ 1.\n            </code>\n            <br/>\n            Aceasta reprezintă numărul de eșecuri care apar într-o secvență de încercări Bernoulli înainte ca un număr țintă de succese să fie atins. Media este μ = n(1-p)/p și varianța n(1-p)/p^2.\n            <br/>\n            O distribuție binomială negativă poate apărea de asemenea ca un amestec de distribuții Poisson cu media distribuită ca o distribuție gamma (vezi pgamma) cu parametru de scară (1 - prob)/prob și parametru de formă size. (Această definiție permite valori non-integre ale size.)\n            <br/>\n            O parametrizare alternativă (folosită frecvent în ecologie) este prin media mu (vezi mai sus), și size, parametrul de dispersie, unde prob = size/(size+mu). Varianța este mu + mu^2/size în această parametrizare.\n            <br/>\n            Dacă un element din x nu este întreg, rezultatul dnbinom este zero, cu un avertisment.\n            Cazul size == 0 este distribuția concentrată la zero. Aceasta este distribuția limită pentru size care se apropie de zero, chiar dacă mu mai degrabă decât prob este menținut constant. Observați totuși, că media distribuției limită este 0, indiferent de valoarea lui mu.\n            <br/>\n            Quantila este definită ca cea mai mică valoare x astfel încât F(x) ≥ p, unde F este funcția de distribuție.\n            <br/>\n            <br/><b>Valoare</b>\n            <br/>\n            dnbinom oferă densitatea, pnbinom oferă funcția de distribuție, qnbinom oferă funcția de quantile, iar rnbinom generează deviate aleatorii.\n            <br/>\n            Size sau prob invalid vor rezulta în valoarea de returnare NaN, cu un avertisment.\n            <br/>\n            Lungimea rezultatului este determinată de n pentru rnbinom, și este maximul lungimilor argumentelor numerice pentru celelalte funcții.\n            <br/>\n            Argumentele numerice, altele decât n, sunt reciclate la lungimea rezultatului. Numai primele elemente ale argumentelor logice sunt utilizate.            \n        "
  }
}