{
  "title": "Raporturi de șanse / Riscuri relative, M de 2 Tabel",
  "navigation": "Raporturi de șanse / Riscuri relative, M de 2 Tabel",
  "outcomevarlabel": "Variabila de rezultat (Factor binar)",
  "expvarlabel": "Variabila de expunere/predictor (Factor)",
  "statlabel": "Statistică",
  "orlabel": "Raporturi de șanse",
  "rrlabel": "Riscuri relative",
  "oresttypelabel": "Tip de estimare a raportului de șanse",
  "orestwaldlabel": "Wald",
  "orestfisherlabel": "Fisher",
  "orestmidplabel": "Mid-p",
  "orestsmalllabel": "Ajustat pentru eșantion mic",
  "rresttypelabel": "Tip de estimare a riscului relativ",
  "rrestwaldlabel": "Wald",
  "rrestsmalllabel": "Ajustat pentru eșantion mic",
  "reversallabel": "Reversarea categoriei",
  "revnonelabel": "Fără reversare",
  "revexplabel": "Expunere",
  "revoutlabel": "Rezultat",
  "revbothlabel": "Ambele",
  "cilevellabel": "Nivel de încredere (0-1)",
  "help": {
    "title": "Raporturi de șanse / Riscuri relative, M de 2 Tabel",
    "r_help": "help(epitab, package ='epitools')",
    "body": "\nAcest lucru este folosit pentru a compara probabilitățile de a avea o \"boală\" pentru un grup în raport cu altul, sub formă de raport de șanse (raport de șanse) sau raport de probabilitate (riscuri relative).  \nRaportul de șanse pentru \"boală\" este definit ca probabilitatea de \"boală\" împărțită la probabilitatea de \"fără boală\". O tabelă de frecvențe a rezultatelor în fiecare grup este furnizată.  \nÎn plus, o tabelă de raporturi de șanse sau riscuri relative pentru fiecare grup în raport cu grupul de referință, cu intervale de încredere și o valoare p Chi-pătrat Wald este inclusă.  În cele din urmă, \no tabel de valori p este prezentat cu versiuni exacte mid-p, exacte Fisher și Chi-pătrat Wald, comparând fiecare grup cu grupul de referință. \n<br/><br/>\n<b>Variabila de rezultat:</b> Variabilă binară \"boală\" (da/nu) de interes.  În mod implicit, cea mai înaltă categorie în ordinea de sortare este definită ca \"boală da\".\n<br/><br/>\n<b>Variabila de expunere/predictor:</b> Grupuri de comparat.  Poate avea mai mult de 2 grupuri.\n<br/><br/>\n<b>Statistică:</b> Ce statistică să se calculeze\n<br/><br/>\n<b>Tip de estimare a raportului de șanse / risc relativ:</b> Wald (maxim de verosimilitate necondiționat), Fisher (maxim de verosimilitate condiționat), Mid-p (metodă mediană neafectată), sau Ajustat pentru eșantion mic\n<br/><br/>\n<b>Reversarea categoriei:</b>  Acest lucru controlează dacă să se inverseze sau nu ordinea categoriilor variabilei de expunere sau a categoriilor variabilei de rezultat.  Inversarea variabilei de expunere \nva schimba grupul de referință pentru raporturile de șanse.  Inversarea variabilei de rezultat va schimba categoria care corespunde \"bolii\".\n<br/><br/>\n<b>Nivel de încredere:</b> nivel pentru intervalele de încredere; implicit este 0.95\n<br/><br/>\n<b>Pachete R necesare:</b> epitools\n\t\t\t"
  }
}