{
    "title": "Regresia parametrică a supraviețuirii",
    "navigation": "Regresia parametrică a supraviețuirii",
    "modelname": "Introduceți numele modelului",
    "timevar": "Timpul până la eveniment sau cenzurare",
    "eventvar": "Eveniment (1 sau mai mare = eveniment, 0 sau mai mic = cenzurare)",
    "destvars": "Variabile independente",
    "weightvar": "Greutate (opțional)",
    "rmstChk": "Calculează timpul mediu restricționat al supraviețuirii (RMST)",
    "rmstSEChk": "Calculează eroarea standard a RMST folosind bootstrap (notă: poate dura ceva timp)",
    "bootIter": "Numărul de iterații pentru bootstrap",
    "HazardRatioChk": "Calculează rapoartele de risc",
    "labelSurvival": "Tipul graficului de supraviețuire",
    "survivalradioCI": "Supraviețuire cu CI",
    "survivalradio": "Supraviețuire",
    "survivalradioKMCI": "Curba de supraviețuire Kaplan-Meier (neparametrică) cu CI",
    "survivalradioKM": "Curba de supraviețuire Kaplan-Meier (neparametrică)",
    "labelFailure": "Tipul graficului de eșec cumulativ",
    "inciradioCI": "Eșec cumulativ cu CI",
    "inciradio": "Eșec cumulativ",
    "inciradioKMCI": "Curba de eșec cumulativ Kaplan-Meier (neparametrică) cu CI",
    "inciradioKM": "Curba de eșec cumulativ Kaplan-Meier (neparametrică)",
    "spectimes": "Calculează probabilitatea de supraviețuire - specificați timpul ca time1, time2, time3, etc., sau în formatul seq(1,5,by=1)",
    "specprobs": "Calculează timpul de supraviețuire până la eveniment - specificați probabilitățile (ex. 0.25, 0.50, 0.60, 0.75) sau în formatul seq(0.2,0.9,by=0.1)",
    "coVarValues": "Lăsați gol pentru a folosi media variabilelor independente (covariabile). În caz contrar, specificați valorile separate prin virgulă pentru estimările probabilității și graficele dorite.",
    "labelDistribution": "Selectați funcția de distribuție care se potrivește cel mai bine cu datele",
    "selectDistFuncWeibullRad": "Weibull",
    "selectDistFuncExpRad": "Exponențială",
    "selectDistFuncGammaRad": "Gamma",
    "selectDistFuncLnormalRad": "Normală logaritmică",
    "selectDistFuncPoissonRad": "Poisson",
    "selectDistFuncNBinomRad": "Binomială negativă",
    "selectDistFuncGeomRad": "Geometrică",
    "selectDistFuncBetaRad": "Beta",
    "selectDistFuncUnifRad": "Uniformă",
    "selectDistFuncLogisRad": "Logistică",
    "selectDistFuncLogLogisRad": "Logistică logaritmică",
    "selectDistFuncCauchyRad": "Cauchy",
    "selectDistFuncNormRad": "Normală",
    "confidenceInterval": "Interval de încredere pentru estimările maxime de verosimilitate",
    "help": {
        "title": "Regresia parametrică a supraviețuirii",
        "r_help": "help(flexsurvreg, package = 'flexsurv')",
        "body": "\n\t\t\tConsultați setul de date de exemplu din directorul de instalare. Locația implicită este drive:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. Variabila Followup_time trebuie introdusă ca timpul până la eveniment sau cenzurare, iar variabila Event ca 1 (eveniment) sau 0 (cenzurare).<br/>\n            <br/>\n            <br/>\n\t\t\tSeturile de date de exemplu sunt lung, manufacturing_data și bulb reliability.<br/><br/>\t\t\n            <b>Estimarea parametrilor regresiei parametrică și graficul suprapuse cu curba de supraviețuire Kaplan-Meier (model de zero/intercept)</b>\n            <br/>\n            <br/>\n            Acestea sunt utilizate pentru a estima riscul acumulat al probabilității de eveniment (sau de absență a acestuia) pe o perioadă de timp, de la începutul urmării până la eveniment.<br/>\n            <br/>\n            <b>Timp:</b> timpul până la eveniment (dacă evenimentul a avut loc) sau până la ultima urmărire (dacă nu a avut loc evenimentul)<br/><br/>\n            <b>Eveniment:</b> variabila numerică care indică dacă s-a produs un eveniment (1) sau nu (0)<br/><br/>\n            <b>Tip de grafic:</b> probabilitatea de supraviețuire (fără eveniment) sau probabilitatea de eșec (cu eveniment)<br/><br/>\n            <br/>\n            <br/>\n\t\t\t<b>Estimarea tabelului pentru un timp specific sau probabilitate:</b> opțional, puteți include un tabel cu estimările probabilității de supraviețuire pentru un set de timp selectat.<br/><br/>\n\t\t\t<b>Specificați timpul ca time1, time2, time3, etc., sau ca seq(1,5,by=1):</b> specificați timpul pentru tabelul de estimare. Puteți să-l introduceți individual prin virgulă sau ca o secvență de valori echidistante.\n\t\t\t<br/><br/>\n            Tabelul afișează numărul de subiecți, numărul de evenimente, timpul median de supraviețuire (dacă este definit), timpul mediu restricționat al supraviețuirii și timpul median de urmărire. Timpul median de urmărire se estimează utilizând estimatorul Kaplan-Meier inversat, tratând observările adevărate ca fiind cenzurate și observările cenzurate ca evenimente. Prin urmare, „evenimentul” în acest estimator reprezintă „urmărirea subiectului cât mai mult posibil”.\n            <br/>\n            Estimările parametrice pentru distribuția selectată și estimările evenimentului sunt afișate pentru fiecare timp din setul de date, cu intervale de încredere.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Opțiuni de stil</b>\n            <br/>\n            <br/>\n            <b>Titlul graficului:</b> titlul graficului; lăsați tot textul gol pentru a nu afișa titlul.<br/><br/>\n\t\t\t<b>Dimensiunea titlului graficului:</b> dimensiunea titlului graficului<br/><br/>\n            <b>Tema graficului:</b> stilul general al graficului<br/><br/>\n            <b>Inclusiv numărul de riscuri:</b> opțional, puteți include un tabel care arată numărul de subiecți la risc în funcție de timp, sub grafic. <b>Poziția tabelului de risc</b> controlează dacă tabelul este plasat intern sau extern pe axă. <b>Înălțimea tabelului de risc</b> controlează cât de mult din zona graficului este ocupată de tabelul de risc. Această opțiune este ignorată dacă poziția tabelului de risc este internă.\n\t\t\t<b>Dimensiunea valorilor riscurilor</b> controlează dimensiunea numerelor de riscuri, iar <b>Dimensiunea titlului tabelului de risc</b> controlează dimensiunea titlului tabelului. <b>Dimensiunea etichetelor axelor tabelului de risc</b> controlează dimensiunea etichetelor axelor. <b>Dimensiunea etichetelor numerelor de risc pe axa tabelului de risc</b> controlează dimensiunea etichetelor numerelor de risc. Dacă doriți să eliminați toate axele și liniile de grilă din tabelul de risc, selectați <b>Eliminați axele și liniile de grilă din tabelul de risc</b> pentru a afișa doar valorile numerice ale riscurilor.<br/>\n            <br/>\n            <br/>   \n            <b>Opțiuni pentru linii</b>\n            <br/> \n            <br/> \n            <b>Dimensiunea</b> controlează grosimea liniei și <b>culoarea</b> controlează culoarea liniei. Opțional, puteți include 95% CI estimat sub formă de <b>panglică</b> (zonă umbrită) sau <b>treaptă</b> (linie). <b>Transparența</b> controlează densitatea panglicii și este ignorată dacă selectați opțiunea treaptă. <b>Timpul cenzurat</b> (când subiectul nu mai este expus riscului pentru eveniment) poate fi afișat cu simbolul „+” pe linie și puteți ajusta dimensiunea simbolului „+”. Opțiunea <b>Linie care arată timpul median de supraviețuire</b> adaugă o linie orizontală sau verticală la timpul estimat în care se estimează că 50% din subiecți au experimentat evenimentul. Dacă curba de supraviețuire nu depășește 50%, timpul median nu este definit.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opțiuni pentru axe</b>\n            <br/> \n            <br/> \n            Opțiunea <b>Etichete</b> specifică etichetele textului axei. <b>Limitele axelor</b> specifică valorile minime și maxime ale axelor. Opțiunea <b>Incrementul scalei</b> controlează intervalul între marcajele axei. Incrementul de timp pe axa de timp controlează și tabelul de timp al riscurilor opționale.\n            <br/> \n            Opțiunea <b>Scara axei</b> specifică dacă estimările sunt afișate pe o scară de raport (0-1) sau pe o scară de procente (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea etichetelor axelor:</b> controlează dimensiunea etichetelor axelor de supraviețuire și de timp.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea etichetelor marcajelor axelor:</b> controlează dimensiunea etichetelor de pe axele de supraviețuire și de timp.\n"
    }
}
