{
  "title": "Estimările nivelului parametrilor",
  "navigation": "Estimările parametrilor",
  "label1": "Modelele următoarelor clase sunt acceptate, clasele sunt enumerate între paranteze mai jos",
  "label2": "Modele liniare (lm), modele liniare generalizate (glm), modele log-lineare multinomiale (multinom), regresie quantilă (rq), regresie liniară robustă (rlm), obiect de curba de supraviețuire (survfit), model de efecte mixte liniare (lme), obiect de regresie cu riscuri proporționale (coxph), model de regresie de supraviețuire parametric (survreg), regresie logistică/probit ordonată (polr), analiză factorială (factanal), modele liniare generalizate regularizate Lasso și Elastic-net (glmnet)",
  "modelselector1": "Selectați un model",
  "help": {
    "title": "Estimările nivelului parametrilor",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>Descriere</b></br>\nAfișează estimările parametrilor modelului selectat\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: model sau alt obiect R de convertit într-un cadru de date cu o singură linie\n</li>\n</ul>\n<b>Detalii</b></br>\nAfișează estimările parametrilor următoarelor modele</br>\nModele liniare (clasa modelului lm)</br>\nModele liniare generalizate (clasa modelului glm)</br>\nModele log-lineare multinomiale (clasa modelului multinom)</br>\nRegresie logistică ordonată sau regresie Probit (clasa modelului polr)</br>\nModele liniare generalizate regularizate Lasso și Elastic-Net (clasa modelului glmnet)</br>\nRegresie liniară robustă (clasa modelului rlm)</br>\nRegresie quantilă (clasa modelului rq)</br>\nmodel de efecte mixte liniare (lme)</br>\nobiect de regresie cu riscuri proporționale (coxph)</br>\nmodel de regresie de supraviețuire parametric (survreg)</br>\nanaliză factorială (factanal)</br>\n<b>Valoare</b></br>\nUn tibble::tibble() cu informații despre componentele modelului.</br>\ntermen: Numele termenului de regresie.</br>\nestimate: Valoarea estimată a termenului de regresie.</br>\nstd.error: Eroarea standard a termenului de regresie.</br>\nstatistic: Valoarea unei statistici, aproape întotdeauna o statistică T, utilizată într-o ipoteză că termenul de regresie este diferit de zero.</br>\np.value: Valoarea p bidirecțională asociată cu statistica observată.</br>\nconf.low: Limita inferioară a unui interval de încredere pentru termenul de regresie. Inclusă doar dacă conf.int = TRUE.</br>\nconf.high: Limita superioară a unui interval de încredere pentru termenul de regresie. Inclusă doar dacă conf.int = TRUE.</br>\nDacă modelul liniar este un obiect mlm (model liniar multiplu), există o coloană suplimentară:</br>\nresponse: La ce coloană de răspuns corespund coeficientii (de obicei Y1, Y2, etc)</br>\n<b>Pachet</b></br>\nbroom</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă în editorul de sintaxă R help(tidy, package ='broom')\n"
  }
}