{
  "title": "Graficul hărții Persoană-Articol",
  "navigation": "Graficul hărții Persoană-Articol",
  "label1": "Selectați un model (modelele din clasa Rm și dRm sunt acceptate)",
  "label1b": "Dacă nu sunt disponibile modele, trebuie să creați mai întâi un model selectând Ajustare Model -> IRT",
  "modelselector1": "Selectați un model",
  "range1": "Interval pentru axa X",
  "help": {
    "title": "Graficul hărții Persoană-Articol",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>Descriere</b></br>\n                O hartă persoană-articol afișează locația parametrilor articolelor (și a pragurilor) precum și distribuția parametrilor persoanelor pe dimensiunea latentă. Hărțile persoană-articol sunt utile pentru a compara intervalul și poziția distribuției măsurii articolelor (panoul inferior) cu intervalul și poziția distribuției măsurii persoanelor (panoul superior). Articolele ar trebui să fie ideal amplasate pe întreaga scară pentru a măsura semnificativ „abilitatea” tuturor persoanelor.\n\n                <br/><br/>\n                <b>Utilizare</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"Harta Persoană-Articol\", latdim = \"Dimensiunea Latentă\",\n                pplabel = \"Distribuția\nParametrului\nPersoanei\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>Argumente</b>\n                <br/>  \n                object: Obiect din clasa Rm sau dRm\n                <br/>\n                item.subset: Subset de articole care urmează a fi reprezentate. Fie un vector numeric care indică coloana din X, fie un vector de caractere care indică numele coloanei. Dacă \"all\", toate articolele sunt reprezentate. Numărul de articole care urmează a fi reprezentate trebuie să fie > 1.\n                <br/>\n                sorted: Dacă este TRUE, articolele sunt sortate în ordine crescătoare conform locației lor pe dimensiunea latentă.   \n                <br/>\n                main: Titlul principal al graficului.\n                <br/>\n                latdim: Eticheta axei x, adică dimensiunea latentă.\n                <br/>\n                pplabel: Titlul pentru panoul superior care afișează distribuția parametrului persoanei\n                <br/>\n                cex.gen: cex ca parametru grafic specifică o valoare numerică care oferă cantitatea cu care textul și simbolurile de graficare ar trebui să fie mărite în raport cu valoarea implicită. Aici cex.gen se aplică tuturor etichetelor de text. Valoarea implicită este 0.7.\n                <br/>\n                xrange: Interval pentru axa x\n                <br/>\n                warn.ord: Dacă este TRUE (valoarea implicită), asteriscurile sunt afișate în marginea din dreapta a panoului inferior pentru a indica locațiile pragurilor nonordonate pentru articolele politoame.\n                <br/>\n                warn.ord.colour: Locațiile pragurilor nonordonate pentru articolele politoame sunt colorate cu această culoare pentru a le face mai vizibile. Acest lucru este deosebit de util atunci când există multe articole, astfel încât graficul să fie destul de dens. Valoarea implicită este \"black\", astfel încât nu se face nicio distincție.\n                <br/>   \n                irug: Dacă este TRUE (valoarea implicită), toate pragurile sunt reprezentate sub distribuția persoanei pentru a indica unde articolele incluse sunt cele mai informative.                \n                <br/>\n                pp: Dacă nu este NULL, aceasta conține datele parametrului persoanei ale obiectului de date, evitând necesitatea de a le recalcula.\n                <br/><br/>\n\n                <b>Pachete</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>Ajutor</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}