{
  "title": "Dimensiunea eșantionului, precizia unei diferențe de medii",
  "navigation": "Diferența de medii",
  "howtouse": "Specificați fie dimensiunea eșantionului, fie lățimea intervalului de încredere, iar cealaltă va fi calculată",
  "n1": "Dimensiunea eșantionului Grup 1",
  "width": "Lățimea intervalului de încredere",
  "ratio": "Raportul dimensiunii eșantionului Grup 2 la Grup 1",
  "meandiff": "Diferența medie",
  "sd1": "Deviația standard Grup 1",
  "sd2": "Deviația standard Grup 2",
  "conflevel": "Nivelul de încredere (0-1)",
  "variance": "Presupunerea varianței",
  "help": {
    "title": "Dimensiunea eșantionului, precizia unei diferențe de medii",
    "r_help": "help(prec_meandiff, package ='presize')",
    "body": "\nAceasta este o evaluare a dimensiunii eșantionului pentru o diferență de medii bazată pe lățimea intervalului de încredere.  Calculează dimensiunea eșantionului sau lățimea intervalului de încredere atunci când utilizatorul \nspecificează cealaltă.\n<br/><br/>\n<b>Dimensiunea eșantionului Grup 1:</b> Specificați numărul de subiecți în grupul 1\n<br/><br/>\n<b>Lățimea intervalului de încredere:</b> Specificați lățimea intervalului de încredere dorită.  Lățimea unui interval de încredere este o măsură a preciziei unei estimări și este limita superioară minus limita inferioară.\n<br/><br/>\n<b>Raportul dimensiunii eșantionului Grup 2 la Grup 1:</b> Specificați raportul dimensiunii eșantionului grupului 2 la dimensiunea eșantionului grupului 1.  O valoare de 1 înseamnă dimensiuni egale ale eșantionului.\n<br/><br/>\n<b>Diferența medie:</b> Specificați diferența așteptată în mediile grupurilor \n<br/><br/>\n<b>Deviația standard Grup 1:</b> Specificați deviația standard a rezultatului în grupul 1\n<br/><br/>\n<b>Deviația standard Grup 2:</b> Specificați deviația standard a rezultatului în grupul 2\n<br/><br/>\n<b>Nivelul de încredere:</b> Specificați nivelul dorit al intervalului de încredere\n<br/><br/>\n<b>Presupunerea varianței:</b> Specificați dacă varianțele grupurilor sunt presupuse a fi egale sau inegale.  Specificarea varianțelor egale folosește o estimare comună a varianței.\n<br/><br/>\n<b>Pachete R necesare:</b> presize\n\t\t\t"
  }
}