{
  "title": "Dimensiunea eșantionului, precizia unui raport de risc",
  "navigation": "Raport de risc",
  "howtouse": "Specificați fie dimensiunea eșantionului, fie lățimea intervalului de încredere, iar cealaltă va fi calculată",
  "n1": "Dimensiunea eșantionului Grup 1",
  "width": "Lățimea intervalului de încredere",
  "ratio": "Raportul dimensiunii eșantionului Grup 2 la Grup 1",
  "prop1": "Proporția rezultatului Grup 1",
  "prop2": "Proporția rezultatului Grup 2",
  "conflevel": "Nivelul de încredere (0-1)",
  "method": "Metoda intervalului de încredere",
  "help": {
    "title": "Dimensiunea eșantionului, precizia unui raport de risc",
    "r_help": "help(prec_riskratio, package ='presize')",
    "body": "\nAceasta este o evaluare a dimensiunii eșantionului pentru un raport de proporții (raport de risc / risc relativ) bazată pe lățimea intervalului de încredere.  Se calculează dimensiunea eșantionului sau lățimea intervalului de încredere atunci când utilizatorul \nspecificează cealaltă.\n<br/><br/>\n<b>Dimensiunea eșantionului Grup 1:</b> Specificați numărul de subiecți în grupul 1\n<br/><br/>\n<b>Lățimea intervalului de încredere:</b> Specificați lățimea dorită a intervalului de încredere.  Lățimea unui interval de încredere este o măsură a preciziei unei estimări și este limita superioară minus limita inferioară.\n<br/><br/>\n<b>Raportul dimensiunii eșantionului Grup 2 la Grup 1:</b> Specificați raportul dimensiunii eșantionului grupului 2 la dimensiunea eșantionului grupului 1.  O valoare de 1 înseamnă dimensiuni egale ale eșantionului.\n<br/><br/>\n<b>Proporția rezultatului Grup 1:</b> Specificați proporția subiecților din grupul 1 cu rezultatul 'pozitiv'\n<br/><br/>\n<b>Proporția rezultatului Grup 2:</b> Specificați proporția subiecților din grupul 2 cu rezultatul 'pozitiv'\n<br/><br/>\nRețineți că raportul de risc va fi calculat ca proporția din grupul 1 împărțită la proporția din grupul 2.\n<br/><br/>\n<b>Nivelul de încredere:</b> Specificați nivelul dorit al intervalului de încredere\n<br/><br/>\n<b>Metoda intervalului de încredere:</b> Specificați tipul de interval de încredere de utilizat. Koopman (koopman) oferă un interval de încredere bazat pe scor asimptotic care este întotdeauna consistent \ncu testul chi-pătrat al lui Pearson. Este intervalul recomandat (Fagerland et al.). Katz (katz) folosește o transformare logaritmică pentru a calcula intervalul de încredere. CI nu poate \nfi calculat dacă una dintre proporții este zero. Dacă ambele proporții sunt 1, estimarea erorii standard devine zero, rezultând un CI de [1, 1].\n<br/><br/>\n<b>Pachete R necesare:</b> presize\n\t\t\t"
  }
}