{
  "title": "Analiza Componentelor Principale",
  "navigation": "Componentelor Principale",
  "lab40": "NOTĂ: Matricea de corelație sau covarianță este creată automat din variabilele selectate",
  "destination": "Selectați variabilele",
  "label1": "Selectați o matrice de corelație sau covarianță",
  "rd1": "Matricea de corelație",
  "rd2": "Matricea de covarianță",
  "addToDataset": "Adăugați componentele principale la setul de date. Trebuie să specificați un prefix pentru numele variabilelor și numărul de componente de adăugat",
  "variablePrefix": "Introduceți un prefix pentru componentele adăugate la setul de date",
  "noOfComponents": "Introduceți numărul de componente de adăugat la setul de date",
  "screeplot": "Graficul Scree",
  "help": {
    "title": "Analiza Componentelor Principale",
    "r_help": "help(princomp, package ='stats')",
    "body": "\n<b>Descriere</b></br>\nEfectuează o analiză a componentelor principale pe matricea de date numerice date și returnează rezultatele ca un obiect de clasă princomp. Apelează intern princomp în pachetul stats.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nBSkyPCARes <-BSkyPrinCompAnalysis(vars=c(),cor =TRUE, componentsToRetain =0, generateScreeplot=FALSE,prefixForComponents =\"\",dataset=\"\")\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nvars: Variabilele într-un vector de caractere din care se extrag componentele\n</li>\n<li>\ncor: Un boolean care specifică dacă calculul ar trebui să folosească o matrice de corelație sau covarianță\n</li>\n<li>\ncomponentsToRetain: Un numeric care specifică numărul de componente de reținut în setul de date. O nouă variabilă este creată în setul de date pentru fiecare componentă invocată\n</li>\n<li>\n​generateScreeplot: Generează un grafic Scree\n</li>\n<li>\nprefixForComponents: Prefix de utilizat atunci când se salvează componentele într-un set de date\n</li>\n<li>\ndataset: Numele setului de date ca un șir\n</li>\n</ul>\n<b>Valoare</b></br>\nprincomp returnează o listă cu clasa \"princomp\" conținând următoarele componente</br>\nsdev: deviațiile standard ale componentelor principale.</br>\nloadings: matricea de încărcări ale variabilelor (adică, o matrice ale cărei coloane conțin vectorii proprii). Aceasta este de clasă \"loadings\": consultați loadings pentru metoda sa de imprimare.</br>\ncenter: mediile care au fost scăzute.</br>\nscale: scalările aplicate fiecărei variabile.</br>\nn.obs: numărul de observații.</br>\nscores: dacă scores = TRUE, scorurile datelor furnizate pe componentele principale. Acestea sunt non-nule doar dacă x a fost furnizat, și dacă covmat a fost de asemenea furnizat dacă a fost o listă de covarianță. Pentru metoda formulei, napredict() este aplicat pentru a gestiona tratamentul valorilor omise de na.action.</br>\ncall: apelul potrivit.</br>\nna.action: Dacă este relevant.</br>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(princomp, package ='stats')\n"
  }
}