{
    "title": "Test de proporții pentru două eșantioane",
    "navigation": "Două eșantioane (Corectare a continuității)",
    "tvarbox1": "GroupBy, specificați o variabilă de tip factor",
    "response": "Variabilă de răspuns, variabilă de tip factor cu doar 2 nivele",
    "label1": "Ipoteza alternativă",
    "test1": "Media populației != mu",
    "test2": "Media populației > mu",
    "test3": "Media populației < mu",
    "txtbox1": "Nivel de confidență",
    "chkbox1": "Cu corectare a continuității",
    "help": {
        "title": "Test de proporții pentru două eșantioane",
        "r_help": "help(prop.test, package=stats)",
        "body": "\n<b>Descriere</b></br>\nprop.test poate fi utilizat pentru a testa ipoteza nulă că proporțiile (probabilitățile de succes) din mai multe grupuri sunt aceleași sau că sunt egale cu anumite valori date.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: un vector cu numărul de succese, o tabelă unidimensională cu două intrări sau o tabelă bidimensională (sau matrice) cu 2 coloane, care indică numărul de succese și eșecuri, respectiv.\n</li>\n<li>\nn: un vector cu numărul de încercări; este ignorat dacă x este o matrice sau o tabelă.\n</li>\n<li>\np: un vector cu probabilitățile de succes. Lungimea lui p trebuie să fie aceeași cu numărul de grupuri specificat de x și elementele sale trebuie să fie mai mari decât 0 și mai mici decât 1.\n</li>\n<li>\nalternative: un șir de caractere care specifică ipoteza alternativă, trebuie să fie \"two.sided\" (implicit), \"greater\" sau \"less\". Puteți specifica doar prima literă. Este utilizat doar pentru testarea ipotezei nule că o proporție unică este egală cu o anumită valoare, sau că două proporții sunt egale; ignorat în alte cazuri.\n</li>\n<li>\nconf.level: nivelul de confidență al intervalului de confidență returnat. Trebuie să fie o singură valoare între 0 și 1. Este utilizat doar atunci când se testează ipoteza nulă că o proporție unică este egală cu o anumită valoare, sau că două proporții sunt egale; ignorat în alte cazuri.\n</li>\n<li>\ncorrect: un indicator logic care arată dacă corectarea continuității lui Yates ar trebui aplicată acolo unde este posibil.\n</li>\n</ul>\n<b>Detalii</b></br>\nSe utilizează doar grupuri cu numere finite de succese și eșecuri. Numerele de succese și eșecuri trebuie să fie non-negative și, prin urmare, să nu fie mai mari decât numerele corespunzătoare de încercări, care trebuie să fie pozitive. Toate numerele finite ar trebui să fie întregi.</br>\nDacă p este NULL și există mai multe grupuri, ipoteza nulă testată este că proporțiile din fiecare grup sunt aceleași. Dacă există două grupuri, alternativele sunt că probabilitatea de succes în primul grup este mai mică decât, nu egală cu, sau mai mare decât probabilitatea de succes în al doilea grup, așa cum este specificat de alternative. Se returnează un interval de confidență pentru diferența de proporții cu nivelul de confidență specificat de conf.level și limitat la [-1,1]. Corectarea continuității este utilizată doar dacă nu depășește diferența proporțiilor eșantionului în valoare absolută. În caz contrar, dacă există mai mult de 2 grupuri, alternativa este întotdeauna \"two.sided\", intervalul de confidență returnat este NULL și corectarea continuității nu este utilizată niciodată.</br>\nDacă există un singur grup, atunci ipoteza nulă testată este că probabilitatea de succes de bază este p, sau 0.5 dacă p nu este specificat. Alternativa este că probabilitatea de succes este mai mică decât, nu egală cu, sau mai mare decât p sau 0.5, respectiv, așa cum este specificat de alternative. Se returnează un interval de confidență pentru proporția de bază cu nivelul de confidență specificat de conf.level și limitat la [0,1]. Corectarea continuității este utilizată doar dacă nu depășește diferența dintre proporțiile eșantionului și proporția nulă în valoare absolută. Intervalul de confidență este calculat prin inversarea testului de scor.</br>\nÎn cele din urmă, dacă p este specificat și există mai mult de 2 grupuri, ipoteza nulă testată este că probabilitățile de succes de bază sunt cele date de p. Alternativa este întotdeauna \"two.sided\", intervalul de confidență returnat este NULL și corectarea continuității nu este utilizată niciodată.</br>\n<b>Valoare</b><br/>\nO listă cu clasa \"htest\" care conține următoarele componente:</br>\nstatistic: valoarea testului de chi-pătrat al lui Pearson.</br>\nparameter: gradele de libertate ale distribuției chi-pătrat aproximative a statisticii testului.</br>\np.value: p-valoarea testului.</br>\nestimate: un vector cu proporțiile eșantionului x/n.</br>\nconf.int: un interval de confidență pentru proporția reală dacă există un grup, sau pentru diferența proporțiilor dacă există 2 grupuri și p nu este specificat, sau NULL în caz contrar. În cazurile în care nu este NULL, intervalul de confidență returnat are un nivel de confidență asimptotic așa cum este specificat de conf.level și este adecvat pentru ipoteza alternativă specificată.</br>\nnull.value: valoarea lui p dacă este specificată de ipoteza nulă, sau NULL în caz contrar.</br>\nalternative: un șir de caractere care descrie alternativa.</br>\nmethod: un șir de caractere care indică metoda utilizată și dacă corectarea continuității lui Yates a fost aplicată.</br>\ndata.name: un șir de caractere care dă numele datelor.</br>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(prop.test, package ='stats')\n"
    }
}
