{
  "title": "Testul proporției unui singur eșantion",
  "navigation": "Eșantion unic",
  "tvarbox1": "Numeric sau factor cu 2 niveluri/valori doar",
  "label1": "Ipoteza alternativă",
  "test1": "Proporția != Proporția ipotetizată",
  "test2": "Proporția > Proporția ipotetizată",
  "test3": "Proporția < Proporția ipotetizată",
  "txtbox1": "Nivel de încredere",
  "txtbox2": "Ipoteza nulă (Proporția ipotetizată în intervalul 0-1)",
  "chkbox1": "Cu corecție de continuitate",
  "dataInCols": "Unul sau mai multe variabile conțin eșantioane",
  "summarized": "Date rezumate",
  "noOfEvents": "Numărul de evenimente",
  "noOfTrials": "Numărul de încercări",
  "method": "Selectați metoda",
  "help": {
    "title": "Testul proporției unui singur eșantion",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>Descriere</b></br>\nprop.test poate fi utilizat pentru a testa nul că proporțiile (probabilitățile de succes) în mai multe grupuri sunt aceleași sau că acestea sunt egale cu anumite valori date.<br/>\nCând metoda = \"Exact\", un test exact al unei ipoteze nule simple despre probabilitatea de succes într-un experiment Bernoulli.<br/>\nCând metoda =\"Aproximare normală\" distribuția normală este utilizată ca o aproximare pentru distribuția binomială (când dimensiunea eșantionului este suficient de mare)<br/>\n<code> \nBSky_Single_Sample_Proportion_Test = stats::binom.test( x =5, n =20 , alternative='two.sided', p=0.5, conf.level=0.95)\n</code> <br/>\n<code> \nBSky_Single_Sample_Proportion_Test = BSkyNormalApprox( x =6, n =26 , alternative='two.sided', p=0.5, conf.level=0.95)\n</code> <br/>\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: un vector de număr de succese, o tabelă unidimensională cu două intrări sau o tabelă bidimensională (sau matrice) cu 2 coloane, oferind numărul de succese și eșecuri, respectiv.\n</li>\n<li>\nn: un vector de număr de încercări; ignorat dacă x este o matrice sau o tabelă.\n</li>\n<li>\np: un vector de probabilități de succes. Lungimea lui p trebuie să fie aceeași cu numărul de grupuri specificate de x, iar elementele sale trebuie să fie mai mari decât 0 și mai mici decât 1.\n</li>\n<li>\nalternative: un șir de caractere care specifică ipoteza alternativă, trebuie să fie unul dintre \"two.sided\" (implicit), \"greater\" sau \"less\". Puteți specifica doar litera inițială. Utilizat doar pentru a testa nul că o proporție unică este egală cu o valoare dată sau că două proporții sunt egale; ignorat în alt mod.\n</li>\n<li>\nconf.level: nivelul de încredere al intervalului de încredere returnat. Trebuie să fie un singur număr între 0 și 1. Utilizat doar atunci când se testează nul că o proporție unică este egală cu o valoare dată sau că două proporții sunt egale; ignorat în alt mod.\n</li>\n<li>\ncorrect: un logic care indică dacă corecția de continuitate a lui Yates ar trebui aplicată acolo unde este posibil.\n</li>\n</ul>\n<b>Detalii</b></br>\nNumai grupurile cu numere finite de succese și eșecuri sunt utilizate. Numărul de succese și eșecuri trebuie să fie nonnegative și, prin urmare, nu mai mare decât numărul corespunzător de încercări care trebuie să fie pozitive. Toate numerele finite ar trebui să fie întregi.</br>\nDacă p este NULL și există mai mult de un grup, nulul testat este că proporțiile din fiecare grup sunt aceleași. Dacă există două grupuri, alternativele sunt că probabilitatea de succes în primul grup este mai mică, nu egală sau mai mare decât probabilitatea de succes în al doilea grup, așa cum este specificat de alternativă. Un interval de încredere pentru diferența de proporții cu nivelul de încredere specificat de conf.level și tăiat la [-1,1] este returnat. Corecția de continuitate este utilizată doar dacă nu depășește diferența proporțiilor eșantionului în valoare absolută. În caz contrar, dacă există mai mult de 2 grupuri, alternativa este întotdeauna \"two.sided\", intervalul de încredere returnat este NULL, iar corecția de continuitate nu este niciodată utilizată.</br>\nDacă există doar un singur grup, atunci nulul testat este că probabilitatea de succes subiacente este p, sau .5 dacă p nu este dat. Alternativa este că probabilitatea de succes este mai mică, nu egală sau mai mare decât p sau 0.5, respectiv, așa cum este specificat de alternativă. Un interval de încredere pentru proporția subiacente cu nivelul de încredere specificat de conf.level și tăiat la [0,1] este returnat. Corecția de continuitate este utilizată doar dacă nu depășește diferența dintre proporțiile eșantionului și proporțiile nule în valoare absolută. Intervalul de încredere este calculat prin inversarea testului de scor.</br>\nÎn cele din urmă, dacă p este dat și există mai mult de 2 grupuri, nulul testat este că probabilitățile subiacente de succes sunt cele date de p. Alternativa este întotdeauna \"two.sided\", intervalul de încredere returnat este NULL, iar corecția de continuitate nu este niciodată utilizată.</br>\n<b>Valoare</b><br/>\nO listă cu clasa \"htest\" conținând următoarele componente:</br>\nstatistică: valoarea statisticii testului chi-pătrat a lui Pearson.</br>\nparametru: gradele de libertate ale distribuției chi-pătrat aproximative a statisticii testului.</br>\np.value: valoarea p a testului.</br>\nestimate: un vector cu proporțiile eșantionului x/n.</br>\nconf.int: un interval de încredere pentru proporția adevărată dacă există un grup, sau pentru diferența de proporții dacă există 2 grupuri și p nu este dat, sau NULL în alt mod. În cazurile în care nu este NULL, intervalul de încredere returnat are un nivel de încredere asimptotic specificat de conf.level și este adecvat pentru ipoteza alternativă specificată.</br>\nnull.value: valoarea p dacă este specificată de nul, sau NULL în alt mod.</br>\nalternative: un șir de caractere care descrie alternativa.</br>\nmetodă: un șir de caractere care indică metoda utilizată și dacă corecția de continuitate a lui Yates a fost aplicată.</br>\ndata.name: un șir de caractere care oferă numele datelor.</br>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(prop.test, package ='stats')\n"
  }
}