{
  "label1": "Pentru a compara pantele modelului de regresie cuantile, consultați \"Evaluarea modelului > Comparare > Modele de regresie cuantile\"",
  "title": "Regresie Cuantile",
  "navigation": "Cuantile",
  "modelname": "Introduceți numele modelului",
  "depvarlabel": "Variabila Dependentă",
  "quantilelabel": "Cuantile (0-1)",
  "estgrplabel": "Metoda de Estimare",
  "brlabel": "Barrodale și Roberts",
  "fnlabel": "Frisch-Newton",
  "pfnlabel": "Frisch-Newton, preprocesare",
  "sfnlabel": "Frisch-Newton, rar",
  "stderrgrplabel": "Metoda Erorii Standard",
  "ranklabel": "Rang",
  "iidlabel": "IID",
  "nidlabel": "NID",
  "kernallabel": "Kernal",
  "bootstraplabel": "Bootstrap",
  "bootsamplabel": "Probe Bootstrap",
  "help": {
    "title": "Regresie Cuantile",
    "r_help": "help(rq, package = 'quantreg')",
    "body": "\nAcesta se potrivește unui model de regresie cuantile, care modelează un cuantile dorit (adică percentil) al variabilei de rezultat. Un cuantile tipic de modelat este 0.5, adică mediana.  \nUn rezumat al modelului și estimările parametrilor cu intervale de încredere de 95% sunt furnizate.\n<br/><br/>\n<b>Introduceți Numele Modelului:</b>  numele dorit al modelului\n<br/><br/>\n<b>Variabila Dependentă:</b>  Specificați variabila dependentă pentru model. Cuantilele dorite ale acestei variabile vor fi modelate. Aceasta trebuie să fie numerică.\n<br/><br/>\n<b>Constructor de Formule:</b>  Specificați termenii modelului folosind notația formulei. Variabilele numerice, factor, factor ordonat și caracter sunt permise. Variabilele de caracter vor fi transformate în factori.\n<br/><br/>\n<b>Cuantile (0-1):</b>  Specificați cuantilele dorite de modelat pentru variabila dependentă. 0.5 (mediana) este implicit și este o cantitate tipică.\n<br/><br/>\n<b>Metoda de Estimare:</b>  Specificați metoda de estimare pentru parametrii modelului. Metoda Barrodale și Roberts este implicită și este eficientă pentru modelele cu \nmai multe mii de observații. Metoda Frisch-Newton și abordarea Frisch-Newton, preprocesare ar putea fi avantajoase pentru probleme mari și foarte mari, respectiv, \nîn special în cazurile cu un număr mic de parametri estimați. Pentru dimensiuni mari ale eșantionului cu un număr mare de parametri, metoda Frisch-Newton, rar poate fi necesară.  \nConsultați referințele din Ajutorul R pentru detalii.\n<br/><br/>\n<b>Metoda Erorii Standard:</b>  Specificați metoda utilizată pentru a estima erorile standard și intervalele de încredere. Metoda Rang oferă intervale de încredere doar, poate fi lentă \nîn execuție pentru dimensiuni mari ale eșantionului (n > 1000) și se bazează pe inversarea unui test de rang. Metoda IID presupune că erorile sunt independente și identic distribuite (iid). Metoda NID \npresupune linearitate locală în cuantile și calculează o estimare sandwich folosind o estimare locală a rarității. Metoda Kernal folosește o estimare kernal a sandwich-ului.  \nMetoda Bootstrap folosește o abordare de re-eșantionare bootstrap pentru a estima erorile standard. Consultați referințele din Ajutorul R pentru detalii.\n<br/><br/>\n<b>Probe Bootstrap:</b>  Numărul dorit de probe bootstrap pentru abordarea erorii standard bootstrap. Implicit este 2000 de probe.\n<br/><br/>\n<b>Pachete R Necesare:</b> quantreg, broom\n\t\t"
  }
}