{
  "title": "Analiza Fiabilității (Alpha Cronbach)",
  "navigation": "Alpha Cronbach",
  "tvarbox1": "Toate elementele",
  "tvarbox2": "Introduceți elementele de mai sus care sunt invers scorate",
  "help": {
    "title": "Alpha Cronbach",
    "r_help": "help(alpha, package=psych)",
    "body": "\n            <b>Statistica fiabilității vă oferă​</b></br>\n•\tAlpha Cronbach: Alpha Cronbach’s α (valorile ≥ .7 sau .8 indică o bună fiabilitate; Kline (1999))​<br/>\n•\tstd.alpha: Alpha standardizat bazat pe corelații​<br/>\n•\tLambda 6 Guttman (calculat din corelația multiplă pătrată sau ‘smc’)​​<br/>\n•\taverage_r: corelația medie între elemente (aceasta este folosită pentru a calcula std.alpha)​​<br/>\n•\tmean: media scalei (media mediilor tuturor indivizilor)​​<br/>\n•\tsd: deviația standard a scalei​​<br/></br>\n<b>Interpretarea fiabilității dacă un element este eliminat​</b></br>\n•\tSe referă la alpha Cronbach general atunci când acel element particular (din rând) a fost eliminat/șters</br>\n•\tCând valorile brute ale alpha Cronbach din orice rând sunt mai mari decât alpha general în tabelul de statistici de fiabilitate de mai sus, aceasta înseamnă că eliminarea acelui element particular din rând va crește alpha Cronbach general al scalei.​</br>\n•\tCelelalte coloane ale acestui tabel se referă la modul în care celelalte statistici se vor schimba dacă acel element particular a fost eliminat/șters.​</br>\n<b>Cum să interpretăm ‘Statistica elementului’?​</b></br>\n•\traw.r: Corelația fiecărui element cu scorul total, fără corectare pentru suprapunerea elementelor.​</br>\n•\tr.drop: corelația element-total fără acel element în sine (adică, corelația element-rest sau corelația corectată element-total); corelațiile scăzute element-total indică faptul că elementul nu corelează bine cu scala în ansamblu​</br>\n•\tr.cor: corelația element-total corectată pentru suprapunerea elementelor și fiabilitatea scalei​</br>\n•\tmean și sd: media și sd a scalei dacă acel element este eliminat​</br>\n•\tToate elementele ar trebui să coreleze cu scorul total, așa că căutăm elemente care nu corelează cu scorul general al scalei. Dacă valorile r.drop sunt mai mici de aproximativ .3, înseamnă că acel element particular nu corelează foarte bine cu scala în ansamblu.​</br>​</br>\n<b>Cum să interpretăm tabelul final de frecvență?​​</b></br>\n•\tAcest tabel ne spune ce procent din oameni au dat fiecare răspuns la fiecare dintre elemente (adică, dacă aveți o scală de 5 puncte, atunci vă spune câte procente din răspunsuri au fost 1, 2, 3, 4 sau 5).​</br>\n•\tAcest lucru vă ajută să verificați distribuția răspunsurilor și dacă toată lumea dă aceleași răspunsuri (ceea ce va duce la o fiabilitate scăzută).​</br>\nDacă scala dvs. conține elemente care sunt invers scorate, trebuie să le specificați. Argumentul keys vă permite să faceți acest lucru.</br> </br> \n\n<b>Descriere</b></br>\nGăsiți două estimări ale fiabilității: alpha Cronbach și Lambda 6 Guttman.​\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nalpha(x, keys=NULL,cumulative=FALSE, title=NULL, max=10,na.rm = TRUE,​\n   check.keys=FALSE,n.iter=1,delete=TRUE,use=\"pairwise\",warnings=TRUE,n.obs=NULL)​\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx​: Un data.frame sau matrice de date, sau o matrice de covarianță sau corelație​\n</li>\n<li>\nkeys​: Dacă unele elemente trebuie să fie invers scorate, atunci fie specificați direcția tuturor elementelor, fie doar un vector al elementelor care trebuie invers scorate​\n</li>\n<li>\ntitle​: Orice șir de text pentru a identifica această rulare​\n</li>\n<li>\ncumulative​: ar trebui ca mediile să reflecte suma elementelor sau media elementelor. Valoarea implicită este mediile.​\n</li>\n<li>\nmax​: numărul de categorii/elemente de luat în considerare dacă se raportează frecvențele categoriilor. Implicit 10, trecut la link{response.frequencies}​\n</li>\n<li>\nna.rm​: Valoarea implicită este de a elimina valorile lipsă și de a găsi corelații pairwise​\n</li>\n<li>\ncheck.keys​: dacă este TRUE, atunci găsiți primul component principal și inversați elementele cu încărcări negative. Oferiți un avertisment dacă acest lucru se întâmplă.​\n</li>\n<li>\nn.iter​: Numărul de iterații dacă sunt dorite intervale de încredere bootstrap​\n</li>\n<li>\ndelete​: Ștergeți elementele fără variație și emiteți un avertisment​\n</li>\n<li>\nuse​: Opțiuni de trecut la funcția cor: \"everything\", \"all.obs\", \"complete.obs\", \"na.or.complete\", sau \"pairwise.complete.obs\". Valoarea implicită este \"pairwise\"​\n</li>\n<li>\nwarnings​: Implicit, printați un avertisment și un mesaj că elementele au fost inversate. Suprimați mesajul dacă warnings = FALSE​\n</li>\n<li>\nn.obs​: Dacă folosiți matrice de corelație ca intrare, specificând numărul de observații, putem găsi intervale de încredere​\n</li>\n</ul>\n<b>Detalii</b></br>\nAlpha este una dintre mai multe estimări ale fiabilității consistenței interne a unui test.​​</br>\n<b>Valoare</b><br/>\ntotal​: o listă care conține​​</br>\nraw_alpha​: alpha bazat pe covarianțe​​</br>\nstd.alpha​: Alpha standardizat bazat pe corelații​​</br>\nG6(smc)​: Fiabilitatea Lambda 6 Guttman​</br>\naverage_r​: Corelația medie între elemente​​</br>\nmean​: Pentru matricele de date, media scalei formate prin sumarea elementelor​​</br>\nsd​: Pentru matricele de date, deviația standard a scorului total​​</br>\nalpha.drop​: Un data frame cu toate cele de mai sus pentru cazul fiecărui element fiind eliminat unul câte unul.​​</br>\nitem.stats​: Un data frame care include​​</br>\nn​: numărul de cazuri complete pentru element​​</br>\nraw.r​: Corelația fiecărui element cu scorul total, fără corectare pentru suprapunerea elementelor.​​</br>\nstd.r​: Corelația fiecărui element cu scorul total (fără corectare pentru suprapunerea elementelor) dacă elementele au fost toate standardizate​​</br>\nr.cor​: Corelația totală a elementului corectată pentru suprapunerea elementelor și fiabilitatea scalei​​</br>\nr.drop​: Corelația totală a elementului pentru acest element în raport cu scala fără acest element​​</br>\nmean​: pentru matricele de date, media fiecărui element​​</br>\nsd​: Pentru matricele de date, deviația standard a fiecărui element​​</br>\nresponse.freq​: Pentru matricele de date, frecvența fiecărui răspuns al elementului (dacă este mai mic de 20)​​</br>\nboot​: o matrice de 6 coloane de valori resample bootstrap​​</br>\nUnidim​: Un index al unidimensionalității​​</br>\nFit​: Ajustarea matricei diagonale​​</br>\n<b>Pachet</b></br>\npsych</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă help(alpha, package=psych) creând un chunk de cod R făcând clic pe + în fereastra de ieșire\n\n\t\t\t"
  }
}