{
  "helpText": "Analiza ANOVA cu măsuri repetate necesită ca datele să fie în format lung. Dacă datele tale nu sunt în format lung, vezi Seturi de date > ReShape > Mai lung",
  "modelname": "Introduceți numele modelului",
  "title": "Analiza ANOVA cu măsuri repetate",
  "subjectID": "Variabila de utilizat ca identificator al subiectului",
  "dependentVariable": "Variabila dependentă",
  "navigation": "ANOVA, Măsuri Repetate, Lung",
  "response": "Variabilă(variabile) în cadrul subiectului, de exemplu, Timp",
  "Fixed": "Factor(e) între subiecți",
  "covariates": "Covariate",
  "Summary": "Medii marginale estimate",
  "Scatter_plot": "Posthocs",
  "Residual": "Grafic rezidual vs. ajustat",
  "Histogram": "Grafic histogramă a rezidualelor",
  "brownForsythe": "Testul Brown-Forsythe",
  "levenesTest": "Testul Levene",
  "plotMeansCI": "Grafic al mediilor și intervalelor de încredere",
  "simpleEffectsTest": "Testul efectelor simple",
  "label2": "Opțiuni pentru posthocs și testul efectelor simple",
  "combon": "Compară mediile folosind:",
  "adjust": "Metodă pentru ajustarea valorilor p",
  "displayBoxMDetails": "Afișează detalii asociate cu testul Box's M (Notă: Rezultatele testului Box's M sunt întotdeauna afișate)",
  "help": {
    "title": "Analiza ANOVA cu măsuri repetate",
    "r_help": "help(aov_ez , package='afex')",
    "body": "\n<b>Descriere</b></br>\nCu analiza ANOVA cu măsuri repetate, statisticile F sunt calculate pentru fiecare factor în cadrul subiecților, factorul între subiecți și termenul de interacțiune pentru ANOVA mixtă</br>\nCaută tabelele suplimentare de valori ANOVA în ieșire care afișează MSE (media pătrată a erorii) și pes (eta pătrată parțială)</br>\nÎn prezent, susținem un singur factor în cadrul subiecților și un factor între subiecți, factorul între subiecți este opțional.</br>\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"variabilaDependenta\", \n\tid = \"Identificator\", within = c(\"Timp\"), \tbetween = c(\"Tratament\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndata: Un data.frame care conține datele. Obligatoriu\n</li>\n<li>\ndv: vector de caractere (de lungime 1) care indică coloana care conține variabila dependentă în date.\n</li>\n<li>\nbetween: vector de caractere care indică factor(e) între subiecți/coloane în date. Implicit este NULL, indicând că nu există factori între subiecți.\n</li>\n<li>\nwithin: vector de caractere care indică factor(e) în cadrul subiecților (sau măsuri repetate)/coloane în date. Implicit este NULL, indicând că nu există factori în cadrul subiecților.\n</li>\n<li>\ncovariate: vector de caractere care indică covariatele între subiecți (adică, coloane) în date. Implicit este NULL, indicând că nu există covariate. Te rugăm să reții că factorize trebuie să fie setat pe FALSE în cazul în care covariata este numerică și ar trebui tratată ca atare.\n</li>\n<li>\nanovatable: listă de argumente suplimentare transmise funcției care produce tabela ANOVA. \n</li>\n</ul>\n<br/>\n<b>Detalii</b></br>\nVezi ajutorul detaliat R</br>\n<b>Valoare</b><br/>\naov_car, aov_4 și aov_ez sunt wrapper-e pentru Anova și aov, valoarea returnată depinde de argumentul return. Implicit, un obiect S3 de clasă \"afex_aov\" este returnat conținând următoarele sloturi:<br/>\n\"anova_table\": O tabelă ANOVA de clasă c(\"anova\", \"data.frame\").<br/>\n\"aov\": obiect aov returnat din aov (nu ar trebui utilizat pentru a evalua semnificația efectelor, dar poate fi transmis la emmeans pentru teste post-hoc).<br/>\n\"Anova\": obiect returnat din Anova, un obiect de clasă \"Anova.mlm\" (dacă sunt prezente factori în cadrul subiecților) sau de clasă c(\"anova\", \"data.frame\").<br/>\n\"lm\": obiectul ajustat cu lm și transmis la Anova (adică, un obiect de clasă \"lm\" sau \"mlm\"). De asemenea, returnat dacă return = \"lm\".<br/>\n\"data\": o listă care conține: (1) lung (datele posibil agregate în format lung utilizate pentru aov), lat (datele utilizate pentru a ajusta obiectul lm), și idata (dacă sunt prezente factori în cadrul subiecților, argumentul idata transmis la car::Anova). De asemenea, returnat dacă return = \"data\".<br/>\n<b>Pachet</b></br>\nafex</br>\n<b>Ajutor</b></br>\nhelp(aov_ez, package ='afex')\nApasă pe butonul Ajutor R pentru a obține ajutor detaliat R. Poți de asemenea să introduci help(aov_ez, package ='afex') și să apeși CTRL Enter în editorul de sintaxă R pentru a obține ajutor\n    "
  }
}