{
  "title": "Reshape, wide to long",
  "label2": "Alege variabilele pe care să le reshapezi sau, alternativ, alege variabilele pe care să nu le reshapezi. În acest din urmă caz, toate variabilele rămase vor fi reshape-uite în coloane.",
  "navigation": "Mai lung",
  "label0": "Poți alege să salvezi rezultatele într-un nou set de date sau să suprascrii setul de date existent",
  "label1": "Opțiuni",
  "advanced": "Avansat",
  "New": "Salvează rezultatele într-un nou set de date",
  "newdatasetname": "Introdu un nume pentru setul de date",
  "Existing": "Suprascrie setul de date existent",
  "label12": "Introdu numele variabilelor pentru noile variabile de factor repetat",
  "repeatedMeasure": "NOTĂ: Când specifici mai multe nume de variabile care stochează factori repetati, separă-le prin virgulă, de exemplu, Lună, Zi. Trebuie, de asemenea, să dai clic pe avansat pentru a specifica cum se creează numele variabilelor.",
  "repeatedValue": "Numele variabilei pentru valoarea repetată, de exemplu, Număr",
  "labelChoice": "Selectează una dintre opțiunile de mai jos",
  "subsetvars": "Opțiunea 1: Selectează variabilele care să fie reshape-uite într-una sau mai multe variabile",
  "names_sep": "Opțiunea 2: Specifică un caracter sau o expresie regulată pentru a împărți numele coloanelor pentru a crea valori pentru numele variabilelor. Acceptă aceeași specificație ca separate(), și poate fi fie un vector numeric (specificând pozițiile de întrerupere), fie un singur șir (specificând o expresie regulată pentru a împărți)",
  "names_pattern": "Opțiunea 1: O expresie regulată care conține grupuri de potrivire (()). Partea care se potrivește a expresiei regulate între () va fi folosită pentru a crea numele variabilelor.",
  "dontReshape": "Opțiunea 2: Selectează variabilele care să nu fie reshape-uite (toate variabilele rămase vor fi reshape-uite în coloane)",
  "removeNA": "Elimină rândurile în care valoarea repetată este NA.",
  "makeString": "Transformă factorul repetat într-un tip de șir R în loc de un factor",
  "label3": "Dacă există mai multe variabile noi create pentru factorii repetati, opțiunile de mai jos controlează cum se descompun numele coloanelor. Selectează una dintre cele 2 opțiuni de mai jos.",
  "help": {
    "title": "Reshape (wide to long)",
    "r_help": "help(pivot_longer, package=tidyr)",
    "body": "\n<b>Descriere</b></br>\nVezi videoclipul la <a href=\" https://youtu.be/ypLXqmFp3jY\">Reshape wide to long</a></br>\nTransformă un set de date larg într-un set de date lung prin conversia coloanelor în perechi cheie-valoare\nPivot_longer ia mai multe coloane și le colapsează în perechi cheie-valoare, duplicând toate celelalte coloane după cum este necesar. Folosești pivot_longer() când observi că ai coloane care nu sunt variabile.</br>\nScrie în vignette(\"pivot\") în editorul R pentru a vedea ajutorul R. Dacă există mai multe coloane de creat, trebuie să specifici argumente pentru a specifica cum sunt construite numele coloanelor.</br>\nÎn acest caz, dă clic pe avansat pentru a introduce o expresie regulată care specifică cum ar trebui să fie create variabilele din numele coloanelor.</br>\nNOTĂ: Când specifici mai multe variabile pentru factorii repetati, separă-le prin ,\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \npivot_longer( cols=c(col1, col2...),names_to=\"key\",values_to=\"value\",values_drop_na = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ncols: Coloanele care să fie pivotate în format mai lung.\n</li>\n<li>\nvalues_to: Un șir care specifică numele coloanei care să fie creat din datele stocate în valorile celulelor. Dacă names_to este un caracter care conține sentinelul special .value, această valoare va fi ignorată, iar numele coloanei de valoare va fi derivat dintr-o parte a numelui coloanelor existente. Dacă este gol, toate variabilele sunt selectate, exclude o variabilă y cu -y. Când excludi variabile, toate variabilele rămase sunt pivotate în lungime.\n</li>\n<li>\nvalues_drop_na: Dacă este TRUE, va elimina rândurile care conțin doar NAs în coloana value_to. Aceasta transformă efectiv valorile lipsă explicite în valori lipsă implicite și ar trebui, în general, să fie folosită doar atunci când valorile lipsă din date au fost create de structura sa.\n</li>\n<li>\nnames_sep: acceptă aceeași specificație ca separate(), și poate fi fie un vector numeric (specificând pozițiile de întrerupere), fie un singur șir (specificând o expresie regulată pentru a împărți).</br>\nSă spunem că coloanele sunt Height_1_1, Height_1_2, Weight_1_1, Weight_1_2, Sagur_1_1, Sagur_2_1 unde primul număr este luna și al doilea săptămâna, specificând _ ca separator va rezulta în 3 variabile create, prima variabilă cu valori Height, Weight, Sagur, a doua cu valori 1 și 2, iar a treia cu valori 1 și 2.</br>\nScrie help(regex) în editorul de cod R pentru mai multe detalii\n</li>\n<li>\nnames_pattern: acceptă aceeași specificație ca extract(), o expresie regulată care conține grupuri de potrivire (()).\nacceptă aceeași specificație ca separate(), și poate fi fie un vector numeric (specificând pozițiile de întrerupere), fie un singur șir (specificând o expresie regulată pentru a împărți).</br>\nSă spunem că coloanele sunt Height_33.1_1, Height_44.1_2, Weight_66.1_1, Weight_55.1_2, unde cele 2 cifre după primul underscore trebuie ignorate, cifra după . este luna și cifra după ultimul _ este săptămâna.</br>\nExpresiile regulate care extrag valorile noilor variabile trebuie să fie în (). Expresia regulată va fi (.*)_.*.(.*)_(.)</br> \nNotă: . într-o expresie regulată înseamnă orice caracter</br> \n* înseamnă 0 sau mai multe, așa că .* înseamnă 0 sau mai multe caractere</br> \nAșadar, șirul poate fi interpretat ca căutând un model de</br> \n(.*) 0 sau mai multe caractere urmate de</br> \n _ un underscore urmat de</br> \n .*. unul sau mai multe caractere urmate de . (escapând . cu un  indicând că este caracterul în sine urmat de</br> \n.* unul sau mai multe caractere urmate de</br> \n_ underscore urmat de</br> \n. un singur caracter</br> \nToate modelele dintre () formează valorile fiecărei dintre cele 3 noi variabile de factor</br> \n</li>\n</ul>\n<b>Valoare</b><br/>\nReturnează setul de date reshape-uit\n<br/>\n<b>Pachet</b></br>\ntidyr</br>\n<b>Ajutor</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
  }
}