{
    "title": "Probabilitățile de supraviețuire parametrică prezise",
    "label100": "Această fereastră de dialog oferă probabilitatea de supraviețuire prezisă la una sau mai multe momente specificate.\nTrebuie respectate următoarele cerințe:\n1. Trebuie să fiți construit un model de regresie parametrică flexsurvreg pe un set de date în care valoarea 1 sau mai mare = eveniment, iar 0 sau mai mică = cenzură.\n2. Setul de date pentru care doriți să generați preziceri trebuie să conțină toate variabilele independente utilizate pentru a crea modelul original.\n3. Scara de timp utilizată pentru timp trebuie să corespundă cu scara de timp utilizată pentru crearea modelului original.\n4. Dacă doriți preziceri pentru o singură observație, trebuie să creați un nou set de date cu acea observație.",
    "navigation": "Scorare parametrică a supraviețuirii",
    "filterModels": "Filtrați modelele după clasă",
    "modelSelection": "Selectați un model pentru a evalua un set de date",
    "label1": "Teste de diagnostic",
    "followUpTime": "Specificați unul sau mai multe momente, de exemplu, 200, 1200, 1250. Vor fi generate probabilități de supraviețuire și eșec prezise pentru fiecare moment.",
    "levelOfInterest": "Când variabila de prezis are 2 niveluri, specificați nivelul de interes. Matricea de confuzie și statisticile asociate sunt afișate cu nivelul de interes specificat ca referință.",
    "label12": "Rezultatele testelor: De îndată ce un model este selectat, vom efectua teste pentru a vedea dacă variabilele dependente specificate în model sunt disponibile în setul de date care urmează să fie evaluat. Rezultatele vor fi afișate aici.",
    "label2": "Salvați probabilitățile de supraviețuire și eșec.",
    "label3": "Probabilitățile prezise sunt salvate ca noi variabile (cu prefix specificat, dacă este cazul)",
    "label4": "**Pentru variabile dependente cu 2 niveluri, al doilea nivel este tratat ca nivel pozitiv. Consultați Date > Niveluri de factor > Reordonare manuală a nivelurilor pentru a schimba ordinea nivelurilor de factor și pentru a reconstrui modelul.",
    "conflevel": "Salvați intervalele de încredere pentru valorile prezise individual **(Valabil doar pentru modelele liniare (clasa lm))",
    "roctable": "Afișați tabela ROC (**Doar pentru variabile dependente binare)",
    "colname": "Specificați prefixul numelui coloanei",
    "label5": "**Bifarea casetei de mai sus va duce la o penalizare a performanței pentru seturi de date mari.",
    "level": "Specificați nivelul de încredere",
    "confusioncheck": "Generați matricea de confuzie",
    "help": {
        "title": "Scorarea unui set de date utilizând un model flexsurvreg (parametric de supraviețuire)",
        "r_help": "help(flexsurvreg, package = 'flexsurv')",
        "body": "\n    CÂND SUNT SPECIFICATE MAI MULTE PERIOADE DE TIMP, O MATRICE DE CONFUZIE ȘI O CURBĂ ROC SUNT GENERATE DOAR PENTRU PRIMA PERIOADĂ DE TIMP\n    <b>Descriere</b></br>\n    Scorarea modelului efectuează următoarele:</br>\n    1. Scorarea setului de date curent utilizând modelul pre-construit selectat. Salvează predicțiile cu intervalul de încredere specificat în setul de date curent, utilizând prefixul specificat.</br>\n    2. Opțional, creează o matrice de confuzie și o curbă ROC.</br>\n    3. În cazul în care evaluați un set de date de antrenament care conține variabila dependentă/variabila de prezis și variabila dependentă are 2 niveluri, aveți opțiunea de a selecta nivelul de referință/nivelul de interes. <br/>\n    4. Matricea de confuzie și statisticile asociate sunt create utilizând nivelul de interes specificat.<br/>\n    Consultați detaliile despre funcția predict și matricea de confuzie mai jos.\n    <br/>\n    <br/>\n    <b>Descriere</b></br>\n    predict este o funcție generică pentru a face predicții utilizând modelul selectat.\n    <br/>\n    <b>Utilizare</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argumente</b><br/>\n    <ul>\n    <li>\n    modelname: un obiect de model pentru care se dorește prezicerea.\n    </li>\n    <li>\n    prefix: un șir de caractere prefix care va fi utilizat pentru a crea noi variabile care conțin predicțiile.\n    </li>\n    <li>\n    datasetname: este setul de date curent pentru a evalua și salva predicțiile.\n    </li>\n    </ul>\n    <b>Detalii</b></br>\n    Salvează predicțiile cu intervalul de încredere specificat în setul de date curent, utilizând prefixul specificat.</br>\n    <b>Pachet</b></br>\n    stats</br>\n    <b>Ajutor</b></br>\n    Pentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestei feronaterii de dialog sau rulați următoarea comandă: help(predict, package ='stats') în fereastra editorului R.\n    </br>\n    </br>\n    <b>Descriere</b></br>\n    Creează o matrice de confuzie prin cros-tabularea claselor observate și prezise, cu statistici asociate.\n    <br/>\n    <b>Utilizare</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argumente</b><br/>\n    <ul>\n    <li>\n    modelname: un obiect de model pentru care se dorește matricea de confuzie.\n    </li>\n    <li>\n    showCofusionMatrix: logic, dacă este TRUE matricea de confuzie este generată (dacă se aplică), dacă este FALSE, matricea de confuzie nu este generată.\n    </li>\n    <li>\n    predictions: un obiect returnat ca rezultat al apelului predict().\n    </li>\n    <li>\n    datasetname: este numele setului de date curent pe care dorim să îl folosim pentru a face preziceri.\n    </li>\n    </ul>\n    <b>Detalii</b></br>\n    Afișează matricea de confuzie utilizând funcția confusionMatrix din pachetul caret.</br>\n    <b>Pachet</b></br>\n    caret</br>\n    <b>Ajutor</b></br>\n    Pentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestei feronaterii de dialog sau rulați următoarea comandă: help(confusionMatrix, package ='caret') în fereastra editorului R."
    }
}
