{
  "title": "SEM",
  "residualCovHeatmap": "Hartă de căldură a deviației între matricele de covarianță observate și cele implicate de model",
  "observedCorr": "Corelații observate",
  "modelImpliedCorr": "Corelații implicate de model",
  "residualCorr": "Deviația între corelațiile observate și cele ajustate",
  "residualCorrHeatmap": "Hartă de căldură a deviației între matricele de corelații observate și cele implicate de model",
  "intercepts1": "Intercepturile variabilelor observate",
  "intercepts": "Afișează intercepturile",
  "means": "Intercepturile/mediile variabilelor latente",
  "residuals1": "Varianțele reziduale ale variabilelor observate",
  "residual_covariances": "Covarianțele reziduale ale variabilelor observate",
  "lv_variances": "Varianțele (reziduale) ale variabilelor latente",
  "lv_covariances": "Covarianțele (reziduale) ale variabilelor latente",
  "regressions": "Toate coeficientele de regresie din model",
  "loadings": "Încărcăturile variabilelor observate pe variabilele lor latente respective",
  "secOrdFacOptvar" : "Factori de ordin secundar",
  "EqConstraintsOptvar" : "Constrângeri de egalitate",  
  "mediationOptvar" : "Mediere",  
  "multiGrpOptions": "Opțiuni pentru grupuri multiple",
  "multiGrpSrc": "Variabile sursă",
  "multiGrpDependent": "Variabile de grupare",
  "modelname": "Introduceți un nume pentru model",
  "mediationSrcCtrl": "Relații sursă",
  "mediationDestCtrl": "Parametrii de mediere",
  "navigation": "SEM",
  "modelTermsDst": "Relație",
  "modelTerms": "Predictor",
  "modelTerms1": "Rezultat",
  "sem": "Variabile latente",
  "sem_model_terms": "Parametrii structurali",
  "semSuppCtrl": "Factori de ordinul întâi",
  "sem2": "Factori de ordinul al doilea",
  "label1": "Selectați un element din listele predictor și rezultat și faceți clic pe butonul cu o săgeată pentru a muta elementele selectate în lista de relații",
  "label2": "Selectați un element din listele predictor și rezultat și faceți clic pe butonul cu o săgeată pentru a muta elementele selectate în lista de relații",
  "label3": "Informații",
  "label4": "Ieșiri suplimentare",
  "label5": "Covarianțe și corelații (vezi ajutor)",
  "label6": "R-pătrat",
  "label7": "Salvați previziunile",
  "label9": "Constrângeri",
  "coVarTerms": "1st variabilă/factor",
  "coVarTerms1": "2nd variabilă/factor",
  "coVarDst": "Covarianțe selectate",
  "optionsCoVarTerms": "Covarianțe",
  "parameterizeFormula": "Afișează etichetele parametrilor",
  "modelOptions": "Opțiuni pentru model",
  "method": "Selectați o metodă și o abordare (dacă este cazul)",
  "approach": "Abordare ML de maximă verosimilitate",
  "missing": "Valori lipsă",
  "addFitMeasures": "Măsuri suplimentare de ajustare",
  "mardiaSkew": "Asimetria Mardia (Numai cazuri complete)",
  "mardiaKurt": "Kurtosis Mardia (Numai cazuri complete)",
  "observed": "Covarianțe observate",
  "modelImplied": "Covarianțe implicate de model (ajustate)",
  "residual": "Deviația între covarianțele observate și cele ajustate",
  "r2squareNone": "Niciuna",
  "r2squareEndo": "Endogenă",
  "factorScores": "Scoruri de factori (variabile salvate cu prefixul FS)",
  "indicators": "Indicatori (variabile salvate cu prefixul I)",
  "dependentVars": "Variabile dependente (variabile salvate cu prefixul DV)",
  "label8": "Indici de modificare",
  "modIndices": "Indici de modificare",
  "highLowIndices": "Ascunde indici scăzuți",
  "threshold": "Prag",
  "residuals": "Afișează reziduurile",
  "includeThresholds": "Afișează pragurile",
  "edgeLabels": "Selectați opțiuni pentru etichetele marginilor",
  "layout": "Opțiuni pentru modul în care ar trebui să fie plasate nodurile",
  "rotate": "Poziția variabilelor exogene atunci când se folosește layout-ul arbore sau arbore2",
  "abbNodeLabels": "Numărul de caractere pentru a abrevia etichetele nodurilor",
  "abbEdgeLabels": "Numărul de caractere pentru a abrevia etichetele marginilor",
  "label101": "Cărări",
  "label102": "Layout",
  "label103": "Noduri",
  "semPlotOptions": "Opțiuni pentru grafic",
  "parameterOptions": "Opțiuni pentru parametru",
  "manifestShapes": "Forme manifeste",
  "latentShapes": "Forme latente",
  "outputOptions": "Opțiuni pentru ieșire",
  "label104": "Soluții standardizate",
  "stdall": "Estimările standardizate se bazează pe varianțele atât ale variabilelor observate (continue), cât și ale celor latente",
  "stdlv": "Estimările standardizate se bazează pe varianțele variabilelor latente (continue) doar",
  "stdnox": "Estimările standardizate se bazează pe varianțele atât ale variabilelor observate (continue), cât și ale celor latente, dar nu pe varianțele covariatelor exogene",
  "label105": "Erori standard",
  "label106": "Setări bootstrap",
  "automatic": "Automat",
  "standard": "Standard",
  "robust": "Robust",
  "pseudoML": "Pseudo ML",
  "bootstrap": "Bootstrap",
  "percentiles": "Percentile",
  "normal": "Normal",
  "adjustedBiasCorrected": "Corectat pentru bias ajustat",
  "basic": "de bază",
  "bootstratRep": "Repetiții bootstrap",
  "autoComputeCovar": "Calculați automat covarianțele",
  "equalityConstraints1": "Relații",
  "sem3": "Constrângeri de egalitate",
  "help": {
    "title": "SEM",
    "r_help": "ajutor(sem, pachet=lavaan)",
    "body": "\n<b>Descriere</b></br>\nModelarea Ecuațiilor Structurale (SEM) utilizează estimarea pachetului lavaan (0.6.16) și lucrează cu formularea tradițională LISREL sem (mai degrabă decât formulările Bentler-Weeks, RAMpath sau LISCOMP). Estimarea se bazează pe verosimilitatea maximă și folosește NLMINB (quasi-Newton) folosind abordarea normală de verosimilitate (mai degrabă decât metoda de verosimilitate Wishart). Erorile standard se bazează pe matricele de informații așteptate (mai degrabă decât observate), dar informațiile observate, așteptate și deviațiile pot fi examinate folosind hărți de căldură. Screening-ul normalității (adică asimetria și kurtosis Mardia) sunt furnizate. Utilizatorul poate specifica modele cu și fără variabile latente continue (adică modelare de măsurare) atât la ordine inferioare, cât și superioare, precum și modele structurale (adică modelare a căilor). Constrângerile de egalitate, medierea și analiza multigrup sunt posibile. O gamă largă de metode de estimare (de exemplu, variante de maximă verosimilitate, cele mai mici pătrate și James-Stein) sunt acceptate. Numeroase statistici de ajustare sunt disponibile la cerere (de exemplu, GFI, aGFI, ECVI etc.), iar un mic subset (adică CFI, TLI, SRMR, RMSEA, AIC, BC) sunt furnizate implicit. Intervalele de încredere utilizând diverse funcții de bootstrap pot fi, de asemenea, obținute. Diagramele modelelor sunt produse folosind semPlot (1.1.6).  \n</br>\n</br>\nCând faceți clic pe Covarianțe în dialog, veți vedea că caseta de selectare, calculați automat covarianțele este bifată. Puteți șterge o covarianță calculată automat selectând covarianța și făcând clic pe pictograma de coș de gunoi. Când ștergeți o covarianță, o suprimăm în codul generat. Dacă doriți să anulați suprimarea, trebuie să o adăugați manual din nou sau să ștergeți și să recreați variabila latentă sau factorul de ordin superior care face parte din covarianța pe care doriți să o anulați. \n</br>\n</br>\nCând o variabilă de grupare este selectată (faceți clic pe Opțiuni pentru grupuri multiple în dialog), trebuie să selectați caseta de selectare \"Intercepturile variabilelor observate\" și caseta de selectare \"Intercepturile/mediile variabilelor latente\". \nBifarea doar a primei casete de selectare vă oferă mai multă flexibilitate. \n</br>\nDescrierea funcțiilor de ajustare este mai jos</br>\n\"ML\" verosimilitate maximă</br>\n\"GLS\": cele mai mici pătrate generalizate. Numai pentru date complete.</br>\n\"WLS\": cele mai mici pătrate ponderate (uneori numite estimare ADF). Numai pentru date complete.</br>\n\"DWLS\": cele mai mici pătrate ponderate diagonal</br>\n\"ULS\": cele mai mici pătrate neponderate</br>\n\"DLS\": cele mai mici pătrate ponderate distribuțional</br>\n\"PML\": verosimilitate maximă pe baza perechilor</br>\nMulte estimatori au variante robuste, ceea ce înseamnă că oferă erori standard robuste și o statistică de testare scalată. De exemplu, pentru estimarea verosimilității maxime, lavaan oferă următoarele variante robuste:</br>\n\"MLM\": estimarea verosimilității maxime cu erori standard robuste și o statistică de testare scalată Satorra-Bentler. Numai pentru date complete.</br>\n\"MLMVS\": estimarea verosimilității maxime cu erori standard robuste și o statistică de testare ajustată pe medie și varianță (cunoscută sub numele de abordarea Satterthwaite). Numai pentru date complete.</br>\n\"MLMV\": estimarea verosimilității maxime cu erori standard robuste și o statistică de testare ajustată pe medie și varianță (folosind o abordare cu schimbare de scară). Numai pentru date complete.</br>\n\"MLF\": pentru estimarea verosimilității maxime cu erori standard bazate pe derivatele de ordinul întâi și o statistică de testare convențională. Pentru date complete și incomplete.</br>\n\"MLR\": estimarea verosimilității maxime cu erori standard robuste (Huber-White) și o statistică de testare scalată care este (asimptotic) egală cu statisticile de testare Yuan-Bentler. Pentru date complete și incomplete.</br>\n</br>\nTBD\nDocumentați situația în jurul gradelor de libertate, practic atunci când o variabilă de grupare este selectată, trebuie să selectați caseta de selectare \"Intercepturile variabilelor observate\" și caseta de selectare \"Intercepturile/mediile variabilelor latente\". \nBifarea doar a primei casete de selectare vă oferă mai multă flexibilitate. \n<b>Pachet</b></br>\nlavaan;semPlot;semTools</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă în editorul de sintaxă R</br>\najutor(sem, pachet='lavaan')\n\n\n"
  }
}