{
  "title": "Modelul Rasch Simplu",
  "navigation": "Modelul Rasch Simplu",
  "modelname": "Introduceți numele modelului",
  "destinationvars": "Variabilă(e) de destinație",
  "estimationlbl": "Estimare",
  "rad1": "Utilizați estimarea CML",
  "chk1": "Calculați eroarea standardizată",
  "chk2": "Normalizați parametrii pentru a suma (0)",
  "rad2": "Utilizați estimarea MML",
  "help": {
    "title": "Modelul Rasch Simplu",
    "r_help": "help(RM, package='eRm')",
    "body": "\n            <b>Descriere</b>\n            <br/>\n            Creează un model Rasch simplu folosind estimarea CML sau MML.\n            <br/><br/>\n            Pentru estimarea CML, invocăm eRm::RM pentru a calcula estimările parametrilor unui model Rasch pentru răspunsuri binare la itemi folosind estimarea CML.\n            <br/><br/>\n            Pentru estimarea MML, invocăm TAM::tam.mml pentru a genera estimările parametrilor unui model unidimensional \n            <br/><br/>\n            <b>Utilizare pentru estimarea CML</b>\n            <br/>\n            <code>\n            eRm::RM(X, se = TRUE, sum0 = TRUE, etaStart) \n            </code>\n            <br/><br/>\n            <b>Argumente</b>\n            <br/>          \n            <ul>\n            <li>\n            X:  Matrice de date 0/1 sau cadru de date; rândurile reprezintă indivizi, coloanele reprezintă itemi. Valorile lipsă sunt inserate ca NA.\n            </li>\n            <li>\n            W:  Matrice de design pentru modelul Rasch. Dacă este omisă, funcția va calcula W automat.\n            </li>\n            <li>\n            se: Dacă este TRUE, erorile standard sunt calculate.\n            </li>\n            <li>\n            sum0: Dacă este TRUE, parametrii sunt normalizați pentru a suma-0 specificând un W adecvat. Dacă este FALSE, primul parametru este restricționat la 0.\n            </li>\n            <li>\n            etaStart: Un vector de valori de început pentru parametrii eta poate fi specificat. Dacă lipsește, se folosește vectorul 0.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>Utilizare pentru estimarea MML</b>\n            <br/>\n            <code>\n            tam.mml(resp,verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Argumente</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Cadru de date cu răspunsuri polytomous la itemi k=0,...,K. Răspunsurile lipsă trebuie declarate ca NA.\n            </li>\n            <li>\n            irtmodel: Pentru pantele fixe ale itemilor (în tam.mml) opțiunile includ PCM (model de credit parțial), PCM2 (model de credit parțial cu parametrizarea ConQuest 'item+item*step' și RSM (model de scală de evaluare; parametrizarea ConQuest 'item+step'). \n            <br/>\n            Pentru pantele estimate ale itemilor (disponibile doar în tam.mml.2pl) opțiunile sunt 2PL (toate pantele categoriilor de itemi sunt estimate; Modelul de Răspuns al Itemului Nominal), GPCM (modelul de credit parțial generalizat în care fiecare item primește un singur și doar un parametru de pantă pe dimensiune) și 2PL.groups (subseturi de itemi primesc aceleași estimări ale pantei itemilor) și o matrice de design E pe pantele itemilor în modelul de credit parțial generalizat (GPCM.design, vezi Exemple). Rețineți că pantele itemilor nu pot fi estimate cu designuri facete folosind funcția tam.mml.mfr. Cu toate acestea, este ușor să folosiți matrice de design pre-specificate și să aplicați unele restricții la tam.mml.2pl\n            </li>\n            <li>\n            verbose: Logic indicând dacă ieșirea ar trebui să fie imprimată în timpul iterațiilor. \n            </li>\n            </ul>\n            <br/><br/>\n            <b>Pachete</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>            \n            <b>Ajutor</b>\n            <br/>\n            help(RM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
  }
}