{
  "title": "Tabel, Avansat",
  "navigation": "Tabel, Avansat",
  "notelabel": "NOTĂ: Cel puțin o variabilă trebuie specificată în cel puțin unul dintre următoarele: Test ANOVA, Test Kruskal-Wallis, Test Median, Test Chi-Cercetător Pearson, Test Exact Fisher, Test Trend Ordinal sau Fără Test",
  "anovavarslabel": "Variabile pentru Test ANOVA",
  "kwvarslabel": "Variabile pentru Test Kruskal-Wallis",
  "medvarslabel": "Variabile pentru Test Median",
  "chisqvarslabel": "Variabile pentru Test Chi-Cercetător Pearson",
  "fishervarslabel": "Variabile pentru Test Exact Fisher",
  "ordvarslabel": "Variabile pentru Test Trend Ordinal",
  "notestvarslabel": "Variabile pentru Fără Test",
  "bygroupvarlabel": "Grupuri de Comparat",
  "stratavarlabel": "Strate (opțional)",
  "tabletitlelabel": "Titlul Tabelului",
  "totalcolchkboxlabel": "Include coloana totală",
  "groupvarchkboxlabel": "Include numele variabilei de grup",
  "digitslabel": "Cifre După Virgulă",
  "contdigitslabel": "Valori Continue",
  "pctdigitslabel": "Procente",
  "pvaluedigitslabel": "Valori P",
  "simplifylabel": "Simplifică Rezumatele Variabilelor pe Mai Multe Rânduri într-un Singur Rând (dacă este posibil)",
  "numericsimplifylabel": "Variabile Numerice",
  "categorysimplifylabel": "Variabile Categoriale",
  "ordinalsimplifylabel": "Variabile Ordinale",
  "datesimplifylabel": "Variabile de Dată",
  "labelsimplifylabel": "Folosește Ultimul Nivel în Eticheta Variabilelor Categoriale",
  "conflevellabel": "Nivel de Încredere",
  "simchkboxlabel": "Simulează valorile p pentru Pearson și Fisher",
  "simnumlabel": "Numărul de Simulări",
  "footnotechkboxlabel": "Notă de Subsol pentru Numele Testelor",
  "sampsizelabel": "Dimensiunea Eșantionului",
  "meanlabel": "Mediu",
  "quantileslabel": "Quantile",
  "otherlabel": "Altele",
  "nmissanylabel": "Numărul Lipsă, dacă există",
  "nmissalwayslabel": "Numărul Lipsă, întotdeauna",
  "meansdlabel": "Mediu (SD)",
  "meancilabel": "Mediu (CI)",
  "meanselabel": "Mediu (SE)",
  "gmeanlabel": "Mediu Geometric",
  "gmeansdlabel": "Mediu Geometric (SD)",
  "gmeancilabel": "Mediu Geometric (CI)",
  "trimmeancilabel": "Mediu Tăiat (CI)",
  "trimpctlabel": "Specificați Procentul Mediu Tăiat",
  "medianlabel": "Mediană",
  "medianq1q3label": "Mediană (25%-ile, 75%-ile)",
  "q1q3label": "(25%-ile, 75%-ile)",
  "iqrlabel": "Interval Intercuartil",
  "medianrangelabel": "Mediană (Interval)",
  "medianmadlabel": "Mediană (Devierea Absolută Mediană)",
  "rangelabel": "Interval",
  "minlabel": "Minim",
  "maxlabel": "Maxim",
  "pct1label": "1%-ile (CI)",
  "pct5label": "5%-ile (CI)",
  "pct10label": "10%-ile (CI)",
  "pct25label": "25%-ile (CI)",
  "pct33label": "33 1/3 %-ile (CI)",
  "pct50label": "Mediană (CI)",
  "pct66label": "66 2/3 %-ile (CI)",
  "pct75label": "75%-ile (CI)",
  "pct90label": "90%-ile (CI)",
  "pct95label": "95%-ile (CI)",
  "pct99label": "99%-ile (CI)",
  "custquantlabel": "Percentilă Personalizată (CI)",
  "custquantvaluelabel": "Specificați Percentila",
  "skewnesslabel": "Asimetrie",
  "kurtosislabel": "Kurtosis",
  "sumlabel": "Sumă",
  "sdlabel": "SD",
  "varlabel": "Varianță",
  "gsdlabel": "SD Mediu Geometric",
  "cvlabel": "Coeficient de Variabilitate",
  "freqlabel": "Frecvență",
  "freqtotallabel": "Frecvență/Total",
  "freqpctlabel": "Frecvență (%)",
  "propcilabel": "Proporție (CI)",
  "ciFootNote": "Notă de Subsol pentru Nivelul de Încredere",
  "help": {
    "title": "Tabel, Avansat",
    "r_help": "help(tableby, package ='arsenal')",
    "body": "\nAcest lucru creează un tabel de statistici rezumative în cadrul grupurilor pentru a compara și o variabilă de stratificare pentru a face comparațiile în cadrul acestora. O coloană pentru fiecare grup \nvariabilă categorie va fi creată. Categoriile variabilei de stratificare vor forma rânduri suplimentare pentru tabel. Diverse statistici rezumative și teste statistice pot fi \nspecificate.\n<br/><br/>\nNotă: Datele de orice clasă vor fi convertite în clasa Date doar în scopuri de rezumare. Setul dvs. de date original va rămâne neschimbat. Acest lucru înseamnă, de asemenea, că datele rezumate vor fi precise doar până la zi.\n<br/><br/>\n<b>Grupuri de Comparat:</b> Variabilă care definește categoriile de comparat\n<br/><br/>\n<b>Variabile pentru Test ANOVA:</b> Specificați variabile numerice sau de dată pentru comparațiile de grup folosind testul Analizei Varianței (ANOVA)\n<br/><br/>\n<b>Variabile pentru Test Kruskal-Wallis:</b> Specificați variabile numerice, de dată sau variabile factor ordinale pentru comparațiile de grup folosind testul Kruskal-Wallis\n<br/><br/>\n<b>Variabile pentru Test Median:</b> Specificați variabile numerice sau de dată pentru comparațiile de grup folosind un test al medianelor\n<br/><br/>\n<b>Variabile pentru Test Chi-Cercetător Pearson:</b> Specificați variabile factor nominale sau variabile factor ordinale pentru comparațiile de grup folosind testul Chi-Cercetător Pearson\n<br/><br/>\n<b>Variabile pentru Test Exact Fisher:</b> Specificați variabile factor nominale sau variabile factor ordinale pentru comparațiile de grup folosind testul Exact Fisher\n<br/><br/>\n<b>Variabile pentru Test Trend Ordinal:</b> Specificați variabile factor nominale sau variabile factor ordinale pentru comparațiile de grup folosind un test de trend. Pentru două grupuri, acest lucru este esențial testul de trend Cochran-Armitage.\n<br/><br/>\n<b>Variabile pentru Fără Test:</b> Specificați variabilele pe care doriți să le rezumați doar în cadrul grupurilor. Nu vor fi calculate teste statistice pentru aceste variabile.\n<br/><br/>\nNotă: Trebuie să specificați cel puțin o variabilă pentru a rezuma pentru a produce un tabel.\n<br/><br/>\n<b>Strate (opțional):</b> Variabilă care definește categoriile în cadrul cărora vor fi făcute comparațiile\n<br/><br/>\n<b>Titlul Tabelului:</b> specificați titlul tabelului\n<br/><br/>\n<b>Include coloana totală:</b> dacă o coloană totală este inclusă în tabel sau nu\n<br/><br/>\n<b>Include numele variabilei de grup:</b> dacă să includeți sau nu numele variabilei de grup în tabel\n<br/><br/>\n<b>Cifre După Virgulă:</b> specificați câte cifre să fie afișate după punctul zecimal pentru valori continue, procente și valori p\n<br/><br/>\n<b>Simplifică Rezumatele Variabilelor pe Mai Multe Rânduri într-un Singur Rând (dacă este posibil):</b> Pentru variabile categoriale (factor/ordinal) cu două categorii sau rezumate unice ale variabilelor numerice sau de dată, \nputeți colapsa rândurile pentru a avea toate numele variabilelor și statisticile să apară într-un singur rând. Rezumatele pentru ultimul nivel pentru fiecare variabilă categorială vor fi afișate. \nOrice variabilă pentru care colapsarea nu este posibilă va ocupa mai multe rânduri. Activarea/dezactivarea acestei opțiuni se poate face pentru fiecare tip de variabilă separat.\n<br/><br/>\n<b>Folosește Ultimul Nivel în Eticheta Variabilelor Categoriale:</b> Pentru tabele simplificate, aceasta include ultimul nivel al variabilelor factor/ordinal în eticheta rândului.\n<br/><br/>\n<b>Nivel de Încredere:</b> Acesta setează nivelul de încredere al intervalelor de încredere.\n<br/><br/>\n<b>Opțiuni pentru Teste Statistice</b>\n<br/><br/>\n<b>Teste Statistice:</b> Simulările Pearson și Fisher oferă capacitatea de a obține valori p simulate pentru testele chi-pătrat Pearson și \ntestele Exact Fisher. Această procedură creează simulări Monte Carlo de un număr specificat de ori (Numărul de Simulări). Acest lucru poate fi util în cazurile în care \ncalculările standard, în special pentru testul Exact Fisher, rezultă în erori de memorie a computerului.\n<br/><br/>\n<b>Notă de Subsol pentru Numele Testelor:</b> dacă să includeți sau nu notele de subsol pentru valorile p care listează testele statistice efectuate pentru fiecare variabilă\n<br/><br/>\n<b>Opțiuni pentru Statistici Numerice:</b>\n<br/>statistici care vor fi afișate pentru variabile numerice\n<br/><br/>\n<b>Opțiuni pentru Statistici Categoriale:</b> \n<br/>statistici care vor fi afișate atât pentru factorii nominali, cât și pentru cei ordinați\n<br/><br/>\n<b>Statistici pentru Date:</b>\n<br/>statistici care vor fi afișate pentru variabile de dată\n<br/><br/>\n<b>Notă:</b> Dacă doriți să rezumați o variabilă de un tip specific, se recomandă să selectați cel puțin o statistică în acea categorie care nu este \"Numărul Lipsă, dacă există\". Dacă \"Numărul Lipsă, dacă există\" este singura opțiune selectată și nicio variabilă nu are o valoare lipsă, atunci va rezulta o eroare. \n<br/><br/>\n<b>Pachete R Necesare:</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
  }
}