{
    "title": "Grafic de Linie cu două axe Y",
    "navigation": "Două axe Y",
    "x": "Axa X",
    "y": "Axa Y1, specificați o variabilă numerică",
    "y2": "Axa Y2, specificați o variabilă numerică",
    "y1_sf": "Factor de scară Y1",
    "y2_sf": "Factor de scară Y2",
    "help": {
        "title": "Grafic de Linie",
        "r_help": "help(geom_line, package=ggplot2)",
        "body": "\n            <b>Descriere</b></br>\n            Creează un grafic de linie (conectat prin ordine) sau un grafic de tip pas sau ordonează graficul de linie în funcție de apariția punctelor în setul de date. Faceți clic pe tab-ul corespunzător tipului de grafic de linie dorit.</br>\n            Grafic de linie (conectat prin ordine): Un grafic de linie plotează o linie prin punctele definite de coordonatele x și y și le conectează în ordinea variabilelor de pe axa x. Când o culoare este setată pe o variabilă de tip factor, punctele sunt grupate după culoare și o linie separată este generată pentru fiecare grup de culori. Fațetele pot fi create opțional specificând o variabilă de tip factor. De asemenea, puteți specifica opțional teme și puteți specifica un titlu și etichete pentru axa x și y​.</br>\n            Grafic de tip pas: Un grafic de linie plotează o linie prin punctele definite de coordonatele x și y și creează un grafic de tip pas, evidențiind exact când apar schimbări. Când o culoare este setată pe o variabilă de tip factor, punctele sunt grupate după culoare și o linie separată este generată pentru fiecare grup de culori. Fațetele pot fi create opțional specificând o variabilă de tip factor. De asemenea, puteți specifica opțional teme și puteți specifica un titlu și etichete pentru axa x și y​.</br>\n            Ordinate după apariție: Un grafic de linie plotează o linie prin punctele definite de coordonatele x și y și le conectează în ordinea în care apar variabilele în setul de date. Când o culoare este setată pe o variabilă de tip factor, punctele sunt grupate după culoare și o linie separată este generată pentru fiecare grup de culori. Fațetele pot fi create opțional specificând o variabilă de tip factor. De asemenea, puteți specifica opțional teme și puteți specifica un titlu și etichete pentru axa x și y​.</br>\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code> \n            # Grafic de linie<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_line( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Grafic de linie pentru ...\")<br/>\n            # Grafic de tip pas<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_step( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Grafic de linie pentru ...\")<br/>\n            # Ordinate după apariție<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_path( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Grafic de linie pentru ...\")\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            data: Setul de date implicit​\n            </li>\n            <li>\n            aes(): Generați mapări estetice care descriu cum variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geometrelor.​\n            </li>\n            <li>\n            x: O variabilă numerică sau de tip factor\n            </li>\n            <li>\n            y: variabila numerică/scară pentru care sunt plotate punctele pe axa y​\n            </li>\n            <li>\n            color: o variabilă opțională de tip factor pentru a grupa punctele (după culoare)​\n            </li>\n            <li>\n            labs(): Schimbați etichetele axelor și titlurile legendelor (Aceasta este opțional)​\n            </li>\n            <li>\n            facet_grid(): Așezați panourile într-o rețea (Aceasta este opțional)​\n            </li>\n            <li>\n            theme_calc(): Specifică tema calculatorului (Aceasta este opțional)​\n            </li>\n            <li>\n            geom_line(): Conectează observațiile ordonate după valoarea x, vezi x:​\n            </li>\n            <li>\n            coord_flip(): Răsturnați axa (Aceasta este opțional)​\n            </li>\n            </ul>\n            <b>Pachet</b></br>\n            ggplot2; ggthemes;</br>\n            <b>Ajutor</b></br>\n            # Grafic de linie\n            help(geom_line, package='ggplot2')\n            # Grafic de tip pas\n            help(geom_step, package=ggplot2)\n            # Ordinea variabilelor\n            help(geom_path, package='ggplot2')\n            Altele: Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. Puteți introduce, de asemenea, help(labs), help(geom_line), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n    "
    }
}
