{
  "title": "Intervale de Toleranță",
  "navigation": "Intervale de Toleranță",
  "label1": "Selectați o funcție de distribuție care se potrivește cel mai bine datelor",
  "variableSelcted": "Selectați o variabilă (date observate) pentru a analiza",
  "x": "Numărul de unități defecte (sau acceptabile) din eșantion",
  "m": "Cantitatea produsă în grupurile viitoare",
  "alpha": "Interval de încredere (de exemplu, 0.95)",
  "P": "Procentul minim (specificați o valoare între 0 și 1) din populație în interval",
  "side": "Interval de toleranță unidirecțional sau bidirecțional este necesar (tip 1 sau 2)",
  "method": "Metoda de calculare a factorilor k (aplicabilă doar pentru Normal, Log Normal, Gamma)",
  "selectDistFuncNormalRad": "Normal",
  "selectDistFuncWeibullRad": "Weibull",
  "selectDistFuncExpRad": "Exponențial",
  "selectDistFuncGammaRad": "Gamma",
  "selectDistFuncLnormalRad": "Log Normal",
  "selectDistFuncCauchyRad": "Cauchy",
  "help": {
    "title": "Intervale de Toleranță",
    "r_help": "help(normtol.int, package = tolerance)",
    "body": "\n\t\t\t\t<b>Descriere</b></br>\n\t\t\t\tFuncția de calculare a intervalelor de toleranță \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPentru ajutor detaliat - folosiți ajutorul R (package = 'tolerance'), help(normtol.int, package = tolerance), help(exttol.int, package = tolerance)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMetoda de calculare a factorilor k\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMetoda de calculare a factorilor k este aplicabilă doar pentru distribuțiile Normal, Log Normal și Gamma. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\t\t\t\t\n                Factorul k pentru intervalele de toleranță unidirecționale este calculat exact și\n\t\t\t\tastfel este același pentru metoda aleasă. \"HE\" este metoda Howe și este adesea considerată extrem de precisă, \n\t\t\t\t<br/>\n\t\t\t\teven pentru dimensiuni mici ale eșantionului. \"HE2\" este o a doua metodă datorată lui Howe, care funcționează similar cu metoda Weissberg-Beatty\n\t\t\t\t<br/>\n\t\t\t\t, dar este mai simplă din punct de vedere computațional. \"WBE\" este metoda Weissberg-Beatty (numită și metoda Wald-Wolfowitz),\n\t\t\t\t<br/>\n\t\t\t\tcare funcționează similar cu prima metodă Howe pentru dimensiuni mai mari ale eșantionului. \"ELL\" este corecția Ellison la\n\t\t\t\t<br/>\t\t\t\t\n\t\t\t\tmetoda Weissberg-Beatty atunci când f este semnificativ mai mare decât n^2. Un mesaj de avertizare este afișat dacă f nu este mai mare\n\t\t\t\t<br/>\n\t\t\t\tdecât n^2. \"KM\" este aproximația Krishnamoorthy-Mathew la soluția exactă, care funcționează bine pentru dimensiuni mai mari ale eșantionului.\n\t\t\t\t<br/>\n\t\t\t\t\"EXACT\" calculează factorul k exact prin găsirea soluției integrale la problemă prin funcția integrate.\n\t\t\t\t<br/>\n\t\t\t\tRețineți că timpul de calcul al acestei metode este determinat în mare măsură de m. \"OCT\" este abordarea Owen pentru a calcula factorul k\n\t\t\t\t<br/>\n\t\t\t\tatunci când se controlează cozile astfel încât să nu existe mai mult de (1-P)/2 din date în fiecare coadă a distribuției.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPentru a încerca acest lucru, puteți folosi fișierul de set de date de eșantion numit tolerance.xlsx. Deschideți fișierul în grila de date cu meniul de deschidere a fișierului \n\t\t\t\t<br/>\n\t\t\t\tAlegeți ND pentru variabilă (observate..), \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}