{
  "title": "t-test, eșantioane pereche",
  "navigation": "t-test, eșantioane pereche",
  "tvarbox1": "Primul variabil numeric",
  "tvarbox3": "Al doilea variabil numeric",
  "label1": "Ipoteza alternativă",
  "test1": "Diferența != mu",
  "test2": "Diferența > mu",
  "test3": "Diferența < mu",
  "chkbox1": "Presupune varianta egală",
  "txtbox2": "Ipoteza nulă (mu)",
  "txtbox1": "Nivel de încredere",
  "cohensdNoCorrection": "d-ul lui Cohen",
  "hedgesgNoCorrection": "g-ul lui Hedges",
  "glassdNoCorrection": "delta lui Glass",
  "hedgesgCorrect": "g-ul lui Hedges cu corecție de bias",
  "glassdCorrect": "delta lui Glass cu corecție de bias",
  "effectsizes": "Dimensiuni ale efectului",
  "showEffectSizes": "Afișează dimensiunile efectului",
  "cohensdCorrect": "d-ul lui Cohen cu corecție de bias",
  "label3": "Opțiuni pentru d-ul lui Cohen",
  "label4": "Opțiuni pentru g-ul lui Hedges",
  "label5": "Opțiuni pentru delta lui Glass",
  "help": {
    "title": "t-test, eșantioane independente",
    "r_help": "help(t.test, package ='stats')",
    "body": "\n<b>Descriere</b></br>\nExecută teste t pentru un eșantion și două eșantioane pe vectori de date.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nt.test(x, ...)<br/>\n## Metoda S3 implicită:<br/>\nt.test(x, y = NULL,\n        alternative = c(\"two.sided\", \"less\", \"greater\"),\n        mu = 0, paired = FALSE, var.equal = FALSE,\n        conf.level = 0.95, ...)<br/>\n## Metoda S3 pentru clasa 'formula'<br/>\nt.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: un vector numeric (nevid) de valori de date.\n</li>\n<li>\ny: un vector numeric opțional (nevid) de valori de date.\n</li>\n<li>\nalternative: un șir de caractere care specifică ipoteza alternativă, trebuie să fie unul dintre \"two.sided\" (implicit), \"greater\" sau \"less\". Poți specifica doar litera inițială.\n</li>\n<li>\nmu: un număr care indică valoarea adevărată a mediei (sau diferența în medii dacă efectuezi un test pe două eșantioane).\n</li>\n<li>\npaired: un logic care indică dacă dorești un test t pereche.\n</li>\n<li>\nvar.equal: O variabilă logică care indică dacă să tratezi cele două variabile ca fiind egale. Dacă este TRUE, atunci varianta combinată este utilizată pentru a estima varianta, altfel se folosește aproximarea Welch (sau Satterthwaite) pentru gradele de libertate.\n</li>\n<li>\nconf.level: nivelul de încredere al intervalului.\n</li>\n<li>\nformula: o formulă de forma lhs ~ rhs unde lhs este o variabilă numerică care oferă valorile de date și rhs un factor cu două niveluri care oferă grupurile corespunzătoare.\n</li>\n<li>\ndata: o matrice sau un cadru de date opțional (sau similar: vezi model.frame) care conține variabilele din formula formula. Implicit, variabilele sunt preluate din environment(formula).\n</li>\n<li>\nsubset: un vector opțional care specifică un subset de observații care să fie utilizate.\n</li>\n<li>\nna.action: o funcție care indică ce ar trebui să se întâmple când datele conțin NAs. Implicit este setat la getOption(\"na.action\").\n</li>\n<li>\n...: argumente suplimentare care pot fi transmise către sau din metode.\n</li>\n</ul>\n<b>Detalii</b></br>\nInterfața de formulă este aplicabilă doar pentru testele pe 2 eșantioane.</br>\nalternative = \"greater\" este alternativa că x are o medie mai mare decât y.</br>\nDacă paired este TRUE, atunci atât x cât și y trebuie să fie specificate și trebuie să aibă aceeași lungime. Valorile lipsă sunt eliminate în tăcere (în perechi dacă paired este TRUE). Dacă var.equal este TRUE, atunci estimarea combinată a variantei este utilizată. Implicit, dacă var.equal este FALSE, atunci varianta este estimată separat pentru ambele grupuri și se folosește modificarea Welch pentru gradele de libertate.</br>\nDacă datele de intrare sunt efectiv constante (comparativ cu cea mai mare dintre cele două medii), se generează o eroare.</br>\n<b>Valoare</b><br/>\nO listă cu clasa \"htest\" conținând următoarele componente:<br/>\nstatistic: valoarea statisticii t.<br/>\nparameter: gradele de libertate pentru statistica t.<br/>\np.value: valoarea p pentru test.<br/>\nconf.int: un interval de încredere pentru medie corespunzător ipotezei alternative specificate.<br/>\nestimate: media estimată sau diferența în medii în funcție de dacă a fost un test pe un eșantion sau pe două eșantioane.<br/>\nnull.value: valoarea ipotetică specificată a mediei sau a diferenței de medii în funcție de dacă a fost un test pe un eșantion sau pe două eșantioane.<br/>\nalternative: un șir de caractere care descrie ipoteza alternativă.<br/>\nmethod: un șir de caractere care indică ce tip de test t a fost efectuat.<br/>\ndata.name: un șir de caractere care oferă numele datelor.<br/>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(t.test, package ='stats')\n"
  }
}