{
  "title": "Testul Wilcoxon, mostre independente",
  "navigation": "Testul Wilcoxon, Mostre Independente",
  "tvarbox1": "Response Variable (one)",
  "tvarbox2": "Factor (one) with only two levels",
  "label1": "Aternative Hypothesis",
  "twosided": "Group1 - Group2 != mu",
  "greater": "Group1 - Group2 > mu",
  "less": "Group1 - Group2 < mu",
  "label2": "Test Method",
  "default": "Default",
  "exact": "Exact",
  "normal": "Normal Approximation",
  "contingency": "Normal Approximation (Continuity correction)",
  "textbox1": "Interval de încredere",
  "textbox2": "Ipoteza nulă (mu)",
  "help": {
    "title": "Testul Wilcoxon, mostre independente",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>Descriere</b></br>\nExecută teste Wilcoxon pentru una și două mostre pe vectori de date; acesta din urmă este cunoscut și sub numele de testul „Mann-Whitney”.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Metoda S3 implicită:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## Metoda S3 pentru clasa 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: vector numeric de valori de date. Valorile non-finite (de exemplu, infinite sau lipsă) vor fi omise.\n</li>\n<li>\ny: un vector numeric opțional de valori de date: la fel ca și x, valorile non-finite vor fi omise.\n</li>\n<li>\nalternative: un șir de caractere care specifică ipoteza alternativă, trebuie să fie unul dintre \"two.sided\" (implicit), \"greater\" sau \"less\". Puteți specifica doar litera inițială.\n</li>\n<li>\nmu: un număr care specifică un parametru opțional utilizat pentru a forma ipoteza nulă. Consultați „Detalii”.\n</li>\n<li>\npaired: un logic care indică dacă doriți un test pereche.\n</li>\n<li>\nexact: un logic care indică dacă ar trebui să se calculeze o valoare p exactă.\n</li>\n<li>\ncorrect: un logic care indică dacă se aplică corecția de continuitate în aproximarea normală pentru valoarea p.\n</li>\n<li>\nconf.int: un logic care indică dacă ar trebui să se calculeze un interval de încredere.\n</li>\n<li>\nconf.level: nivelul de încredere al intervalului.\n</li>\n<li>\nformula: o formulă de forma lhs ~ rhs unde lhs este o variabilă numerică care oferă valorile de date și rhs un factor cu două niveluri care oferă grupurile corespunzătoare.\n</li>\n<li>\ndata: o matrice sau un cadru de date opțional (sau similar: consultați model.frame) care conține variabilele din formula formula. În mod implicit, variabilele sunt preluate din environment(formula).\n</li>\n<li>\nsubset: un vector opțional care specifică un subset de observații care vor fi utilizate.\n</li>\n<li>\nna.action: o funcție care indică ce ar trebui să se întâmple când datele conțin NAs. Implicit, se utilizează getOption(\"na.action\").\n</li>\n<li>\n...: argumente suplimentare care vor fi transmise către sau de la metode.\n</li>\n</ul>\n<b>Detalii</b></br>\nInterfața formulei este aplicabilă doar pentru testele cu 2 mostre.</br>\nDacă este dat doar x, sau dacă atât x cât și y sunt date și paired este TRUE, se efectuează un test Wilcoxon pentru ranguri semnate al ipotezei nule că distribuția lui x (în cazul unei singure mostre) sau a lui x - y (în cazul pereche al celor două mostre) este simetrică în jurul lui mu.</br>\nÎn caz contrar, dacă atât x cât și y sunt date și paired este FALSE, se efectuează un test Wilcoxon pentru suma rangurilor (echivalent cu testul Mann-Whitney: consultați Nota). În acest caz, ipoteza nulă este că distribuțiile lui x și y diferă printr-o deplasare de locație de mu și alternativa este că acestea diferă printr-o altă deplasare de locație (iar alternativa unidirecțională \"greater\" este că x este deplasat la dreapta lui y).</br>\nÎn mod implicit (dacă exact nu este specificat), se calculează o valoare p exactă dacă mostrele conțin mai puțin de 50 de valori finite și nu există legături. În caz contrar, se utilizează o aproximare normală.</br>\nOpțional (dacă argumentul conf.int este adevărat), se calculează un interval de încredere nonparametric și un estimator pentru pseudomediană (cazul unei singure mostre) sau pentru diferența parametrilor de locație x-y. (Pseudomediana unei distribuții F este mediana distribuției lui (u+v)/2, unde u și v sunt independente, fiecare având distribuția F. Dacă F este simetrică, atunci pseudomediana și mediana coincid. Consultați Hollander & Wolfe (1973), pagina 34.) Rețineți că în cazul celor două mostre, estimatorul pentru diferența parametrilor de locație nu estimează diferența în mediane (o concepție greșită comună), ci mai degrabă mediana diferenței dintre o mostră din x și o mostră din y.</br>\nDacă valorile p exacte sunt disponibile, se obține un interval de încredere exact prin algoritmul descris în Bauer (1972), iar estimatorul Hodges-Lehmann este utilizat. În caz contrar, intervalul de încredere și estimarea punctului returnate se bazează pe aproximări normale. Acestea sunt corectate pentru continuitate pentru interval, dar nu pentru estimare (deoarece corecția depinde de alternativă).</br>\nCu mostre mici, poate să nu fie posibil să se obțină acoperiri foarte mari ale intervalului de încredere. Dacă acest lucru se întâmplă, va fi dat un avertisment și un interval cu o acoperire mai mică va fi substituit.</br>\n<b>Valoare</b><br/>\nO listă cu clasa \"htest\" conținând următoarele componente:\nstatistic: valoarea statisticii testului cu un nume care o descrie.</br>\nparameter: parametrii pentru distribuția exactă a statisticii testului.</br>\np.value: valoarea p pentru test.</br>\nnull.value: parametrul de locație mu.</br>\nalternative: un șir de caractere care descrie ipoteza alternativă.</br>\nmethod: tipul de test aplicat.</br>\ndata.name: un șir de caractere care oferă numele datelor.</br>\nconf.int: un interval de încredere pentru parametrul de locație. (Prezent doar dacă argumentul conf.int = TRUE.)</br>\nestimate: o estimare a parametrului de locație. (Prezentă doar dacă argumentul conf.int = TRUE.)</br>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}