{
  "title": "Neue Ebenen hinzufügen",
  "navigation": "Hinzufügen",
  "target": "Faktorenvariablen, um neue Ebenen hinzuzufügen",
  "label1": "Fügen Sie einer oder mehreren Faktorenvariablen neue Ebenen hinzu. Speichern Sie die Ergebnisse in bestehenden Variablen oder erstellen Sie neue Variablen, indem Sie ein Präfix/Suffix angeben. Neue Variablen werden mit dem Präfix/Suffix an die bestehenden Namen angehängt.",
  "newLevels": "Geben Sie neue Ebenen in Anführungszeichen und durch ein Komma getrennt ein, z.B. \"ebene1\",\"ebene2\",\"ebene3\"",
  "label2": "Neue Ebenen in neuen Variablen speichern oder bestehende Variablen überschreiben",
  "rd3": "Geben Sie ein Suffix an (Eine neue Variable wird mit dem Suffix erstellt)",
  "txt3": "Geben Sie ein Suffix ein",
  "rd2": "Geben Sie ein Präfix an (Eine neue Variable wird mit dem Präfix erstellt)",
  "txt4": "Geben Sie ein Präfix ein",
  "rd1": "Bestehende Variablen überschreiben",
  "help": {
    "title": "Neue Ebenen hinzufügen",
    "r_help": "help(fct_expand, package=\"forcats\")",
    "body": "\n<b>HINWEIS: SCHLIESSEN SIE EBENEN NICHT IN DOPPELTE ODER EINZELNE ANFÜHRUNGSZEICHEN EIN, ES DÜRFEN KEINE RÄUME IN DEN EBENENNAMEN SEIN. GEBEN SIE EBENEN GETRENNT DURCH KOMMAS IM FORMAT EBENE1,EBENE2, EBENE3 EIN</b></br>\n<b>Beschreibung</b></br>\nFügen Sie zusätzliche Ebenen zu einem Faktor hinzu. Fügen Sie neuen Ebenen zu einer oder mehreren Faktorenvariablen hinzu. Die Ergebnisse können in bestehenden Variablen (Überschreibung) oder durch Angabe eines Präfix/Suffix neue Variablen erstellt werden. Neue Variablen werden mit dem Präfix/Suffix an die bestehenden Namen angehängt. \n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nfct_expand(f, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nf: Ein Faktor (oder Zeichenvektor).\n</li>\n<li>\n...: Zusätzliche Ebenen, die dem Faktor hinzugefügt werden sollen. Ebenen, die bereits existieren, werden stillschweigend ignoriert.\n</li>\n</ul>\n<b>Beispiele</b><br/>\n<code> \nf <- factor(sample(letters[1:3], 20, replace = TRUE))<br/>\nf<br/>\nfct_expand(f, \"d\", \"e\", \"f\")<br/>\nfct_expand(f, letters[1:6])<br/>\n</code><br/>\n<b>Paket</b></br>\nforcats</br>\n<b>Hilfe</b></br>\nhelp(fct_expand, package=\"forcats\")\n        "
  }
}