{
  "title": "Fügen Sie eine neu kalibrierte Stichprobennummer-Variable hinzu",
  "navigation": "Stichprobennummer kalibrieren",
  "sampleVariableToCalibrate": "Wählen Sie die Stichprobenvariable zur Neukalibrierung aus",
  "sampleVarName": "Geben Sie den Namen der neuen neu kalibrierten Stichprobenvariable an, die hinzugefügt werden soll (z. B. sample_recal). Wenn der Variablenname bereits im Datensatz vorhanden ist, wird er aktualisiert",
  "help": {
    "title": "Fügen Sie eine neu kalibrierte Stichprobennummer-Variable hinzu",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tOrganisieren von Untergruppen (d. h. Stichprobengruppe) für Prozessfähigkeit und andere Untergruppenanalysen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tAnalysen wie die Prozessfähigkeitsanalyse setzen voraus, dass die Daten in der Reihenfolge eingegeben werden, in der sie gesammelt wurden (chronologische Reihenfolge). Das bedeutet, dass alle Beobachtungen aus derselben Untergruppe in aufeinanderfolgenden Zeilen des Datensatzes erscheinen müssen. Eine Spalte für die Untergruppen-ID wird typischerweise verwendet, um zu definieren, welche Zeilen zur gleichen Untergruppe gehören.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWenn diese Bedingung nicht erfüllt ist (zum Beispiel, wenn Zeilen aus derselben Untergruppe im Datensatz verstreut sind und nicht nebeneinander stehen), müssen die Untergruppen-IDs neu kalibriert werden.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tNeukalibrierung bedeutet:\n\t\t\t\t<br/>\n\t\t\t\tEine neue Untergruppennummer wird immer dann zugewiesen, wenn sich die Untergruppen-ID von einer Zeile zur nächsten ändert.\n\t\t\t\t<br/>\n\t\t\t\tWenn dieselbe Untergruppen-ID später erneut erscheint, aber nicht benachbart zu ihrem vorherigen Vorkommen ist, wird sie als neue Untergruppe behandelt.\n\t\t\t\t<br/>\n\t\t\t\tMit anderen Worten, nur identische Werte, die nebeneinander erscheinen, werden als Teil derselben Untergruppe betrachtet. Identische Werte, die durch andere Untergruppen getrennt sind, werden während der Neukalibrierung in separate Untergruppen aufgeteilt.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDie neu kalibrierte Stichprobennummer-Variable im Datensatz ist erforderlich, um viele Analysen durchzuführen, z. B. Prozessfähigkeit, Shewhart-Diagramme wie xbar, R, S usw. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}