{
  "title": "AIC",
  "navigation": "AIC",
  "modelselector1": "Wählen Sie ein Modell einer der folgenden Klassen (Klasse in Klammern) Lineares Modell (lm) Verallgemeinerte lineare Modelle (glm) Ordinale logistische oder Probit-Regression (polr) Multinomiale log-lineare Modelle (multinom)",
  "help": {
    "title": "AIC",
    "r_help": "help(AIC,package='stats')",
    "body": "\n                <b>Beschreibung</b></br>\nGenerische Funktion zur Berechnung des Akaike'schen ‘An Information Criterion’ für eines oder mehrere angepasste Modellobjekte, für die ein Log-Likelihood-Wert erhalten werden kann, gemäß der Formel -2*Log-Likelihood + k*npar, wobei npar die Anzahl der Parameter im angepassten Modell darstellt und k = 2 für das übliche AIC oder k = log(n) (n ist die Anzahl der Beobachtungen) für das sogenannte BIC oder SBC (Schwarz'sches Bayes-Kriterium).\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nAIC(object, ..., k = 2)\nBIC(object, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: ein angepasstes Modellobjekt, für das eine logLik-Methode existiert, um den entsprechenden Log-Likelihood-Wert zu extrahieren, oder ein Objekt, das von der Klasse logLik erbt.\n</li>\n<li>\n... optional weitere angepasste Modellobjekte.\n</li>\n<li>\nk: numerisch, die Strafe pro Parameter, die verwendet werden soll; das Standard-k = 2 ist das klassische AIC.\n</li>\n</ul>\n<b>Details</b></br>\nBeim Vergleich von Modellen, die durch maximale Wahrscheinlichkeit an dieselben Daten angepasst wurden, gilt: Je kleiner das AIC oder BIC, desto besser die Anpassung.\nDie Theorie des AIC erfordert, dass die Log-Likelihood maximiert wurde: Während AIC für Modelle berechnet werden kann, die nicht durch maximale Wahrscheinlichkeit angepasst wurden, sollten deren AIC-Werte nicht verglichen werden.</br>\nBeispiele für Modelle, die nicht ‘an dieselben Daten angepasst wurden’ sind, wenn die Antwort transformiert wird (beschleunigte Lebensmodelle werden an Log-Zeiten angepasst) und wenn Kontingenztabellen verwendet wurden, um Daten zusammenzufassen.</br>\nDies sind generische Funktionen (mit S4-Generika, die im Paket stats4 definiert sind): Methoden sollten jedoch für die Log-Likelihood-Funktion logLik definiert werden, anstatt für diese Funktionen: Die Aktion ihrer Standardmethoden besteht darin, logLik auf alle bereitgestellten Objekte aufzurufen und die Ergebnisse zusammenzustellen. Beachten Sie, dass in mehreren gängigen Fällen logLik nicht den Wert bei der MLE zurückgibt: siehe die Hilfeseite.</br>\nDie Log-Likelihood und damit das AIC/BIC ist nur bis zu einer additiven Konstante definiert. Verschiedene Konstanten wurden traditionell für unterschiedliche Zwecke verwendet, sodass extractAIC und AIC unterschiedliche Werte zurückgeben können (und tun dies für Modelle der Klasse \"lm\": siehe die Hilfe für extractAIC). Besondere Vorsicht ist geboten, wenn Anpassungen verschiedener Klassen verglichen werden (zum Beispiel ist ein Vergleich eines Poisson- und Gamma-GLM bedeutungslos, da der eine eine diskrete Antwort hat, der andere kontinuierlich ist).</br>\nBIC wird definiert als AIC(object, ..., k = log(nobs(object))). Dies erfordert, dass die Anzahl der Beobachtungen bekannt ist: Die Standardmethode sucht zuerst nach einem \"nobs\"-Attribut im Rückgabewert der logLik-Methode, versucht dann das nobs-Generikum, und wenn beides nicht gelingt, gibt sie BIC als NA zurück.</br>\n<b>Wert</b><br/>\nWenn nur ein Objekt bereitgestellt wird, ein numerischer Wert mit dem entsprechenden AIC (oder BIC, oder ..., abhängig von k).\nWenn mehrere Objekte bereitgestellt werden, ein data.frame mit Zeilen, die den Objekten entsprechen, und Spalten, die die Anzahl der Parameter im Modell (df) und das AIC oder BIC darstellen.<br/>\n<b>Beispiele</b><br/>\n<code> \nlm1 <- lm(Fertility ~ . , data = swiss)</br>\nAIC(lm1)</br>\nstopifnot(all.equal(AIC(lm1),<br/>\n                    AIC(logLik(lm1))))<br/>\nBIC(lm1)</br>\nlm2 <- update(lm1, . ~ . -Examination)</br>\nAIC(lm1, lm2)</br>\nBIC(lm1, lm2)</br>\n</code> <br/>\n<b>Paket</b></br>\nstats</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl im R-Syntax-Editor aus: help(AIC,package='stats')\n                "
  }
}