{
  "title": "ANOVA, einseitig mit zufälligen Blöcken",
  "navigation": "ANOVA, 1 Weg (zufällige Blöcke)",
  "tvarbox1": "Antwortvariable",
  "tvarbox2": "Fester Effekt",
  "blockVar": "Blockierungsvariable(n)",
  "Post_hoc": "Post-hoc-Analyse",
  "chk1": "Histogramm der Residuen",
  "help": {
    "title": "ANOVA, einseitig mit zufälligen Blöcken",
    "r_help": "help(lmer, package ='lme4')",
    "body": "\n<b>Beschreibung</b></br>\nFitten eines linearen gemischten Modells (LMM) zu Daten, über REML oder maximale Wahrscheinlichkeit.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nlmer(formula, data = NULL, REML = TRUE, control = lmerControl(),\n        start = NULL, verbose = 0L, subset, weights, na.action,\n        offset, contrasts = NULL, devFunOnly = FALSE, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nformula: ein zweiseitiges lineares Formelobjekt, das sowohl den festen als auch den zufälligen Teil des Modells beschreibt, mit der Antwort auf der linken Seite eines ~ Operators und den Termen, getrennt durch +Operatoren, auf der rechten Seite. Zufallsvariablen werden durch senkrechte Striche (|) unterschieden, die Ausdrücke für Entwurfsmatrizen von Gruppierungsfaktoren trennen. Zwei senkrechte Striche (||) können verwendet werden, um mehrere unkorrelierte Zufallsvariablen für dieselbe Gruppierungsvariable anzugeben. (Aufgrund der Art und Weise, wie es implementiert ist, funktioniert die ||-Syntax nur für Entwurfsmatrizen, die numerische (kontinuierliche) Prädiktoren enthalten; um Modelle mit unabhängigen kategorialen Effekten zu erstellen, siehe dummy oder die lmer_alt-Funktion aus dem afex-Paket.)\n</li>\n<li>\ndata: ein optionales Datenrahmen, das die in der Formel genannten Variablen enthält. Standardmäßig werden die Variablen aus der Umgebung entnommen, aus der lmer aufgerufen wird. Während Daten optional sind, empfehlen die Paketautoren dringend deren Verwendung, insbesondere bei späteren Methoden wie update und drop1, die auf das angepasste Modell angewendet werden (solche Methoden sind nicht garantiert, dass sie ordnungsgemäß funktionieren, wenn Daten weggelassen werden). Wenn Daten weggelassen werden, werden die Variablen aus der Umgebung der Formel (wenn als Formel angegeben) oder aus dem übergeordneten Rahmen (wenn als Zeichenvektor angegeben) entnommen.\n</li>\n<li>\nREML: logische Skalar - Soll die Schätzung gewählt werden, um das REML-Kriterium zu optimieren (im Gegensatz zur Log-Likelihood)?\nna.action: eine Funktion, die angibt, was passieren soll, wenn die Daten NAs enthalten. Die Standardaktion (na.omit, abgeleitet vom 'fabrikfrischen' Wert von getOption(\"na.action\")) entfernt alle Beobachtungen mit fehlenden Werten in beliebigen Variablen.\n</li>\n</ul>\n<b>Wert</b></br>\nEin Objekt der Klasse merMod (genauer gesagt, ein Objekt der Unterklasse lmerMod), für das viele Methoden verfügbar sind (z.B. methods(class=\"merMod\"))</br>\n<b>Paket</b></br>\nlme4</br>\n<b>Hilfe</b></br>\nhelp(lmer, package ='lme4')</br></br>\n<b>Beschreibung</b></br>\nBeschreibung Methoden für die Funktion anova im Paket lmerTest\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \n## S4-Methode für die Signatur 'merModLmerTest' anova(object, ... , ddf=\"Satterthwaite\", type=3)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: Objekt der Klasse \"merModLmerTest\" ... Objekt der Klasse \"merModLmerTest\". Dann werden die Modellvergleichsstatistiken berechnet\n</li>\n<li>\nddf: Standardmäßig wird die Näherung von Satterthwaite zu den Freiheitsgraden berechnet. Wenn ddf=\"Kenward-Roger\", wird die Näherung von Kenward-Roger unter Verwendung der KRmodcomp-Funktion aus dem pbkrtest-Paket berechnet. Wenn ddf=\"lme4\" dann wird die ANOVA-Tabelle, die aus dem lme4-Paket stammt, zurückgegeben.\n</li>\n<li>\nTyp: Art der Hypothese, die getestet werden soll. Könnte type=3 oder type=2 oder type=1 sein (Die Definition stammt aus der SAS-Theorie) Details Laut (Goodnight, J.H. 1976) ist das Verhalten der Hypothese vom Typ 3 nicht vollständig untersucht für die Situationen mit fehlenden Zellen (wo Beobachtungen bei einigen Faktor-Stufen-Kombinationen fehlen). In solchen Fällen wird eine Warnung ausgegeben.\n</li>\n</ul>\n<b>Details</b></br>\nLaut (Goodnight, J.H. 1976) ist das Verhalten der Hypothese vom Typ 3 nicht vollständig untersucht für die Situationen mit fehlenden Zellen (wo Beobachtungen bei einigen Faktor-Stufen-Kombinationen fehlen). In solchen Fällen wird eine Warnung ausgegeben.</br>\n<b>Paket</b></br>\nlme4;lmerTest;rcompanion;ggplot2;multcomp</br>\n<b>Hilfe</b></br>\nhttps://cran.r-project.org/web/packages/lmerTest/lmerTest.pdf</br>\nhelp(nagelkerke, package ='rcompanion')</br>\nhelp(emmeans,package=\"cld\")</br>\nhelp(cld,package='emmeans')</br>\n<b>Referenzmaterial</b></br>\nhttp://rcompanion.org/handbook/I_07.html\n"
  }
}