{
  "title": "ANOVA & Likelihood Ratio Test",
  "navigation": "ANOVA & Likelihood Ratio",
  "label1": "ANOVA wird für Modelle mit den folgenden Klassen durchgeführt (R-Klassen in Klammern) Lineare Modelle (lm), Generalisierte lineare Modelle (glm), Negativ-binomial log-lineares Modell (negbin), Lineares Modell mit verallgemeinerten kleinsten Quadraten (gls), Überlebensregressionsmodell (survreg), Proportionales Hazard-Modell (coxph), Loess-Regression (loess)",
  "label2": "**HINWEIS: Der Likelihood-Test wird nicht für Modelle unterstützt, die über Model Tuning (Klasse train) erstellt wurden.",
  "modelselector1": "Wählen Sie ein Modell aus",
  "help": {
    "title": "ANOVA & Likelihood Ratio Test",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>Beschreibung</b></br>\nANOVA-Tabellen: Berechnet ANOVA-Tabellen und führt Likelihood-Ratio-Tests für ein angepasstes Modellobjekt durch. Für gemischte Effekte Modelle wird die ANOVA-ähnliche Tabelle für zufällige Effekte angezeigt. \n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: ein Objekt, das die Ergebnisse enthält, die von einer Modellanpassungsfunktion zurückgegeben werden (z. B. lm oder glm).\n</li>\n</ul>\n<b>Wert</b><br/>\nDiese (generische) Funktion gibt ein Objekt der Klasse anova zurück. Diese Objekte repräsentieren ANOVA- und Deviance-Tabellen. Bei einem einzelnen Argument wird eine Tabelle erstellt, die testet, ob die Modellbegriffe signifikant sind. Bei einer Sequenz von Objekten testet anova die Modelle gegeneinander in der angegebenen Reihenfolge.<br/>\nDie Druckmethode für anova-Objekte druckt Tabellen in einer „schönen“ Form.<br/>\n<b>Warnung</b><br/>\nDer Vergleich zwischen zwei oder mehr Modellen ist nur gültig, wenn sie auf demselben Datensatz angepasst werden. Dies kann ein Problem sein, wenn fehlende Werte vorhanden sind und R's Standard na.action = na.omit verwendet wird.<br/>\n<b>Pakete</b></br>\nstats</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogfelds oder führen Sie den folgenden Befehl im R-Syntax-Editor aus: help(anova,package='stats')</br></br>\n<b>Beschreibung</b></br>\nLikelihood-Ratio-Test von geschachtelten Modellen: lrtest ist eine generische Funktion zur Durchführung von Likelihood-Ratio-Tests. Die Standardmethode kann verwendet werden, um geschachtelte (generalisierte) lineare Modelle zu vergleichen (siehe Einzelheiten unten).\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Standard S3-Methode:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## S3-Methode für Klasse 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: ein Objekt. Siehe unten für Einzelheiten.\n</li>\n<li>\n...: weitere Objektspezifikationen, die an Methoden übergeben werden. Siehe unten für Einzelheiten.\n</li>\n<li>\nname: eine Funktion zum Extrahieren eines geeigneten Namens/Beschreibung aus einem angepassten Modellobjekt. Standardmäßig wird der Name durch Aufruf der Formel abgefragt.\n</li>\n<li>\ndata: ein Datenrahmen, der die Variablen im Modell enthält.\n</li>\n</ul>\n<b>Einzelheiten</b></br>\nlrtest soll eine generische Funktion für den Vergleich von Modellen über asymptotische Likelihood-Ratio-Tests sein. Die Standardmethode vergleicht nacheinander das angepasste Modellobjekt mit den in ... übergebenen Modellen. Anstelle von angepassten Modellobjekten in ... können mehrere andere Spezifikationen möglich sein. Der Aktualisierungsmechanismus ist derselbe wie bei waldtest: Die Modelle in ... können als Ganzzahlen, Zeichen (beide für Begriffe, die aus dem vorherigen Modell entfernt werden sollen), Aktualisierungsformeln oder angepasste Modellobjekte angegeben werden. Abgesehen von dem letzten Fall wird die Existenz einer Aktualisierungsmethode angenommen. Siehe waldtest für Einzelheiten.<br/>\nAnschließend wird ein asymptotischer Likelihood-Ratio-Test für jedes zwei aufeinanderfolgende Modell durchgeführt: Das Zweifache der Differenz der Log-Likelihoods (wie von den logLik-Methoden abgeleitet) wird mit einer Chi-Quadrat-Verteilung verglichen.<br/>\nDie \"Formel\"-Methode passt zuerst ein lm an und ruft dann die Standardmethode auf.<br/>\n<b>Wert</b><br/>\nEin Objekt der Klasse \"anova\", das die Log-Likelihood, die Freiheitsgrade, die Differenz der Freiheitsgrade, die Likelihood-Ratio-Chi-Quadrat-Statistik und den entsprechenden p-Wert enthält.\n<b>Beispiele</b><br/>\n<code> \n## mit Daten von Greene (1993):<br/>\n## Daten laden und Verzögerungen berechnen<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## verschiedene äquivalente Spezifikationen des LR-Tests<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>Beschreibung</b></br>\nANOVA-ähnliche Tabelle für Zufallseffekte: Berechnet eine ANOVA-ähnliche Tabelle mit Tests der Zufallseffektbegriffe im Modell. Jeder Zufallseffektbegriff wird reduziert oder entfernt und Likelihood-Ratio-Tests von Modellreduktionen werden in einer Form präsentiert, die der von drop1 ähnelt. rand ist ein Alias für ranova.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmodel: ein lineares gemischtes Effektmodell, das mit lmer() angepasst wurde (erbt von der Klasse lmerMod).\n</li>\n<li>\nreduce.terms: wenn TRUE (Standard), werden Zufallseffektbegriffe reduziert (wenn möglich). Wenn FALSE werden Zufallseffektbegriffe einfach entfernt.\n</li>\n</ul>\n<b>Einzelheiten</b></br>\nWenn das Modell mit REML angepasst wird, sind die Tests REML-Likelihood-Ratio-Tests.<br/>\nEin Zufallseffektbegriff der Form (f1 + f2 | gr) wird auf Begriffe der Form (f2 | gr) und (f1 | gr) reduziert, und diese reduzierten Modelle werden mit dem ursprünglichen Modell verglichen. Wenn reduce.terms FALSE ist, wird (f1 + f2 | gr) stattdessen entfernt.<br/>\nEin Zufallseffektbegriff der Form (f1 | gr) wird auf (1 | gr) reduziert (es sei denn, reduce.terms ist FALSE).<br/>\nEin Zufallseffektbegriff der Form (1 | gr) wird nicht reduziert, sondern einfach entfernt.<br/>\nEin Zufallseffektbegriff der Form (0 + f1 | gr) oder (-1 + f1 | gr) wird (wenn reduce.terms = TRUE) auf (1 | gr) reduziert.<br/>\nEin Zufallseffektbegriff der Form (1 | gr1/gr2) wird automatisch auf zwei Begriffe erweitert: (1 | gr2:gr1) und (1 | gr1) unter Verwendung von findbars.<br/>\nIn dieser Darstellung ist es unerheblich, ob f1 und f2 Faktoren oder kontinuierliche Variablen sind.<br/>\n<b>Wert</b><br/>\nEine ANOVA-ähnliche Tabelle mit einzelnen Termentfernungen von Zufallseffekten, die von der Klasse anova und data.frame mit den Spalten erben:</br>\nnpar: Anzahl der Modellparameter.</br>\nlogLik: die Log-Likelihood für das Modell. Beachten Sie, dass dies die REML-logLik ist, wenn das Modell mit REML angepasst wird.</br>\nAIC: der AIC für das Modell, bewertet als -2*(logLik - npar). Kleiner ist besser.</br>\nLRT: die Likelihood-Ratio-Teststatistik; das Zweifache der Differenz in der Log-Likelihood, die asymptotisch chi-quadrat verteilt ist.</br>\nDf: Freiheitsgrade für den Likelihood-Ratio-Test: die Differenz in der Anzahl der Modellparameter.</br>\nPr(>Chisq) :der p-Wert.</br>\n<b>Warnung</b></br>\nIn bestimmten Fällen können Tests von nicht geschachtelten Modellen generiert werden. Ein Beispiel ist, wenn (0 + poly(x, 2) | gr) reduziert wird (der Standard) auf (1 | gr). Nach unserem besten Wissen werden nicht geschachtelte Modellvergleiche nur in Fällen generiert, die statistischer Unsinn sind (wie in diesem Beispiel, wo der zufällige Schnittpunkt unterdrückt wird).</br>\nHinweis: Beachten Sie, dass anova verwendet werden kann, um zwei Modelle zu vergleichen und oft in der Lage ist, die gleichen Tests wie ranova zu produzieren. Dies ist jedoch nicht immer der Fall, wie in den Beispielen veranschaulicht wird.</br>\n<b>Beispiele</b><br/>\n<code> \n# Test der Reduzierung von (Days | Subject) auf (1 | Subject):<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # 2 df Test<br/>\n# Dieser Test kann auch mit anova() erreicht werden:<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# Veranschaulichen Sie das reduce.test-Argument:<br/>\n# Test der Entfernung von (Days | Subject):<br/>\nranova(fm1, reduce.terms = FALSE) # 3 df Test<br/>\n# Die Likelihood-Ratio-Teststatistik ist in diesem Fall:<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() ist nicht immer in der Lage, die gleichen Tests wie ranova() durchzuführen,<br/>\n# zum Beispiel:<br/>\nanova(fm1, fm3, refit=FALSE) # vergleicht REML mit ML und sollte nicht verwendet werden<br/>\nanova(fm1, fm3, refit=TRUE) # ist ein Test von ML-Anpassungen und nicht das, was wir suchen<br/>\n# Beachten Sie auch, dass die lmer-Anpassung zuerst kommen muss - nicht eine lm-Anpassung:<br/>\n# anova(fm3, fm1) # funktioniert nicht und gibt einen Fehler zurück<br/>\n# ranova() kann möglicherweise nicht alle relevanten Tests generieren:<br/>\n# Für das folgende Modell zeigt ranova() an, dass wir nicht reduzieren sollten<br/>\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Assessor), data=TVbo)<br/>\nranova(fm)<br/>\n# Ein passenderes Modell ist jedoch:<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Assessor), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm und fm2 haben im Wesentlichen die gleiche Anpassung an die Daten, aber fm verwendet 5 Parameter mehr als fm.<br/>\n</code> <br/>\n<b>Pakete</b></br>\nlmerTest</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogfelds oder führen Sie den folgenden Befehl im R-Syntax-Editor aus: help(ranova, package ='lmerTest')\n                "
  }
}