{
  "title": "Balkendiagramm",
  "navigation": "Balkendiagramm",
  "optionsLabels": "Optionen für Beschriftungen",
  "suppressLabels": "Alle Beschriftungen für Zählungen und Prozentsätze unterdrücken",
  "suppressThreshold": "Beschriftungen für Zählungen und Prozentsätze unter dem angegebenen Schwellenwertprozentsatz unterdrücken",
  "label1": "Klicken Sie auf die Registerkarte unten, um Zählung oder Mittelwert auszuwählen. Wenn Zählung ausgewählt ist, ist eine Y-Variable optional. Wenn Zählung ausgewählt ist und keine Y-Variable angegeben ist, werden die Zählungen der X-Variable angezeigt. Wenn Zählung angegeben ist und eine Y-Variable angegeben ist, werden die Werte der Y-Variable summiert. Wenn der Mittelwert ausgewählt ist, müssen Sie eine Y- und eine X-Variable auswählen. Mittelwerte werden für die Y-Variable(n) berechnet.",
  "x": "X-Variable, geben Sie eine kategoriale Variable an",
  "y": "Y-Variable(n), geben Sie eine numerische Variable(n) an",
  "fill": "Geben Sie eine kategoriale Variable an, um die Balken zu füllen",
  "dropna": "Fehlende Werte entfernen",
  "bottomlbl": "Balkendiagramm auswählen",
  "meanlbl": "Mittelwert",
  "countlbl": "Zählung",
  "fill1": "Wählen Sie eine Farbe für die Balken. Hinweis: Dies wird ignoriert, wenn eine Variable zum Füllen der Balken angegeben ist.",
  "legends": "Legenden anzeigen und wenn ja, Position der Legenden (Standard ist rechts)",
  "digitsCountDisplay": "Ziffern - Anzahl der Ziffern, die für Zählungen und Prozentsätze angezeigt werden sollen",
  "barType": "Art des Balkendiagramms",
  "stackedBar": "Gestapeltes Balkendiagramm",
  "sideBySide": "Gruppen nebeneinander anzeigen",
  "fillPercent": "Balken füllen",
  "errorBarOptions": "Fehlerbalken",
  "noErrBars": "Keine Fehlerbalken",
  "stderr": "Standardfehler",
  "stddev": "Standardabweichungen",
  "cilevel": "Geben Sie das Konfidenzniveau an:",
  "confidenceInterval": "Konfidenzniveau:",
  "drawSignificance": "Fügen Sie die Signifikanz (p-Werte) für den Mittelwertvergleich zwischen jedem Balkenpaar hinzu (Wählen Sie Facette zur Gruppierung der Analyse). Für tukey_hsd und games_howell_test sind die p-Werte bereits angepasst. Die zusätzliche Methode zur Anpassung der p-Werte wird ignoriert.",
  "methodForMeanDiffSignificance": "Testmethode, die zum Vergleichen der Mittelwerte verwendet wird",
  "adjPvalue": "P-Werte anpassen für den Vergleich der Mittelwerte, die durch die Testmethode erzeugt wurden",
  "pValueFromatting": "Format der angezeigten p-Werte (Signifikanz)",
  "alpha": "Opazität (0-1)",
  "flipBox": "Achse umdrehen",
  "specify_a_title": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "showErrorBar": "Zeigen Sie beide Enden des Fehlerbalkens (Standard), nur oben oder unten an",
  "Facetrow": "Facet-Reihe",
  "Facetcolumn": "Facet-Spalte",
  "Facetwrap": "Facet-Wickel",
  "Facetscale": "Facet-Skala",
  "relFreq": "Relative Häufigkeiten",
  "facets_lbl": "Facetten",
  "xyLimits": "X- und Y-Achsenlimits",
  "label5": "Geben Sie einen Bereich für X- und Y-Achsenwerte an",
  "rangeYValues": "Geben Sie den Y-Achsenbereich an, z. B. 0,100",
  "help": {
    "title": "Hilfe zum Balkendiagramm",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Ein Balkendiagramm oder Balkengrafik ist ein Diagramm, das gruppierte Daten mit rechteckigen Balken darstellt, deren Längen proportional zu den Werten sind, die sie repräsentieren. Die Balken können vertikal oder horizontal gezeichnet werden. Die Balken können nach einer optionalen Faktorvariablen gruppiert werden. Die Gruppen können auf einem einzelnen Balken gestapelt oder nebeneinander angezeigt werden. Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die X- und Y-Achse festlegen.\n        Sie können ein Balkendiagramm für eine einzelne Faktorvariable erstellen, die Balken stellen die Zählungen jeder Ebene der Faktorstufe dar. Hier wird die Faktorvariable auf der X-Achse sein, siehe Beispiel unten. Wenn das Kontrollkästchen für die relativen Häufigkeiten ausgewählt ist, zeigen wir die relative Häufigkeit anstelle der Zählungen auf der Y-Achse an.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=0.4) +\n         labs(x =\"year\",y =\"Count\",title= \"Balkendiagramm für X-Achse: Jahr, Y-Achse: Zählung\")\n        </code>\n        <br />\n        Sie können ein Balkendiagramm erstellen, indem Sie eine Skala/numerische Variable auf der Y-Achse platzieren und die Balken nach einer Faktorvariable füllen. Der Balken wird gefüllt, indem die Werte der Y-Variable für jede Ebene der Faktorvariable summiert werden, siehe Beispiel unten\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=0.4,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"Balkendiagramm für X-Achse:, Y-Achse: Gewicht, Füllung: Herkunft\")\n        </code>\n        <br />\n        Sie können eine X-Variable, Y-Variable und Füllung angeben. Der Balken wird gefüllt durch die Summe der Werte der Y-Variable für jede Ebene der X-Variable, gruppiert nach der Ebene der Variable, die in der Füllung angegeben ist.\n        Wenn Sie mehrere X-Variablen angeben, erstellen wir ein separates Balkendiagramm für jede X-Variable. \n        <br />\n        Verwendung:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Das Standarddatenset​\n        </li>\n        <li>\n        aes():    Generieren Sie ästhetische Zuordnungen, die beschreiben, wie Variablen in den Daten auf visuelle Eigenschaften (Ästhetik) von Geoms abgebildet werden.​\n        </li>\n        <li>\n        x: Eine Faktor-/kategoriale Variable. Die Länge des Balkens entspricht den Zählungen jeder Ebene der Faktorvariable.​\n        </li>\n        <li>\n        fill: Eine optionale Faktor-/kategoriale Variable, um die Zählungen der Ebenen in x zu gruppieren: (siehe oben)​\n        </li>\n        <li>\n        geom_bar(): Erstellt das Balkendiagramm, position =\"stack\" stapelt die Gruppen auf einem einzelnen Balken, position =\"dodge\" stapelt die Gruppen nebeneinander, position =\"fill\" füllt den Balken mit einem Prozentsatz jeder Gruppierungsebene.​\n        </li>\n        <li>\n        Labs(): Ändern Sie Achsenbeschriftungen und Legendentitel (dies ist optional)​\n        </li>\n        <li>\n        facet_grid(): Legen Sie Panels in einem Raster an (dies ist optional)​\n        </li>\n        <li>\n        theme_calc(): Gibt das Rechnerdesign an (dies ist optional)​\n        </li>\n        <li>\n        coord_flip(): Achse umdrehen (dies ist optional)​\n        </li>\n        <li>\n        alpha: Steuert die Opazität, nimmt Werte zwischen 0-1 an. 1 bedeutet keine Opazität.\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tWenn 'Fügen Sie die Signifikanz (p-Werte) für den Mittelwertvergleich zwischen jedem Balkenpaar hinzu' unter Mittelwert ausgewählt ist, lauten die Codes für die p-Werte im Diagramm wie folgt:\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tAnpassungsmethoden für P-Werte:\n\t\t<br/>\n\t\tDie Anpassungsmethoden für P-Werte umfassen die Bonferroni-Korrektur (\"bonferroni\"), bei der die p-Werte mit der Anzahl der Vergleiche multipliziert werden. Weniger konservative Korrekturen sind ebenfalls enthalten, darunter Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" oder sein Alias \"fdr\") und Benjamini & Yekutieli (2001) (\"BY\"), \n\t\tjeweils. Eine Durchlaufoption (\"none\") ist ebenfalls enthalten. Die Menge der Methoden ist im p.adjust.methods-Vektor enthalten, \n\t\tzum Nutzen von Methoden, die die Methode als Option haben müssen und sie an p.adjust weitergeben.\n\t\t<br/>\n\t\t<br/>\n\t\tDie ersten vier Methoden sind darauf ausgelegt, eine starke Kontrolle der familiären Fehlerquote zu gewährleisten. Es scheint keinen Grund zu geben, die \n\t\tunmodifizierte Bonferroni-Korrektur zu verwenden, da sie von der Holm-Methode dominiert wird, die auch unter willkürlichen Annahmen gültig ist.\n\t\t<br/>\n\t\t<br/>\n\t\tDie Methoden von Hochberg und Hommel sind gültig, wenn die Hypothesentests unabhängig sind oder wenn sie nicht negativ assoziiert sind \n\t\t(Sarkar, 1998; Sarkar und Chang, 1997). Die Hommel-Methode ist leistungsfähiger als die Hochberg-Methode, aber der Unterschied ist normalerweise gering \n\t\tund die Hochberg-p-Werte sind schneller zu berechnen.\n\t\t<br/>\n\t\t<br/>\n\t\tDie \"BH\" (auch \"fdr\") und \"BY\"-Methoden von Benjamini, Hochberg und Yekutieli kontrollieren die falsche Entdeckungsrate, den erwarteten \n\t\tAnteil falscher Entdeckungen unter den abgelehnten Hypothesen. Die falsche Entdeckungsrate ist eine weniger strenge Bedingung als \n\t\tdie familiäre Fehlerquote, sodass diese Methoden leistungsfähiger sind als die anderen.\n\t\t<br/>\n\t\t<br/>\n\t\tSiehe auch \n\t\t<br />\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br />\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br />\n\t\t<br />\n        Paket: ggplot2, ggthemes​\n        <br />\n        Sonstiges: Klicken Sie auf die R-Hilfe-Schaltfläche, um detaillierte R-Hilfe zu erhalten. Sie können auch help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) eingeben​\n        "
  }
}