{
  "title": "Ein abgestimmtes Modell mit Bootstrap-Resampling erstellen",
  "navigation": "Bootstrap-Resampling",
  "modelname": "Geben Sie den Namen für das abgestimmte Modell ein",
  "iterator": "Geben Sie die Anzahl der Resampling-Iterationen ein",
  "dependent": "Zu prognostizierende Variable",
  "levelOfInterest": "Wenn die zu prognostizierende Variable 2 Ebenen hat, geben Sie die Ebene von Interesse an. Die Verwirrungsmatrix und verwandte Statistiken werden mit der angegebenen Ebene von Interesse als Referenz angezeigt.",
  "independent": "Unabhängige Variablen",
  "label1": "EINIGE MODELLE REAGIEREN EMPFINDLICH AUF FEHLENDE WERTE ODER ABHÄNGIGE VARIABLEN, DIE FAKTOREN SIND. ZUM UMGANG MIT FEHLENDEN WERTEN, SIEHE [ VARIABLEN > FEHLENDE WERTE ] UND FÜR DUMMY-CODIERUNG VON FAKTORVARIABLEN, SIEHE [ VARIABLEN > BERECHNEN > DUMMY-CODE ]. Klicken Sie auf das ?-Symbol oben rechts im Dialog für Details.",
  "ModelSelection": "Wählen Sie eine Modellkategorie und dann den Typ des Modells aus",
  "help": {
    "title": "Ein abgestimmtes Modell mit Bootstrap-Resampling erstellen",
    "r_help": "help(train, package=caret)",
    "body": "\n<b>Beschreibung</b></br>\nBootstrap-Resampling verwendet die Funktionen trainControl und train innerhalb des caret-Pakets, um ein abgestimmtes/optimiertes Modell zu erstellen.<br/>\nEin abgestimmtes Modell wird durch Resampling der Ergebnisse über die Abstimmungsparameter erstellt. Die Ergebnisse der Abstimmung werden unter den Tabellen am Ende der Ausgabe angezeigt.<br/>\nSobald das abgestimmte Modell erstellt ist, treffen wir Vorhersagen mit dem abgestimmten Modell gegen den Trainingsdatensatz (der zur Erstellung des Modells verwendet wurde) und zeigen die Verwirrungsmatrix und verwandte Statistiken an.<br/>\nHINWEIS: Siehe URL unter https://www.blueskystatistics.com/Articles.asp?ID=330 für Details zu Modellen, die abhängige Variablen benötigen, die dummy-codiert werden müssen, und entsprechende Anforderungen für unterstützte abhängige Variablen. Auch einige Modelle unterstützen keine fehlenden Werte. Wenn beim Erstellen des Modells Fehler angezeigt werden, entfernen Sie fehlende Werte.<br/>\nDas abgestimmte Modell wird im Objekt der Klasse train mit einem Namen gespeichert, den Sie im Textfeld angegeben haben.<br/>\nDie für das endgültige abgestimmte Modell ausgewählten Parameterwerte werden am Ende der Ausgabe angezeigt.<br/>\nIm Fall von Prädiktoren mit 2 Ebenen haben Sie die Möglichkeit, die Referenzebene/Ebene von Interesse auszuwählen.<br/>\nDie Verwirrungsmatrix und verwandte Statistiken werden unter Verwendung der angegebenen Ebene von Interesse erstellt.<br/>\n<code> \ntrain_control <- caret::trainControl(method=\"boot\", number=5)<br/>\n#Allgemeine Syntax<br/>\ntunedModel <- caret::train(x = Beispiel-Daten zum Trainieren des Modells, y = abhängige Variable, trControl = train_control, method = \"das zu verwendende Modell\", prob.model=TRUE )<br/>\n#Beispiel für ausgefüllte Syntax<br/>\ntunedModel <- caret::train(as.data.frame(TrainData), dependentVariable, trControl=train_control, method = \"adaboost\", preProcess = NULL, prob.model = TRUE )<br/>\n</code>\nWir generieren eine Verwirrungsmatrix und Modellgenauigkeitsstatistiken für das abgestimmte Modell. Dies geschieht wie folgt:\n<ul>\n<li>\nWir generieren vorhergesagte Werte aus dem Trainingsdatensatz, indem wir die Funktion predict auf dem optimierten Modell der Klasse train aufrufen (intern wird predict.train die Funktion im caret-Paket sein, die R aufruft)<br/>\n<code> \npredictedValues = predict(tunedModel, das von der train-Funktion zurückgegeben wird)<br/>\n</code> <br/>\n</li>\n<li>\nWir berechnen die Genauigkeitsstatistiken aus der Verwirrungsmatrix, die wie folgt generiert wird:<br/>\n<code> \ncaret::confusionMatrix (predictions = predictedValues, reference = abhängige Variable des Modells)<br/>\n</code> \n</li>\n</ul>\nSie können das endgültige abgestimmte/optimierte Modell verwenden, um einen Datensatz zu bewerten. Gehen Sie dazu wie folgt vor:<br/>\n1. Gehen Sie zu dem Datensatz, den Sie bewerten möchten. Hinweis: Die Variablennamen im zu bewertenden Datensatz (auch bekannt als unabhängige Variablen) müssen mit den Variablennamen übereinstimmen, die Sie im Datensatz verwendet haben, um das abgestimmte Modell ursprünglich zu erstellen. Andernfalls wird ein Fehler angezeigt. Diese Fehlermeldung wird im Abschnitt der diagnostischen Tests im Modellbewertungsdialog angezeigt, siehe Punkt 2 unten. <br/>\n2. Öffnen Sie den Dialog zur Modellbewertung unter Modellbewertung>Vorhersage>Modellbewertung. <br/>\n3. Wählen Sie ein Modell aus, das Sie verwenden möchten, um den Datensatz zu bewerten. Sie können die Modelle, die Sie erstellt haben, nach Klasse filtern. <br/>\n4. Sobald Sie das Modell ausgewählt haben, geben Sie ein Präfix an, das verwendet werden soll, um die vorhergesagten Werte zu speichern. Sie können optional Konfidenzintervalle für die Vorhersagen speichern und eine Verwirrungsmatrix generieren. Sie müssen ein Präfix für die Variable angeben, die die Vorhersagen/Wertungen enthält. Die Vorhersagen und vorhergesagten Wahrscheinlichkeiten, wo zutreffend, werden als neue Variablen am Ende des Datensatzes gespeichert. Wenn das angegebene Präfix beispielsweise AA ist, werden die Vorhersagen in einer Variablen AA_original abhängige Variablenname_Vorhersagen gespeichert, die vorhergesagten Wahrscheinlichkeiten werden in einer Variablen AA_Ebene1_VorhergesagteWahrscheinlichkeiten gespeichert. <br/>\n5. Klicken Sie auf die Schaltfläche Ausführen, um den Datensatz zu bewerten. <br/>\n<b>Paket</b></br>\ncaret</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol oben rechts in diesem Dialog oder führen Sie den folgenden Befehl help(train, package ='caret') im R-Editorfenster aus."
  }
}