{
  "title": "Boxplot mit Multi-Vari-Gruppierung",
  "navigation": "Boxplot, Multi-Vari",
  "response": "Variable, die für das Boxplot verwendet werden soll (eine numerische Variable)",
  "YaxisGroup": "Y-Variable (eine Kategorie) für die Y-Achse",
  "XaxisGroup": "X-Variable (eine Kategorie) für die X-Achse",
  "withinXaxisGroup": "Eine oder mehrere Gruppierungsvariablen (Kategorien), um Boxplots innerhalb der X-Achse zu gruppieren",
  "flipaxisChk": "Achse umkehren",
  "connectMeanPointsChk": "Die Mittelwerte verbinden",
  "connectMedianPointsChk": "Die Mediane verbinden",
  "showMeanPointsChk": "Mittelwerte anzeigen (wenn nicht verbunden)",
  "showMinMaxNumberChk": "Min- und Max-Werte pro Y-Achsen-Kategorie auf dem Diagramm anzeigen",
  "showMeanNumberChk": "Mittelwert auf dem Diagramm anzeigen",
  "showMedianNumberChk": "Medianwert auf dem Diagramm anzeigen",
  "showQuantileNumberChk": "Quantil (Q1 und Q3) Wert auf dem Diagramm anzeigen",
  "showStatTableChk": "Alle Statistiken in einer Tabelle drucken",
  "chartTitle": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "meanPointColor": "Wählen Sie eine Farbe für die Mittelwerte (Nach der Farbauswahl, klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "meanPointSize": "Größe der Mittelwerte (Standard = 1,15)",
  "boxPlotWidth": "Vertikale Breite des Boxplots (Standard = 0,4)",
  "keepOriginalScaleChk": "Die ursprüngliche Skala der ausgewählten numerischen Variable beibehalten",
  "factorLevelOccuranceOrderChk": "Alle Kategorien in der Reihenfolge ihrer Vorkommen für das Plotten neu anordnen",
  "legends": "Legenden anzeigen und wenn ja, Position der Legenden (Standard ist rechts)",
  "help": {
    "title": "Boxplot mit spezieller Gruppierung (Multi-Vari)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tOrganisation von Untergruppen (d.h. Stichprobengruppe) für Prozessfähigkeit und andere Untergruppenanalysen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tAnalysen wie die Prozessfähigkeitsanalyse setzen voraus, dass die Daten in der Reihenfolge eingegeben werden, in der sie gesammelt wurden (chronologische Reihenfolge). Das bedeutet, dass alle Beobachtungen aus der gleichen Untergruppe in aufeinanderfolgenden Zeilen des Datensatzes erscheinen müssen. Eine Spalte für die Untergruppen-ID wird typischerweise verwendet, um zu definieren, welche Zeilen zur gleichen Untergruppe gehören.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWenn diese Bedingung nicht erfüllt ist (zum Beispiel, wenn Zeilen aus der gleichen Untergruppe im Datensatz verstreut sind und nicht nebeneinander stehen), müssen die Untergruppen-IDs neu kalibriert werden.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tNeukalibrierung bedeutet:\n\t\t\t\t<br/>\n\t\t\t\tEine neue Untergruppennummer wird immer dann zugewiesen, wenn sich die Untergruppen-ID von einer Zeile zur nächsten ändert.\n\t\t\t\t<br/>\n\t\t\t\tWenn die gleiche Untergruppen-ID später wieder erscheint, aber nicht benachbart zu ihrem vorherigen Vorkommen ist, wird sie als neue Untergruppe behandelt.\n\t\t\t\t<br/>\n\t\t\t\tMit anderen Worten, nur identische Werte, die nebeneinander erscheinen, werden als Teil der gleichen Untergruppe betrachtet. Identische Werte, die durch andere Untergruppen getrennt sind, werden während der Neukalibrierung in separate Untergruppen aufgeteilt.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDie neu kalibrierte Stichprobennummer-Variable im Datensatz ist notwendig, um viele Analysen durchzuführen, z.B. Prozessfähigkeit, Shewhart-Diagramme wie xbar, R, S usw.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}