{
  "title": "Box Plot",
  "navigation": "Box Plot",
  "x": "X-Variable, geben Sie eine Kategorische Variable an",
  "y": "Y-Variable(n), geben Sie eine(n) numerische(n) Variable(n) an",
  "Fill": "Geben Sie eine Gruppierungs-(Kategorische) Variable an",
  "flipaxis": "Achse umdrehen",
  "dataPoints": "Wählen Sie eine Option zum Plotten der Datenpunkte",
  "alpha": "Opazität (0-1)",
  "notch": "Kerbe",
  "outliers": "Ausreißer anzeigen (in Rot)",
  "barcolor": "Wählen Sie eine Farbe für die Linien um die Kästen (Nach der Farbauswahl außerhalb der Steuerung klicken, um anzuwenden)",
  "showCountsChk": "Werte auf dem Kasten anzeigen (1Q, Median, 3Q)",
  "drawSignificanceChk": "Fügen Sie Signifikanz (p-Werte) für den Mittelwertvergleich zwischen jedem Kastenpaar hinzu (Wählen Sie Facette zur Gruppierung der Analyse). Für tukey_hsd und games_howell_test sind die p-Werte bereits angepasst. Die zusätzliche Methode zur Anpassung der p-Werte wird ignoriert.",
  "methodForMeanDiffSignificance": "Testmethode zur Vergleich von Mittelwerten",
  "adjPvalue": "P-Werte anpassen aus dem Vergleich von Mittelwerten",
  "pValueFromatting": "Format der angezeigten p-Werte (Signifikanz)",
  "specify_a_title": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "legends": "Legenden anzeigen und falls ja, Position der Legenden (Standard ist rechts)",
  "angleXaxis_text": "Winkel zum Neigen der x-Achsen-Textwerte (Standard 0 für kein Neigen)",
  "angleYaxis_text": "Winkel zum Neigen der y-Achsen-Textwerte (Standard 0 für kein Neigen)",
  "axisTickmarksCount": "Wie viele Achsenwerte (d.h. Tickmark) angezeigt werden sollen (Standard 10)",
  "positionJitterWidth": "Jitter-Punkte Streuung (Wählen Sie einen Wert zwischen 0 und 1. Standard ist 0.2)",
  "Facetrow": "Facette Reihe",
  "Facetcolumn": "Facette Spalte",
  "Facetwrap": "Facette umwickeln (wenn gewählt, wird jede Auswahl der Facette Reihe und Spalte ignoriert)",
  "Facetscale": "Facette Maßstab",
  "label1": "Horizontale Linien",
  "connectMedianPointsChk": "Verbinden Sie die Medianpunkte über die Kästen",
  "connectMeanPointsChk": "Verbinden Sie die Mittelwertpunkte über die Kästen",
  "plotMedianLineChk": "Plotte eine horizontale Linie für den Gesammedian der Y (numerischen) Variable",
  "plotMeanLineChk": "Plotte eine horizontale Linie für den Gesammittelwert der Y (numerischen) Variable",
  "yIntercept": "Geben Sie durch Kommas getrennte Y-Achsenabschnittswerte für die horizontalen Linien ein, z.B. 100, 200, 300",
  "hLineColor": "Wählen Sie eine Farbe für die Linie(n) und Beschriftung(en) (Nach der Farbauswahl außerhalb der Steuerung klicken, um anzuwenden)",
  "lineType": "Wählen Sie den Linientyp",
  "horizontalLinelabel": "Geben Sie durch Kommas getrennte Beschriftungen (ohne umschließende Anführungszeichen) für die horizontalen Linie(n) an",
  "horizontalLinelabel_angle_text": "Winkel zum Neigen der horizontalen Linienbeschriftung (Standard 0 für kein Neigen)",
  "label2": "Hinweis: Größere Werte verschieben den Text nach unten, kleinere Werte verschieben den Text nach oben",
  "addHoriRefLines": "Fügen Sie Referenzlinien hinzu",
  "xyLimits": "X- und Y-Achsenlimits",
  "label5": "Geben Sie einen Bereich für X- und Y-Achsenwerte an",
  "rangeYValues": "Geben Sie den Y-Achsenbereich an, z.B. 0,100",
  "labelHori_HorizontalJustification": "Hinweis: Größere Werte platzieren den Text nach links, kleinere Werte verschieben den Text nach rechts",
  "verticalJustification": "Steuern Sie die vertikale Rechtfertigung der Beschriftung",
  "hori_HorizontalJustification": "Steuern Sie die horizontale Rechtfertigung der Beschriftung",
  "addlLabelHlineTextPositionOffset": "Zusätzliche Anpassungen zur Positionierung des Beschriftungstextes für horizontale Linien",
  "horiMovementHReflineLabel": "Bewegen Sie den Text horizontal nach links oder rechts - verwenden Sie eine beliebige Zahl mit + oder - Zeichen (lassen Sie 0 für die Kategorische Achse)",
  "nobreaklineHRefLabelandValueChk": "Aktivieren Sie dieses Kontrollkästchen, um den Zeilenumbruch zwischen Beschriftungswert und Beschriftungstext zu entfernen",
  "vertiMovementHReflineLabel": "Bewegen Sie den Text vertikal nach oben oder unten - verwenden Sie eine beliebige Zahl mit + oder - Zeichen (lassen Sie 0 für die Kategorische Achse)",
  "facets_lbl": "Facetten",
  "help": {
    "title": "Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Beschreibung</b></br>\n        In der deskriptiven Statistik ist ein Boxplot oder Box-Plot eine bequeme Möglichkeit, Gruppen numerischer Daten grafisch durch ihre Quartile darzustellen. Boxplots können auch Linien haben, die vertikal von den Kästen (Schnurrhaare) ausgehen und die Variabilität außerhalb der oberen und unteren Quartile anzeigen, daher die Begriffe Box-and-Whisker-Plot und Box-and-Whisker-Diagramm. Ausreißer können als einzelne Punkte dargestellt werden. Box- und Whisker-Plots sind einheitlich in ihrer Verwendung des Kastens: Der Boden und die Oberseite des Kastens sind immer das erste und dritte Quartil, und das Band innerhalb des Kastens ist immer das zweite Quartil (der Median). Das obere Schnurrhaar erstreckt sich von dem Gelenk bis zum höchsten Wert, der innerhalb von 1,5 * IQR des Gelenks liegt, wobei IQR der Interquartilsabstand oder der Abstand zwischen dem ersten und dritten Quartil ist. Das untere Schnurrhaar erstreckt sich von dem Gelenk bis zum niedrigsten Wert innerhalb von 1,5 * IQR des Gelenks. Daten, die über das Ende der Schnurrhaare hinausgehen, sind Ausreißer und werden als Punkte dargestellt (wie von Tukey angegeben).​</br>\n        Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die x- und y-Achse angeben​</br>\n        Wenn Sie die Option wählen, die Datenpunkte zu plotten, tun wir dies mit geom_dotplot</br>\n        Standardmäßig werden Ausreißer mit schwarzen Punkten angezeigt. Wenn Sie die Option wählen, Ausreißer (in Rot) über das Kontrollkästchen anzuzeigen, werden Ausreißer deutlicher hervorgehoben.\n        <br/>\n        <b>Verwendung</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumente</b><br/>\n        <ul>\n        <li>\n        data: Das Standarddatensatz​\n        </li>\n        <li>\n        x: Eine Faktor-/kategorische Variable, die die Gruppierung der y-Variable definiert​\n        </li>\n        <li>\n        y: Eine numerische Variable, für die der Boxplot berechnet wird​\n        </li>\n        <li>\n        fill: Eine optionale Faktor-/kategorische Variable, um die bestehenden Gruppen weiter zu gruppieren. Jede Untergruppe wird in einer eigenen Farbe angezeigt.​\n        </li>\n        <li>\n        aes():    Generieren Sie ästhetische Zuordnungen, die beschreiben, wie Variablen in den Daten auf visuelle Eigenschaften (Ästhetik) von Geoms abgebildet werden.​\n        </li>\n        <li>\n        geom_boxplot(): Erstellt den Boxplot. Die oberen und unteren \"Gelenke\" entsprechen den ersten und dritten Quartilen (den 25. und 75. Perzentilen).​\n        </li>\n        <li>\n        geom_dotplot: Plottet die Datenpunkte\n        </li>\n        <li>\n        Labs(): Ändern Sie Achsenbeschriftungen und Legendentitel (dies ist optional)​\n        </li>\n        <li>\n        facet_grid(): Legen Sie Panels in einem Gitterlayout an (dies ist optional)​\n        </li>\n        <li>\n        theme_calc(): Gibt das Rechner-Thema an (dies ist optional)​\n        </li>\n        <li>\n        coord_flip(): Achse umdrehen (dies ist optional)​\n        </li>\n        <li>\n        notch: Notched Boxplots wenden eine \"Kerbe\" oder Verengung des Kastens um den Median an. Kerben sind nützlich, um einen groben Hinweis auf die Signifikanz des Unterschieds der Mediane zu bieten; wenn sich die Kerben von zwei Kästen nicht überlappen, bietet dies einen Hinweis auf einen statistisch signifikanten Unterschied zwischen den Mediane. In einem notched Boxplot erstrecken sich die Kerben 1,58 * IQR / sqrt(n)\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tWenn 'Fügen Sie Signifikanz (p-Werte) für den Mittelwertvergleich zwischen jedem Kastenpaar hinzu' ausgewählt ist, sind die Codes für p-Werte auf dem Plot wie folgt\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tAnpassungsmethoden für P-Werte:\n\t\t<br/>\n\t\tDie Anpassungsmethoden für P-Werte umfassen die Bonferroni-Korrektur (\"bonferroni\"), bei der die p-Werte mit der Anzahl der Vergleiche multipliziert werden. Weniger konservative Korrekturen sind ebenfalls enthalten, wie Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), Hommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" oder sein Alias \"fdr\") und Benjamini & Yekutieli (2001) (\"BY\"), jeweils. Eine Pass-Through-Option (\"none\") ist ebenfalls enthalten. Die Methoden sind im p.adjust.methods-Vektor enthalten, um den Methoden, die die Methode als Option benötigen, zu helfen und sie an p.adjust weiterzugeben.\n\t\t<br/>\n\t\t<br />\n\t\tDie ersten vier Methoden sind darauf ausgelegt, eine starke Kontrolle der Familienfehlerquote zu gewährleisten. Es scheint keinen Grund zu geben, die unmodifizierte Bonferroni-Korrektur zu verwenden, da sie von der Holm-Methode dominiert wird, die auch unter willkürlichen Annahmen gültig ist.\n\t\t<br/>\n\t\t<br />\n\t\tDie Methoden von Hochberg und Hommel sind gültig, wenn die Hypothesentests unabhängig sind oder wenn sie nicht negativ assoziiert sind (Sarkar, 1998; Sarkar und Chang, 1997). Die Methode von Hommel ist leistungsfähiger als die von Hochberg, aber der Unterschied ist normalerweise gering und die Hochberg-p-Werte sind schneller zu berechnen.\n\t\t<br/>\n\t\t<br />\n\t\tDie Methoden \"BH\" (auch \"fdr\") und \"BY\" von Benjamini, Hochberg und Yekutieli kontrollieren die Falsch-Entdeckungs-Rate, den erwarteten Anteil an falschen Entdeckungen unter den abgelehnten Hypothesen. Die Falsch-Entdeckungs-Rate ist eine weniger strenge Bedingung als die Familienfehlerquote, sodass diese Methoden leistungsfähiger sind als die anderen.\n\t\t<br/>\n\t\t<br />\n\t\tSiehe auch \n\t\t<br />\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br />\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br />\n\t\t<br />\n        <b>Paket</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Hilfe</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Klicken Sie auf die R-Hilfe-Schaltfläche, um detaillierte R-Hilfe zu erhalten. Sie können auch help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help(geom_dotplot) eingeben\n        "
  }
}