{
  "title": "Korrelation der Übereinstimmung, mehrere Bewerter",
  "navigation": "Korrelation der Übereinstimmung, mehrere Bewerter",
  "ratervars": "Bewertervariablen, mindestens 2",
  "cilevel": "Konfidenzniveau:",
  "bootsamp": "Anzahl der Bootstrap-Stichproben",
  "plotoptionslabel": "Plot-Optionen",
  "plotchkbox": "Streudiagramme für alle Bewerterpaare",
  "plottitle": "Titel",
  "varlabels": "Variablenbezeichnungen (falls verwendet, müssen Bezeichnungen für alle Variablen in der Reihenfolge angegeben werden, als 'Bezeichnung 1', 'Bezeichnung 2' usw.)",
  "plottheme": "Plot-Thema",
  "help": {
    "title": "Korrelation der Übereinstimmung, mehrere Bewerter",
    "r_help": "help(epi.occc,package=epiR)",
    "body": "\nDer Korrelation der Übereinstimmung Koeffizient (CCC) misst die Übereinstimmung zwischen Beobachtern, die dieselben Subjekte auf derselben Skala für kontinuierliche Daten messen. Der CCC kann zwischen \n-1 und 1 liegen, wobei 1 perfekte Übereinstimmung und 0 keine Übereinstimmung bedeutet. Negative Werte zeigen negative Übereinstimmung an, sind jedoch in der Praxis selten. Der gesamte CCC und die paarweisen CCC's \n(alle Paare von Bewertern) werden mit Bootstrap-Perzentil- und angepassten Bootstrap-Perzentil-Konfidenzintervallen berechnet. Jede Beobachtung mit einem fehlenden Wert für die angegebenen Bewertervariablen wird aus der Analyse entfernt.\n<br/><br/>\n<b>Bewertervariablen:</b> Variablen, die die von den Beobachtern bereitgestellten Werte enthalten; müssen numerisch sein\n<br/>\n<b>Konfidenzintervallniveau:</b> Gewünschtes Konfidenzintervallniveau für den CCC\n<br/>\n<b>Anzahl der Bootstrap-Stichproben:</b> Die gewünschte Anzahl von Bootstrap-Stichproben, die aus den Originaldaten gezogen werden sollen, um die Konfidenzintervalle zu berechnen. Mindestens 1000 wird empfohlen, \nsofern praktisch machbar.\n<br/>\n<b>Streudiagramme für alle Bewerterpaare:</b> Option zur Erstellung von Streudiagrammen für alle Paare von Bewertern in einem Matrixformat.   \n<br/><br/>\n<b>Erforderliche R-Pakete:</b> epiR, boot, GGally, ggthemes\n                "
  }
}