{
  "title": "Chi-Quadrat-Test",
  "navigation": "Chi-Quadrat-Test",
  "target": "Ausgewählte Variablen",
  "proportions": "Test gegen gleiche Proportionen oder geben Sie Proportionen ein, gegen die getestet werden soll. Wenn Ihre Variable Geschlecht ist, lassen Sie dieses Steuerfeld leer, um auf gleiche Proportionen zu testen. Um auf 20 % Frauen, 80 % Männer zu testen, geben Sie 0.2,0.8 ein. Geben Sie eine Proportion für jede Ebene ein. Die Proportionen müssen insgesamt 1 ergeben.",
  "help": {
    "title": "Chi-Quadrat-Test",
    "r_help": "help(chisq.test, package=stats)",
    "body": "\n<b>Beschreibung</b></br>\nchisq.test führt Chi-Quadrat-Kontingenztest und Anpassungstest durch.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code>\nchisq.test(x, y = NULL, correct = TRUE,\n            p = rep(1/length(x), length(x)), rescale.p = FALSE,\n            simulate.p.value = FALSE, B = 2000)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: ein numerischer Vektor oder eine Matrix. x und y können auch beide Faktoren sein.\n</li>\n<li>\ny: ein numerischer Vektor; wird ignoriert, wenn x eine Matrix ist. Wenn x ein Faktor ist, sollte y ein Faktor der gleichen Länge sein.\n</li>\n<li>\ncorrect: ein logisches, das angibt, ob eine Kontinuitätskorrektur bei der Berechnung der Teststatistik für 2x2-Tabellen angewendet werden soll: eine Hälfte wird von allen |O - E|-Differenzen abgezogen; die Korrektur wird jedoch nicht größer als die Differenzen selbst sein. Es wird keine Korrektur vorgenommen, wenn simulate.p.value = TRUE.\n</li>\n<li>\np: ein Vektor von Wahrscheinlichkeiten der gleichen Länge wie x. Ein Fehler wird angezeigt, wenn ein Eintrag von p negativ ist.\n</li>\n<li>\nrescale.p: ein logischer Skalar; wenn TRUE, wird p (falls erforderlich) so skaliert, dass es 1 ergibt. Wenn rescale.p FALSE ist und p nicht 1 ergibt, wird ein Fehler angezeigt.\n</li>\n<li>\nsimulate.p.value: ein logisches, das angibt, ob p-Werte durch Monte-Carlo-Simulation berechnet werden sollen.\n</li>\n<li>\nB: eine ganze Zahl, die die Anzahl der Replikate angibt, die im Monte-Carlo-Test verwendet werden.\n</li>\n</ul>\n<b>Beschreibung</b><br/>\nWenn x eine Matrix mit einer Zeile oder Spalte ist oder wenn x ein Vektor ist und y nicht angegeben ist, wird ein Anpassungstest durchgeführt (x wird als eindimensionales Kontingenztable behandelt). Die Einträge von x müssen nicht-negative ganze Zahlen sein. In diesem Fall wird die Hypothese getestet, ob die Populationswahrscheinlichkeiten den in p angegebenen entsprechen oder alle gleich sind, wenn p nicht angegeben ist.\nWenn x eine Matrix mit mindestens zwei Zeilen und Spalten ist, wird sie als zweidimensionales Kontingenztable betrachtet: die Einträge von x müssen nicht-negative ganze Zahlen sein. Andernfalls müssen x und y Vektoren oder Faktoren der gleichen Länge sein; Fälle mit fehlenden Werten werden entfernt, die Objekte werden in Faktoren umgewandelt, und das Kontingenztable wird aus diesen berechnet. Dann wird der Chi-Quadrat-Test von Pearson für die Nullhypothese durchgeführt, dass die gemeinsame Verteilung der Zellzahlen in einem zweidimensionalen Kontingenztable das Produkt der Zeilen- und Spaltenrandverteilungen ist.<br/>\nWenn simulate.p.value FALSE ist, wird der p-Wert aus der asymptotischen Chi-Quadrat-Verteilung der Teststatistik berechnet; die Kontinuitätskorrektur wird nur im 2x2-Fall verwendet (wenn correct TRUE ist, was die Standardeinstellung ist). Andernfalls wird der p-Wert für einen Monte-Carlo-Test (Hope, 1968) mit B Replikaten berechnet.\nIm Fall des Kontingenztable wird die Simulation durch Zufallsstichproben aus der Menge aller Kontingenztable mit gegebenen Randverteilungen durchgeführt und funktioniert nur, wenn die Randverteilungen strikt positiv sind. Die Kontinuitätskorrektur wird niemals verwendet, und die Statistik wird ohne sie angegeben. Beachten Sie, dass dies nicht die übliche Stichproben-Situation ist, die für den Chi-Quadrat-Test angenommen wird, sondern eher die für den exakten Test von Fisher.<br/>\nIm Fall der Anpassung wird die Simulation durch Zufallsstichproben aus der diskreten Verteilung durchgeführt, die durch p angegeben wird, wobei jede Stichprobe die Größe n = sum(x) hat. Diese Simulation wird in R durchgeführt und kann langsam sein.<br/>\n<b>Wert</b></br>\nEine Liste mit der Klasse \"htest\", die die folgenden Komponenten enthält:</br>\nstatistic: der Wert der Chi-Quadrat-Teststatistik.</br>\nparameter: die Freiheitsgrade der approximativen Chi-Quadrat-Verteilung der Teststatistik, NA, wenn der p-Wert durch Monte-Carlo-Simulation berechnet wird.</br>\np.value: der p-Wert für den Test.</br>\nmethod: eine Zeichenfolge, die den Typ des durchgeführten Tests angibt und ob Monte-Carlo-Simulation oder Kontinuitätskorrektur verwendet wurde.</br>\ndata.name: eine Zeichenfolge, die den Namen/die Namen der Daten angibt.</br>\nobserved: die beobachteten Zählungen.</br>\nexpected: die erwarteten Zählungen unter der Nullhypothese.</br>\nresiduals: die Pearson-Restwerte, (beobachtet - erwartet) / sqrt(erwartet).</br>\nstdres: standardisierte Restwerte, (beobachtet - erwartet) / sqrt(V), wobei V die Restzellenvarianz ist (Agresti, 2007, Abschnitt 2.4.5 für den Fall, dass x eine Matrix ist, n * p * (1 - p) andernfalls).​​</br>\n<b>Beispiele</b><br/>\n<code> \n## Aus Agresti(2007) S.39\nM <- as.table(rbind(c(762, 327, 468), c(484, 239, 477)))</br>\ndimnames(M) <- list(gender = c(\"F\", \"M\"),</br>\n                    party = c(\"Demokrat\",\"Unabhängig\", \"Republikaner\"))</br>\n(Xsq <- chisq.test(M))  # Druckt Testzusammenfassung</br>\nXsq$observed   # beobachtete Zählungen (gleich wie M)</br>\nXsq$expected   # erwartete Zählungen unter der Null</br>\nXsq$residuals  # Pearson-Restwerte</br>\nXsq$stdres     # standardisierte Restwerte</br>\n</br>\n## Effekt der Simulation von p-Werten</br>\nx <- matrix(c(12, 5, 7, 7), ncol = 2)</br>\nchisq.test(x)$p.value           # 0.4233</br>\nchisq.test(x, simulate.p.value = TRUE, B = 10000)$p.value</br>\n                                # etwa 0.29!</br>\n</code> <br/>\n<b>Pakete</b></br>\nstats</br>\n<b>Hilfe</b></br>\nhelp(chisq.test, package ='caret')      \n"
  }
}