{
  "title": "ROC-Kurven vergleichen",
  "navigation": "ROC-Kurven vergleichen",
  "outcomevar": "Binäre Ergebnisvariable (numerisch/Faktor)",
  "predprobvars": "Vorhergesagte Wahrscheinlichkeitsvariablen aus jedem Modell, geben Sie mindestens 2 an",
  "outcomeorderlabel": "Ergebnis 'Positiver' Wert",
  "outcomeorderhigh": "Höherer geordneter Wert",
  "outcomeorderlow": "Niedrigerer geordneter Wert",
  "specopt": "Spezifität anstelle von 1-Spezifität plotten",
  "cilevel": "Konfidenzniveau",
  "multcompopt": "Anpassung für mehrere Vergleiche",
  "multcompmethod": "Methode für mehrere Vergleiche",
  "plotoptions": "Plot-Optionen",
  "plottitle": "Plot-Titel",
  "plottitlesize": "Plot-Titelgröße (5-50)",
  "themedropdown": "Plot-Thema",
  "lineoptionslabel": "Linienoptionen",
  "linesize": "Liniengröße (0-5)",
  "colorpalette": "Farbschema",
  "axisoptionslabel": "Achsenoptionen",
  "axislabelsize": "Achsenbeschriftungsgröße (5-50)",
  "ticklabelsize": "Achsenmarkierungsbeschriftungsgröße (5-50)",
  "legendoptionslabel": "Legendenoptionen",
  "legendtitle": "Titel",
  "legendpos": "Position",
  "curvelabels": "Kurvenbeschriftungen, geben Sie an als 'Label 1', 'Label 2', 'Label 3'; verwenden Sie \\n innerhalb einer Beschriftung für einen Zeilenumbruch",
  "legendfontsize": "Größe der Legendenbeschriftungen (5-50)",
  "help": {
    "title": "ROC-Kurven vergleichen",
    "r_help": "help(roc.test, package = 'pROC')",
    "body": "\nDieser Dialog vergleicht die Receiver Operating Characteristic (ROC)-Kurven anhand einer Reihe von vorhergesagten Wahrscheinlichkeiten aus einem Modell (z.B. logistische Regression). Jedes Modell muss\nmit derselben Reihenfolge der Ergebnisvariablen angepasst worden sein. Es bietet eine Tabelle der einzelnen Flächen unter den ROC-Kurven mit Konfidenzintervallen, eine Tabelle der paarweisen Vergleiche \nunter Verwendung des DeLong-Tests und eine überlagerte Reihe von ROC-Kurven. Probanden mit fehlenden Werten für das Ergebnis oder die vorhergesagten Wahrscheinlichkeiten werden entfernt, sodass jedes Modell\nauf derselben Gruppe von Probanden bewertet wird. Siehe Modellbewertung > Vorhersage > Modellbewertung, um vorhergesagte Wahrscheinlichkeiten aus Kandidatenmodellen zu erhalten. \n<br/><br/><br/>\n<b>Binäre Ergebnisvariable:</b> Die binäre Ergebnisvariable, die für Vorhersagen verwendet wird. Muss numerisch oder Faktor sein.\n<br/><br/>\n<b>Vorhergesagte Wahrscheinlichkeitsvariablen aus jedem Modell:</b> Geben Sie die vorhergesagten Wahrscheinlichkeits-Spalten aus jedem angepassten Modell an, das Sie vergleichen möchten.\n<br/><br/>\n<b>Ergebnis 'Positiver' Wert:</b> Geben Sie an, ob der höhere oder niedrigere geordnete Wert der angegebenen binären Ergebnisvariable als 'positiver' Wert betrachtet werden soll. Dies ist der \nWert, auf den sich die vorhergesagten Wahrscheinlichkeiten beziehen. Zum Beispiel, wenn das binäre Ergebnis als 0/1 kodiert ist, würde der höhere geordnete Wert bedeuten, dass 1 die 'positive' Antwort ist und\nder niedrigere geordnete Wert bedeuten würde, dass 0 die 'positive' Antwort ist. \n<br/><br/>\n<b>Spezifität anstelle von 1-Spezifität plotten:</b> Dies ändert die x-Achse des ROC-Kurvenplots, um stattdessen die Spezifität zu verwenden. Die Achse wird von 1 nach 0 abnehmen, wenn Sie nach\nlinks gehen.\n<br/><br/> \n<b>Konfidenzniveau:</b> Konfidenzniveau für ROC-Kurvenbereichsintervalle\n<br/><br/>\n<b>Anpassung für mehrere Vergleiche:</b> Wenden Sie eine Anpassung für mehrere Vergleiche auf die paarweisen Vergleiche der ROC-Kurvenflächen an.\n<br/><br/><br/>\n<b>Plot-Optionen:</b>\n<br/><br/>\n<b>Plot-Titel:</b> Geben Sie den Titel für den Plot an. Kann entfernt werden.\n<br/><br/>\n<b>Plot-Thema:</b> Geben Sie das allgemeine Thema für den Plot an\n<br/><br/>\n<b>Linienoptionen:</b>\n<br/><br/>\n<b>Liniengröße:</b> Geben Sie die Größe der Linien im ROC-Kurvenplot an\n<br/><br/>\n<b>Farbschema:</b> Geben Sie das Farbschema an, das für die Linien der ROC-Kurve verwendet wird\n<br/><br/>\n<b>Achsenoptionen:</b>\n<br/><br/>\n<b>Achsenbeschriftungsgröße:</b> Geben Sie die Größe der Achsenbeschriftungen an, die im Plot verwendet werden.\n<br/><br/>\n<b>Größe der Achsenmarkierungsbeschriftungen:</b> Geben Sie die Größe der Achsenmarkierungsbeschriftungen an.\n<br/><br/>\n<b>Legendenoptionen:</b>\n<br/><br/>\n<b>Position:</b> Geben Sie die Position der Legende im Plot an. Kann rechts, oben, unten oder links sein.\n<br/><br/>\n<b>Titel:</b> Geben Sie den Titel für die Legende an. Kann entfernt werden.\n<br/><br/>\n<b>Kurvenbeschriftungen:</b> Geben Sie die Kurvenbeschriftungen an, die in der Legende entsprechend der Reihenfolge der Kurven verwendet werden (Kurve 1, Kurve 2, Kurve 3 usw.). Wenn Sie nichts angeben, erhalten Sie Kurvenbeschriftungen von 1, 2, 3 usw. Wenn Sie irgendwelche Beschriftungen angeben, müssen Sie Beschriftungen für alle Kurven angeben. Die Reihenfolge der Kurven ist dieselbe wie die angegebene Reihenfolge der vorhergesagten Wahrscheinlichkeiten.\n<br/><br/>\n<b>Größe der Legendenbeschriftungen:</b> Größe aller Texte in der Legende.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> pROC, ggthemes, RColorBrewer, ggsci, ggplot2\n"
  }
}