{
  "title": "Wettbewerbende Risiken, eine Gruppe",
  "navigation": "Wettbewerbende Risiken, eine Gruppe",
  "timevar": "Zeit bis zum Ereignis oder Zensur",
  "eventvar": "Ereignisse (0 = Zensur, 1 = Ereignis 1, 2 = Ereignis 2, ...)",
  "eventnum": "Ereigniscodes",
  "singleeventchkbox": "Diagramm für ein einzelnes Ereignis",
  "printallest": "Schätzungstabelle einschließlich aller Zeiten",
  "printspecest": "Schätzungstabelle für spezifische Zeiten",
  "spectimes": "Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an",
  "styleoptions": "Stiloptionen",
  "axisoptions": "Achsenoptionen",
  "label12": "Klicken Sie auf die ?-Schaltfläche oben rechts im Dialogfeld für Details zu Beispieldatensätzen und dem unterstützten Datenformat.",
  "titleboxall": "Diagrammtitel (Diagramm aller Ereignisse)",
  "titleboxsingle": "Diagrammtitel (Diagramm eines einzelnen Ereignisses)",
  "plottitlesizelabel": "Größe des Diagrammtitels (5-50)",
  "themedropdown": "Diagrammthema",
  "label1": "Legende (Diagramm aller Ereignisse)",
  "legendpos": "Position",
  "legendtitle": "Titel",
  "eventlabels": "Ereignisbezeichnungen (geben Sie Bezeichnungen durch Kommas getrennt in der Reihenfolge der Ereigniscodes an: z.B. 'Ereignis 1', 'Ereignis 2', usw.; nicht Zensurcode)",
  "legendfontsize": "Größe der Legendenbezeichnungen (5-50)",
  "label2": "Anzahl der Gefährdeten",
  "natriskchkbox": "Anzahl der Gefährdeten einbeziehen",
  "risktableprop": "Höhe der Risikotabelle (0-1)",
  "risktablevaluesize": "Größe der Werte in der Risikotabelle (1-15)",
  "risktabletitlesize": "Größe des Titels der Risikotabelle (5-50)",
  "risktableaxislabelsize": "Größe der Achsenbeschriftungen der Risikotabelle (5-50)",
  "risktableticklabelsize": "Größe der Tick-Beschriftungen der Risikotabelle (5-50)",
  "risktableclean": "Achsen und Gitterlinien aus der Risikotabelle entfernen",
  "label3": "Linienoptionen",
  "linesize": "Größe (0-5)",
  "colorpalette": "Farbschema (Diagramm aller Ereignisse)",
  "linecolor": "Farbe (Diagramm eines einzelnen Ereignisses)",
  "label4": "Konfidenzintervall",
  "cichkbox": "95% CI einbeziehen",
  "labelblank": "",
  "cistyle": "Stil",
  "citransparency": "Transparenz (0-1)",
  "censorchkbox": "Zensierte Zeiten einbeziehen",
  "label5": "Inzidenzachse",
  "incaxislabelall": "Bezeichnung (Diagramm aller Ereignisse)",
  "incaxislabelsingle": "Bezeichnung (Diagramm eines einzelnen Ereignisses)",
  "label6": "Skala",
  "defbutton": "Proportion",
  "pctbutton": "Prozent",
  "label7": "Achsenlimits und Tick-Mark-Inkremente (0-1)",
  "incaxismin": "Minimum",
  "incaxismax": "Maximum",
  "incaxisinc": "Inkrement",
  "label8": "Zeitachse",
  "timeaxislabel": "Bezeichnung",
  "label9": "Achsenlimits und Tick-Mark-Inkremente",
  "timeaxismin": "Minimum",
  "timeaxismax": "Maximum",
  "timeaxisinc": "Inkrement",
  "label10": "Hinweis: Das Maximum kann angegeben werden, ohne dass das Inkrement angegeben wird. Das Inkrement kann nicht angegeben werden, ohne dass das Maximum angegeben wird.",
  "axislabelsize": "Größe der Achsenbeschriftungen (5-50)",
  "ticklabelsize": "Größe der Achsen-Tick-Mark-Beschriftungen (5-50)",
  "help": {
    "title": "Wettbewerbende Risiken, Eine Gruppe",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n\t\t\tSiehe Beispieldatensatz im Installationsverzeichnis, der Standardstandort befindet sich auf dem Laufwerk: \\Program Files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\melanoma_upd.RData. Die Variable Zeit sollte als Zeit bis zum Ereignis oder zur Zensur eingegeben werden, und die Variable Tod sollte als Ereignisse eingegeben werden.<br/>\t\t\t\n            Dieser Datensatz ist eine aktualisierte Version des Melanomdatensatzes im MASS-Paket.\n            <br/>\n            <br/>\n            Ein konkurrierendes Risiko ist ein Ereignis, dessen Auftreten das Auftreten des primären Ereignisses von Interesse ausschließt. Eine standardmäßige Kaplan-Meier-Analyse in solchen Fällen ist voreingenommen und überschätzt das Ereignisrisiko. Dieser Dialog wird verwendet, um das kumulative Risiko zu schätzen, das primäre Ereignis nach Beginn der Nachverfolgung für dieses Ereignis (oder Zeit null) zu haben, wenn eines oder mehrere konkurrierende Risiken vorhanden sind. Die Summe der kumulierten Inzidenzen für jedes Ereignis entspricht der kumulierten Inzidenz für jedes Ereignis. Die Probanden müssen ab Zeit null für alle Ereignisse gefährdet sein. Kumulative Inzidenzdiagramme für alle Ereignisse (getrennte Kurven für jedes Ereignis im selben Diagramm) und optional für ein spezifisches Ereignis allein werden bereitgestellt. \n            <br/>\n            Eine Einführung in das Thema konkurrierende Risiken finden Sie in \"Einführung in die Analyse von Überlebensdaten in Anwesenheit konkurrierender Risiken\" von Peter Austin et al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Zeit bis zum Ereignis oder zur Zensur:</b> Für jeden Probanden die Dauer bis zum ersten Ereignis, falls ein Ereignis aufgetreten ist, oder die letzte Nachverfolgung für Ereignisse, falls keine Ereignisse aufgetreten sind.\n            <br/><br/>\n            <b>Ereignisse:</b> Numerischer Indikator dafür, welches Ereignis aufgetreten ist (1=Ereignis 1, 2=Ereignis 2, usw.) oder wenn keine Ereignisse aufgetreten sind (0=Zensur) für jeden Probanden\n            <br/><br/>\n            <b>Diagramm für ein einzelnes Ereignis:</b> Ob Sie die kumulative Inzidenz für ein spezifisches Ereignis allein darstellen möchten. Der <b>Ereigniscodes</b> entspricht dem Ereignis, das dargestellt wird.\n            <br/><br/>\n            <b>Schätzungstabelle einschließlich aller Zeiten:</b> Option zur Einbeziehung einer Tabelle, die die kumulierten Inzidenzwahrscheinlichkeiten und 95% Konfidenzintervalle für jede beobachtete Zeit im Datensatz auflistet\n            <br/>\n            <br/>\n\t\t\t<b>Schätzungstabelle für spezifische Zeiten:</b> Option zur Einbeziehung einer Tabelle, die die Überlebensschätzungswahrscheinlichkeiten für eine benutzerdefinierte Auswahl von Zeiten enthält.\n\t\t\t<br/><br/>\n\t\t\t<b>Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an:</b> Dies sind die spezifischen Zeiten, die in die Tabelle für spezifische Zeiten aufgenommen werden. Sie können einzeln mit Kommas angegeben oder als eine Sequenz gleichmäßig verteilter Werte angegeben werden.\n\t\t\t<br/><br/>\n            Tabellen werden mit der Stichprobengröße, der Anzahl der Probanden mit jedem Ereignis, der eingeschränkten mittleren Zeit im Zustand und der medianen Nachverfolgungszeit ausgegeben. Die mediane Nachverfolgungszeit wird unter Verwendung des umgekehrten Kaplan-Meier-Schätzers berechnet, der wahre Ereignisse als zensierte Beobachtungen und wahre zensierte Beobachtungen als Ereignisse behandelt. Daher ist das \"Ereignis\" in diesem Schätzer \"die Probanden so lange zu verfolgen, wie die Studie es zulassen könnte\".\n            <br/>\n            Eine Tabelle der kumulierten Inzidenzschätzungen wird zu jeder beobachteten Zeit im Datensatz bereitgestellt, mit 95% Konfidenzintervallen. \n            <br/>\n            <br/>\n            <b>Erforderliche R-Pakete:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n            <br/>\n            <br/>\n            <br/>\n            <b>Stiloptionen</b>\n            <br/>\n            <br/>\n            <b>Diagrammtitel (Diagramm aller Ereignisse):</b> Titel des Diagramms, das alle Ereignisse anzeigt; löschen Sie allen Text für keinen Titel\n            <br/><br/>\n            <b>Diagrammtitel (Diagramm eines einzelnen Ereignisses):</b> Titel des Diagramms, das das ausgewählte einzelne Ereignis anzeigt; löschen Sie allen Text für keinen Titel\n\t\t\t<br/><br/>\n\t\t\t<b>Größe des Diagrammtitels:</b> Größe der Diagrammtitel.\n\t\t\t<br/><br/>\n            <b>Diagrammthema:</b> Allgemeiner Stil des Diagramms\n            <br/><br/>\n            <b>Legendenoptionen:</b>\n            <br/>\n            Die <b>Position</b>-Option steuert den Standort der Legende (oben, unten, links, rechts). Der <b>Titel</b> ist der Titel der Legende. Um den Titel zu entfernen, entfernen Sie allen Text aus dem Textfeld. <b>Ereignisbezeichnungen</b> werden verwendet, um Text für jeden numerischen Ereigniscodes anzuzeigen, anstelle der Codes. Wenn Sie Bezeichnungen angeben, müssen alle Ereignisse beschriftet werden.\n\t\t\tDie <b>Größe der Legendenbezeichnungen</b>-Option steuert die Größe aller Texte in der Legende.\n            <br/>\n            <br/>\n            <b>Anzahl der Gefährdeten:</b>\n\t\t\t<br/>\n\t\t\tOptional können Sie eine Tabelle für die Anzahl der Probanden, die über die Zeit noch gefährdet sind, am unteren Rand der Diagramme einfügen. Die <b>Höhe der Risikotabelle</b> steuert den Anteil des Diagrammbereichs, den die Tabelle einnimmt.\n\t\t\tDie <b>Größe der Risikotabellenwerte</b> steuert die Größe der Zahlen, die gefährdet sind. Die <b>Größe des Titels der Risikotabelle</b> steuert die Größe des Titels für die Tabelle der Anzahl der Gefährdeten.\n\t\t\tDie <b>Größe der Achsenbeschriftungen der Risikotabelle</b> steuert die Größe der Achsenbeschriftungen. \n\t\t\tDie <b>Größe der Tick-Beschriftungen der Risikotabelle</b> steuert die Größe der Tick-Mark-Beschriftungen. Wenn gewünscht, können Sie alle Achsen und Gitterlinien \n\t\t\taus der Tabelle der Anzahl der Gefährdeten entfernen, indem Sie die Option <b>Achsen und Gitterlinien aus der Risikotabelle entfernen</b> aktivieren. Dies wird nur die Zahlen, die gefährdet sind, in der Tabelle enthalten.           \n            <br/><br/>\n            <b>Linienoptionen:</b>\n            <br/>\n            <b>Größe</b> steuert die Dicke. Die <b>Farbe</b>-Optionen steuern das Farbschema, das für die Linien im Diagramm aller Ereignisse verwendet wird, und die Farbe der Linie im Diagramm eines einzelnen Ereignisses. Farbschemata, die wissenschaftlichen Zeitschriften nachempfunden sind, werden ebenfalls bereitgestellt. Man kann optional ein 95% Konfidenzintervall für die Schätzungen in entweder einem <b>Ribbon</b> (schattierter Bereich) oder <b>Step</b> (Linie) Format einfügen. <b>Transparenz</b> steuert, wie dunkel das Band ist und wird ignoriert, wenn die Schrittoption ausgewählt ist.\n\t\t\t<br/><br/>\n\t\t\t<b>Zensierte Zeiten einbeziehen:</b> Zensierte Zeiten (wenn Probanden nicht mehr für die Ereignisse gefährdet sind) können als ein Rug in der Nähe der Zeitachse beider Diagramme einbezogen werden. Dies ist nützlicher in kleineren Datensätzen oder in Fällen mit kleineren Zahlen von zensierten Probanden.\n            <br/><br/><br/>\n\t\t\t<b>Achsenoptionen</b>\n            <br/>\n            <br/>\n            Die <b>Bezeichnung</b>-Option gibt die Textbezeichnung für die Achse an. Die <b>Achsenlimits</b> geben die minimalen und maximalen Werte der Achse an. Die <b>Tick-Mark-Inkremente</b>-Option steuert den Abstand der Tick-Markierungen auf der Achse. Die Inkremente auf der Zeitachse steuern auch die Zeiten für die optionale Tabelle der Anzahl der Gefährdeten.\n            <br/>\n            Die Inzidenzachse <b>Skala</b>-Option gibt an, ob Sie möchten, dass die Schätzungen auf einer Proportions- (0-1) oder Prozent- (0-100) Skala angezeigt werden.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Achsenbeschriftungen:</b>  Dies steuert die Größe sowohl der Inzidenz- als auch der Zeitachsenbeschriftungen.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Tick-Mark-Beschriftungen der Achsen:</b>  Dies steuert die Größe sowohl der Inzidenz- als auch der Zeitachsen-Tick-Mark-Beschriftungen.\t\t\t\t\n      "
  }
}