{
  "title": "Modelle vergleichen",
  "navigation": "Modelle vergleichen",
  "label1": "Vergleicht 2 geschachtelte Modelle mithilfe eines F- oder Chi-Quadrat-Tests, abhängig von der Schätzung, und führt einen Likelihood-Ratio-Test durch.",
  "label2": "Wählen Sie Modelle der folgenden Klassen aus (R-Klasse in Klammern unten)",
  "label3": "Lineare Modelle (lm), Verallgemeinertes lineares Modell (glm), Lineares gemischtes Effektmodell (lme), Ordinales logistisches oder Probit-Regressionsmodell (polr), Proportionales Hazard-Modell (coxph), Lineares Modell mit verallgemeinerten kleinsten Quadraten (gls), Überlebensregressionsmodell (survreg), Lokale polynomial Regression (loess), Nichtlineares kleinste Quadrate-Modell (nls), Multinomiale log-lineare Modelle (multinom)",
  "label4": "**HINWEIS: Modelle, die aus der Modelloptimierung (Klasse train) erstellt wurden, werden nicht unterstützt",
  "modelselector1": "Wählen Sie das vollständige Modell aus:",
  "modelselector2": "Wählen Sie ein Modell mit weniger Prädiktoren aus:",
  "help": {
    "title": "Modelle vergleichen",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>\nVergleicht 2 geschachtelte Modelle mithilfe eines F- oder Chi-Quadrat-Tests, abhängig von der Schätzung. F-Tests werden für die Schätzung der kleinsten Quadrate verwendet, Chi-Quadrat-Tests werden für die Schätzung der maximalen Wahrscheinlichkeit verwendet. Beide Modelle sollten auf demselben Datensatz erstellt werden, da Unterschiede in fehlenden Werten Probleme verursachen können.</b></br>\n<b>Beschreibung</b></br>\nAnova-Tabellen: Berechnet Analyse der Varianz-Tabellen und führt Likelihood-Ratio-Tests für ein angepasstes Modellobjekt durch.  \n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject:  ein Objekt, das die Ergebnisse enthält, die von einer Modellanpassungsfunktion zurückgegeben werden (z. B. lm oder glm).\n</li>\n</ul>\n<b>Wert</b><br/>\nDiese (generische) Funktion gibt ein Objekt der Klasse anova zurück. Diese Objekte repräsentieren Analyse-der-Varianz- und Analyse-der-Abweichungstabellen. Bei einem einzelnen Argument wird eine Tabelle erstellt, die testet, ob die Modellterme signifikant sind. Bei einer Sequenz von Objekten testet anova die Modelle gegeneinander in der angegebenen Reihenfolge.<br/>\nDie Druckmethode für anova-Objekte druckt Tabellen in einer „schönen“ Form.<br/>\n<b>Warnung</b><br/>\nDer Vergleich zwischen zwei oder mehr Modellen ist nur gültig, wenn sie auf demselben Datensatz angepasst werden. Dies kann ein Problem darstellen, wenn es fehlende Werte gibt und R's Standard na.action = na.omit verwendet wird.<br/>\n<b>Pakete</b></br>\nstats</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogfelds oder führen Sie den folgenden Befehl im R-Syntax-Editor aus: help(anova,package='stats')</br></br>\n<b>Beschreibung</b></br>\nLikelihood-Ratio-Test geschachtelter Modelle: lrtest ist eine generische Funktion zur Durchführung von Likelihood-Ratio-Tests. Die Standardmethode kann verwendet werden, um geschachtelte (verallgemeinerte) lineare Modelle zu vergleichen (siehe Einzelheiten unten).\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Standard S3-Methode:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## S3-Methode für die Klasse 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: ein Objekt. Siehe unten für Einzelheiten.\n</li>\n<li>\n...: weitere Objektspezifikationen, die an Methoden übergeben werden. Siehe unten für Einzelheiten.\n</li>\n<li>\nname: eine Funktion zum Extrahieren eines geeigneten Namens/Beschreibung aus einem angepassten Modellobjekt. Standardmäßig wird der Name durch den Aufruf von formula abgefragt.\n</li>\n<li>\ndata: ein Datenrahmen, der die Variablen im Modell enthält.\n</li>\n</ul>\n<b>Einzelheiten</b></br>\nlrtest soll eine generische Funktion für den Vergleich von Modellen über asymptotische Likelihood-Ratio-Tests sein. Die Standardmethode vergleicht nacheinander das angepasste Modellobjekt mit den in ... übergebenen Modellen. Anstelle von angepassten Modellobjekten in ... können mehrere andere Spezifikationen möglich sein. Der Aktualisierungsmechanismus ist derselbe wie bei waldtest: Die Modelle in ... können als Ganzzahlen, Zeichen (beides für Terme, die aus dem vorherigen Modell entfernt werden sollen), Aktualisierungsformeln oder angepasste Modellobjekte angegeben werden. Abgesehen von dem letzten Fall wird angenommen, dass eine Aktualisierungsmethode vorhanden ist. Siehe waldtest für Einzelheiten.<br/>\nAnschließend wird ein asymptotischer Likelihood-Ratio-Test für jedes zwei aufeinanderfolgende Modelle durchgeführt: Das Zweifache der Differenz der Log-Likelihoods (wie von den logLik-Methoden abgeleitet) wird mit einer Chi-Quadrat-Verteilung verglichen.<br/>\nDie \"formel\"-Methode passt zuerst ein lm an und ruft dann die Standardmethode auf.<br/>\n<b>Wert</b><br/>\nEin Objekt der Klasse \"anova\", das die Log-Likelihood, Freiheitsgrade, die Differenz der Freiheitsgrade, die Likelihood-Ratio-Chi-Quadrat-Statistik und den entsprechenden p-Wert enthält.\n<b>Beispiele</b><br/>\n<code> \n## mit Daten von Greene (1993):<br/>\n## Daten laden und Verzögerungen berechnen<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## verschiedene äquivalente Spezifikationen des LR-Tests<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
  }
}