{
  "title": "Berechnen Sie die Werte der Modellvariablen, um die Zielantwort zu erreichen",
  "label100": "Dieser Dialog berechnet die Modellvariablen, um den Zielwert der Modellantwort zu erreichen\nHinweis: Wenn eine nicht-numerische Variable im ausgewählten Modell vorhanden ist, schlägt die Berechnung der Zielantwort fehl",
  "navigation": "Zielantwort berechnen",
  "modelSelection": "Wählen Sie ein Modell aus, um die optimalen Variablenwerte zu berechnen",
  "targetResponse": "Geben Sie den gewünschten Zielwert der Antwort (numerisch) für das ausgewählte Modell an",
  "targetResponseLower": "(Optional) Geben Sie den gewünschten unteren Zielwert der Antwort (numerisch) für das ausgewählte Modell an",
  "targetResponseUpper": "(Optional) Geben Sie den gewünschten oberen Zielwert der Antwort (numerisch) für das ausgewählte Modell an",
  "label200": "Einschränkungen des Zielantwortoptimierers",
  "label12": "Variablen (Faktoren) im ausgewählten Modell, die unten in der gleichen Reihenfolge aufgeführt sind, wie sie im Modell erscheinen",
  "factorConstraintUseDatasetLowerChk": "Untergrenzenbeschränkungen: Wenn aktiviert, wird der Mindestwert jeder im Modell verwendeten Variablen für die Untergrenze verwendet",
  "factorConstraintLower": "Untergrenzenbeschränkungen: (Ignoriert, wenn oben aktiviert) Lassen Sie das Feld leer, um keine Einschränkungen für die Untergrenze der Modellvariablen (d.h. Faktoren) festzulegen. Andernfalls müssen Sie kommagetrennte Werte für jede Modellvariable eingeben. Wenn eine bestimmte Modellvariable keine Untergrenze hat, geben Sie -Inf ein, z.B. 0, 0.1, -Inf, 20",
  "factorConstraintUseDatasetUpperChk": "Obergrenzenbeschränkungen: Wenn aktiviert, wird der Höchstwert jeder im Modell verwendeten Variablen für die Obergrenze verwendet",
  "factorConstraintUpper": "Obergrenzenbeschränkungen: (Ignoriert, wenn oben aktiviert) Lassen Sie das Feld leer, um keine Einschränkungen für die Obergrenze der Modellvariablen (d.h. Faktoren) festzulegen. Andernfalls müssen Sie kommagetrennte Werte für jede Modellvariable eingeben. Wenn eine bestimmte Modellvariable keine Obergrenze hat, geben Sie Inf ein, z.B. 0, 0.2, 0.9, Inf",
  "factorInitalValues": "Startwerte: Lassen Sie das Feld leer, damit das System die anfänglichen Startwerte für die Modellvariablen (d.h. Faktoren) auswählt (Standard: alle Nullen). Andernfalls müssen Sie kommagetrennte Werte für jede Modellvariable eingeben, z.B. 0, 0, 0, 0",
  "help": {
    "title": "Berechnen Sie die Werte der Modellvariablen (Faktoren) für die Zielantwort des ausgewählten Modells",
    "r_help": "help(optim, package = 'stats')",
    "body": "\n        "
  }
}