{
  "title": "Wettbewerbende Risiken, Gruppen vergleichen",
  "navigation": "Wettbewerbende Risiken, Gruppen vergleichen",
  "timevar": "Zeit bis zum Ereignis oder Zensur",
  "eventvar": "Ereignisse (0 = Zensur, 1 = Ereignis 1, 2 = Ereignis 2, ...)",
  "groupvarlabel": "Gruppe",
  "eventnum": "Ereigniscode",
  "singleeventchkbox": "Plot für ein einzelnes Ereignis",
  "printallest": "Schätzungstabelle einschließlich aller Zeiten",
  "printspecest": "Schätzungstabelle für spezifische Zeiten",
  "spectimes": "Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an",
  "styleoptions": "Stiloptionen",
  "axisoptions": "Achsenoptionen",
  "titleboxall": "Plot-Titel (alle Ereignisse Plots)",
  "titleboxsingle": "Plot-Titel (einzelnes Ereignis Plot)",
  "plottitlesizelabel": "Plot-Titelgröße (5-50)",
  "themedropdown": "Plot-Thema",
  "label1": "Legende",
  "legendpos": "Position",
  "keywidthlabel": "Schlüsselbreite (cm; kombinierter Plot nur)",
  "legendeventslabel": "Ereignisse",
  "legendtitle": "Titel",
  "eventlabels": "Labels (geben Sie Labels durch Kommas getrennt in der Reihenfolge der Ereigniscodes an: z.B. 'Ereignis 1', 'Ereignis 2', usw.; nicht Zensurcode)",
  "legendgroupslabel": "Gruppen",
  "grouplabels": "Labels (geben Sie Labels durch Kommas getrennt in der Reihenfolge der Gruppen an: z.B. 'Gruppe 1', 'Gruppe 2', usw.)",
  "legendfontsize": "Größe der Legendenlabels (5-50)",
  "wraplabelfontsize": "Größe der Ereignislabels für Plot nach Ereignis (5-50)",
  "label2": "Anzahl der Gefährdeten",
  "natriskchkbox": "Anzahl der Gefährdeten einbeziehen",
  "risktableprop": "Höhe der Risikotabelle (0-1)",
  "risktablevaluesize": "Größe der Risikotabellenwerte (1-15)",
  "risktabletitlesize": "Größe des Titels der Risikotabelle (5-50)",
  "risktableaxislabelsize": "Größe der Achsenbeschriftungen der Risikotabelle (5-50)",
  "risktableticklabelsize": "Größe der Tick-Labels der Risikotabelle (5-50)",
  "risktableclean": "Achsen und Gitterlinien aus der Risikotabelle entfernen",
  "label3": "Linienoptionen",
  "linesize": "Größe (0-5)",
  "colorpalette": "Farbschema",
  "label4": "Konfidenzintervall",
  "cichkbox": "95% CI einbeziehen",
  "labelblank": "",
  "cistyle": "Stil",
  "citransparency": "Transparenz (0-1)",
  "censorlabel": "Zensierte Zeiten",
  "censorchkbox": "Zensierte Zeiten einbeziehen",
  "censorsize": "Größe (0-10)",
  "pvaluelabel": "P-Wert (einzelnes Ereignis Plot nur)",
  "pvaluechkbox": "P-Wert einbeziehen",
  "pvaluelocationx": "X-Achse (Zeit) Position",
  "pvaluelocationy": "Y-Achse (Wahrscheinlichkeit) Position",
  "pvaluesize": "Größe (1-20)",
  "pvalueaccuracy": "Genauigkeit (0-1)",
  "label5": "Inzidenzachse",
  "incaxislabelall": "Label (alle Ereignisse Plots)",
  "incaxislabelsingle": "Label (einzelnes Ereignis Plot)",
  "label6": "Skala",
  "defbutton": "Anteil",
  "pctbutton": "Prozent",
  "label7": "Achsenlimits und Tick-Mark-Inkremente (0-1)",
  "incaxismin": "Minimum",
  "incaxismax": "Maximum",
  "incaxisinc": "Inkrement",
  "label8": "Zeitachse",
  "timeaxislabel": "Label",
  "label9": "Achsenlimits und Tick-Mark-Inkremente",
  "timeaxismin": "Minimum",
  "timeaxismax": "Maximum",
  "timeaxisinc": "Inkrement",
  "label10": "Hinweis: Maximum kann angegeben werden, ohne dass das Inkrement angegeben wird. Inkrement kann nicht angegeben werden, ohne dass Maximum angegeben wird.",
  "axislabelsize": "Größe der Achsenbeschriftungen (5-50)",
  "ticklabelsize": "Größe der Achsen-Tick-Mark-Labels (5-50)",
  "help": {
    "title": "Wettbewerbende Risiken, Gruppen vergleichen",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n            <br/>\n            Ein konkurrierendes Risiko ist ein Ereignis, dessen Auftreten das Auftreten des primären Ereignisses von Interesse ausschließt. Eine standardmäßige Kaplan-Meier-Analyse in solchen Fällen ist voreingenommen und überschätzt das Ereignisrisiko. Dieser Dialog wird verwendet, um das kumulative Risiko zu schätzen, das primäre Ereignis nach Beginn der Nachverfolgung für dieses Ereignis (oder Zeit null) zu haben, wenn eines oder mehrere konkurrierende Risiken vorhanden sind. Die Summe der kumulierten Inzidenzen für jedes Ereignis entspricht der kumulierten Inzidenz für jedes Ereignis. Die Probanden müssen ab Zeit null für alle Ereignisse gefährdet sein. Kumulative Inzidenzplots für alle Ereignisse (getrennte Kurven für jedes Ereignis im selben Plot) und optional für ein spezifisches Ereignis allein werden bereitgestellt. \n            <br/>\n            Eine Einführung in das Thema der konkurrierenden Risiken finden Sie in \"Einführung in die Analyse von Überlebensdaten in Anwesenheit konkurrierender Risiken\" von Peter Austin et al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Zeit bis zum Ereignis oder Zensur:</b> Für jeden Probanden die Zeit bis zum ersten Ereignis, falls ein Ereignis aufgetreten ist, oder die letzte Nachverfolgung für Ereignisse, falls keine Ereignisse aufgetreten sind.\n            <br/><br/>\n            <b>Ereignisse:</b> Numerischer Indikator, welches Ereignis aufgetreten ist (1=Ereignis 1, 2=Ereignis 2, usw.) oder wenn keine Ereignisse aufgetreten sind (0=Zensur) für jeden Probanden\n            <br/><br/>\n            <b>Plot für ein einzelnes Ereignis:</b> Ob Sie die kumulative Inzidenz für ein spezifisches Ereignis allein plotten möchten. Der <b>Ereigniscode</b> entspricht dem Ereignis, das geplottet wird.\n            <br/><br/>\n            <b>Schätzungstabelle einschließlich aller Zeiten:</b> Option, eine Tabelle einzuschließen, die die kumulierten Inzidenzwahrscheinlichkeiten und 95% Konfidenzintervalle für jede beobachtete Zeit im Datensatz auflistet\n            <br/>\n            <br/>\n\t\t\t<b>Schätzungstabelle für spezifische Zeiten:</b> Option, eine Tabelle einzuschließen, die die kumulierten Inzidenzwahrscheinlichkeiten für eine benutzerdefinierte Menge von Zeiten enthält.\n\t\t\t<br/><br/>\n\t\t\t<b>Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an:</b> Dies sind die spezifischen Zeiten, die in die Tabelle für spezifische Zeiten aufgenommen werden. Sie können einzeln mit Kommas oder als Sequenz gleichmäßig verteilter Werte angegeben werden.\n\t\t\t<br/><br/>\t\t\t\n            Tabellen werden mit der Stichprobengröße, der Anzahl der Probanden mit jedem Ereignis, der eingeschränkten mittleren Zeit im Zustand und der medianen Nachverfolgungszeit ausgegeben. Die mediane Nachverfolgungszeit wird unter Verwendung des umgekehrten Kaplan-Meier-Schätzers berechnet, der wahre Ereignisse als zensierte Beobachtungen und wahre zensierte Beobachtungen als Ereignisse behandelt. Daher ist das \"Ereignis\" in diesem Schätzer \"die Probanden so lange zu verfolgen, wie die Studie es zuließ\".\n            <br/>\n            Eine Tabelle der kumulierten Inzidenzschätzungen wird zu jeder beobachteten Zeit im Datensatz bereitgestellt, mit 95% Konfidenzintervallen. \n            <br/>\n            <br/>\n            <b>Erforderliche R-Pakete:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>Stiloptionen</b>\n            <br/>\n            <br/>\n            <b>Plot-Titel (alle Ereignisse Plots):</b> Titel der Plots, die alle Ereignisse anzeigen; löschen Sie allen Text für keinen Titel\n            <br/><br/>\n            <b>Plot-Titel (einzelnes Ereignis Plot):</b> Titel des Plots, der das ausgewählte einzelne Ereignis anzeigt; löschen Sie allen Text für keinen Titel\n\t\t\t<br/><br/>\n\t\t\t<b>Plot-Titelgröße:</b> Größe der Plot-Titel.\n\t\t\t<br/><br/>\n            <b>Plot-Thema:</b> Allgemeiner Stil des Plots\n            <br/><br/>\n            <b>Legendenoptionen:</b>\n            <br/>\n            Die <b>Position</b>-Option steuert den Standort der Legende (oben, unten, links, rechts). <b>Schlüsselbreite</b> wird verwendet, um die Breite der Legenden-Schlüssel im Plot, der alle Ereignisse und Gruppen kombiniert, zu ändern. Dies kann verwendet werden, um die Linientypen in der Legende lesbarer zu machen.\n\t\t\t<b>Ereignistitel</b> ist der Titel für den Teil der Legende, der die Ereignisse abgrenzt. <b>Gruppentitel</b> ist der Titel für den Teil der Legende, der die Gruppen abgrenzt. Löschen Sie den Text, wenn kein Titel gewünscht ist. <b>Ereignislabels</b> werden verwendet, um Text für jeden numerischen Ereigniscode anstelle der Codes anzuzeigen. <b>Gruppenlabels</b> werden verwendet, um den Text für die Gruppen zu ändern. Wenn Sie Labels angeben, müssen alle Labels angegeben werden.\n\t\t\tDie <b>Größe der Legendenlabels</b>-Option steuert die Größe aller Texte in der Legende.\n\t\t\tDie <b>Größe der Ereignislabels für Plot nach Ereignis</b>-Option steuert die Größe des Ereignisnamens im Plot, der nach Ereignistyp gefiltert ist.\n            <br/>\n            <br/>\n            <b>Anzahl der Gefährdeten:</b>\n\t\t\t<br/>\n\t\t\tOptional eine Tabelle für die Anzahl der Probanden, die über die Zeit hinweg noch gefährdet sind, am unteren Rand der Plots einfügen. Dies wird für den Plot, der nach Ereignis gefiltert ist, aus Platz- und Lesbarkeitsgründen nicht bereitgestellt. Die <b>Höhe der Risikotabelle</b> steuert den Anteil des Plotbereichs, den die Tabelle einnimmt.\n\t\t\tDie <b>Größe der Risikotabellenwerte</b> steuert die Größe der Zahlen, die gefährdet sind. Die <b>Größe des Titels der Risikotabelle</b> steuert die Größe des Titels der Tabelle zur Anzahl der Gefährdeten.\n\t\t\tDie <b>Größe der Achsenbeschriftungen der Risikotabelle</b> steuert die Größe der Achsenbeschriftungen. \n\t\t\tDie <b>Größe der Tick-Labels der Risikotabelle</b> steuert die Größe der Tick-Mark-Labels. Wenn gewünscht, können alle Achsen und Gitterlinien \n\t\t\taus der Risikotabelle entfernt werden, indem die Option <b>Achsen und Gitterlinien aus der Risikotabelle entfernen</b> aktiviert wird. Dies wird nur die Zahlen, die gefährdet sind, in der Tabelle enthalten.           \n            <br/><br/>\n            <b>Linienoptionen:</b>\n            <br/>\n            <b>Größe</b> steuert die Dicke. Die <b>Farbschema</b>-Option steuert das Farbschema, das für die Linien in allen Plots verwendet wird. Farbschemata, die wissenschaftlichen Zeitschriften nachempfunden sind, werden ebenfalls bereitgestellt. Man kann optional ein 95% Konfidenzintervall für die Schätzungen in entweder einem <b>Ribbon</b> (schattierter Bereich) oder <b>Step</b> (Linie) Format einfügen. <b>Transparenz</b> steuert, wie dunkel das Ribbon ist und wird ignoriert, wenn die Step-Option ausgewählt ist.\n\t\t\t<br/><br/>\n\t\t\t<b>Zensierte Zeiten einbeziehen:</b> Zensierte Zeiten (wenn Probanden nicht mehr für die Ereignisse gefährdet sind) können als Pluszeichen auf den Linien einbezogen werden. Dies ist in kleineren Datensätzen oder in Fällen mit kleineren Zahlen von zensierten Probanden nützlicher. Sie werden im Plot, der alle Ereignisse und Gruppen überlagert, aus Lesbarkeitsgründen nicht bereitgestellt.\n\t\t\t<b>Größe</b> steuert die Größe der zensierten Zeit Pluszeichen.\n\t\t\t<br/><br/>\n\t\t\t<b>P-Wert einbeziehen</b> kann verwendet werden, um den Gray-Test-P-Wert des ausgewählten Ereignisses im einzelnen Ereignis-Plot einzuschließen. <b>X-Achse (Zeit) Position</b> und <b>Y-Achse (Wahrscheinlichkeit) Position</b> geben die (X, Y)-Koordinaten des P-Werts im Plot an.\n\t\t\t<b>Größe</b> steuert die Größe des P-Werts im Plot. <b>Genauigkeit</b> steuert die Genauigkeit des P-Werts. Zum Beispiel würde der Standardwert von 0.0001 P-Werte nicht kleiner als 0.0001 anzeigen. Jeder P-Wert kleiner als 0.0001 würde als \"p<0.0001\" angezeigt. \n            <br/><br/><br/>\n\t\t\t<b>Achsenoptionen</b>\n            <br/>\n            <br/>\n            Die <b>Label</b>-Optionen spezifizieren den Textlabel für die Achse. Die <b>Achsenlimits</b> spezifizieren die minimalen und maximalen Werte der Achse. Die <b>Tick-Mark-Inkremente</b>-Option steuert den Abstand der Tick-Marken auf der Achse. Die Inkremente auf der Zeitachse steuern auch die Zeiten für die optionale Tabelle zur Anzahl der Gefährdeten.\n            <br/>\n            Die Inzidenzachse <b>Skala</b>-Option spezifiziert, ob Sie möchten, dass die Schätzungen auf einem Anteil (0-1) oder Prozent (0-100) Skala sind.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Achsenbeschriftungen:</b>  Dies steuert die Größe sowohl der Inzidenz- als auch der Zeitachsenbeschriftungen.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Tick-Mark-Labels der Achsen:</b>  Dies steuert die Größe sowohl der Inzidenz- als auch der Zeitachsen-Tick-Mark-Labels.\n      "
  }
}