{
  "title": "Logistische, bedingte",
  "navigation": "Logistische, bedingte",
  "modelname": "Modellnamen eingeben",
  "outcomevarlabel": "Abhängige Variable (numerisch; 1 = Ereignis, 0 = kein Ereignis)",
  "stratavarlabel": "Strata",
  "methodgrplabel": "Schätzmethode",
  "exactlabel": "Genau",
  "efronlabel": "Efron",
  "breslowlabel": "Breslow",
  "help": {
    "title": "Logistische, bedingte",
    "r_help": "help(clogit, Paket = 'survival')",
    "body": "\nDies passt ein bedingtes logistisches Regressionsmodell an, das dem Standard-logistischen Regressionsmodell ähnlich ist, jedoch eine Stratifikationsvariable einbezieht. Häufige Anwendungen dieses \nModells sind in gepaarten Fall-Kontroll-, gepaarten Kohorten- und geschachtelten Fall-Kontroll-Studien. Die Ausgabe umfasst die Anzahl der in der Analyse verwendeten Strata, Häufigkeitsmuster der Ergebnisse \ninnerhalb der Strata, verschiedene Modellzusammenfassungsstatistiken, Parameterschätzungen und Odds Ratios.\n<br/><br/>\n<b>Abhängige Variable:</b> Dies ist die Variable, die das Ereignis für jedes Subjekt angibt, wobei 1 ein Ereignis und 0 ein Nicht-Ereignis bedeutet. Diese Variable muss numerisch sein.\n<br/><br/>\n<b>Formel-Builder:</b> Geben Sie die gewünschten Modellbegriffe an.\n<br/><br/>\n<b>Strata:</b> Geben Sie die Stratifikationsvariable an. Kann numerisch, charakterlich oder ein nominales/ordinales Faktum sein.\n<br/><br/>\n<b>Schätzmethode:</b> Geben Sie die Schätzmethode für das Modell an. Die \"Genau\"-Methode ist die Standardmethode. Solange es nicht zu viele Möglichkeiten gibt, Ereignisse innerhalb der Strata auszuwählen, sollte dies die gewählte Option sein. Die Schätzung kann einige Zeit in Anspruch nehmen oder zu Fehlern führen, wenn viele Kombinationen innerhalb einiger Strata resultieren können, sagen wir 100 Ereignisse aus 500 Subjekten. Die Efron- und Breslow-Näherungen sind in diesen Fällen ausreichend, wobei Efron bevorzugt wird. Siehe die Referenzen in der R-Hilfe für Details.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> survival, broom, arsenal, dplyr\n\t\t"
  }
}