{
  "title": "Zeichen zu Datum & Uhrzeit",
  "navigation": "Zeichen zu Datum & Uhrzeit",
  "labelInfo": "Wenn die Umwandlung der Zeichenvariablen für Datum, Uhrzeit oder Datum-Uhrzeit-Zeichen in den Datentyp nur Datum oder Datum-Uhrzeit erfolgreich ist, wird immer die neue Datumsvariable im Format JJJJ-MM-TT erstellt, wenn nur das Datum verfügbar ist, und JJJJ-MM-TT HH:MM:SS oder JJJJ-MM-TT HH:MM:SS.xxx mit xxx Millisekunden, wenn die Uhrzeit verfügbar ist.",
  "label1": "Wählen Sie ein Suffix oder Präfix für die konvertierte Variable",
  "suffix": "Suffix",
  "prefix": "Präfix",
  "prefixOrSuffix": "Geben Sie ein Präfix oder Suffix ein",
  "Destination": "Wählen Sie die Zeichenvariable, die in ein Datum umgewandelt werden soll",
  "DateFormat": "Geben Sie das Format für den Datumsanteil der ausgewählten Zeichenvariable an, z.B. nur Datum als 2024-10-07 oder Datum-Uhrzeit als 2024-10-07 16:34:56 (leer lassen, wenn kein Datumselement verfügbar ist)",
  "TimeFormat": "Geben Sie das Format für den Zeitanteil der ausgewählten Zeichenvariable an, z.B. Datum-Uhrzeit einschließlich Millisekunden als 2024-10-07 16:34:56.789 oder nur Zeit als 16:34:56 (leer lassen, wenn kein Zeitelement verfügbar ist)",
  "TimeZone": "Wählen Sie eine Zeitzone (Standard - nichts ausgewählt ist die lokale Zeitzone des PCs)",
  "missingYear": "Fehlendes Jahr: Wenn das Jahr in der Datumszeichenvariable fehlt, geben Sie das Jahr ein, z.B. 2024. Leer lassen, um das aktuelle Jahr zu verwenden",
  "missingMonth": "Fehlender Monat: Wenn der Monat in der Datumszeichenvariable fehlt, geben Sie den Monat ein, z.B. 03, Mär oder März für März. Leer lassen, um den aktuellen Monat zu verwenden",
  "missingDay": "Fehlender Tag: Wenn der Tag in der Datumszeichenvariable fehlt, geben Sie den Tag des Monats ein, z.B. 17. Leer lassen, um heute zu verwenden",
  "missingHour": "Fehlende Stunde: Wenn die Stunde in der Datum/Uhrzeit-Zeichenvariable fehlt, geben Sie die Stunde ein, z.B. 7 oder 16. Leer lassen, um die aktuelle Stunde zu verwenden",
  "missingMinute": "Fehlende Minute: Wenn die Minute in der Datum/Uhrzeit-Zeichenvariable fehlt, geben Sie die Minute ein, z.B. 10 oder 35. Leer lassen, um die aktuelle Minute zu verwenden",
  "missingSeconds": "Fehlende Sekunden: Wenn die Sekunden in der Datum/Uhrzeit-Zeichenvariable fehlen, geben Sie die Sekunden ein, z.B. 17 oder 59. Leer lassen, um die aktuellen Sekunden zu verwenden",
  "help": {
    "title": "Konvertieren von Teil- oder Voll-Datumszeichen in den Datentyp Datum",
    "r_help": "help(package=\"lubridate\")",
    "body": "\n\t\t\t<b>Beschreibung</b></br>\n\t\t\tKonvertiert eine Zeichenkette für Datum, Uhrzeit oder Datum-Uhrzeit mit teilweisen oder vollständigen Datum- und Uhrzeitelementen, d.h. Datumselemente wie Jahr, Monat und Tag des Monats in einen Datentyp (POSIXct-Klasse) oder nur die Uhrzeit wie Stunde Minute Sekunde Millisekunde, Stunde Minute Sekunde, .. in ein vollständiges Datum (POSIXct-Klasse) um. \n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tWählen Sie ein Format aus der möglichen Liste von Formaten aus den Datumsformaten, wenn nur Datumselemente in der ausgewählten Zeichenkette verfügbar sind\n\t\t\t<br/> \n\t\t\tWählen Sie ein Zeitformat aus der möglichen Liste von Zeitformaten, wenn nur Zeitelemente in der ausgewählten Zeichenkette verfügbar sind\n\t\t\t<br/>\n\t\t\tWählen Sie sowohl Datum- als auch Zeitformate aus der Auswahl der Datum- und Zeitformate, wenn sowohl Datum- als auch Zeitelemente in der ausgewählten Zeichenkette verfügbar sind\n\t\t\t<br/>\n\t\t\tWählen Sie das geeignete Format, das die Zeichenkette für Datum und Uhrzeit darstellt (d.h. Reihenfolge und Vorhandensein/Fehlen von Monat, Tag oder Jahr oder Stunde, Minute, Sekunden oder Millisekunden)\n\t\t\t<br/>\n\t\t\tViele Schritte zur Vorbereitung der Zeichenkette werden intern durchgeführt, bevor die Funktionen aus dem lubridate-Paket aufgerufen werden, um die vorbereitete Zeichenkette für Datum, Uhrzeit oder Datum-Uhrzeit in eine neue POSIXct-Datumsvariable zu konvertieren.\n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tOPTIONEN\n\t\t\t<br/>\n\t\t\tErweitern Sie die OPTIONEN, um weiter zu verfeinern, ob das aktuelle Jahr, der aktuelle Monat oder heute verwendet werden soll, wenn die Jahr-, Monat- oder Datumselemente in der Zeichen-Datumszeichenvariable fehlen oder die aktuelle Stunde, Minute, Sekunden, wenn eines oder mehrere Zeitelemente in der Zeichen-Zeitzeichenvariable fehlen.\n\t\t\t<br/>\n\t\t\t<br/> \n\t\t\tDatumsformatierungsoptionen für die ausgewählte Zeichen-Datumszeichenvariable sind:\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMonat Tag:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette nur den Monat gefolgt von einem Tag und keinem Jahr enthält, wie 03/17, 05-25, Mär,15 , Mai-21, ...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tTag Monat:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette nur den Tag gefolgt vom Monat und keinem Jahr enthält, wie 17/03, 25-05, 15,Mär , 21-Mai,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMonat Jahr:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette nur den Monat gefolgt vom Jahr und keinem Tag des Monats enthält, wie 03/2024, 05-2020, Mär,2023 , Jul-2018,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tJahr Monat:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette nur das Jahr gefolgt vom Monat und keinem Tag des Monats enthält, wie 2024/03, 2020-05, 2023,Mär, 2018-Jul,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tNur Jahr:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette nur das Jahr und keinen Tag oder Monat enthält, wie 2020, 2024, 1995, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tNur Monat:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette nur den Monat und keinen Tag oder Jahr enthält, wie 03, 11, Mär, November, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tNur Tag:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette nur den Tag und keinen Monat oder Jahr enthält, wie Tag des Monats als 03, 17, 28 oder Tag der Woche als Mo, Samstag, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tJahr Monat Tag:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette Jahr, gefolgt von Monat und Tag enthält, wie 2024/03/22, 2020-05-19, 2019,Mär,26,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMonat Tag Jahr:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette den Monat, gefolgt von Tag und Jahr enthält, wie 03/22/2024, 05-19-2020, Mär,26,2019,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tTag Monat Jahr:\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datumszeichenkette einen Tag, gefolgt von einem Monat und Jahr enthält, wie 22/03/2024, 19-05-2020, 26 März 2019,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tZeitformatierungsoptionen für die ausgewählte Zeichen-Datumszeichenvariable sind:\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tStunde Minute Sekunde\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datum/Uhrzeit-Zeichenkette Stunde, gefolgt von Minuten und Sekunden enthält, wie 22/03/2024 17:15:48 oder nur Zeit als 17:15:48,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tStunde Minute Sekunde Millisekunde (oder Mikrosekunde)\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datum/Uhrzeit-Zeichenkette Stunde, gefolgt von Minuten, Sekunden und Millisekunden oder Mikrosekunden enthält, wie 22/03/2024 17:15:48.784 oder nur Zeit als 17:15:48.784,17:15:48.784239,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMinute Sekunde Millisekunde (oder Mikrosekunde)\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Zeitzeichenkette Minuten, Sekunden und Millisekunden oder Mikrosekunden enthält, wie nur Zeit 15:48.784,15:48.784239... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tStunde Minute \n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Datum/Uhrzeit-Zeichenkette Stunde, gefolgt von Minuten enthält, wie 22/03/2024 17:15 oder nur Zeit 17:15,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMinute Sekunde\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Zeitzeichenkette Minuten und Sekunden enthält, wie Zeit als 15:48,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tSekunde Millisekunde (oder Mikrosekunde)\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Zeitzeichenkette Sekunden und Millisekunden oder Mikrosekunden enthält, wie Zeit als 48.784, 55.784239,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tNur Stunde \n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Zeitzeichenkette nur Stunde enthält, wie Zeit als 10, 14 oder 22,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tNur Minute\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Zeitzeichenkette nur Minuten enthält, wie Zeit als 10, 29, 44 oder 59,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tNur Sekunde\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Zeitzeichenkette nur Sekunden enthält, wie Zeit als 10, 29, 44 oder 59,... \n\t\t\t</br>\n\t\t\t</br>\t\n\t\t\tNur Millisekunde\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Zeitzeichenkette nur Millisekunden enthält, wie Zeit als 10, 290, 448 oder 759,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tNur Mikrosekunde\n\t\t\t</br>\n\t\t\tWählen Sie dies, wenn die ausgewählte Zeichen-Zeitzeichenkette nur Mikrosekunden enthält, wie Zeit als 101, 2901, 448890 oder 759123,... \n\t\t\t</br>\n\t\t\t</br>\n<b>Hilfe</b></br>\nhilfe(package=\"lubridate\")\n"
  }
}