{
  "title": "Coxcomb-Diagramm",
  "navigation": "Coxcomb",
  "x": "X-Achsenvariable(n), geben Sie eine Faktorvariable(n) an",
  "y": "Y-Variable, geben Sie eine numerische Variable an",
  "fill": "Füllung, geben Sie eine Faktorvariable an",
  "alpha": "Opazität (0-1)",
  "width": "Breite",
  "rdgrp1": "Füllproportionen",
  "flip": "Achse umdrehen",
  "barcolor": "Balkenfarbe (Nach Farbauswahl klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "specify_a_title": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "Facetrow": "Facet-Reihe",
  "Facetcolumn": "Facet-Spalte",
  "Facetwrap": "Facet-Wrap",
  "Facetscale": "Facet-Skala",
  "help": {
    "title": "Coxcomb-Diagramm",
    "r_help": "help(coord_polar, package='ggplot2')",
    "body": "\n            <b>Beschreibung</b></br>\nEin Coxcomb/Bulls Eye-Diagramm (oder ein Kreisdiagramm) ist eine kreisförmige statistische Grafik, die in Scheiben/konzentrische Kreise unterteilt ist, um numerische Proportionen zu veranschaulichen. Im Coxcomb/Bulls Eye-Diagramm ist die Breite jeder konzentrischen Kreises (und folglich seine Fläche) proportional zur Menge, die sie darstellt. Die Menge kann als Anzahl oder Prozentsatz dargestellt werden.</br>​\nFacetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die x- und y-Achse angeben.</br>\nWenn Sie mehrere x-Variablen angeben, erstellen wir ein separates Coxcomb/Bulls Eye für jede x-Variable.</br>\n<b>Verwendung</b>\n<br/>\n<code>\n#Sie können ein Bulls Eye-Diagramm für eine einzelne Faktorvariable erstellen, ein konzentrischer Kreis wird für jede Ebene der Faktorvariable erstellt. Die Breite des konzentrischen Kreises ist proportional zu den Zählungen jeder Ebene der Faktorvariable. Hier entspricht die Faktorvariable der Füllung wie unten<br/>\n#Pinguine ist ein Datensatz im R-Paket equatiomatic\nggplot(data=penguins,aes(x ='',fill=species)) +​\n                 geom_bar(alpha=1,width =0.9) +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"Anzahl\",fill =\"var1\",title= \"Bulls Eye-Diagramm mit Füllung: species\")​</br></br>\n#Sie können ein Bulls Eye-Diagramm erstellen, indem Sie eine Skala/numerische Variable als y-Variable und eine Faktorvariable angeben, die als Füllung dient. Hier wird ein konzentrischer Kreis für jede Ebene der Füllfaktorvariable erstellt. Die Breite des konzentrischen Kreises ist proportional zur Summe der y-Werte auf jeder Ebene der Faktorvariable. Hier entspricht die Faktorvariable der Füllung wie unten<br/>\nggplot(data=penguins,aes(x ='', y = bill_length_mm, fill = species)) +​\n                 geom_bar(alpha=1,width =0.9,stat=\"identity\") +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"var1\",fill =\"var2\",title= \"Bulls Eye-Diagramm mit X-Ästhetik:,Y-Ästhetik: var1,Füllung: var2\") </br></br>\n\n#Sie können ein Coxcomb-Diagramm erstellen, indem Sie eine x-Variable angeben. Die Scheiben werden für jede Ebene der x-Variable erstellt, der Radius jeder Scheibe ist proportional zur Anzahl<br/>\n    ggplot(data=penguins, aes(x=island, )) +\n        geom_bar( alpha=1,width=1,) +\n        coord_polar(\"x\") +\n        labs(x=\"island\",  title= \"Coxcomb-Diagramm mit X-Ästhetik: island\") +\n        xlab(\"island\") + ylab(\"Anzahl\")</br></br>\n\n#Sie können ein Coxcomb-Diagramm generieren, indem Sie eine X-Variable und eine Füllung angeben. Die Scheiben werden für jede Ebene der x-Variable erstellt. Jede Scheibe wird durch die Anzahl der Fälle in jeder Ebene der angegebenen Füllvariable gefüllt.\nggplot(data=penguins, aes(x=island,fill=species )) +\n\tgeom_bar( alpha=1, width=1) +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\",  title= \"Coxcomb-Diagramm mit X-Ästhetik: island Füllung: species\") +\n\txlab(\"island\") + ylab(\"Anzahl\")</br></br>\n\n\n#Sie können ein Coxcomb-Diagramm erstellen, indem Sie eine x-Variable, y-Variable und Füllung angeben. Die Scheiben werden für jede Ebene der x-Variable erstellt und durch die Summe der Werte der y-Variable für jede Ebene der in der Füllung angegebenen Variablen gefüllt. Die Scheiben werden nach den Ebenen der Füllvariable unterteilt. Die Fläche, die jede Ebene der Füllvariable innerhalb der Scheibe einnimmt, ist proportional zur Summe der Zählungen der y-Variable, die mit der Scheibe und der Füllvariable übereinstimmen.<br/>\nggplot(data=penguins, aes(x=island,y=bill_depth_mm,fill=species )) +\n\tgeom_bar( alpha=1,width=1,stat = \"identity\") +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\", y=\"bill_depth_mm\", title= \"Coxcomb-Diagramm mit X-Ästhetik: island Y-Ästhetik: bill_depth_mm Füllung: species\") +\n\txlab(\"island\") + ylab(\"bill_depth_mm\")</br></br>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndata: Der Standarddatensatz​\n</li>\n<li>\naes(): Generiert ästhetische Zuordnungen, die beschreiben, wie Variablen in den Daten auf visuelle Eigenschaften (Ästhetik) von Geoms abgebildet werden.​\n</li>\n<li>\nx: (Optional) Eine Faktor-/kategorische Variable. Die Länge des Balkens entspricht den Zählungen jeder Ebene der Faktorvariable.​\n</li>\n<li>\nY: (Optional) eine numerische Variable\n</li>\n<li>\nfill: (Optional) Eine optionale Faktor-/kategorische Variable, um die Zählungen der Ebenen in x zu gruppieren: (siehe oben)​\n</li>\n<li>\ngeom_bar(): Erstellt das Balkendiagramm, position =\"fill\" füllt den Balken mit einem Prozentsatz jeder Gruppierungsebene.​\n</li>\n<li>\nCoor_polar(): Das polare Koordinatensystem wird am häufigsten für Kreisdiagramme verwendet, die ein gestapeltes Balkendiagramm in polaren Koordinaten sind.\n</li>\n<li>\nLabs(): Ändert Achsenbeschriftungen und Legendentitel (dies ist optional)​\n</li>\n<li>\nfacet_grid(): Legt Panels in einem Raster an (dies ist optional)​\n</li>\n<li>\ntheme_calc(): Gibt das Rechnerdesign an (dies ist optional)​\n</li>\n<li>\ncoord_flip(): Achse umdrehen (dies ist optional)​\n</li>\n<li>\nalpha: Steuert die Opazität, nimmt Werte zwischen 0-1 an. 1 bedeutet keine Opazität.\n</li>\n</ul>\n<b>Paket</b></br>\nggplot2;ggthemes;</br>\n<b>Hilfe</b></br>\nhelp(coord_polar, package=ggplot2)</br>\nSonstiges: Klicken Sie auf die R-Hilfe-Schaltfläche, um detaillierte R-Hilfe zu erhalten. Sie können auch help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) eingeben.​\n    "
  }
}