{
  "title": "Cox, Fine-Gray",
  "navigation": "Cox, Fine-Gray",
  "modelname": "Modellnamen eingeben",
  "timevar": "Zeit bis zum Ereignis oder Zensur",
  "eventvar": "Ereignisse (0 = Zensur, 1 = Ereignis 1, 2 = Ereignis 2, ...)",
  "eventcodelabel": "Ereigniscodes",
  "modelterms": "Modellausdrucks-Builder für unabhängige Variablen",
  "stratavarslabel": "Stratifizierungsvariablen (optional)",
  "weightvar": "Gewichte (optional)",
  "tiemethod": "Methode für gebundene Zeiten",
  "diagnosticsbox": "Modelldiagnosen",
  "martminlabel": "Minimumwert der Nullmodell-Martingale-Restachse (-Inf bis 1)",
  "anovachkboxlabel": "Analyse der Abweichung (Typ II)",
  "help": {
    "title": "Cox, Fine-Gray",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nPasst ein Fine-Gray Cox proportional hazards Modell für Zeit-bis-Ereignis-Daten mit zensierten Beobachtungen an, wenn konkurrierende Risiken vorhanden sind. Fine-Gray-Modelle modellieren den Effekt von \nKovariaten auf die kumulative Inzidenzfunktion. Eine Alternative besteht darin, den Effekt von Kovariaten auf die ursachenspezifische Hazard zu modellieren, für die Standard-Cox-Regression-Modelle \nverwendet werden können. Eine Einführung in das Thema konkurrierende Risiken finden Sie in \"Einführung in die Analyse von Überlebensdaten in Anwesenheit konkurrierender Risiken\" von Peter Austin, \net. al., Circulation, 2016; 133:601-609. \n<br/><br/>\nModellanpassungsstatistiken, Parameterschätzungen und Hazard-Ratios werden bereitgestellt. Verfügbare Optionen umfassen die Methode für gebundene Zeiten und Modelldiagnosen. Das Modell wird mit den \nfinegray- und coxph-Funktionen im Survival-Paket angepasst.\n<br/><br/>\n<b>Modellnamen eingeben:</b> Geben Sie den Namen des Modells an, in dem die Ergebnisse gespeichert werden.\n<br/><br/>\n<b>Zeit bis zum Ereignis oder Zensur:</b> Zeit bis zum ersten Ereignis für diejenigen, die ein Ereignis erleben, oder Zeit bis zur letzten Nachverfolgung für diejenigen, die kein Ereignis erleben\n<br/><br/>\n<b>Ereignisse (0 = Zensur, 1 = Ereignis 1, 2 = Ereignis 2, ...):</b> Numerischer Ereignisindikator; 0=Zensur, 1=Ereignis 1, 2=Ereignis 2, usw.\n<br/><br/>\n<b>Ereigniscodes:</b> Wählen Sie das Ereignis von Interesse, das Sie modellieren möchten. Kann entweder ausgewählt oder eingegeben werden.\n<br/><br/>\n<b>Formel-Builder:</b> Erstellen Sie Terme, die im Modell enthalten sind. Faktoren, Strings und logische Variablen werden dummy-codiert. Die bereitgestellten Schaltflächen ermöglichen es Ihnen, Hauptwirkungen, vollständige faktoriale Wirkungen (Hauptwirkungen und alle Wechselwirkungen mit den beteiligten Variablen), Polynome, spezifische Wechselwirkungen zu spezifizieren und Terme aus der Liste zu löschen. Wechselwirkungen \nmit Stratifizierungsvariablen sind erlaubt.\n<br/><br/>\n<b>Stratifizierungsvariablen:</b> Geben Sie eine oder mehrere Stratifizierungsvariablen an. Diese können numerisch, faktorisch, geordnet oder Zeichenvariablen sein. Die Strata teilen die \nProbanden in separate Gruppen, wobei jede Gruppe eine eigene Basis-Hazard-Funktion hat. Wenn mehrere Stratifizierungsvariablen angegeben sind, wird für jede Kombination von Stratifizierungsvariablenebenen eine separate Basis-Hazard-Funktion \nverwendet.\n<br/><br/>\n<b>Gewichte:</b> Numerische Variable für Beobachtungsgewichte. Nützlich in Situationen, in denen jeder Datensatz nicht als eine Beobachtung gezählt werden sollte. \n<br/><br/>\n<b>Methode für gebundene Zeiten:</b> Methode zum Aufbrechen gebundener beobachteter Zeiten. Efron ist normalerweise die bessere Wahl, wenn es nicht viele gebundene Zeiten gibt.\n<br/><br/>\n<b>Modelldiagnosen:</b> Wenn ausgewählt, wird eine Bewertung der proportionalen Hazard und der funktionalen Form der Kovariaten durchgeführt, einschließlich relevanter Plots. \nWenn es Stratifizierungsvariablen oder nicht-numerische Prädiktoren gibt, werden keine funktionalen Formplots erstellt. \nDer <b>Minimumwert der Nullmodell-Martingale-Restachse</b> muss möglicherweise geändert werden, um alle Martingale-Restwerte zu sehen.\n<br/><br/>\n<b>Analyse der Abweichung (Typ II):</b> Wenn ausgewählt, werden gesamte Variablentests (einschließlich Tests mit mehreren Freiheitsgraden für mehrkategoriale Kovariaten) bereitgestellt. Wald-Tests \nwerden verwendet.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nKlicken Sie auf die Schaltfläche R-Hilfe, um detaillierte R-Hilfe zur coxph-Funktion zu erhalten. Gehen Sie zu Hilfe-> R-Funktionshilfe, um weitere Informationen zur finegray-Funktion zu erhalten, die das \nbenötigte Dataset erstellt.\n"
  }
}