{
  "title": "Cox, Stratified",
  "navigation": "Cox, Stratified",
  "modelname": "Modellnamen eingeben",
  "timevar": "Zeit bis zum Ereignis oder Zensur",
  "eventvar": "Ereignisse (1 = Ereignis, 0 = Zensur)",
  "modelterms": "Modellausdrucks-Builder für unabhängige Variablen",
  "stratavarslabel": "Stratifizierungsvariablen",
  "weightvar": "Gewichte (optional)",
  "tiemethod": "Methode für gebundene Zeiten",
  "diagnosticsbox": "Modelldiagnosen",
  "help": {
    "title": "Cox, Stratified",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n            Passt ein stratifiziertes Cox-Proportional-Hazards-Modell für Zeit-bis-Ereignis-Daten mit zensierten Beobachtungen an. Dies ist ein Cox-Modell, das eine separate Basisgefahr \n\t\t\tFunktion für jede Strata-Ebene zulässt. Modellanpassungsstatistiken, Parameterschätzungen und Hazard-Ratios werden bereitgestellt. Verfügbare Optionen umfassen die Methode für gebundene Zeiten \n\t\t\tund Modelldiagnosen. Das Modell wird mit der Funktion coxph im survival-Paket angepasst. \n            <br/>\n            <br/>\n            <b>Zeit bis zum Ereignis oder Zensur:</b> Zeit bis zum Ereignis für diejenigen, die das Ereignis erleben, oder Zeit bis zur letzten Nachverfolgung für diejenigen, die das Ereignis nicht erleben\n            <br/><br/>\n            <b>Ereignisse (1=Ereignis, 0=Zensur):</b> Numerischer Ereignisindikator; 1=Ereignis, 0=Zensur\n            <br/><br/>\n            <b>Formel-Builder:</b> Konstruktion von Termen, die im Modell enthalten sind. Faktoren, Strings und logische Variablen werden dummy-codiert. Die bereitgestellten Schaltflächen ermöglichen es Ihnen, \n\t\t\thauptsächliche Effekte, vollständige faktoriale Effekte (Haupteffekte und alle Wechselwirkungen mit den beteiligten Variablen), Polynome, spezifische Wechselwirkungen und Terme zu löschen \n\t\t\taus der Liste. Wechselwirkungen mit Stratifizierungsvariablen sind erlaubt.\n            <br/><br/>\n\t\t\t<b>Stratifizierungsvariablen:</b> Geben Sie eine oder mehrere Stratifizierungsvariablen an. Diese können numerisch, faktorisch, geordnet oder Zeichenvariablen sein. Die Strata \n\t\t\tteilen die Probanden in separate Gruppen, wobei jede Gruppe eine eigene Basisgefahrfunktion hat. Wenn mehrere Stratifizierungsvariablen angegeben sind, wird eine separate \n\t\t\tBasisgefahrfunktion für jede Kombination von Stratifizierungsvariablenebenen verwendet.\n\t\t\t<br/><br/>\n            <b>Gewichte:</b> Numerische Variable für Beobachtungsgewichte. Nützlich in Situationen, in denen jeder Datensatz nicht als eine Beobachtung gezählt werden sollte. \n            <br/>\n            <br/>\n            <b>Erforderliche Pakete:</b> survival, broom, survminer\n            <br/>\n            <br/>\n            Klicken Sie auf die Schaltfläche R-Hilfe, um detaillierte R-Hilfe zur Funktion coxph zu erhalten.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Optionen</b>\n            <br/>\n            <br/>\n            <b>Methode für gebundene Zeiten:</b>\n            <br/>\n            Methode zum Brechen gebundener beobachteter Zeiten. Efron ist normalerweise die bessere Wahl, wenn es nicht viele gebundene Zeiten gibt. Die exakte Methode kann vorteilhaft sein, wenn es viele gebundene Zeiten gibt, wie in diskreten Zeit-Situationen, kann jedoch etwas länger dauern, um das Modell anzupassen. \n            <br/>\n            <br/>\n            <b>Modelldiagnosen:</b>\n            <br/>\n            Wenn ausgewählt, werden proportionale Hazard-Tests und Diagramme bereitgestellt, zusätzlich zu einem Martingale-Restdiagramm.\n      "
  }
}