{
    "title": "Cox, Basis",
    "navigation": "Cox, Basis",
    "helplabel": "Klicken Sie auf die ?-Schaltfläche oben rechts im Dialog, um Details zu Beispieldatensätzen und zum unterstützten Datenformat zu erhalten.",
    "modelname": "Modellname eingeben",
    "timevar": "Zeit bis zum Ereignis oder zur Zensierung",
    "eventvar": "Ereignisse (1 = Ereignis, 0 = Zensierung)",
    "destvars": "Unabhängige Variablen",
    "weightvar": "Gewichte (optional)",
    "tiemethod": "Methode für gebundene Zeiten",
    "forestplotbox": "Wald-Diagramm",
    "diagnosticsbox": "Modelldiagnosen",
    "martscalebox": "Minimale Achsenwerte für Martingale-Residuen im Nullmodell (-Inf bis 1):",
    "devbox": "Analyse der Abweichung (Typ II)",
    "devtype": "Teststatistik",
    "help": {
        "title": "Cox, Basis",
        "r_help": "help(coxph, package = 'survival')",
        "body": "\n\t\t\tSehen Sie sich den Beispieldatensatz im Installationsverzeichnis an; der Standardpfad ist Laufwerksbuchstabe:&bsol;program files&bsol;BioStat Prime&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. Die Variable Followup_time sollte als Zeit bis zum Ereignis oder zur Zensierung eingegeben werden, und die Variable Event sollte als Ereignisse (1 = Ereignis, 0 = Zensierung) eingegeben werden. Geschlecht, Alter und BMI können die unabhängigen Variablen sein.\n\t\t\t<br/>\n            Die Ereignis-Variable muss numerisch sein, Faktoren sind nicht zulässig. Wenn Sie eine Ereignis-Variable vom Typ Faktor mit 2 Werten wie z.B. 0 und 1 haben, konvertieren Sie sie in numerische Werte.\n\t\t\tDieser Datensatz ist eine aktualisierte Version des Mockstudy-Datensatzes im Arsenal-Paket.\n\t\t\t<br/><br/>\n            <b>Cox-Proportional-Hazard-Modell</b>\n            <br/>\n            <br/>\n            Passt ein Cox-Proportional-Hazard-Modell für Zeit-bis-Ereignis-Daten mit zensierten Beobachtungen an. Modellanpassungsstatistiken, Parameterschätzungen und Hazard-Ratios werden bereitgestellt. Zu den verfügbaren Optionen gehören die Methode für gebundene Zeiten, Modelldiagnosen wie proportionale Hazards und Bewertungen der Funktionsform der Kovariaten sowie ein Wald-Diagramm der Hazard-Ratios mit Konfidenzintervallen. Das Modell wird mit der Funktion coxph im Survival-Paket angepasst.\n            <br/>\n            <br/>\n            <b>Zeit:</b> Zeit bis zum Ereignis für diejenigen, die das Ereignis erleben, oder Zeit bis zum letzten Follow-up für diejenigen, die das Ereignis nicht erleben\n            <br/><br/>\n            <b>Ereignis:</b> Numerischer Ereignisindikator; 1=Ereignis, 0=Zensierung\n            <br/><br/>\n            <b>Unabhängige Variablen:</b> Unabhängige Variablen, die im Modell enthalten sein sollen. Faktoren, Zeichenfolgen und logische Variablen werden als Dummy-Variablen kodiert.\n            <br/><br/>\n            <b>Gewichte:</b> Numerische Variable für Beobachtungsgewichte. Nützlich in Situationen, in denen jeder Datensatz nicht als eine Beobachtung gezählt werden sollte.\n            <br/>\n            <br/>\n            <b>Erforderliche Pakete:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Klicken Sie auf die Schaltfläche R-Hilfe holen, um detaillierte R-Hilfe zur Funktion coxph zu erhalten.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Optionen</b>\n            <br/>\n            <br/>\n            <b>Methode für gebundene Zeiten:</b>\n            <br/>\n            Methode zur Auflösung gebundener Beobachtungszeiten. Efron ist normalerweise die bessere Wahl, wenn es nicht viele gebundene Zeiten gibt. Die genaue Methode kann vorteilhaft sein, wenn viele gebundene Zeiten vorhanden sind, wie in diskreten Zeitsituationen, kann jedoch etwas länger dauern, bis das Modell angepasst ist.\n            <br/>\n            <br/>\n            <b>Wald-Diagramm:</b>\n            <br/>\n            Diagramm der Hazard-Ratios und Konfidenzintervalle für jeden Prädiktor im Modell.\n            <br/>\n            <br/>\n            <b>Modelldiagnosen:</b>\n            <br/>\n            Wenn ausgewählt, werden Tests und Diagramme für proportionale Hazards bereitgestellt sowie Bewertungen der Funktionsform für jede Kovariate im Modell. Die Option Minimalwert der Achse für Martingale-Residuen des Nullmodells muss möglicherweise geändert werden, damit alle Residuen im Diagramm angezeigt werden. Für Funktionsformbewertungen müssen Sie nur numerische Prädiktoren angeben und dürfen keine fehlenden Daten haben. Siehe Variablen > Fehlende Werte > NAs entfernen.\n            <br/>\n            <br/>\n            <b>Analyse der Abweichung (Typ II):</b>\n            Globaler Test für jeden Prädiktor im Modell. Mehrfachfreiheitsgrad-Tests werden für Effekte mit mehr als 2 Stufen bereitgestellt. Wald- und Likelihood-Ratio-Tests können durchgeführt werden, wobei die Likelihood-Ratio-Tests bessere Eigenschaften bei kleinen Stichproben aufweisen.\n            \n"
    }
}
