{
  "title": "Cox, binäre zeitabhängige Kovariaten",
  "navigation": "Cox, binäre zeitabhängige Kovariaten",
  "modelname": "Modellnamen eingeben",
  "timevar": "Zeit bis zum Ereignis oder Zensur",
  "eventvar": "Ereignisse (1 = Ereignis 1, 0 = Zensur)",
  "modelterms": "Modellausdrucks-Builder für unabhängige Variablen",
  "switchtimeslabel": "Expositionszeitvariablen für zeitabhängige Kovariaten",
  "tdprefixlabel": "Präfix für zeitabhängige Kovariaten",
  "subjectidlabel": "Subjektidentifikator",
  "weightvar": "Gewichte (optional)",
  "tiemethod": "Methode für gebundene Zeiten",
  "forestplotbox": "Wald-Diagramm",
  "diagnosticsbox": "Modell-Diagnosen",
  "martscalebox": "Nullmodell Martingale-Restachse Mindestwert (-Inf bis 1):",
  "devbox": "Analyse der Abweichung (Typ II)",
  "devtype": "Teststatistik",
  "startstopboxlabel": "Zeige (Start-, Stopp-) Zeitdatensatz",
  "startstopnamelabel": "Datensatzname",
  "help": {
    "title": "Cox, binäre zeitabhängige Kovariaten",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nPasst ein Cox-Proportional-Hazards-Modell für zeitabhängige Daten mit zensierten Beobachtungen an, das eine oder mehrere binäre zeitabhängige \"Expositions\"-Kovariaten umfasst. Diese Art von \nKovariate ist eine, bei der das Auftreten eines \"Ja\" nach Beginn der Nachverfolgung auftreten kann, und sobald dieses \"Ja\" auftritt, bleibt es für die Dauer der Nachverfolgung ein \"Ja\". Ein Beispiel \nwäre die Abstoßung eines Transplantats nach der Transplantation (d.h. bevor die Abstoßung auftritt, war der Patient nicht \"exponiert\"; nach der Abstoßung ist der Patient \"exponiert\"). \nDie Behandlung einer solchen Kovariate als zu Beginn der Nachverfolgung bekannt ist eine Form des Blicks in die Zukunft und führt zu verzerrten Schätzungen (auch bekannt als \"unsterbliches Zeit-Bias\").\n<br/><br/>\nModellanpassungsstatistiken, Parameterabschätzungen und Hazard-Ratios werden bereitgestellt. Verfügbare Optionen umfassen die Methode für gebundene Zeiten, Wald-Diagramme, Modell-Diagnosen und die Möglichkeit, \ndas zugrunde liegende Zählprozess-Datensatz zu sehen, der erstellt wird. Eine Tabelle, die den Zählprozess-Datensatz beschreibt, wird als Überprüfung bereitgestellt, dass diese Daten \nangemessen erstellt werden.\n<br/><br/>  \nZusammenfassungen der Zählprozessdaten:\n<br/>\n<b>früh:</b> Zeit, zu der sich der Prädiktor vor Beginn der Nachverfolgungszeit ändert<br/>\n<b>spät:</b> Zeit, zu der sich der Prädiktor ändert, nachdem die Nachverfolgung endet<br/>\n<b>innerhalb:</b> Zeit, zu der sich der Prädiktor innerhalb des Nachverfolgungszeitraums ändert<br/>\n<b>führend:</b> Zeit, zu der sich der Prädiktor zu Beginn der Nachverfolgung ändert<br/>\n<b>nachlaufend:</b> Zeit, zu der sich der Prädiktor am Ende der Nachverfolgung ändert<br/>\n<b>Grenze:</b> Zeit, zu der sich der Prädiktor entweder zu Beginn oder am Ende der Nachverfolgung ändert\n<br/><br/>\nFür weitere Informationen zu dieser Tabelle siehe das Vignette zu zeitabhängigen Kovariaten unter <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>.  \n<br/><br/>\nDas Modell wird mit der Funktion coxph im Survival-Paket angepasst.\n<br/><br/>\n<b>Modellnamen eingeben:</b> Name, unter dem die Modellergebnisse gespeichert werden\n<br/><br/>\n<b>Zeit bis zum Ereignis oder Zensur:</b> Zeit bis zum Ergebnisereignis für diejenigen, die das Ereignis erleben, oder Zeit bis zur letzten Nachverfolgung für diejenigen, die das Ergebnisereignis nicht erleben\n<br/><br/>\n<b>Ereignisse (1=Ereignis, 0=Zensur):</b> Numerischer Ereignisindikator; 1=Ereignis, 0=Zensur\n<br/><br/>\n<b>Formel-Builder:</b> Konstruktion von Termen, die im Modell enthalten sind. Faktoren, Strings und logische Variablen werden dummy-codiert. Die bereitgestellten Schaltflächen ermöglichen es Ihnen, Hauptwirkungen, vollständige faktoriale Wirkungen (Hauptwirkungen und alle Wechselwirkungen mit den beteiligten Variablen), Polynome, spezifische Wechselwirkungen zu spezifizieren und Terme aus der Liste zu löschen.\n<br/><br/>\n<b>Expositionszeitvariablen für zeitabhängige Kovariaten:</b> Numerische Variablen, die die Zeit speichern, zu der das Subjekt erstmals \"exponiert\" war. Dies muss auf derselben Zeitskala wie die Zeitvariable sein. Fehlende Werte sollten für Subjekte verwendet werden, die nie exponiert waren. Jede hier angegebene Variable erstellt eine separate zeitabhängige Kovariate. Eine angegebene \nZeit geht davon aus, dass ein Subjekt vor dieser Zeit nicht exponiert ist und nach dieser Zeit exponiert ist (d.h. wenn der Prädiktor von \"Nein\" auf \"Ja\" wechselt). Nur positive Werte anzugeben bedeutet, dass \nSubjekte für einige Zeit nach Beginn der Nachverfolgung nicht exponiert sind. Die Angabe einiger positiver und negativer Zeiten zeigt an, dass einige Subjekte nach und einige vor \nBeginn der Nachverfolgung exponiert waren. Wenn Sie wissen, dass ein Subjekt vor Beginn der Nachverfolgung exponiert war, aber nicht genau wissen, wann, können Sie jede negative Zeit verwenden, und das Modell wird dieses Subjekt korrekt als während der gesamten Nachverfolgungszeit exponiert behandeln. Wenn Subjekte nach der Nachverfolgung exponiert sind, werden sie korrekt als während der gesamten Nachverfolgungszeit nicht exponiert behandelt.\n<br/><br/>\n<b>Präfix für zeitabhängige Kovariaten:</b> Gewünschtes Präfix, das für jede in dem Feld <b>Expositionszeitvariablen</b> angegebene zeitabhängige Kovariate verwendet werden soll. Der Name jeder zeitabhängigen Kovariate beginnt mit diesem Präfix.\n<br/><br/>\n<b>Subjektidentifikator:</b> Die Variable, die den Subjektidentifikator speichert. Dies ist erforderlich, um den zugrunde liegenden Zählprozess-Datensatz zu erstellen.\n<br/><br/>\n<b>Gewichte:</b> Numerische Variable für Beobachtungsgewichte. Nützlich in Situationen, in denen jeder Datensatz nicht als eine Beobachtung gezählt werden sollte. \n<br/><br/>\n<b>Optionen:</b>\n<br/><br/>\n<b>Methode für gebundene Zeiten:</b> Methode zur Auflösung gebundener beobachteter Zeiten. Efron ist normalerweise die bessere Wahl, wenn es nicht viele gebundene Zeiten gibt. Die exakte Methode kann vorteilhaft sein, wenn \nes viele gebundene Zeiten gibt, wie in diskreten Zeit-Situationen, kann jedoch etwas länger dauern, um das Modell anzupassen.\n<br/><br/>\n<b>Wald-Diagramm:</b> erstellt ein Wald-Diagramm von Hazard-Ratios und Konfidenzintervallen\n<br/><br/>\n<b>Zeige (Start-, Stopp-) Datensatz:</b> Zeigt den zugrunde liegenden Zählprozess-Datensatz, der in den Berechnungen verwendet wird. Dies unterteilt die Nachverfolgungszeit jedes Subjekts in Teile, abhängig davon, wann sich die zeitabhängige Kovariate ändern sollte.\n<br/><br/>\n<b>Modell-Diagnosen:</b> Wenn ausgewählt, werden proportionalen Hazardentests und Diagramme bereitgestellt, zusätzlich zu Bewertungen der funktionalen Form für jede Kovariate im Modell.  \nDie Mindestwertoption für die Nullmodell Martingale-Restachse muss möglicherweise geändert werden, damit alle Residuen im Diagramm erscheinen. Um funktionale Formbewertungen zu erhalten, müssen Sie \nnur numerische Prädiktoren angeben und keine fehlenden Daten haben. Siehe Variablen > Fehlende Werte > NAs entfernen.\n<br/><br/>\n<b>Analyse der Abweichung (Typ II):</b> Globaler Test jedes Prädiktors im Modell. Mehrgradige Tests werden für Effekte mit mehr als 2 Ebenen bereitgestellt.  \nWald- und Likelihood-Verhältnis-Tests können erhalten werden, wobei Likelihood-Verhältnis-Tests bessere Eigenschaften bei kleinen Stichproben haben.           \n<br/><br/>\n<b>Erforderliche Pakete:</b> survival, broom, survminer, car\n"
  }
}