{
  "help": {
    "title": "Kreuztabelle",
    "r_help": "help(CrossTable, package=gmodels)",
    "body": "\n            <b>Beschreibung</b></br>\nErstellt eine Kreuztabelle mit Zeilen-, Spalten- und Schichtvariablen. Wenn mehrere Zeilen- und Spaltenvariablen angegeben sind, generieren wir eine separate Kreuztabelle für jedes Paar von Zeilen- und Spaltenvariablen. Zusätzlich werden die folgenden Informationen angezeigt<br/>\nErwartete Häufigkeiten<br/>\nZeilen- und Spaltenprozentsätze<br/>\nUnstandardisierte, standardisierte und angepasste Residuen<br/>\nChisq mit Odds Ratio, McNemar- und Fisher-Statistiken<br/>\nHINWEIS: Wir entfernen automatisch alle Zeilen, in denen jede Häufigkeit 0 ist. Dies kann sich darauf auswirken, wie die Chisq-, McNemar- und Fisher-Tests durchgeführt werden. Zum Beispiel könnten Sie 3 Zeilen und 2 Spalten erwarten, da die Zeilenvariable 3 Ebenen und die Spaltenvariable 2 Ebenen hat. Wenn jedoch eine Zeilenebene alle 0-Häufigkeiten hat, erhalten Sie eine 2*2-Tabelle. Während die Monte-Carlo-Simulation mit dem Fisher-Test auf einer 3*2-Tabelle läuft, gilt dies nicht für eine 2*2-Tabelle, und der normale Fisher-Test wird durchgeführt. \n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nBSkyCrossTable(x,y,layers, weight, datasetname, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE,long_table = FALSE )\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: Zeilenvariable\n</li>\n<li>\ny: Spaltenvariable\n</li>\n<li>\nlayers: eine oder mehrere Variablen für Schichten\n</li>\n<li>\nweights: eine numerische Variable, die die Häufigkeitsgewichte enthält\n</li>\n<li>\ndatasetname: Name des Datensatzes, aus dem x, y und layers (Variablen) ausgewählt werden\n</li>\n<li>\nchisq:  wenn TRUE, wird eine Chi-Quadrat-Tabelle generiert\n</li>\n<li>\nprop.r: Zeilenprozentsätze werden erzeugt, wenn dies TRUE ist\n</li>\n<li>\nprop.c: Spaltenprozentsätze werden erzeugt, wenn dies TRUE ist\n</li>\n<li>\nresid: wenn TRUE, werden unstandardisierte Residuen erzeugt\n</li>\n<li>\nsresid: wenn TRUE, werden standardisierte Residuen erzeugt\n</li>\n<li>\nexpected: Erwartete Häufigkeiten werden erzeugt, wenn dies TRUE ist\n</li>\n<li>\nasresid:  wenn TRUE, werden angepasste Residuen erzeugt\n</li>\n<li>\nlong_table: Die Long-Table-Option wird eingeführt, um Analysen mit einer großen Anzahl von Variablen zu berücksichtigen. Die Wahl des langen Formats steuert die Breite der Ausgabetabelle, sodass es einfach ist, Ergebnisse zu sehen, ohne nach rechts im Ausgabefenster scrollen zu müssen. \n</li>\n</ul>\n<b>Wert</b></br>\nEine Liste mit den Ergebnissen\n<br/>\n<b>Beispiel</b></br>\n<code> \nBSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>\nlayers=c('type'),datasetname='Dataset2',<br/>\nchisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>\nresid=FALSE,sresid=FALSE,expected=FALSE,<br/>\nasresid=FALSE)</br>\nBSkyFormat(BSky_Multiway_Cross_Tab)</br>\n</code> <br/>\n<b>Paket</b></br>\ngmodels</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogfelds oder führen Sie den folgenden Befehl aus: help(CrossTable, package=gmodels), indem Sie einen R-Code-Chunk erstellen, indem Sie + im Ausgabefenster klicken  \n    "
  }
}