{
  "title": "Kreuztabelle Liste",
  "navigation": "Kreuztabelle Liste",
  "destvarslabel": "Variablen für Tabelle",
  "missinglabel": "Fehlende Werte",
  "removelabel": "Entfernen",
  "showexcludelabel": "Anzeigen und von Prozenten ausschließen",
  "includelabel": "Anzeigen und in Prozenten einbeziehen",
  "sparseoptlabel": "Kombinationen mit 0 Zählungen einbeziehen",
  "toplistoptlabel": "Die N häufigsten Werte anzeigen",
  "topnumlabel": "N",
  "help": {
    "title": "Kreuztabelle Liste",
    "r_help": "help(freqlist, package ='arsenal')",
    "body": "\nDies erstellt Häufigkeitstabellen in Listenformat für Kombinationen von einem oder mehreren Variablen. Jede Kombination von Werten über alle angegebenen Variablen wird tabelliert, \nmit ihren beobachteten Häufigkeiten. Die angegebenen Variablen können jede Klasse sein, einschließlich numerischer, kontinuierlicher Variablen. Während dies für Zusammenfassungsfrequenzen und \nProzentsätze verwendet werden kann, ist ein Hauptzweck die Überprüfung von Daten auf Inkonsistenzen. Es sollte darauf geachtet werden, wie viele Variablen gekreuzt werden und wie viele Möglichkeiten resultieren können, da \neinige Tabellen länger zur Erstellung benötigen. \n<br/><br/>\n<b>Variablen für Tabelle:</b>  <br/>Variablen, die in die Tabelle aufgenommen werden sollen, die jede Klasse sein können. Die Tabelle wird entsprechend der Reihenfolge der Variablen in dieser Liste sortiert.  \nDas bedeutet, wenn die Variablen A und B die angegebene Reihenfolge sind, wird die Tabelle nach den Ebenen von A und dann nach den Ebenen von B innerhalb von A sortiert.\n<br/><br/>\n<b>Fehlende Werte</b>\n<br/>\n<ul>\n\t<li><b>Entfernen:</b>  Kombinationen von Variablenwerten, die NA's haben, werden aus der Tabelle ausgeschlossen.</li>\n\t<li><b>Anzeigen und von Prozenten ausschließen:</b>  Kombinationen von Variablenwerten, die NA's haben, werden in die Tabelle aufgenommen, aber nicht in die Prozentberechnungen einbezogen.</li>\n\t<li><b>Anzeigen und in Prozenten einbeziehen:</b>  Kombinationen von Variablenwerten, die NA's haben, werden in die Tabelle aufgenommen und in die Prozentberechnungen einbezogen.</li> \n</ul>\n<br/><br/>\n<b>Kombinationen mit 0 Zählungen einbeziehen:</b>  <br/>Ob Kombinationen von Variablenwerten, die im Datensatz nicht existieren, einbezogen werden sollen. Zum Beispiel, wenn die Variablen A und B beobachtete Werte von 1, 2 und 3 haben, aber die (A, B) Kombination (1, 3) nicht in den Daten beobachtet wird, würde diese Option eine Zeile für die (1, 3) Kombination mit einer Häufigkeit von 0 einfügen.\n<br/><br/>\n<b>Die N häufigsten Werte anzeigen:</b>  <br/>Wenn aktiviert, würde dies eine separate Tabelle mit den N häufigsten Variablenkombinationen erstellen.\n<ul>\n\t<li><b>N:</b> Wie viele Variablenkombinationen für die Top-N-Tabelle angezeigt werden sollen.</li>\n</ul>\n<b>Erforderliche R-Pakete:</b> arsenal\n\t\t\t"
  }
}