{
  "title": "Anpassung univariater Verteilungen an nicht zensierte Daten",
  "navigation": "Verteilungsanpassung",
  "variableSelcted": "Wählen Sie eine Variable aus, die die Verteilung enthält",
  "label2": "Anpassungstest für verschiedene Verteilungen",
  "normDistChk": "Normal",
  "weibullDistChk": "Weibull",
  "lnormDistChk": "Log Normal",
  "poissonDistChk": "Poisson",
  "expDistChk": "Exponential",
  "gammaDistChk": "Gamma",
  "nbinomDistChk": "Negative Binomial",
  "geomDistChk": "Geometrisch",
  "betaDistChk": "Beta",
  "unifDistChk": "Uniform",
  "logisDistChk": "Logistisch",
  "cauchyDistChk": "Cauchy",
  "method": "Anpassungsmethode",
  "gof": "Goodness-of-fit (gof) - erforderlich nur, wenn die 'mge'-Methode der Anpassung oben gewählt wurde",
  "help": {
    "title": "Anpassung univariater Verteilungen an nicht zensierte Daten",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tAnpassung univariater Verteilungen an nicht zensierte Daten durch maximale Wahrscheinlichkeit (mle), Momentanpassung (mme), Quantilanpassung (qme) oder Maximierung der Goodness-of-fit-Schätzung (mge), die auch als Minimierung der Distanzschätzung bekannt ist.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür detaillierte Hilfe - verwenden Sie R help(fitdist, package = fitdistrplus) und help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDie vier möglichen Anpassungsmethoden sind unten beschrieben:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWenn Methode=\"mle\" (Standard)\n\t\t\t\tDie maximale Wahrscheinlichkeitsschätzung besteht darin, die Log-Wahrscheinlichkeit zu maximieren. Eine numerische Optimierung wird in mledist über optim durchgeführt, um die besten Werte zu finden (siehe mledist für Details).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWenn Methode=\"mme\"\n\t\t\t\tDie Momentanpassungsschätzung besteht darin, theoretische und empirische Momente zu gleichzusetzen. Geschätzte Werte der Verteilungsparameter werden durch eine geschlossene Formel für die folgenden Verteilungen berechnet: \"norm\", \"lnorm\", \"pois\", \"exp\", \"gamma\", \"nbinom\", \"geom\", \"beta\", \"unif\" und \"logis\". Andernfalls werden die theoretischen und empirischen Momente numerisch durch Minimierung der Summe der quadrierten Unterschiede zwischen beobachteten und theoretischen Momenten angepasst. In diesem letzten Fall sind weitere Argumente im Aufruf von fitdist erforderlich: order und memp (siehe mmedist für Details).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWenn Methode = \"qme\"\n\t\t\t\tDie Quantilanpassungsschätzung besteht darin, theoretische und empirische Quantile gleichzusetzen. Eine numerische Optimierung wird in qmedist über optim durchgeführt, um die Summe der quadrierten Unterschiede zwischen beobachteten und theoretischen Quantilen zu minimieren. Die Verwendung dieser Methode erfordert ein zusätzliches Argument probs, das als numerischer Vektor der Wahrscheinlichkeiten definiert ist, für die das/die Quantil(e) angepasst werden soll(en) (siehe qmedist für Details).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWenn Methode = \"mge\"\n\t\t\t\tDie maximale Goodness-of-fit-Schätzung besteht darin, eine Goodness-of-fit-Statistik zu maximieren. Eine numerische Optimierung wird in mgedist über optim durchgeführt, um die Goodness-of-fit-Distanz zu minimieren. Die Verwendung dieser Methode erfordert ein zusätzliches Argument gof, das für die gewählte Goodness-of-fit-Distanz kodiert ist. Man kann die klassische Cramer-von Mises-Distanz (\"CvM\"), die klassische Kolmogorov-Smirnov-Distanz (\"KS\"), die klassische Anderson-Darling-Distanz (\"AD\"), die den Schwänzen der Verteilung mehr Gewicht verleiht, oder eine der Varianten dieser letzten Distanz verwenden, die von Luceno (2006) vorgeschlagen wurde (siehe mgedist für weitere Details). Diese Methode ist nicht für diskrete Verteilungen geeignet.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWenn Methode = \"mse\"\n\t\t\t\tDie maximale Goodness-of-fit-Schätzung besteht darin, den durchschnittlichen log-Spacing zu maximieren. Eine numerische Optimierung wird in msedist über optim durchgeführt.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDie Konvergenz ist \n\t\t\t\tEin ganzzahliger Code für die Konvergenz von optim/constrOptim, der wie folgt definiert ist oder vom Benutzer in der benutzerdefinierten Optimierungsfunktion definiert wird. 0 zeigt eine erfolgreiche Konvergenz an. 1 zeigt an, dass die Iterationsgrenze von optim erreicht wurde. 10 zeigt die Degenerierung des Nealder-Mead-Simplex an. 100 zeigt an, dass optim auf einen internen Fehler gestoßen ist.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tGoodness-of-fit-Statistiken werden von gofstat() berechnet. Die Chi-Quadrat-Statistik wird unter Verwendung von Zellen berechnet, die durch das Argument chisqbreaks definiert sind, oder Zellen, die automatisch aus den Daten definiert werden, um ungefähr die gleiche Anzahl von Beobachtungen pro Zelle zu erreichen, die ungefähr gleich dem Argument meancount entspricht, oder leicht mehr, wenn es einige Bindungen gibt. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür kontinuierliche Verteilungen werden auch Kolmogorov-Smirnov-, Cramer-von-Mises- und Anderson-Darling-Statistiken berechnet, wie von Stephens (1986) definiert.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWichtige Statistiken sind Cramer-von-Mises-, Anderson-Darling- und Kolmogorov-Statistiken für kontinuierliche Verteilungen und Chi-Quadrat-Statistiken für diskrete (\"binom\", \"nbinom\", \"geom\", \"hyper\" und \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Für einen guten Überblick über die Verteilungsanpassung siehe https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Für einen guten Überblick über die Verteilungsanpassung siehe https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}