{
  "title": "Cullen- und Frey-Diagramm mit Beschreibungen einer empirischen Verteilung für nicht zensierte Daten",
  "navigation": "Verteilungsanalyse (Cullen- und Frey-Diagramm)",
  "variableSelcted": "Wählen Sie eine Variable aus, die die Verteilung enthält",
  "boot": "(Optional) Boot-Werte von Schiefe und Kurtosis. Wenn angegeben, muss es eine ganze Zahl über 10 sein",
  "discreteChk": "Diskret - nicht ausgewählt (Standard) für gleichmäßig, normal, logistisch, lognormal, beta und gamma. Ausgewählt für Poisson und negative Binomialverteilung",
  "method": "Unvoreingenommen (Standard) für unvoreingenommene geschätzte Werte von Statistiken oder Stichprobe für Stichprobenwerte",
  "help": {
    "title": "Beschreibung einer empirischen Verteilung für nicht zensierte Daten",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tBerechnet beschreibende Parameter einer empirischen Verteilung für nicht zensierte Daten und bietet ein Schiefe-Kurtosis-Diagramm\n\t\t\t\t<br/>\n\t\t\t\tFür die detaillierte Hilfe - verwenden Sie R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMinimum, Maximum, Median, Mittelwert, Stichprobenstandardabweichung und Stichprobe (wenn Methode==\"sample\") oder standardmäßig unvoreingenommene Schätzungen von \n\t\t\t\tSchiefe und Pearsons Kurtosiswerten werden ausgegeben (Sokal und Rohlf, 1995). Ein Schiefe-Kurtosis-Diagramm wie das \n\t\t\t\tvon Cullen und Frey (1999) vorgeschlagene wird für die empirische Verteilung gegeben. In diesem Diagramm werden Werte für gängige \n\t\t\t\tVerteilungen ebenfalls angezeigt, um die Wahl der Verteilungen zur Anpassung an die Daten zu unterstützen. Für einige \n\t\t\t\tVerteilungen (normal, gleichmäßig, logistisch, exponentiell zum Beispiel) gibt es nur einen möglichen Wert für die Schiefe \n\t\t\t\tund die Kurtosis (zum Beispiel für eine Normalverteilung, Schiefe = 0 und Kurtosis = 3), und die Verteilung wird somit \n\t\t\t\tals Punkt im Diagramm dargestellt. Für andere Verteilungen werden Bereiche möglicher Werte dargestellt, die aus \n\t\t\t\tLinien (Gamma- und lognormalen Verteilungen zum Beispiel) oder größeren Bereichen (Beta-Verteilung zum Beispiel) bestehen. \n\t\t\t\tDie Weibull-Verteilung wird im Diagramm nicht dargestellt, aber es wird in der Legende angegeben, dass Formen, die nahe \n\t\t\t\tlognormalen und gamma-Verteilungen liegen, mit dieser Verteilung erzielt werden können.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm die Unsicherheit der geschätzten Werte von Kurtosis und Schiefe aus den Daten zu berücksichtigen, kann der Datensatz \n\t\t\t\tdurch Festlegen des Arguments boot auf eine ganze Zahl über 10 bootstrapped werden. Boot-Werte von Schiefe und Kurtosis \n\t\t\t\tentsprechend den Boot-Bootstrap-Proben werden dann berechnet und in blauer Farbe im Schiefe-Kurtosis-Diagramm angezeigt.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWenn diskret TRUE ist, sind die dargestellten Verteilungen die Poisson-, negative Binomialverteilungen und die Normalverteilung, \n\t\t\t\tauf die vorherige diskrete Verteilungen konvergieren können. Wenn diskret FALSE ist, sind dies gleichmäßig, normal, \n\t\t\t\tlogistisch, lognormal, beta und gamma Verteilungen.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Für einen guten Überblick über die Anpassung von Verteilungen siehe https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}