{
  "title": "Ein kurzer Überblick über die Funktionalität des Designs von Experimenten (DoE)",
  "navigation": "DoE Übersicht",
  "lbl1": "1. Um ein Design unter DoE zu erstellen -> Menü Design erstellen, benötigen Sie zunächst einen Datensatz mit Faktordetails, um das Design zu erstellen.",
  "lbl2": "2. Um zu beginnen, wählen Sie einen der bereitgestellten Beispieldatensätze (Excel-Datei) im Verzeichnis der Beispieldatensätze in Ihrem Installationsverzeichnis von BlueSky Statistics aus oder Sie können eine Faktordetailtabelle/-datensatz im Handumdrehen mit dem Menü DoE -> DoE-Faktordetails erstellen.",
  "lbl3": "3. Sobald ein Datensatz mit dem Menü Datei öffnen geöffnet oder im Handumdrehen in Schritt 2 oben erstellt wurde, gehen Sie unter DoE -> Menü Design erstellen, um ein passendes Design zu erstellen.",
  "lbl4": "4. Nachdem ein Design erfolgreich erstellt wurde, wird es im UI-Raster des Datensatzes angezeigt. Sie können das Menü DoE -> Design inspizieren verwenden, um das gerade erstellte Design zu inspizieren.",
  "lbl5": "5. Lassen Sie uns das Design mit dem Menü DoE -> Design exportieren in ein Verzeichnis des Dateisystems exportieren. Es werden automatisch drei Dateien (.csv, .rda, .html) mit denselben Namen wie der Design-Datensatz im UI-Raster im angegebenen Dateipfad erstellt.",
  "lbl6": "6. Die in Schritt 5 exportierte CSV-Datei ist dazu gedacht, die Experimente in der realen Welt gemäß dem Design einzurichten, um Ergebnisse zur späteren Analyse zu sammeln/aufzuzeichnen.",
  "lbl7": "7. Die Ergebnisse werden aufgezeichnet und als separate Spalte(n) mit dem Namen Antworten im DoE-Vokabular in die CSV-Datei hinzugefügt. Ändern Sie die CSV-Dateierweiterung nicht in ein anderes Dateiformat. Sehen Sie sich das Verzeichnis der Beispieldatensätze für DoE an, Beispiele von CSV-Dateien, die als mitresp gekennzeichnet sind, um die Werte für die Ergebnis-/Antwortspalten zu erhalten, um diese zu kopieren und Ihre eigenen Antwortspalten in Ihrer exportierten CSV-Datei zu erstellen, die Teil des Designexports in Schritt 5 oben war.",
  "lbl8": "8. Lassen Sie uns die CSV-Design-Datei mit den hinzugefügten Antwortspalten mit dem Menü DoE -> Designantwort importieren, zurück in die BlueSky Statistics-App importieren.",
  "lbl9": "9. Um die Design-CSV-Datei in Schritt 8 zu importieren, muss das ursprüngliche Design (das exportiert wurde) im UI-Raster des Datensatzes verfügbar sein. Wenn es nicht verfügbar ist, verwenden Sie das Menü Datei öffnen, um die Design-.rda-Datei zu laden, die als Teil des Designexports in Schritt 5 erstellt wurde.",
  "lbl10": "10. Nachdem die CSV-Datei erfolgreich gegen den richtigen/aktiven Design-Datensatz importiert wurde und ein neues Design mit den Antwortspalten erstellt wurde, können Sie das Menü DoE -> Design inspizieren verwenden, um das Design mit den Antwortspalten zu inspizieren.",
  "lbl11": "11. Jetzt ist das Design mit den Antwortspalten bereit für die Analyse mit dem Menü DoE -> Design analysieren mit verschiedenen Analysemethoden, z.B. lineares Modell, Response Surface-Modell usw."
}