{
  "title": "Gleichheit der Varianzen",
  "navigation": "Gleichheit der Varianzen",
  "label1": "Wählen Sie Tests",
  "bartlett": "Bartlett-Test",
  "levene": "Levene-Test",
  "fligner": "Fligner–Killeen-Test",
  "normal_distribution": "Test basierend auf normaler Verteilung",
  "pairwiseLeveneTest": "Pairwise Levene-Test",
  "label2": "Datenformat",
  "wide": "Breites Format",
  "long": "Langformat",
  "label3": "Konfidenzniveau",
  "label4": "Alternativhypothese",
  "alt1": "Zweiseitig",
  "alt2": "Größer",
  "alt3": "Weniger",
  "label5": "Methode zur Anpassung des p-Werts (für den pairwise Levene-Test)",
  "padj1": "Holm",
  "padj2": "Hochberg",
  "padj3": "Hommel",
  "padj4": "Bonferroni",
  "padj5": "BH",
  "padj6": "BY",
  "padj7": "FDR",
  "padj8": "Keine",
  "help": {
    "title": "Tests zur Gleichheit der Varianzen",
    "r_help": "help(bartlett.test, package=stats); help(leveneTest, package=car); help(fligner.test, package=stats)",
    "body": "\n<b>Beschreibung</b></br>\nTestet die Gleichheit der Varianzen. Unterstützt Daten in den folgenden Formaten<br/>\nbreit: Jede Variable enthält Messungen, z.B. enthält Variable 1 Messungen von Maschine A, Variable 2 enthält Messungen von Maschine B...<br/>\nlange: Die Messungen in einer Variable sind nach einer oder mehreren Variablen gruppiert, z.B. werden Testergebnisse nach Geschlecht und Klasse gruppiert. <br/>\nDie Methode zur Anpassung des p-Werts wird nur angewendet, wenn der pairwise Levene-Test ausgewählt ist.<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"breit\" ),<br/>\n    cols_to_compare = c('A','B','C'),<br/>\n    response_col = NULL,<br/>\n    group_col = NULL,<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"zweiseitig\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n    Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Datensatz1\"<br/>\n)<br/>\nBSky_variance_analysis (<br/>\n    data_format = c(\"lang\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Punktzahl'),<br/>\n    group_col = c('Geschlecht','Klasse'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"zweiseitig\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Datensatz2\"<br/>\n)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndata_format: Kann breit oder lang sein\n</li>\n<li>\ncols_to_compare: Die Variablen, um die Varianzen zu vergleichen, wenn der Datensatz im breiten Format vorliegt, NULL für Daten im langen Format\n</li>\n<li>\nresponse_col: Die Messvariable, um die Varianzen zwischen Gruppen zu vergleichen. NULL für breite Daten\n</li>\n<li>\ngroup_col: Eine oder mehrere Variablen, die verwendet werden, um die Messvariable zu gruppieren, wir testen die Gleichheit der Varianzen zwischen Gruppen\n</li>\n<li>\nconf_level: Konfidenzintervall\n</li>\n<li>\nalt_hypothesis: Auf zweiseitig setzen\n</li>\n<li>\np_adjust_method: Methode zur Anpassung des p-Werts\n</li>\n<li>\nnormal_distribution: wenn TRUE, gehen wir von Normalverteilung aus\n</li>\n<li>\nFligner_Killeen: wenn TRUE, führt einen Fligner_Killeen-Test durch\n</li>\n<li>\npairwiseComparison: Führen Sie einen pairwise Levene-Test durch\n</li>\n<li>\ndatasetname: Name des Datensatzes, aus dem x,y und Schichten (Variablen) ausgewählt werden\n</li>\n</ul>\n<b>Wert</b></br>\nBonferroni-Konfidenzintervalle für die angegebenen Konfidenzintervalle. Testergebnisse für Mehrfachvergleichtests (wenn Normalität nicht angenommen wird) und Ergebnisse anderer Tests\n<br/>\n<b>Beispiel</b></br>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"lang\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Punktzahl'),<br/>\n    group_col = c('Geschlecht','Klasse'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"zweiseitig\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Datensatz2\"<br/>\n)<br/>\n</code> <br/>\n\n<b>Details</b></br>\nTest für mehrere Vergleiche</br>\nVerwendet, wenn Sie nicht „Test basierend auf normaler Verteilung verwenden“ auswählen – d.h. Sie bevorzugen Methoden, die robust gegenüber nicht-normalen Verteilungen sind. </br>\nWenn Sie k > 2 Gruppen haben, berechnen wir die Intervalle für Standardabweichungen, sodass, wenn zwei Intervalle sich nicht überlappen, die zugehörigen Standardabweichungen signifikant unterschiedlich sind.</br> \nFür k = 2 Stichproben verwendet es die Methode von Bonett zum Testen von zwei Varianzen mit hypothesisiertem Verhältnis = 1. </br>\nWenn der gesamte Test für mehrere Vergleiche signifikant ist, sind die Standardabweichungen, die den sich nicht überlappenden Intervallen entsprechen, statistisch unterschiedlich.</br>\nVorteile: Leistungsfähiger als die Methode von Levene in vielen Situationen (für kontinuierliche Verteilungen). Aber wenn die Stichprobengrößen klein sind (< 20) oder die Verteilungen extrem schief/schwer sind, kann die Fehlerquote vom Typ I erhöht sein.</br>\nP-Wert für den Test</br>\nWenn es 2 Stichproben im Design gibt, berechnen wir den p-Wert für den Test für mehrere Vergleiche mit der Methode von Bonett für einen Test mit 2 Varianzen und einem hypothesisierten Verhältnis, Ρo, von 1.</br>\nWenn es k > 2 Stichproben im Design gibt, sei Pij der p-Wert des Tests für jedes Paar (i, j) von Stichproben. Der p-Wert für das Verfahren der Mehrfachvergleiche als Gesamttest der Gleichheit der Varianzen wird durch Folgendes gegeben:</br>\nP =min{Pij, 1<=i<j<=k}\n</br>\nLevene-Teststatistik</br>\nDer Levene-Test wird verwendet, um die Nullhypothese zu testen, dass die Varianzen über Gruppen hinweg gleich sind (H₀: alle Varianzen gleich) gegenüber der Alternative, dass mindestens eine Varianz unterschiedlich ist. </br>\nEr ist robuster gegenüber Abweichungen von der Normalverteilung im Vergleich zu Tests, die Normalität annehmen (z.B. Bartlett-Test). </br>\nKonkret verwenden wir die Brown-Forsythe-Modifikation (absolute Abweichungen vom Stichprobenmedian anstelle des Mittelwerts) für verbesserte Robustheit. </br>\nInterpretation: Wenn der p-Wert < α ist, lehnen Sie H₀ ab und schließen Sie, dass die Varianzen nicht gleich sind. </br>\n</br>\nBartlett-Teststatistik</br>\nDer Bartlett-Test ist darauf ausgelegt, die Gleichheit der Varianzen zu testen, wenn die Daten normal verteilt sind. H₀: alle Varianzen gleich. Wenn k > 2 Gruppen,\nverwenden wir den Bartlett-Test (wenn „Test basierend auf normaler Verteilung verwenden“ ausgewählt ist). </br>\nDie Teststatistik (häufig als B bezeichnet) basiert auf dem Vergleich des gewichteten arithmetischen Mittels und des gewichteten geometrischen Mittels der Stichprobenvarianzen. </br>\nDie Statistik folgt (ungefähr) einer Chi-Quadrat-Verteilung mit k-1 df. </br>\nDa der Bartlett-Test Normalität annimmt, ist er empfindlich gegenüber Abweichungen von der Normalität (d.h. nicht-normale oder schwergewichtige Verteilungen können zu irreführenden Ergebnissen führen)</br>\n</br>\nF-Teststatistik</br>\nWenn es genau zwei Gruppen (k = 2) gibt, verwenden wir einen F-Test anstelle des Bartlett-Tests (wenn „Test basierend auf normaler Verteilung verwenden“ ausgewählt ist). </br>\nH₀: die Varianzen sind gleich (σ₁² = σ₂²). </br>\nDie F-Statistik wird als Verhältnis der beiden Stichprobenvarianzen (größere über kleinere) berechnet. Dann hängt der p-Wert von der Alternativhypothese ab\n (einseitig „weniger als“ oder „größer als“, oder zweiseitig). </br>\nInterpretation: Wenn der p-Wert < α ist, lehnen Sie H₀ ab und schließen Sie, dass die Varianzen unterschiedlich sind. Es ist nur unter der Annahme der Normalität gültig.</br>\n<b>Wert</b><br/>\n\n<b>Paket</b></br>\nBlueSky</br>\n<b>Hilfe</b></br>\nBitte kontaktieren Sie support@blueskystatistics.com für weitere Informationen.\n    "
  }
}