{
  "exportpro_title": "Aktiven Export in HTML, DOCX oder PDF",
  "exportpro_subtitle": "Bitte warten Sie, nachdem Sie die Export-Schaltfläche geklickt haben. Der Prozess kann eine Weile dauern, abhängig davon, wie groß Ihr Export ist.",
  "exportPro_iconTooltip": "Exportieren nach HTML, DOCX, PDF",
  "exportpro_pandocHint": "Sie müssen Pandoc separat installieren. Nur beim ersten Mal müssen Sie den Pfad zur Pandoc-Executable von Ihrem Pandoc-Installationspfad angeben.",
  "exportpro_pandocPathLbl": "Pandoc-Pfad:",
  "exportpro_browsePandocPathBtn": "Wählen Sie den Pandoc-Dateipfad",
  "exportpro_outputFolderLbl": "Exportdokumentenordner:",
  "exportpro_browseOutputPathBtn": "Wählen Sie den Exportordner",
  "exportpro_outputFilenameLbl": "Geben Sie den exportierten Dateinamen ein (ohne Dateierweiterung). Geben Sie keine Leerzeichen oder andere Sonderzeichen ein:",
  "exportpro_selExportFormatLbl": "Wählen Sie das Dateiformat zum Exportieren:",
  "exportpro_HTMLradioLbl": "HTML",
  "exportpro_DOCXradioLbl": "DOCX",
  "exportpro_PDFradioLbl": "PDF",
  "exportpro_ExportBtn": "Exportieren",
  "exportpro_CancelBtn": "Abbrechen",
  "exportWaitMsg": "Die Generierung des Outputs kann eine Weile dauern. Bitte überprüfen Sie den Ausgabeordner nach einiger Zeit.",
  "exportMissingFieldsMsg1": "Bitte füllen Sie alle erforderlichen Felder aus (mit rotem Stern markiert)",
  "exportMissingFieldsMsg2": "Bitte überprüfen Sie, ob der Pandoc-Pfad oder der Ausgabe-Pfad existiert",
  "noPandocFoundMsg": "Pandoc ist nicht installiert oder der Pfad ist falsch. Bitte geben Sie den korrekten Pandoc-Pfad ein, an dem sich die Pandoc-Executable befindet, und versuchen Sie es erneut.",
  "exportOverwriteTitle": "Vorhandene Datei überschreiben?",
  "exportOverwriteMsg": "Folgende Datei(en) existieren bereits. Möchten Sie sie überschreiben?",
  "exportOverwriteYes": "Ja",
  "exportOverwriteNo": "Abbrechen",
  "exportFileLockedTitle": "Datei ist in einer anderen Anwendung geöffnet",
  "exportFileLockedMsg1": "Folgende Datei ist gesperrt",
  "exportFileLockedMsg2": " (möglicherweise in einer anderen Anwendung geöffnet)",
  "exportFileLockedMsg3": " Bitte schließen Sie die Datei und versuchen Sie es erneut. ODER geben Sie einen anderen Namen für die exportierte Datei an.",
  "invalidOutputFilenameMsg":"Der Ausgabedateiname darf keine Leerzeichen oder andere Sonderzeichen enthalten. Bitte geben Sie einen gültigen Ausgabedateinamen mit nur alphanumerischen Zeichen ein."
}