{
  "title": "F Wahrscheinlichkeiten",
  "navigation": "F Wahrscheinlichkeiten",
  "varvals": "Geben Sie die Variablenwerte durch ein Komma getrennt ein. Beispiel: 3,0.5",
  "dfnumerator": "Zähler Freiheitsgrade",
  "dfdenominator": "Nenner Freiheitsgrade",
  "labelSig": "Signifikanzniveau",
  "lowtail": "Unteres Ende",
  "uptail": "Oberes Ende",
  "help": {
    "title": "F Wahrscheinlichkeiten",
    "r_help": "help(pf, package=stats)",
    "body": "\n            ​​\n            <b>Beschreibung</b>\n            <br/>\n            Dichte, Verteilungsfunktion, Quantilsfunktion und Zufallszahlengenerierung für die F-Verteilung mit df1 und df2 Freiheitsgraden (und optionalem Nicht-Zentralitätsparameter ncp).\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code>\n                df(x, df1, df2, ncp, log = FALSE)\n                <br/>\n                pf(q, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qf(p, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rf(n, df1, df2, ncp)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumente</b>\n            <br/>\n            <ul>\n                <li>x, q : Vektor von Quantilen.</li>\n                \n                \n                <li>p : Vektor von Wahrscheinlichkeiten.</li>\n                \n                \n                <li>n : Anzahl der Beobachtungen. Wenn die Länge(n) > 1 ist, wird die Länge als die erforderliche Anzahl betrachtet.</li>\n                \n                \n                <li>df1, df2 : Freiheitsgrade. Inf ist erlaubt.</li>\n                \n                \n                <li>ncp : Nicht-Zentralitätsparameter. Wenn weggelassen, wird die zentrale F angenommen.</li>\n                \n                \n                <li>log, log.p : logisch; wenn TRUE, werden die Wahrscheinlichkeiten p als log(p) angegeben.</li>\n                \n                \n                <li>lower.tail : logisch; wenn TRUE (Standard), sind die Wahrscheinlichkeiten P[X ≤ x], andernfalls P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Details</b>\n            <br/>\n            Die F-Verteilung mit df1 = n1 und df2 = n2 Freiheitsgraden hat die Dichte\n            <br/>\n            <code>f(x) = Γ((n1 + n2)/2) / (Γ(n1/2) Γ(n2/2)) (n1/n2)^(n1/2) x^(n1/2 - 1) (1 + (n1/n2) x)^-(n1 + n2)/2</code>\n            <br/>\n            für x > 0.\n            <br/>\n            Es ist die Verteilung des Verhältnisses der mittleren Quadrate von n1 und n2 unabhängigen Standardnormalverteilungen, und somit des Verhältnisses von zwei unabhängigen Chi-Quadrat-Variablen, die jeweils durch ihre Freiheitsgrade geteilt werden. Da das Verhältnis einer Normalverteilung und der Quadratwurzel des Mittelwerts von m unabhängigen Normalverteilungen eine Student's t_m-Verteilung hat, hat das Quadrat einer t_m-Variablen eine F-Verteilung mit 1 und m Freiheitsgraden.\n            <br/>\n            Die nicht-zentrale F-Verteilung ist wiederum das Verhältnis der mittleren Quadrate unabhängiger Normalverteilungen mit einer Varianz von 1, aber die im Zähler dürfen nicht-null Mittelwerte haben und ncp ist die Summe der Quadrate der Mittelwerte. Siehe Chi-Quadrat für weitere Details zu nicht-zentralen Verteilungen.\n            <br/>\n            <br/><b>Wert</b>\n            <br/>\n            df gibt die Dichte an, pf gibt die Verteilungsfunktion an, qf gibt die Quantilsfunktion an, und rf generiert Zufallsvariablen.\n            <br/>\n            Ungültige Argumente führen zu einem Rückgabewert NaN, mit einer Warnung.\n            <br/>\n            Die Länge des Ergebnisses wird durch n für rf bestimmt und ist das Maximum der Längen der numerischen Argumente für die anderen Funktionen.\n            <br/>\n            Die numerischen Argumente, die nicht n sind, werden auf die Länge des Ergebnisses wiederverwendet. Nur die ersten Elemente der logischen Argumente werden verwendet.\n            <br/>\n            <br/><b>Hinweis</b>\n            <br/>\n            Die Angabe von ncp = 0 verwendet den Algorithmus für die nicht-zentrale Verteilung, der nicht derselbe Algorithmus ist, der verwendet wird, wenn ncp weggelassen wird. Dies dient dazu, ein konsistentes Verhalten in extremen Fällen mit Werten von ncp, die sehr nahe bei null liegen, zu gewährleisten.\n            <br/>\n            Der Code für nicht-null ncp ist hauptsächlich für moderate Werte von ncp gedacht: Er wird nicht hochgenau sein, insbesondere in den Rändern, für große Werte."
  }
}