{
  "title": "Histogramm mit überlagerten Normalverteilungen",
  "navigation": "Histogramm",
  "x": "X-Achse, geben Sie eine(n) numerische(n) Variable(n) an",
  "bins": "Geben Sie die Anzahl der Intervalle an",
  "fill": "Geben Sie eine Gruppierungsvariable (Kategorie) an",
  "binwidth": "Intervallbreite",
  "barcolor": "Wählen Sie optional eine Füllfarbe aus (Nach der Farbauswahl klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "alpha": "Opazität (0-1)",
  "flip": "Achse umdrehen",
  "specify_a_title": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "legends": "Legenden anzeigen und falls ja, Position der Legenden (Standard ist rechts)",
  "facets_lbl": "Facetten",
  "Facetrow": "Facettenreihe",
  "Facetcolumn": "Facettenkolonne",
  "Facetwrap": "Facettenumwicklung (wenn gewählt, wird jede Auswahl von Facettenreihe und -kolonne ignoriert)",
  "Facetscale": "Facettenskalierung",
  "normalCurveColor": "Wählen Sie optional eine Farbe für die Normalverteilungskurve aus (Nach der Farbauswahl klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "rugPlot": "Rug-Plot anzeigen (geeignet für kleine Datensätze)",
  "normalCurve": "Normalverteilungskurve anzeigen",
  "normalCurveHeightScaleFactor": "Jede Zahl, einschließlich Dezimalzahlen, um die Höhe der Normalverteilungskurve zu skalieren (für gestapelte Balken). Geben Sie 0 für keine Skalierung ein",
  "showCountsChk": "Anzeigen der Zählungen in den Intervallen (Zählungen werden nicht angezeigt, wenn eine Facette ausgewählt ist)",
  "histogramBarPosition": "Balkenposition, wenn eine Gruppe gewählt ist (gestapelt oder nebeneinander)",
  "histogramBinDetailsChk": "Histogramm-Intervalldetails in einer Tabelle anzeigen",
  "label1": "Horizontale Linien",
  "yIntercept": "Geben Sie durch Kommas getrennte Y-Achsenabschnittswerte für die horizontalen Linien ein, z.B. 100, 200, 300 (d.h. Zählwerte). Linien werden nur gezeichnet, wenn eine Zählachse vorhanden ist",
  "hLineColor": "Wählen Sie eine Farbe für Linie(n) und Beschriftung(en) aus (Nach der Farbauswahl klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "lineType": "Wählen Sie den Linientyp aus",
  "horizontalLinelabel": "Geben Sie durch Kommas getrennte Beschriftungen (ohne umschließende Anführungszeichen) für die horizontalen Linien an",
  "horizontalLinelabel_angle_text": "Winkel zum Neigen des Texts der horizontalen Linienbeschriftung (Standard 0 für kein Neigen)",
  "label2": "Hinweis: Größere Werte verschieben den Text nach unten, kleinere Werte verschieben den Text nach oben",
  "addHoriRefLines": "Referenzlinien hinzufügen",
  "xyLimits": "X- und Y-Achsenlimits",
  "label5": "Geben Sie einen Bereich für X- und Y-Achsenwerte an",
  "rangeXValues": "Geben Sie den Bereich der X-Achse an, z.B. 0,100",
  "labelHori_HorizontalJustification": "Hinweis: Größere Werte platzieren den Text nach links, kleinere Werte verschieben den Text nach rechts",
  "verticalJustification": "Steuern Sie die vertikale Ausrichtung der Beschriftung",
  "hori_HorizontalJustification": "Steuern Sie die horizontale Ausrichtung der Beschriftung",
  "addlLabelHlineTextPositionOffset": "Zusätzliche Anpassungen zur Positionierung des Beschriftungstextes für horizontale Linien",
  "horiMovementHReflineLabel": "Bewegen Sie den Text horizontal nach links oder rechts - verwenden Sie eine beliebige Zahl mit + oder - Zeichen (lassen Sie 0 für kategorische Achsen)",
  "nobreaklineHRefLabelandValueChk": "Aktivieren Sie dieses Kästchen, um den Zeilenumbruch zwischen Beschriftungswert und Beschriftungstext zu entfernen",
  "vertiMovementHReflineLabel": "Bewegen Sie den Text vertikal nach oben oder unten - verwenden Sie eine beliebige Zahl mit + oder - Zeichen (lassen Sie 0 für kategorische Achsen)",
  "label3": "Vertikale Linien",
  "xIntercept": "Geben Sie durch Kommas getrennte X-Achsenabschnittswerte für vertikale Linie(n) ein, z.B. 100, 200, 300",
  "vLineColor": "Wählen Sie eine Farbe für Linie(n) und Beschriftung(en) aus (Nach der Farbauswahl klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "vlineType": "Wählen Sie den Linientyp aus",
  "verticalLinelabel": "Geben Sie durch Kommas getrennte Beschriftungen (ohne umschließende Anführungszeichen) für die vertikalen Linien an",
  "verticalLinelabel_angle_text": "Winkel zum Neigen des Texts der vertikalen Linienbeschriftung (Standard 0 für kein Neigen)",
  "label4": "Hinweis: Größere Werte platzieren den Text nach links, kleinere Werte verschieben den Text nach rechts ",
  "labelVeri_VerticalJustification": "Hinweis: Größere Werte verschieben den Text nach unten, kleinere Werte verschieben den Text nach oben",
  "horizontalJustification": "Steuern Sie die horizontale Ausrichtung der Beschriftung",
  "veri_VerticalJustification": "Steuern Sie die vertikale Ausrichtung der Beschriftung",
  "addlLabelVlineTextPositionOffset": "Zusätzliche Anpassungen zur Positionierung des Beschriftungstextes für vertikale Linien",
  "horiMovementVReflineLabel": "Bewegen Sie den Text horizontal nach links oder rechts - verwenden Sie eine beliebige Zahl mit + oder - Zeichen (lassen Sie 0 für kategorische Achsen)",
  "nobreaklineVRefLabelandValueChk": "Aktivieren Sie dieses Kästchen, um den Zeilenumbruch zwischen Beschriftungswert und Beschriftungstext zu entfernen",
  "vertiMovementVReflineLabel": "Bewegen Sie den Text vertikal nach oben oder unten - verwenden Sie eine beliebige Zahl mit + oder - Zeichen (lassen Sie 0 für kategorische Achsen)",
  "help": {
    "title": "Histogramm",
    "r_help": "help(geom_histogram, package=ggplot2)",
    "body": "\n            <b>Beschreibung</b></br>\n            Ein Histogramm ist eine grafische Darstellung der Verteilung numerischer Daten. Es ist eine Schätzung der Wahrscheinlichkeitsverteilung einer kontinuierlichen Variablen (quantitative Variable). Sie können eine Intervallbreite angeben oder die Standardbreite verwenden, siehe unten. Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die X- und Y-Achse angeben.</br>\n            Wenn Sie mehrere Variablen für die X-Achse ausgewählt haben, erstellen wir ein separates Histogramm für jede X-Achsenvariable. Optional überlagern wir eine Normalverteilungskurve und einen Rug-Plot.</br>\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Counts\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            data: Der Standarddatensatz​\n            </li>\n            <li>\n            aes(): Generieren Sie ästhetische Zuordnungen, die beschreiben, wie Variablen in den Daten auf visuelle Eigenschaften (Ästhetik) von Geoms abgebildet werden.​\n            </li>\n            <li>\n            x: Eine numerische/Skalenvariable, für die das Histogramm gezeichnet werden soll.​\n            </li>\n            <li>\n            geom_histogram: Erstellt ein Histogramm, standardmäßig verwendet stat_bin 30 Intervalle - dies ist kein gutes Standardmaß, aber die Idee ist, Sie zum Experimentieren mit verschiedenen Intervallbreiten zu bringen..\n            </li>\n            <li>\n            geom_rug: Erstellt einen Rug-Plot    \n            </li>\n            <li>\n            stat_function: Erstellt eine Normalverteilungskurve (Hinweis: Fehlende Werte müssen entfernt werden, damit die Kurve angezeigt wird)    \n            </li>\n            <li>\n            Labs(): Ändern Sie Achsenbeschriftungen und Legendentitel (dies ist optional)​\n            </li>\n            <li>\n            facet_grid(): Legt Panels in einem Raster an (dies ist optional)​\n            </li>\n            <li>\n            theme_calc(): Gibt das Rechnerdesign an (dies ist optional)​\n            </li>\n            <li>\n            coord_flip(): Achse umdrehen (dies ist optional)\n            </li>\n            <li>\n            alpha: Nimmt einen Wert zwischen 0-1 an, 1 bedeutet keine Opazität. Die Opazität gilt für die Füllfarbe des Histogramms\n            </li>\n            </ul>\n            <b>Paket</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Hilfe</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Klicken Sie auf die Schaltfläche R-Hilfe, um detaillierte R-Hilfe zu erhalten. Sie können auch help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​ eingeben.\n           "
  }
}