{
  "title": "Histogramm mit überlagerten Normalverteilungen",
  "navigation": "Histogramm",
  "x": "X-Achse, geben Sie eine(n) numerische(n) Variable(n) an",
  "bins": "Geben Sie die Anzahl der Bins an",
  "fill": "Geben Sie eine Gruppierungsvariable (Kategorie) an",
  "binwidth": "Bin-Breite",
  "barcolor": "Wählen Sie optional eine Füllfarbe aus (Nach der Farbauswahl klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "alpha": "Opazität (0-1)",
  "flip": "Achse umdrehen",
  "specify_a_title": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "Facetrow": "Facet-Reihe",
  "Facetcolumn": "Facet-Spalte",
  "Facetwrap": "Facet-Wrap (wenn gewählt, wird jede Auswahl von Facet-Reihe und -Spalte ignoriert)",
  "Facetscale": "Facet-Skala",
  "normalCurveColor": "Wählen Sie optional eine Farbe für die Normalverteilung aus (Nach der Farbauswahl klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "rugPlot": "Rug-Plot anzeigen (geeignet für kleine Datensätze)",
  "normalCurve": "Normalverteilung anzeigen (fehlende Werte werden entfernt, damit die Kurve angezeigt wird)",
  "showCountsChk": "Zahlen in den Bins anzeigen (Zahlen werden nicht angezeigt, wenn eine Gruppe oder ein Facet ausgewählt ist)",
  "histogramBarPosition": "Balkenposition, wenn eine Gruppe gewählt ist (gestapelt oder nebeneinander)",
  "histogramBinDetailsChk": "Histogramm-Bindetails in einer Tabelle anzeigen",
  "help": {
    "title": "Histogramm",
    "r_help": "help(geom_histogram, package=ggplot2)",
    "body": "\n            <b>Beschreibung</b></br>\n            Ein Histogramm ist eine grafische Darstellung der Verteilung numerischer Daten. Es ist eine Schätzung der Wahrscheinlichkeitsverteilung einer kontinuierlichen Variablen (quantitative Variable). Sie können eine Bin-Breite angeben oder die Standardbreite verwenden, siehe unten. Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die X- und Y-Achse angeben.</br>\n            Wenn Sie mehrere Variablen für die X-Achse ausgewählt haben, erstellen wir ein separates Histogramm für jede X-Achsenvariable. Wir überlagern optional eine Normalverteilung und einen Rug-Plot.</br>\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Counts\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            data: Der Standarddatensatz​\n            </li>\n            <li>\n            aes(): Generiert ästhetische Zuordnungen, die beschreiben, wie Variablen in den Daten auf visuelle Eigenschaften (Ästhetik) von Geoms abgebildet werden.​\n            </li>\n            <li>\n            x: Eine numerische/Skalenvariable, für die das Histogramm gezeichnet werden soll.​\n            </li>\n            <li>\n            geom_histogram: Erstellt ein Histogramm, standardmäßig verwendet stat_bin 30 Bins - dies ist kein guter Standard, aber die Idee ist, dass Sie mit verschiedenen Bin-Breiten experimentieren.\n            </li>\n            <li>\n            geom_rug: Erstellt einen Rug-Plot    \n            </li>\n            <li>\n            stat_function: Erstellt eine Normalverteilung (Hinweis: Fehlende Werte müssen entfernt werden, damit die Kurve angezeigt wird)    \n            </li>\n            <li>\n            Labs(): Ändert Achsenbeschriftungen und Legendentitel (dies ist optional)​\n            </li>\n            <li>\n            facet_grid(): Ordnet Panels in einem Raster an (dies ist optional)​\n            </li>\n            <li>\n            theme_calc(): Gibt das Rechner-Thema an (dies ist optional)​\n            </li>\n            <li>\n            coord_flip(): Achse umdrehen (dies ist optional)\n            </li>\n            <li>\n            alpha: Nimmt einen Wert zwischen 0-1 an, 1 bedeutet keine Opazität. Die Opazität gilt für die Füllfarbe des Histogramms\n            </li>\n            </ul>\n            <b>Pakete</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Hilfe</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Klicken Sie auf die R-Hilfe-Schaltfläche, um detaillierte R-Hilfe zu erhalten. Sie können auch help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) eingeben.​\n           "
  }
}