{
    "title": "Hypergeometrische Wahrscheinlichkeiten",
    "navigation": "Hypergeometrische Wahrscheinlichkeiten",
    "m": "m (Anzahl der weißen Kugeln in der Urne)",
    "n": "n (Anzahl der schwarzen Kugeln in der Urne)",
    "k": "k (Anzahl der gezogenen Kugeln aus der Urne)",
    "help": {
        "title": "Hypergeometrische Wahrscheinlichkeiten",
        "r_help": "help(dhyper, package=stats)",
        "body": "\n\n            <b>Beschreibung</b>\n            <br/>\n            Dichte-, Verteilungs-, Quantilfunktion und Zufallsgenerierung für die hypergeometrische Verteilung.\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code>\n                dhyper(x, m, n, k, log = FALSE)\n                <br/>\n                phyper(q, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qhyper(p, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rhyper(nn, m, n, k)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumente</b>\n            <br/>\n            <ul>\n                <li>x, q : Vektor von Quantilen, der die Anzahl der ohne Zurücklegen gezogenen weißen Kugeln aus einer Urne darstellt, die sowohl schwarze als auch weiße Kugeln enthält.</li>\n                \n                \n                <li>m : Die Anzahl der weißen Kugeln in der Urne.</li>\n                \n                \n                <li>n : Die Anzahl der schwarzen Kugeln in der Urne.</li>\n                \n                \n                <li>k : Die Anzahl der gezogenen Kugeln aus der Urne.</li>\n                \n                \n                <li>p : Wahrscheinlichkeit, muss zwischen 0 und 1 liegen.</li>\n                \n                \n                <li>nn : Anzahl der Beobachtungen. Wenn die Länge von nn > 1 ist, wird die Länge als die erforderliche Anzahl angesehen.</li>\n                \n                \n                <li>log, log.p : logisch; wenn TRUE, werden Wahrscheinlichkeiten p als log(p) angegeben.</li>\n                \n                \n                <li>lower.tail : logisch; wenn TRUE (Standard), sind die Wahrscheinlichkeiten P[X ≤ x], andernfalls P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Details</b>\n            <br/>\n            Die hypergeometrische Verteilung wird für Stichproben ohne Zurücklegen verwendet. Die Dichte dieser Verteilung mit den Parametern m, n und k (bezeichnet als Np, N-Np und n in der unten stehenden Referenz) wird durch\n            <br/>\n            <code>\n                p(x) = choose(m, x) choose(n, k-x) / choose(m+n, k)\n                für x = 0, …, k.\n            </code>\n            <br/>\n            Beachten Sie, dass p(x) nur für max(0, k-n) <= x <= min(k, m) ungleich Null ist.\n            <br/>\n            Mit p := m/(m+n) (daher Np = N \times p in der Notation der Referenz) sind die ersten beiden Momente Mittelwert\n            <br/>\n            <code>E[X] = μ = k p</code>\n            <br/>\n            und Varianz\n            <br/>\n            <code>Var(X) = k p (1 - p) * (m+n-k)/(m+n-1),</code>\n            <br/>\n            was die Nähe zur Binomialverteilung Binomial(k,p) zeigt (bei der die hypergeometrische Verteilung eine geringere Varianz aufweist, es sei denn, k = 1).\n            <br/>\n            Das Quantil ist definiert als der kleinste Wert x, sodass F(x) ≥ p, wobei F die Verteilungsfunktion ist.\n            <br/>\n            Wenn einer von m, n, k .Machine$integer.max übersteigt, wird derzeit das Äquivalent von qhyper(runif(nn), m, n, k) verwendet, wobei eine binomiale Approximation möglicherweise wesentlich effizienter ist.\n            <br/>\n            <br/><b>Wert</b>\n            <br/>\n            dhyper gibt die Dichte, phyper gibt die Verteilungsfunktion, qhyper gibt die Quantilsfunktion und rhyper generiert Zufallswerte.\n            <br/>\n            Ungültige Argumente führen zu einem Rückgabewert NaN mit einer Warnung.\n            <br/>\n            Die Länge des Ergebnisses wird für rhyper durch n bestimmt und entspricht der maximalen Länge der numerischen Argumente für die anderen Funktionen.\n            <br/>\n            Die numerischen Argumente außer n werden auf die Länge des Ergebnisses erweitert. Nur die ersten Elemente der logischen Argumente werden verwendet.            \n"
    }
}
