{
  "title": "Hypergeometrische Verteilung",
  "navigation": "Hypergeometrische Verteilung",
  "m": "m (Anzahl der weißen Kugeln in der Urne)",
  "n": "n (Anzahl der schwarzen Kugeln in der Urne)",
  "k": "k (Anzahl der aus der Urne gezogenen Kugeln)",
  "labelSig": "Signifikanzniveau",
  "plotProb": "Wahrscheinlichkeitsmassfunktion plotten",
  "plotDistr": "Verteilungsfunktion plotten",
  "help": {
    "title": "Hypergeometrische Verteilung",
    "r_help": "hilfe(qhyper, paket=stats)",
    "body": "\n\n            <b>Beschreibung</b>\n            <br/>\n            Dichte, Verteilungsfunktion, Quantilfunktion und Zufallszahlen für die hypergeometrische Verteilung.\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code>\n                dhyper(x, m, n, k, log = FALSE)\n                <br/>\n                phyper(q, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qhyper(p, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rhyper(nn, m, n, k)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumente</b>\n            <br/>\n            <ul>\n                <li>x, q : Vektor von Quantilen, die die Anzahl der ohne Zurücklegen aus einer Urne gezogenen weißen Kugeln darstellen, die sowohl schwarze als auch weiße Kugeln enthält.</li>\n                \n                \n                <li>m : die Anzahl der weißen Kugeln in der Urne.</li>\n                \n                \n                <li>n : die Anzahl der schwarzen Kugeln in der Urne.</li>\n                \n                \n                <li>k : die Anzahl der aus der Urne gezogenen Kugeln.</li>\n                \n                \n                <li>p : Wahrscheinlichkeit, sie muss zwischen 0 und 1 liegen.</li>\n                \n                \n                <li>nn : Anzahl der Beobachtungen. Wenn die Länge(nn) > 1, wird die Länge als die benötigte Anzahl betrachtet.</li>\n                \n                \n                <li>log, log.p : logisch; wenn TRUE, werden die Wahrscheinlichkeiten p als log(p) angegeben.</li>\n                \n                \n                <li>lower.tail : logisch; wenn TRUE (Standard), sind die Wahrscheinlichkeiten P[X ≤ x], andernfalls P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Details</b>\n            <br/>\n            Die hypergeometrische Verteilung wird für Stichproben ohne Zurücklegen verwendet. Die Dichte dieser Verteilung mit den Parametern m, n und k (benannt Np, N-Np und n, respektive in der Referenz unten) wird gegeben durch\n            <br/>\n            <code>\n                p(x) = choose(m, x) choose(n, k-x) / choose(m+n, k)\n                für x = 0, …, k.\n            </code>\n            <br/>\n            Beachten Sie, dass p(x) nur für max(0, k-n) <= x <= min(k, m) ungleich null ist.\n            <br/>\n            Mit p := m/(m+n) (daher Np = N \times p in der Notation der Referenz) sind die ersten beiden Momente der Mittelwert\n            <br/>\n            <code>E[X] = μ = k p</code>\n            <br/>\n            und die Varianz\n            <br/>\n            <code>Var(X) = k p (1 - p) * (m+n-k)/(m+n-1),</code>\n            <br/>\n            was die Nähe zur Binomial(k,p) zeigt (wobei die hypergeometrische Verteilung eine kleinere Varianz hat, es sei denn, k = 1).\n            <br/>\n            Das Quantil ist definiert als der kleinste Wert x, so dass F(x) ≥ p, wobei F die Verteilungsfunktion ist.\n            <br/>\n            Wenn einer von m, n, k .Machine$integer.max überschreitet, wird derzeit das Äquivalent von qhyper(runif(nn), m,n,k) verwendet, wenn eine binomiale Approximation erheblich effizienter sein kann.\n            <br/>\n            <br/><b>Wert</b>\n            <br/>\n            dhyper gibt die Dichte an, phyper gibt die Verteilungsfunktion an, qhyper gibt die Quantilfunktion an, und rhyper generiert Zufallsvariablen.\n            <br/>\n            Ungültige Argumente führen zu einem Rückgabewert NaN, mit einer Warnung.\n            <br/>\n            Die Länge des Ergebnisses wird durch n für rhyper bestimmt und ist das Maximum der Längen der numerischen Argumente für die anderen Funktionen.\n            <br/>\n            Die numerischen Argumente außer n werden auf die Länge des Ergebnisses wiederverwendet. Nur die ersten Elemente der logischen Argumente werden verwendet.            \n      "
  }
}