{
  "title": "ICC-Diagramme",
  "navigation": "ICC-Diagramme",
  "label1": "Wählen Sie ein Modell (Modelle der Klassen Rm, dRm, tam.mml, tam.mml.2pl, tam.mml.mfr unterstützt)",
  "label1b": "Wenn keine Modelle verfügbar sind, müssen Sie zuerst ein Modell erstellen, indem Sie Modellanpassung -> IRT auswählen",
  "modelselector1": "Wählen Sie ein Modell",
  "label2a": "Für Modelle, die mit CML-Schätzung erstellt wurden",
  "label2b": "(Anwendbar für Modelle der Klassen Rm und dRm)",
  "lblrange": "Optional Bereich für die X-Achse angeben",
  "range1": "Bereich im Format wert1, wert2 z.B. -1, 6 z.B.",
  "label3a": "Für Modelle, die mit MML-Schätzung erstellt wurden",
  "label3b": "(Anwendbar für Modelle der Klassen Rm und dRm)",
  "lblthetarange": "Optional einen Bereich von Theta-Werten angeben, die angezeigt werden sollen",
  "tb1": "Untergrenze, z.B. -1",
  "tb2": "Obergrenze, z.B. 8",
  "help": {
    "title": "ICC-Diagramme",
    "r_help": "hilfe(plotICC, paket='eRm')",
    "body": "\n                <b>Beschreibung</b></br>\n                Plotfunktionen zur Visualisierung der Item-Charakteristik-Kurven\n                <br/>\n                Ruft plotICC für Modelle auf, die mit CML-Schätzung erstellt wurden (Objekte der Klasse Rm)\n                <br/>\n                Ruft plot.tam für Modelle auf, die mit MML-Schätzung erstellt wurden (Objekte der Klassen tam.mml, tam.mml.2pl, tam.mml.mfr)\n                <br/><br/>\n                <b>Verwendung für plotICC</b>\n                <br/>\n                <code>\n                <br/>\n                ## S3-Methode für die Klasse 'Rm'\n                <br/>\n                plotICC(objekt, item.subset = \"alle\", empICC = NULL, empCI = NULL,\n                   mplot = NULL, xlim = c(-4, 4), ylim = c(0, 1),\n                   xlab = \"Latente Dimension\", ylab = \"Wahrscheinlichkeit zu lösen\", main=NULL,\n                   col = NULL, lty = 1, legpos = \"links\", ask = TRUE, ...)\n                </code>\n                <br/><br/>\n                <b>Argumente</b>\n                <br/>\n                <ul>\n                    <li>\n                    objekt: Objekt der Klasse Rm oder dRm\n                    </li>\n\n                    <li>\n                    item.subset: Teilmenge der anzuzeigenden Items. Entweder ein numerischer Vektor, der die Spalte in X angibt, oder ein Zeichenvektor, der den Spaltennamen angibt. Wenn \"alle\" (Standard), werden alle Items angezeigt.\n                    </li>\n\n                    <li>\n                    empICC: Darstellung der empirischen ICCs für Objekte der Klasse dRm. Wenn empICC=NULL (Standard) wird die empirische ICC nicht gezeichnet. Andernfalls muss empICC als Liste angegeben werden, wobei das erste Element eines von \"raw\", \"loess\", \"tukey\", \"kernel\" sein muss. Die anderen optionalen Elemente sind smooth (numerisch), type (Linientyp für empirische ICCs, nützliche Werte sind \"p\" (Standard), \"l\" und \"b\", siehe Grafikparameter type in plot.default), pch, col und lty, die 'Zeichen', Farbe und Linientyp darstellen.\n                    </li>\n\n                    <li>\n                    empCI: Darstellung von Konfidenzintervallen für die empirischen ICCs. Wenn empCI=NULL (Standard) werden keine Konfidenzintervalle gezeichnet. Andernfalls gibt die Angabe von empCI als Liste 'exakte' Konfidenzintervalle für jeden Punkt der empirischen ICC. Die optionalen Elemente dieser Liste sind gamma, das Konfidenzniveau, col, Farbe und lty, Linientyp. Wenn empCI als leere Liste angegeben wird, werden die Standardwerte empCI=list(gamma=0.95,col=\"rot\",lty=\"gestrichelt\") verwendet.\n                    </li>\n\n                    <li>\n                    mplot: wenn NULL, ist die Standardeinstellung wirksam. Für Modelle der Klasse dRm ist dies mplot = TRUE, d.h. die ICCs für bis zu 4 Items werden in einer Abbildung dargestellt. Für Rm-Modelle ist die Standardeinstellung FALSE (jedes Item in einer Abbildung), kann jedoch auf TRUE gesetzt werden.\n                    </li>\n\n                    <li>\n                    xlab: Beschriftung der x-Achse.\n                    </li>\n\n                    <li>\n                    ylab: Beschriftung der y-Achse.\n                    </li>\n\n                    <li>\n                    xlim: Bereich der Personenparameter.\n                    </li>\n\n                    <li>\n                    ylim: Bereich für die Wahrscheinlichkeit zu lösen.\n                    </li>\n\n                    <li>\n                    legende: Wenn TRUE, wird eine Legende bereitgestellt, andernfalls werden die ICCs beschriftet.\n                    </li>\n\n                    <li>\n                    col: Wenn nicht angegeben oder NULL, werden die Linienfarben automatisch bestimmt. Andernfalls kann ein Skalar oder Vektor mit geeigneten Farbspezifikationen angegeben werden.\n                    </li>\n\n                    <li>\n                    lty: Linientyp.\n                    </li>\n\n                    <li>\n                    main: Titel des Diagramms.\n                    </li>\n\n                    <li>\n                    legpos: Position der Legende mit möglichen Werten \"untenrechts\", \"unten\", \"untenlinks\", \"links\", \"obenlinks\", \"oben\", \"obenrechts\", \"rechts\" und \"zentriert\". Wenn FALSE wird keine Legende angezeigt.\n                    </li>\n\n                    <li>\n                    ask: Wenn TRUE (Standard) und die R-Sitzung interaktiv ist, wird der Benutzer vor dem Zeichnen einer neuen Abbildung um Eingabe gebeten. FALSE ist nur nützlich, wenn der automatisierte Export von Abbildungen wirksam ist, z.B. bei der Verwendung von Sweave.\n                    </li>\n\n                    <li>\n                    ...: Zusätzliche Plotparameter.\n                    </li>\n                </ul>\n                <br/><br/>\n                <b>Details für plotICC</b>\n                <br/>\n                Empirische ICCs für Objekte der Klasse dRm können mit der Option empICC gezeichnet werden, einer Liste, in der das erste Element die Art der Berechnung der empirischen Werte angibt. Wenn empICC=list(\"raw\", andere Spezifikationen) werden die relativen Häufigkeiten der positiven Antworten für jede Rohwertgruppe berechnet und an der Position des entsprechenden Personenparameters gezeichnet. Die anderen Optionen verwenden die Standardversionen verschiedener Glättungsverfahren: \"tukey\" (siehe smooth), \"loess\" (siehe loess) und \"kernel\" (siehe ksmooth). Für \"loess\" und \"kernel\" kann ein weiteres Element, smooth, angegeben werden, um den Spann (Standard ist 0.75) oder die Bandbreite (Standard ist 0.5) zu steuern. Zum Beispiel könnte die Spezifikation empirisch = list(\"loess\", smooth=0.9) oder empirisch = list(\"kernel\", smooth=2) sein. Höhere Werte führen zu glatteren Schätzungen der empirischen ICCs.\n                Die optionalen Konfidenzintervalle werden durch ein Verfahren erhalten, das erstmals in Clopper und Pearson (1934) basierend auf der Beta-Verteilung (siehe binom.test) angegeben wurde.\n                <br/><br/>\n                <b>Pakete</b>\n                <br/>\n                eRm\n\n                <br/><br/>\n                <b>Verwendung für plot.tam</b>\n                <br/>  \n                <code>         \n                ## S3-Methode für die Klassen 'tam' und tam.mml\n                <br/>\n                plot(x, items=1:x$nitems, type=\"erwartet\", low=-3, high=3, \n                                   export=TRUE,  observed=TRUE, \n                                   paket=\"lattice\" ...)           \n                </code>        \n                <br/><br/>\n                <b>Details für plot.tam</b>\n                <br/>   \n                <ul>   \n                <li>\n                x: Objekt der Klasse tam oder tam.mml\n                </li>\n                <li>\n                items: Ein Indexvektor, der die anzuzeigenden Items angibt.\n                </li>\n                <li>\n                type: Plottyp. type=\"erwartet\" zeichnet die erwarteten Item-Antwortkurven, während type=\"items\" die Antwortkurven aller Itemkategorien zeichnet.\n                </li>\n                <li>               \n                low: Niedrigster θ-Wert, der angezeigt werden soll\n                </li>\n                <li>                \n                hoch: Höchster θ-Wert, der angezeigt werden soll\n                </li>\n                <li>                \n                paket: Verwendetes R-Paket für den Plot. Kann \"lattice\" oder \"graphics\" sein.\n                </li>\n                <li>                \n                observed: Ein logisches, das angibt, ob die beobachtete Antwortkurve angezeigt werden soll\n                </li>\n                <li>                \n                export: Ein logisches, das angibt, ob alle Grafiken separat in Dateien des Typs export.type in einem Unterverzeichnis 'Plots' des Arbeitsverzeichnisses exportiert werden sollen.                                             \n                </li>\n                </ul>\n                <br/><br/>\n                <b>Pakete</b>\n                <br/>\n                TAM\n                <br/><br/>\n                <b>Hilfe</b>\n                <br/>\n                hilfe(plotICC, paket='eRm')\n                "
  }
}