{
  "title": "ID-Variable",
  "navigation": "ID-Variable",
  "varnamelabel": "Name der zu erstellenden ID-Variable",
  "sortbyvarslabel": "Variablen, nach denen zuerst sortiert werden soll",
  "groupbyvarslabel": "Variablen, nach denen gruppiert werden soll",
  "outputdatalabel": "Ausgabedatensatz",
  "newdatalabel": "Neuen Datensatz erstellen",
  "overwritelabel": "Vorhandenen Datensatz überschreiben",
  "newdatasetlabel": "Geben Sie einen Namen für den neuen Datensatz ein",
  "help": {
    "title": "ID-Variable",
    "r_help": "help(row_number, package ='dplyr')",
    "body": "\nErstellt eine numerische Zeilenidentifikations- (ID-)Variable im aktuellen Datensatz oder in einer separaten Kopie des aktuellen Datensatzes.  \nDie erstellte ID-Variable besteht aus den numerischen Werten 1, 2, 3 usw. in dieser Reihenfolge von oben nach unten im Datensatz.  \nEs können optional Variablen angegeben werden, nach denen sortiert oder gruppiert werden soll, bevor die Identifikationsvariable erstellt wird.  Die Variablen, nach denen sortiert und gruppiert werden soll, \nkönnen dieselben oder unterschiedliche Variablen sein.  Wenn keine Gruppierungsvariablen angegeben sind, wird die gesamte Zeilennummer des Datensatzes der ID-Variable zugewiesen.\n<br/><br/>\n<b>Name der zu erstellenden ID-Variable:</b> Geben Sie den gewünschten Namen der ID-Variable im Ausgabedatensatz an.\n<br/><br/>\n<b>Variablen, nach denen zuerst sortiert werden soll (optional): </b> Geben Sie Variablen an, nach denen sortiert werden soll, bevor Gruppen definiert oder die ID-Variable erstellt wird.\n<br/><br/>\n<b>Variablen, nach denen gruppiert werden soll (optional):</b> Geben Sie Variablen an, deren Ebenen die separate Zuordnung von ID-Werten definieren.  Zum Beispiel wird das Gruppieren nach \nGeschlecht Werte von 1, 2, 3 usw. separat für Männer und Frauen in der Reihenfolge ihres Erscheinens im Datensatz erstellen.\n<br/><br/>\n<b>Ausgabedatensatz:</b> Geben Sie an, ob ein neuer Datensatz erstellt oder der aktuelle Datensatz überschrieben werden soll.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> tidyverse\n\t\t\t"
  }
}