{
  "title": "Kaplan-Meier-Schätzung, Eine Gruppe",
  "navigation": "Kaplan-Meier-Schätzung, Eine Gruppe",
  "timevar": "Zeit bis zum Ereignis oder Zensur",
  "eventvar": "Ereignis (1 = Ereignis, 0 = Zensur)",
  "label1": "Diagrammtyp",
  "survivalradio": "Überleben",
  "inciradio": "Fehler",
  "printallest": "Schätzungstabelle einschließlich aller Zeiten",
  "printspecest": "Schätzungstabelle für spezifische Zeiten",
  "spectimes": "Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an",
  "styleoptions": "Stiloptionen",
  "axisoptions": "Achsenoptionen",
  "label12": "Klicken Sie auf die ?-Schaltfläche oben rechts im Dialogfeld für Details zu Beispieldatensätzen und dem unterstützten Datenformat.",
  "titlebox": "Diagrammtitel",
  "plottitlesizelabel": "Größe des Diagrammtitels (5-50)",
  "themedropdown": "Diagrammthema",
  "label2": "Anzahl der Gefährdeten",
  "natriskchkbox": "Anzahl der Gefährdeten einbeziehen",
  "risktableprop": "Höhe der Risikotabelle (0-1)",
  "risktablepos": "Position der Risikotabelle",
  "risktablevaluesize": "Größe der Werte in der Risikotabelle (1-15)",
  "risktabletitlesize": "Größe des Titels der Risikotabelle (5-50)",
  "risktableaxislabelsize": "Größe der Achsenbeschriftung der Risikotabelle (5-50)",
  "risktableticklabelsize": "Größe der Tick-Beschriftung der Risikotabelle (5-50)",
  "risktableclean": "Achsen und Gitterlinien aus der Risikotabelle entfernen",
  "label3": "Linienoptionen",
  "linesize": "Größe (0-5)",
  "linecolor": "Farbe",
  "label4": "Konfidenzintervall",
  "cichkbox": "95% CI einbeziehen",
  "cistyle": "Stil",
  "citransparency": "Transparenz (0-1)",
  "label5": "Zensierte Zeiten",
  "censorchkbox": "Zensierte Zeiten einbeziehen",
  "censorsize": "Größe (0-10)",
  "medsurvivalline": "Medianüberleben anzeigen (h=horizontal, v=vertikal)",
  "label6": "Überlebensachse",
  "survaxislabel": "Bezeichnung",
  "axislabelsize": "Größe der Achsenbeschriftung (5-50)",
  "label7": "Skala",
  "defbutton": "Proportion",
  "pctbutton": "Prozent",
  "survaxislimits": "Achsenlimits auf Proportionsskala (0-1) - geben Sie 'c(min, max)' ein",
  "survtickinc": "Tick-Marken-Inkremente (0-1)",
  "label8": "Zeitachse",
  "timeaxislabel": "Bezeichnung",
  "timeaxislimits": "Achsenlimits (NULL ist Standard, geben Sie 'c(min,max)' ein, um zu ändern, z.B. 'c(0,20)')",
  "timetickinc": "Tick-Marken-Inkremente (NULL ist Standard, geben Sie eine Zahl ein, um zu ändern, min=0)",
  "ticklabelsize": "Größe der Achsentickmarkenbeschriftung (5-50)",
  "help": {
    "title": "Kaplan-Meier-Schätzung, Eine Gruppe",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tSiehe Beispieldatensatz im Installationsverzeichnis, der Standardstandort befindet sich unter Laufwerksbuchstabe:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. Die Variable Followup_time sollte als Zeit bis zum Ereignis oder zur Zensur eingegeben werden und die Variable Event sollte als Ereignis (1 = Ereignis, 0 = Zensur) eingegeben werden.<br/>\n            Dieser Datensatz ist eine aktualisierte Version des mockstudy-Datensatzes im Arsenal-Paket.<br/><br/>\t\t\n            <b>Kaplan-Meier-Überlebenskurven</b>\n            <br/>\n            <br/>\n            Diese werden verwendet, um das kumulative Risiko zu schätzen, kein Ereignis (oder umgekehrt, ein Ereignis) über einen Zeitraum nach Beginn der Nachverfolgung für dieses Ereignis (oder Zeit null) zu haben. Probanden müssen ab Zeit null für das Ereignis gefährdet sein.\n            <br/>\n            <br/>\n            <b>Zeit:</b> Dauer bis zu einem Ereignis, wenn das Ereignis aufgetreten ist, oder letzte Nachverfolgung für dieses Ereignis, wenn das Ereignis nicht aufgetreten ist, für jeden Probanden\n            <br/><br/>\n            <b>Ereignis:</b> Numerischer Indikator dafür, ob das Ereignis aufgetreten ist oder nicht (1=Ereignis, 0=Zensur) für jeden Probanden\n            <br/><br/>\n            <b>Diagrammtyp:</b> Ob Sie die Wahrscheinlichkeit des Nicht-Habens des Ereignisses (Überleben) oder des Habens des Ereignisses (Fehler) darstellen möchten\n            <br/><br/>\n            <b>Schätzungstabelle einschließlich aller Zeiten:</b> Option, eine Tabelle einzuschließen, die die Überlebens- und Ereignisschätzungswahrscheinlichkeiten für jede beobachtete Zeit im Datensatz enthält\n            <br/>\n            <br/>\n\t\t\t<b>Schätzungstabelle für spezifische Zeiten:</b> Option, eine Tabelle einzuschließen, die die Überlebensschätzungswahrscheinlichkeiten für eine benutzerdefinierte Menge von Zeiten enthält.\n\t\t\t<br/><br/>\n\t\t\t<b>Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an:</b> Dies sind die spezifischen Zeiten, die in die Tabelle für spezifische Zeiten aufgenommen werden. Sie können einzeln mit Kommas oder als Sequenz gleichmäßig verteilter Werte angegeben werden.\n\t\t\t<br/><br/>\n            Tabellen werden mit der Stichprobengröße, der Anzahl der Probanden mit dem Ereignis, der medianen Überlebenszeit (falls definiert), der eingeschränkten mittleren Überlebenszeit und der medianen Nachverfolgungszeit ausgegeben. Die mediane Nachverfolgungszeit wird unter Verwendung des umgekehrten Kaplan-Meier-Schätzers berechnet, der wahre Ereignisse als zensierte Beobachtungen und wahre zensierte Beobachtungen als Ereignisse behandelt. Daher ist das \"Ereignis\" in diesem Schätzer \"die Probanden so lange zu verfolgen, wie die Studie es zuließ\".\n            <br/>\n            Eine Tabelle der Kaplan-Meier-Überlebens- und Ereignisschätzungen wird zu jeder beobachteten Zeit im Datensatz bereitgestellt, mit 95% Konfidenzintervallen. \n            <br/>\n            <br/>\n            <b>Erforderliche Pakete:</b> survival, broom, survminer, dplyr, arsenal, ggthemes \n            <br/>\n            <br/>\n            <br/>           \n            <b>Stiloptionen</b>\n            <br/>\n            <br/>\n            <b>Diagrammtitel:</b> Titel des Diagramms; löschen Sie allen Text für keinen Titel\n            <br/><br/>\n\t\t\t<b>Größe des Diagrammtitels:</b> Größe des Diagrammtitels.\n\t\t\t<br/><br/>\n            <b>Diagrammthema:</b> Allgemeiner Stil des Diagramms\n            <br/><br/>\n            <b>Anzahl der Gefährdeten einbeziehen:</b> Optional, eine Tabelle für die Anzahl der Probanden, die über die Zeit noch gefährdet sind, am unteren Rand des Diagramms einfügen.  <b>Position der Risikotabelle</b> gibt an, ob Sie die Tabelle außerhalb oder innerhalb der Achsen haben möchten.  Die <b>Höhe der Risikotabelle</b> steuert den Anteil des Zeichenbereichs, den die Tabelle einnimmt. Diese Option wird ignoriert, wenn die Position der Risikotabelle innerhalb der Achsen liegt. \n\t\t\tDie <b>Größe der Risikotabelle-Werte</b> steuert die Größe der Zahlen, die gefährdet sind. Die <b>Größe des Titels der Risikotabelle</b> steuert die Größe des Titels für die Tabelle der Anzahl der Gefährdeten.\n\t\t\tDie <b>Größe der Achsenbeschriftung der Risikotabelle</b> steuert die Größe der Achsenbeschriftungen.\n\t\t\tDie <b>Größe der Tick-Beschriftung der Risikotabelle</b> steuert die Größe der Tickmarkenbeschriftungen für die Zeiten in der Tabelle der Anzahl der Gefährdeten. Wenn gewünscht, können alle Achsen und Gitterlinien \n\t\t\taus der Risikotabelle entfernt werden, indem die Option <b>Achsen und Gitterlinien aus der Risikotabelle entfernen</b> aktiviert wird. Dies wird nur die Zahlen in der Tabelle enthalten.\n            <br/>\n            <br/>\n            <b>Linienoptionen:</b>\n            <b>Größe</b> steuert die Dicke und <b>Farbe</b> steuert die Farbe der gezeichneten Linie. Man kann optional ein 95% Konfidenzintervall für die Schätzungen in entweder einem <b>Ribbon</b> (schattierter Bereich) oder <b>Step</b> (Linien) Format einfügen. <b>Transparenz</b> steuert, wie dunkel das Band ist und wird ignoriert, wenn die Schrittoption ausgewählt ist. <b>Zensierte Zeiten</b> (wenn Probanden nicht mehr für das Ereignis gefährdet sind) können mit \"+\"-Symbolen auf der Linie angezeigt werden. Die Größe der \"+\"-Symbole kann angepasst werden. Die Option <b>Medianüberleben anzeigen</b> wird horizontale oder vertikale Linien zu dem Zeitpunkt einfügen, an dem 50% der Probanden geschätzt werden, das Ereignis gehabt zu haben. Die mediane Zeit ist undefiniert, wenn die Überlebenskurve 50% nicht überschreitet.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Achsenoptionen</b>\n            <br/> \n            <br/> \n            Die <b>Bezeichnung</b> Option gibt die Textbezeichnung für die Achse an. Die <b>Achsenlimits</b> geben die minimalen und maximalen Werte der Achse an. Die Option <b>Tick-Marken-Inkremente</b> steuert den Abstand der Tick-Marken auf der Achse. Die Inkremente auf der Zeitachse steuern auch die Zeiten für die optionale Tabelle der Anzahl der Gefährdeten.\n            <br/> \n            Die Überlebensachse <b>Skala</b> Option gibt an, ob Sie möchten, dass die Schätzungen auf einer Proportions- (0-1) oder Prozent- (0-100) Skala sind.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Achsenbeschriftung:</b>  Dies steuert die Größe sowohl der Überlebens- als auch der Zeitachsenbeschriftungen.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Tick-Beschriftung der Achse:</b>  Dies steuert die Größe sowohl der Überlebens- als auch der Zeitachsen-Tickmarkenbeschriftungen.\n      "
  }
}