{
  "title": "Lumpen der am wenigsten oder am häufigsten vorkommenden Faktorstufen",
  "navigation": "Automatisch in Andere lumpen",
  "target": "Wählen Sie Variablen aus, um spärliche Stufen zu lumpen",
  "label1": "Der Standardname der neuen Kategorie, die die lumpierten Stufen enthält, ist \"andere\". Gewichte anzugeben ist optional. Sie können vorhandene Variable(n) mit den lumpierten Stufen überschreiben oder die Ergebnisse in neuen Variablen speichern.",
  "other": "Name für die lumpierte Stufe",
  "label3": "Verwendete Methode",
  "defaultOption": "Lumpen Sie die am wenigsten häufigen Stufen in \"andere\", während sichergestellt wird, dass \"andere\" die kleinste Stufe ist",
  "categories": "Behalten Sie die häufigsten (+n)/am wenigsten häufigen (-n) Kategorien",
  "category": "Geben Sie die Anzahl der Kategorien ein",
  "proportion1": "Behalten Sie Kategorien, die mindestens (+ prop)/höchstens (- prop) einen Anteil der Zeit erscheinen",
  "proportion": "Geben Sie den Anteil ein",
  "dropOption": "Geben Sie Stufen ein, die durch \"Andere\" ersetzt werden sollen, z.B. stufe1,stufe2,stufe3",
  "varweights": "Variablengewichte",
  "label2": "Speichern Sie die Ergebnisse in neuen Variablen oder überschreiben Sie vorhandene Variablen",
  "rd3": "Geben Sie ein Suffix an (Eine neue Variable wird mit dem Suffix erstellt)",
  "txt3": "Geben Sie ein Suffix ein",
  "rd2": "Geben Sie ein Präfix an (Eine neue Variable wird mit dem Präfix erstellt)",
  "txt4": "Geben Sie ein Präfix ein",
  "rd1": "Vorhandene Variablen überschreiben",
  "ties": "Optionen zur Behandlung von Bindungen",
  "help": {
    "title": "In Andere lumpen",
    "r_help": "help(fct_lump, package =forcats)",
    "body": "\n<b>Beschreibung</b></br>\nLumpen Sie die am wenigsten oder am häufigsten vorkommenden Faktorstufen in die \"andere\" Stufe. Der Standardname der neuen Kategorie, die die lumpierten Stufen enthält, ist \"andere\". Gewichte anzugeben ist optional. Sie können vorhandene Variable(n) mit den lumpierten Stufen überschreiben oder die Ergebnisse in neuen Variablen speichern.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nfct_lump(f, n, prop, w = NULL, other_level = \"Andere\", ties.method = c(\"min\", \"average\", \"first\", \"last\", \"random\", \"max\"))<br/>\ndataset$col1<-fct_lump(f =dataset$col1,w =dataset$col2,other_level =\"andere\",ties.method =\"min\")\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nf: Ein Faktor. Wenn sowohl n als auch prop fehlen, lumpen fct_lump die am wenigsten häufigen Stufen in \"andere\", während sichergestellt wird, dass \"andere\" immer noch die kleinste Stufe ist. Es ist besonders nützlich in Verbindung mit fct_inorder().\n</li>\n<li>\nn: Positives n bewahrt die häufigsten n Werte. Negatives n bewahrt die am wenigsten häufigen -n Werte. Bei Bindungen erhalten Sie mindestens abs(n) Werte.\n</li>\n<li>\nprop: Positives prop bewahrt Werte, die mindestens prop der Zeit erscheinen. Negatives prop bewahrt Werte, die höchstens -prop der Zeit erscheinen.\n</li>\n<li>\nw: Ein optionaler numerischer Vektor, der Gewichte für die Häufigkeit jedes Wertes (nicht der Stufe) in f angibt.\n</li>\n<li>\nother_level: Wert der Stufe, die für \"andere\" Werte verwendet wird. Immer am Ende der Stufen platziert.\n</li>\n<li>\nties.method: Ein Zeichenstring, der angibt, wie Bindungen behandelt werden. Siehe rank() für Details.\n</li>\n<li>\nmin: Bewahrt Werte, die mindestens min Mal erscheinen.\n</li>\n</ul>\n<b>Paket</b></br>\nforcats</br>\n<b>Hilfe</b></br>\nGeben Sie die Zeile unten im BlueSky Statistics R-Syntax-Editor ein</br>\nhelp(fct_lump, package =forcats)\n"
  }
}