{
  "title": "Multivariate Qualitätskontrollkarte (MQCC)",
  "navigation": "MQCC-Diagramm",
  "summaryPrintChk": "Zusammenfassung zusätzlich zu Diagramm(en) drucken",
  "variableListSelcted": "Daten (eine oder mehrere Variablen auswählen) zum Diagramm",
  "groupingVariable": "(Optional) Gruppierungsvariable auswählen, wenn Untergruppen vorhanden sind",
  "excludeGroups": "(Optional) Gruppen (wenn Untergruppen numerisch sind) von Berechnung/Darstellung ausschließen (z.B. als 1:10 oder durch Kommas getrennt als 1,4,5,7:12 angeben)",
  "groupsTobeUsedAsNewData": "(Optional) Neue Daten - Gruppen (wenn Untergruppen numerisch sind), die als neue Daten zum Diagramm verwendet werden sollen (z.B. als 1:25 oder 1,4,5,7:12 angeben) - neue Daten zum Plotten, aber nicht in die Grenzwertberechnungen einbezogen",
  "limitsChk": "Wenn Kontrollgrenzen (Phase I) berechnet und dargestellt werden müssen",
  "pred_limitsChk": "Wenn Vorhersagegrenzen (Phase II) berechnet und dargestellt werden müssen",
  "confidence_level": "(Optional) Konfidenzniveau: Lassen Sie die Standardformel wie gezeigt (wo p automatisch als Anzahl der ausgewählten Variablen berechnet wird). Andernfalls geben Sie einen numerischen Wert zwischen 0 und 1 an, der als Konfidenzniveau zur Berechnung der Wahrscheinlichkeitsgrenzen verwendet werden soll",
  "genVarianceChk": "Kontrollkarte für die verallgemeinerte Varianz |S| für die ausgewählten Variablen zeichnen (und eine Gruppierungsvariable muss ausgewählt werden)",
  "help": {
    "title": "Multivariate Qualitätskontrollkarte (mqcc)",
    "r_help": "hilfe(mqcc, paket = qcc)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tmqcc-Funktion zur Durchführung der multivariaten statistischen Qualitätskontrolle und der verallgemeinerten Varianz |S|\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür die detaillierte Hilfe - verwenden Sie R hilfe(mqcc, paket = qcc) und hilfe(GVcontrol, paket = IAcsSPCR)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm dies auszuprobieren, können Sie den Datensatz namens boiler aus dem qcc-Paket mit dem Menü Datensatz laden, indem Sie das qcc-Paket auswählen und dann den Datensatz boiler zum Laden auswählen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tWählen Sie die Variablen aus dem boiler-Datensatz aus, lassen Sie alles als Standard und führen Sie den Dialog aus\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSie können auch die Beispieldatendatei namens widgets_mqcc.xlsx verwenden. Öffnen Sie die Datei im Datenraster mit dem Menü Datei öffnen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm die verallgemeinerte Varianz |S| zu zeichnen, muss der Datensatz eine Spalte mit den Untergruppennummern haben - andernfalls wird nicht geplottet\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tBefolgen Sie das qcc-Tutorial unter https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
  }
}