{
  "title": "Multidimensionale Skalierung",
  "navigation": "Multidimensionale Skalierung",
  "betRows": "Zwischen Zeilen",
  "betVariables": "Zwischen Variablen",
  "textSize": "Textgröße",
  "textPos": "Textposition",
  "destination": "Variablen auswählen",
  "maxDimensions": "Maximale Dimensionen",
  "label1": "Distanzmatrix",
  "computationMethod": "Berechnungsmethode",
  "power": "Macht der Minkowski-Distanz",
  "dispDist": "Distanzmatrix anzeigen",
  "saveDims": "Dimensionen in einem neuen Datensatz speichern",
  "datasetName": "Optional einen Datensatznamen eingeben, um Dimensionen zu speichern",
  "label2": "Erweiterte Optionen",
  "scalingMethod": "Skalierungsmethode",
  "maxIter": "Maximale Anzahl an Iterationen (*Nicht anwendbar für klassische metrische)",
  "plotResults": "Ergebnisse plotten",
  "help": {
    "title": "Multidimensionale Skalierung",
    "r_help": "hilfe(cmdscale, paket=stats)",
    "body": "\n<b>Beschreibung</b></br>\nEs gibt verschiedene Arten von MDS-Algorithmen, einschließlich</br>\n<b>Klassische multidimensionale Skalierung</b></br>\nBewahrt die ursprüngliche Distanzmetrik zwischen Punkten so gut wie möglich. Das bedeutet, dass die angepassten Distanzen auf der MDS-Karte und die ursprünglichen Distanzen in derselben Metrik sind. Klassische MDS gehört zur Kategorie der sogenannten metrischen multidimensionalen Skalierung.</br>\nEs ist auch als Hauptkoordinatenanalyse bekannt. Es ist geeignet für quantitative Daten.</br></br>\n<b>Nicht-metrische multidimensionale Skalierung</b></br>\nEs ist auch als ordinale MDS bekannt. Hier ist nicht die Metrik eines Distanzwertes wichtig oder sinnvoll, sondern sein Wert im Verhältnis zu den Distanzen zwischen anderen Objektpaaren.</br>\nOrdinale MDS konstruiert angepasste Distanzen, die in derselben Rangordnung wie die ursprüngliche Distanz sind. Zum Beispiel, wenn die Distanz zwischen den Objekten 1 und 5 im ursprünglichen Distanzdaten den fünften Rang hat, sollten sie auch im MDS-Layout den fünften Rang haben.</br>\nEs ist geeignet für qualitative Daten.</br>\nWir verwenden die folgenden R-Funktionen</br>\ncmdscale() [stats-Paket]: Berechnet klassische (metrische) multidimensionale Skalierung.</br>\nisoMDS() [MASS-Paket]: Berechnet Kruskals nicht-metrische multidimensionale Skalierung (eine Form der nicht-metrischen MDS).</br>\nsammon() [MASS-Paket]: Berechnet Sammons nichtlineare Abbildung (eine Form der nicht-metrischen MDS).</br>\nAlle diese Funktionen nehmen ein Distanzobjekt als Hauptargument und k ist die gewünschte Anzahl von Dimensionen im skalierten Ergebnis. Standardmäßig geben sie Lösungen mit zwei Dimensionen zurück, aber wir können das über den Parameter k ändern, der standardmäßig auf 2 gesetzt ist.</br>\n<br/>\nOptionen zum Anzeigen der Distanzmatrix, Speichern der Dimensionen in einem neuen Datensatz und Plotten der Dimensionen können ausgewählt werden. </br>\nWenn die klassische metrische Skalierungsmethode ausgewählt ist, zeigen wir die Eigenwerte, die Güte der Anpassung und das Screeplot an. Für andere Skalierungsmethoden zeigen wir den Stresswert an.\n<b>Hilfe</b></br>\nFür detaillierte Hilfe führen Sie die folgenden Befehle aus: hilfe(dist, paket=\"stats\") oder hilfe(cmdscale, paket ='stats') oder hilfe(isoMDS, paket = \"MASS\") oder hilfe(sammon, paket =\"MASS\") im BlueSky Statistics R-Editor aus.           \n<br/>\n<br/>"
  }
}