{
  "title": "Optimale Anzahl von Bäumen",
  "navigation": "Optimieren",
  "dependentvar": "Abhängige Variable",
  "independentvars": "Unabhängige Variable(n)",
  "label1": "Baum-Simulations-Einstellungen",
  "startval": "Startwert",
  "endval": "Endwert",
  "stepval": "Schrittwert",
  "mtry": "mtry",
  "help": {
    "title": "Optimale Anzahl von Bäumen",
    "r_help": "hilfe(randomForest, paket='randomForest')",
    "body": "\n                <b>Beschreibung</b></br>\nBeginnend mit dem Standardwert von mtry, suchen Sie nach dem optimalen Wert (in Bezug auf die Schätzung des Out-of-Bag-Fehlers) von ntree (Anzahl der zu züchtenden Bäume) für randomForest. Die Funktion BSkyMultiRandomForest ruft die Funktion randomForest mit den unten definierten Argumenten auf\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nBSkyMultiRandomForest(x , y=NULL, startval, endval, stepval, mtry)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx : ein Datenrahmen oder eine Matrix von Prädiktoren oder eine Formel, die das zu fittende Modell beschreibt (für die Druckmethode ein randomForest-Objekt).\n</li>\n<li>\ny :  Ein Antwortvektor. Wenn ein Faktor, wird Klassifikation angenommen, andernfalls wird Regression angenommen. Wenn weggelassen, läuft randomForest im unüberwachten Modus.\n</li>\n<li>\nstartval : Startwert für das ntree-Argument in randomForest().\n</li>\n<li>\nendval : Endwert für das ntree-Argument in randomForest().\n</li>\n<li>\nstepval : Zählung, um die startval in jeder Iteration zu erhöhen, bis der endval erreicht ist.\n</li>\n<li>\nmtry : Anzahl der zufällig ausgewählten Variablen als Kandidaten bei jedem Split. Beachten Sie, dass die Standardwerte für Klassifikation (sqrt(p), wobei p die Anzahl der Variablen in x ist) und Regression (p/3) unterschiedlich sind.\n</li>\n</ul>\n<b>Wert</b><br/>\nGibt die optimale Anzahl von Bäumen aus. Zeigt auch eine Tabelle mit ntree und dem entsprechenden Out-of-Bag-Fehler an<br/>\n<b>Pakete</b></br>\nrandomForest​;BlueSky</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl im R-Syntax-Editor aus: hilfe(randomForest, paket='randomForest')\n                "
  }
}