{
  "title": "Parameterlevel-Schätzungen",
  "navigation": "Parameter-Schätzungen",
  "label1": "Modelle der folgenden Klassen werden unterstützt, Klassen sind in Klammern unten aufgeführt",
  "label2": "Lineare Modelle (lm), Verallgemeinerte lineare Modelle (glm), Multinomiale log-lineare Modelle (multinom), Quantilregression (rq), Robuste lineare Regression (rlm), Überlebenskurvenobjekt (survfit), Lineares gemischtes Effekte-Modell (lme), Proportionale Hazard-Regression (coxph), Parametrisches Überlebensregressionsmodell (survreg), Ordinale logistische/Probit-Regression (polr), Faktorenanalyse (factanal), Lasso- und Elastic-Net-regularisierte verallgemeinerte lineare Modelle (glmnet)",
  "modelselector1": "Wählen Sie ein Modell",
  "help": {
    "title": "Parameterlevel-Schätzungen",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>Beschreibung</b></br>\nZeigt die Parameterschätzungen des ausgewählten Modells an\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: Modell oder anderes R-Objekt, das in einen einzeiligen Datenrahmen umgewandelt werden soll\n</li>\n</ul>\n<b>Details</b></br>\nZeigt die Parameterschätzungen der folgenden Modelle an</br>\nLineare Modelle (Modellklasse lm)</br>\nVerallgemeinerte lineare Modelle (Modellklasse glm)</br>\nMultinomiale log-lineare Modelle (Modellklasse multinom)</br>\nOrdinale logistische oder Probit-Regression (Modellklasse polr)</br>\nLasso- und Elastic-Net-regularisierte verallgemeinerte lineare Modelle (Modellklasse glmnet)</br>\nRobuste lineare Regression (Modellklasse rlm)</br>\nQuantilregression (Modellklasse rq)</br>\nLineares gemischtes Effekte-Modell (lme)</br>\nProportionale Hazard-Regression (coxph)</br>\nParametrisches Überlebensregressionsmodell (survreg)</br>\nFaktorenanalyse (factanal)</br>\n<b>Wert</b></br>\nEin tibble::tibble() mit Informationen über die Modellkomponenten.</br>\nterm: Der Name des Regressionsbegriffs.</br>\nestimate: Der geschätzte Wert des Regressionsbegriffs.</br>\nstd.error: Der Standardfehler des Regressionsbegriffs.</br>\nstatistic: Der Wert einer Statistik, fast immer eine T-Statistik, die in einer Hypothese verwendet wird, dass der Regressionsbegriff nicht null ist.</br>\np.value: Der zweiseitige p-Wert, der mit der beobachteten Statistik verbunden ist.</br>\nconf.low: Das untere Ende eines Konfidenzintervalls für den Regressionsbegriff. Nur enthalten, wenn conf.int = TRUE.</br>\nconf.high: Das obere Ende eines Konfidenzintervalls für den Regressionsbegriff. Nur enthalten, wenn conf.int = TRUE.</br>\nWenn das lineare Modell ein mlm-Objekt (mehrfaches lineares Modell) ist, gibt es eine zusätzliche Spalte:</br>\nresponse: Auf welche Antwortspalte die Koeffizienten zutreffen (typischerweise Y1, Y2 usw.)</br>\n<b>Paket</b></br>\nbroom</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl im R-Syntax-Editor aus: help(tidy, package ='broom')\n"
  }
}