{
  "title": "Parametrische Überlebensanalyse",
  "navigation": "Parametrisches Überleben",
  "timevar": "Zeit bis zum Ereignis oder Zensur",
  "eventvar": "Ereignis (1 oder höher = Ereignis, 0 oder niedriger = Zensur)",
  "rmstChk": "Berechne die eingeschränkte mittlere Überlebenszeit (RMST)",
  "rmstSEChk": "Berechne den Standardfehler für RMST mit Bootstrap (Hinweis: Es wird eine Weile dauern)",
  "bootIter": "Bootstrap-Iteration",
  "labelSurvival": "Überlebensplot-Typ",
  "survivalradioCI": "Überleben mit CI",
  "survivalradio": "Überleben",
  "survivalradioKMCI": "Überleben mit Kaplan-Meier (nichtparametrisch) Überlagerung mit CI",
  "survivalradioKM": "Überleben mit Kaplan-Meier (nichtparametrisch) Überlagerung",
  "labelFailure": "Kumulative Ausfallplot-Typ",
  "inciradioCI": "Kumulativer Ausfall mit CI",
  "inciradio": "Kumulativer Ausfall",
  "inciradioKMCI": "Kumulativer Ausfall mit Kaplan-Meier (nichtparametrisch) Überlagerung mit CI",
  "inciradioKM": "Kumulativer Ausfall mit Kaplan-Meier (nichtparametrisch) Überlagerung",
  "spectimes": "Berechne die Überlebenswahrscheinlichkeit - gib Zeiten als time1, time2, time3 usw. oder als seq (1,5,by=1) an",
  "specprobs": "Berechne die Überlebenszeit bis zum Ereignis - gib Quantile (Wahrscheinlichkeit) als 0.25, 0.50, 0.60, 0.75 usw. oder als seq (0.2,0.9,by=0.1) an",
  "labelDistribution": "Wählen Sie eine Verteilungsfunktion, die am besten zu den Daten passt",
  "selectDistFuncWeibullRad": "Weibull",
  "selectDistFuncExpRad": "Exponential",
  "selectDistFuncGammaRad": "Gamma",
  "selectDistFuncLnormalRad": "Log Normal",
  "selectDistFuncPoissonRad": "Poisson",
  "selectDistFuncNBinomRad": "Negative Binomial",
  "selectDistFuncGeomRad": "Geometrisch",
  "selectDistFuncBetaRad": "Beta",
  "selectDistFuncUnifRad": "Uniform",
  "selectDistFuncLogisRad": "Logistisch",
  "selectDistFuncLogLogisRad": "Log-Logistisch",
  "selectDistFuncCauchyRad": "Cauchy",
  "selectDistFuncNormRad": "Normal",
  "confidenceInterval": "Konfidenzintervalle für Maximum-Likelihood-Schätzungen",
  "help": {
    "title": "Parametrische Überlebensregression",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n\t\t\tSiehe Beispieldatensatz im Installationsverzeichnis, der Standardstandort befindet sich unter Laufwerksbuchstabe:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. Die Variable Followup_time sollte als Zeit bis zum Ereignis oder zur Zensur eingegeben werden und die Variable Event sollte als das Ereignis (1 = Ereignis, 0 = Zensur) eingegeben werden.<br/>\n            <br/>\n            <br/>\n\t\t\tDie Beispieldatensätze sind lung, manufacturing_data und bulb reliability <br/><br/>\t\t\n            <b>Parameter Schätzungen und Plots der parametrischen Überlebensregression zusammen mit Kaplan-Meier Überlebenskurven (Null-/Intercept-Modell) Überlagerung</b>\n            <br/>\n            <br/>\n            Diese werden verwendet, um das kumulative Risiko zu schätzen, kein Ereignis zu haben (oder umgekehrt, ein Ereignis zu haben) über einen Zeitraum nach Beginn der Nachverfolgung für dieses Ereignis (oder Zeit null). Probanden müssen ab Zeit null für das Ereignis gefährdet sein.\n            <br/>\n            <br/>\n            <b>Zeit:</b> Länge der Zeit bis zu einem Ereignis, wenn das Ereignis aufgetreten ist, oder letzte Nachverfolgung für dieses Ereignis, wenn das Ereignis nicht aufgetreten ist, für jeden Probanden\n            <br/><br/>\n            <b>Ereignis:</b> Numerischer Indikator dafür, ob das Ereignis aufgetreten ist oder nicht (1=Ereignis, 0=Zensur) für jeden Probanden\n            <br/><br/>\n            <b>Plot-Typ:</b> Plot der Wahrscheinlichkeit, das Ereignis nicht zu haben (Überleben) oder das Ereignis zu haben (Ausfall)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Schätzungstabelle für spezifische Zeiten oder Wahrscheinlichkeiten:</b> Option zur Einbeziehung einer Tabelle, die die Überlebensschätzungswahrscheinlichkeiten für eine benutzerdefinierte Menge von Zeiten enthält.\n\t\t\t<br/><br/>\n\t\t\t<b>Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an:</b> Dies sind die spezifischen Zeiten, die in die Tabelle für spezifische Zeiten aufgenommen werden. Sie können einzeln mit Kommas oder als Sequenz gleichmäßig verteilter Werte angegeben werden.\n\t\t\t<br/><br/>\n            Tabellen werden mit der Stichprobengröße, der Anzahl der Probanden mit dem Ereignis, der medianen Überlebenszeit (falls definiert), der eingeschränkten mittleren Überlebenszeit und der medianen Nachverfolgungszeit ausgegeben. Die mediane Nachverfolgungszeit wird mit dem umgekehrten Kaplan-Meier-Schätzer berechnet, der wahre Ereignisse als zensierte Beobachtungen und wahre zensierte Beobachtungen als Ereignisse behandelt. Daher ist das \"Ereignis\" in diesem Schätzer \"die Probanden so lange zu verfolgen, wie die Studie es zuließ\".\n            <br/>\n            Eine Tabelle der parametrischen Überlebens- und Ereignisschätzungen für die gewählte Verteilung wird zu jedem beobachteten Zeitpunkt im Datensatz mit gegebenen Konfidenzintervallen bereitgestellt. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Stiloptionen</b>\n            <br/>\n            <br/>\n            <b>Plot-Titel:</b> Titel des Plots; löschen Sie allen Text für keinen Titel\n            <br/><br/>\n\t\t\t<b>Plot-Titelgröße:</b> Größe des Plot-Titels.\n\t\t\t<br/><br/>\n            <b>Plot-Thema:</b> Allgemeiner Stil des Plots\n            <br/><br/>\n            <b>Nummer der Gefährdeten einbeziehen:</b> Optional, eine Tabelle für die Anzahl der Probanden, die über die Zeit hinweg gefährdet sind, am unteren Rand des Plots einfügen.  <b>Position der Risikotabelle</b> gibt an, ob Sie die Tabelle außerhalb oder innerhalb der Achsen haben möchten.  Die <b>Höhe der Risikotabelle</b> steuert den Anteil des Plotbereichs, den die Tabelle einnimmt. Diese Option wird ignoriert, wenn die Risikotabelle innerhalb der Achsen positioniert ist. \n\t\t\tDie <b>Größe der Risikotabelle-Werte</b> steuert die Größe der Zahlen, die gefährdet sind. Die <b>Größe des Titels der Risikotabelle</b> steuert die Größe des Titels für die Risikotabelle.\n\t\t\tDie <b>Größe der Achsenbeschriftungen der Risikotabelle</b> steuert die Größe der Achsenbeschriftungen.\n\t\t\tDie <b>Größe der Tick-Mark-Beschriftungen der Risikotabelle</b> steuert die Größe der Tick-Mark-Beschriftungen für die Zeiten in der Risikotabelle. Wenn gewünscht, können alle Achsen und Gitterlinien \n\t\t\taus der Risikotabelle entfernt werden, indem die Option <b>Achsen und Gitterlinien aus der Risikotabelle entfernen</b> aktiviert wird. Dies wird nur die Zahlen in der Tabelle enthalten.\n            <br/>\n            <br/>\n            <b>Linienoptionen:</b>\n            <b>Größe</b> steuert die Dicke und <b>Farbe</b> steuert die Farbe der gezeichneten Linie. Man kann optional ein 95%-Konfidenzintervall für die Schätzungen in entweder einem <b>Ribbon</b> (schattierter Bereich) oder <b>Step</b> (Linie) Format einfügen. <b>Transparenz</b> steuert, wie dunkel das Ribbon ist und wird ignoriert, wenn die Step-Option ausgewählt ist. <b>Zensierte Zeiten</b> (wenn Probanden nicht mehr für das Ereignis gefährdet sind) können mit \"+\"-Symbolen auf der Linie angezeigt werden. Die Größe der \"+\"-Symbole kann angepasst werden. Die Option <b>Medianüberleben anzeigen</b> wird horizontale oder vertikale Linien zu dem Zeitpunkt einfügen, an dem 50% der Probanden geschätzt werden, das Ereignis gehabt zu haben. Die mediane Zeit ist undefiniert, wenn die Überlebenskurve 50% nicht überschreitet.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Achsenoptionen</b>\n            <br/> \n            <br/> \n            Die <b>Beschriftung</b>-Option gibt die Textbeschriftung für die Achse an. Die <b>Achsenlimits</b> geben die minimalen und maximalen Werte der Achse an. Die <b>Tick-Mark-Inkremente</b>-Option steuert den Abstand der Tick-Marken auf der Achse. Die Inkremente auf der Zeitachse steuern auch die Zeiten für die optionale Risikotabelle.\n            <br/> \n            Die Überlebensachse <b>Skala</b>-Option gibt an, ob Sie möchten, dass die Schätzungen auf einer Proportions- (0-1) oder Prozent- (0-100) Skala sind.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Achsenbeschriftungen:</b>  Dies steuert die Größe sowohl der Überlebens- als auch der Zeitachsenbeschriftungen.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Tick-Mark-Beschriftungen der Achsen:</b>  Dies steuert die Größe sowohl der Überlebens- als auch der Zeitachsen-Tick-Mark-Beschriftungen.\n      "
  }
}