{
  "title": "Stichprobengröße, Präzision von Cohens Kappa",
  "navigation": "Cohens Kappa",
  "howtouse": "Geben Sie entweder die Stichprobengröße oder die Breite des Konfidenzintervalls an, und das andere wird berechnet",
  "n": "Stichprobengröße",
  "width": "Breite des Konfidenzintervalls",
  "kappa": "Kappa (0-1)",
  "conflevel": "Konfidenzniveau (0-1)",
  "raters": "Anzahl der Bewerter (2-6)",
  "categories": "Anzahl der Kategorien (2-5)",
  "props": "Anteile in jeder Kategorie; durch Kommas trennen, z.B. .3, .7; müssen der Anzahl der Kategorien entsprechen und sich auf 1 summieren",
  "help": {
    "title": "Stichprobengröße, Präzision von Cohens Kappa",
    "r_help": "help(prec_kappa, package ='presize')",
    "body": "\nDies ist eine Bewertung der Stichprobengröße für Cohens Kappa basierend auf der Breite des Konfidenzintervalls. Es berechnet die Stichprobengröße oder die Breite des Konfidenzintervalls, wenn der Benutzer das andere angibt.\n<br/><br/>\n<b>Stichprobengröße:</b> Geben Sie die Anzahl der Probanden in der Studie an\n<br/><br/>\n<b>Breite des Konfidenzintervalls:</b> Geben Sie die gewünschte Breite des Konfidenzintervalls an. Die Breite eines Konfidenzintervalls ist ein Maß für die Präzision einer Schätzung und ist die obere Grenze minus die untere Grenze.\n<br/><br/>\n<b>Kappa:</b> Geben Sie den erwarteten Kappa-Wert an\n<br/><br/>\n<b>Konfidenzniveau:</b> Geben Sie das gewünschte Niveau des Konfidenzintervalls an\n<br/><br/>\n<b>Anzahl der Bewerter:</b> Geben Sie die Anzahl der Bewerter an, die Werte für jeden Probanden bereitstellen.\n<br/><br/>\n<b>Anzahl der Kategorien:</b> Geben Sie die Anzahl der Kategorien in der Ergebnisvariablen an\n<br/><br/>\n<b>Anteile in jeder Kategorie:</b> Geben Sie den erwarteten Anteil der Probanden in jeder Kategorie an, getrennt durch Kommas. Beachten Sie, dass die Anzahl der angegebenen Werte der Anzahl der angegebenen Kategorien entsprechen und sich auf 1 summieren muss.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> presize\n\t\t\t"
  }
}