{
  "title": "Hauptkomponentenanalyse",
  "navigation": "Hauptkomponenten",
  "lab40": "HINWEIS: Die Korrelations- oder Kovarianzmatrix wird automatisch aus den ausgewählten Variablen erstellt",
  "destination": "Variablen auswählen",
  "label1": "Wählen Sie eine Korrelations- oder Kovarianzmatrix aus",
  "rd1": "Korrelationsmatrix",
  "rd2": "Kovarianzmatrix",
  "addToDataset": "Hauptkomponenten zum Datensatz hinzufügen. Sie müssen ein Präfix für die Variablennamen und die Anzahl der hinzuzufügenden Komponenten angeben",
  "variablePrefix": "Geben Sie ein Präfix für die zum Datensatz hinzugefügten Komponenten ein",
  "noOfComponents": "Geben Sie die Anzahl der hinzuzufügenden Komponenten zum Datensatz ein",
  "screeplot": "Screeplot",
  "help": {
    "title": "Hauptkomponentenanalyse",
    "r_help": "help(princomp, package ='stats')",
    "body": "\n<b>Beschreibung</b></br>\nFührt eine Hauptkomponentenanalyse auf der gegebenen numerischen Datenmatrix durch und gibt die Ergebnisse als Objekt der Klasse princomp zurück. Intern wird princomp im stats-Paket aufgerufen.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nBSkyPCARes <-BSkyPrinCompAnalysis(vars=c(),cor =TRUE, componentsToRetain =0, generateScreeplot=FALSE,prefixForComponents =\"\",dataset=\"\")\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nvars: Die Variablen in einem Zeichenvektor, aus dem Komponenten extrahiert werden\n</li>\n<li>\ncor: Ein boolescher Wert, der angibt, ob die Berechnung eine Korrelations- oder Kovarianzmatrix verwenden soll\n</li>\n<li>\ncomponentsToRetain: Eine Zahl, die die Anzahl der im Datensatz zu behaltenden Komponenten angibt. Für jede aufgerufene Komponente wird eine neue Variable im Datensatz erstellt\n</li>\n<li>\n​generateScreeplot: Generiert ein Screeplot\n</li>\n<li>\nprefixForComponents: Präfix, das beim Speichern der Komponenten in einem Datensatz verwendet werden soll\n</li>\n<li>\ndataset: Der Name des Datensatzes als Zeichenfolge\n</li>\n</ul>\n<b>Wert</b></br>\nprincomp gibt eine Liste mit der Klasse \"princomp\" zurück, die die folgenden Komponenten enthält</br>\nsdev: die Standardabweichungen der Hauptkomponenten.</br>\nloadings: die Matrix der Variablenladungen (d.h. eine Matrix, deren Spalten die Eigenvektoren enthalten). Dies ist der Klasse \"loadings\": siehe loadings für die Druckmethode.</br>\ncenter: die Mittelwerte, die subtrahiert wurden.</br>\nscale: die Skalierungen, die auf jede Variable angewendet wurden.</br>\nn.obs: die Anzahl der Beobachtungen.</br>\nscores: wenn scores = TRUE, die Scores der bereitgestellten Daten auf den Hauptkomponenten. Diese sind nur dann nicht null, wenn x bereitgestellt wurde, und wenn covmat ebenfalls bereitgestellt wurde, falls es sich um eine Kovarianzliste handelte. Für die Formel-Methode wird napredict() angewendet, um die Behandlung von Werten zu handhaben, die durch die na.action weggelassen wurden.</br>\ncall: der übereinstimmende Aufruf.</br>\nna.action: Falls relevant.</br>\n<b>Paket</b></br>\nstats</br>\n<b>Hilfe</b></br>\nhelp(princomp, package ='stats')\n"
  }
}