{
  "title": "Prozessfähigkeit (Sixpack)",
  "navigation": "Prozessfähigkeit (Sixpack)",
  "summaryPlotChk": "Sixpack (unterliegende I-MR, Xbar, R, S-Diagramme, Wahrscheinlichkeit und Fähigkeitsdiagramme)",
  "displaySLlineonPlotChk": "LSL- und USL-Linien auf den zugrunde liegenden Diagrammen anzeigen",
  "printObjectSummaryChk": "QCC-Objektsummary für die Prozessfähigkeit drucken",
  "label1": "Zwei Optionen - entweder eine Variable (und eine Gruppierungsvariable nach Bedarf) auswählen oder die Variablen im Datensatz auswählen, wenn sie bereits gruppiert sind",
  "label2": "Erweiterte Optionen",
  "selectVariableRad": "Option 1: Wählen Sie eine Variable aus dem Datensatz aus (möglicherweise muss diese gruppiert werden)",
  "variableSelcted": "Wählen Sie eine Variable (beobachtete Daten) zur Analyse aus",
  "groupingVariable": "Gruppierungsvariable (optional - falls die Daten gruppiert werden müssen)",
  "sampleSize": "Die Stichprobengröße wird ignoriert, wenn oben eine Gruppierungsvariable ausgewählt wurde",
  "variableControlLimits": "Datenzeilen, die verworfen werden sollen, falls vorhanden, bevor die Gruppierung für die Kontrollgrenzen der Variablen erfolgt (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "displayGroupsChk": "Die Gruppierungen im Datensatz-UI-Raster nur zur Referenz anzeigen",
  "selectDatasetRad": "Option 2: Wählen Sie die Variablen aus dem Datensatz aus, wenn sie bereits gruppiert sind",
  "variablelistSelcted": "Wählen Sie eine oder mehrere gruppierte Variablen (beobachtete Daten) zur Analyse aus",
  "rowsTobeUsed": "Wenn ausgewählte (gruppierte) Zeilen zur Analyse der Prozessfähigkeit verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "nsigmas": "Sigma - Anzahl der Sigmas, die zur Berechnung der Kontrollgrenzen verwendet werden sollen",
  "confidence_level": "Ein numerischer Wert zwischen 0 und 1, der das Niveau angibt, das zur Berechnung der Konfidenzintervalle verwendet werden soll",
  "stddev": "Standardabweichungsmethode zur Berechnung von xbar (für Gruppengröße > 1)",
  "stddevXbarOne": "Standardabweichungsmethode zur Berechnung von I-MR",
  "DoNotUseUnbiasingConstantChk": "Verwenden Sie keine Entbiasierungs-Konstante zur Schätzung der Standardabweichung für die Gesamtprozessfähigkeitsindizes",
  "lower": "LSL - numerischer Wert der unteren Spezifikationsgrenze (geben Sie NA ein, um einseitige Spezifikationsgrenzen anzugeben)",
  "upper": "USL - numerischer Wert der oberen Spezifikationsgrenze (geben Sie NA ein, um einseitige Spezifikationsgrenzen anzugeben)",
  "target": "Ziel - ein optionaler Wert, der das Ziel des Prozesses angibt",
  "addlSpecLines": "Zusätzliche Spezifikationslinien im Diagramm hinzufügen (durch Kommas getrennt, z. B. 73.98, 74.01, 74.03)",
  "addlSpecLinesLabel": "Bezeichnung für die zusätzlichen Spezifikationslinien (durch Kommas getrennt, z. B. Spec 1, Spec 2, Spec 3)",
  "digits": "Ziffern - Anzahl der anzuzeigenden Ziffern"
}