{
  "title": "Prozessfähigkeit (Sixpack) ",
  "navigation": "Prozessfähigkeit (Sixpack) ",
  "summarySixpackPlotChk": "Sixpack (unterliegende I-MR, Xbar, R, S-Diagramme, Wahrscheinlichkeits- und Fähigkeitsdiagramme)",
  "flipaxisPPplotChk": "Achse für das P-P-Diagramm umdrehen",
  "displaySLlineonPlotChk": "LSL- und USL-Linien in den zugrunde liegenden Diagrammen anzeigen",
  "numOfLastSubgroupsPlot": "Anzahl der letzten Untergruppen, die geplottet werden sollen",
  "printObjectSummaryChk": "QCC-Objektzusammenfassung für die Prozessfähigkeit drucken",
  "label1": "Zwei Optionen - entweder eine Variable (und eine Gruppierungsvariable nach Bedarf) auswählen oder die Variablen im Datensatz auswählen, wenn sie bereits gruppiert sind",
  "label2": "Erweiterte Optionen",
  "selectVariableRad": "Option 1: Wählen Sie eine Variable aus dem Datensatz aus (möglicherweise muss diese gruppiert werden)",
  "variableSelcted": "Wählen Sie eine Variable (beobachtete Daten) zur Analyse aus",
  "groupingVariable": "Gruppierungsvariable (optional - falls die Daten gruppiert werden müssen)",
  "sampleSize": "Die Stichprobengröße wird ignoriert, wenn oben eine Gruppierungsvariable ausgewählt wurde",
  "variableControlLimits": "Datenzeilen, die verworfen werden sollen, falls vorhanden, vor der Gruppierung für die Variablenkontrollgrenzen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "displayGroupsChk": "Die Gruppierungen im UI-Raster des Datensatzes nur zur Referenz anzeigen",
  "selectDatasetRad": "Option 2: Wählen Sie die Variablen aus dem Datensatz aus, wenn sie bereits gruppiert sind",
  "variablelistSelcted": "Wählen Sie eine oder mehrere gruppierte Variablen (beobachtete Daten) zur Analyse aus",
  "rowsTobeUsed": "Wenn ausgewählte (gruppierte) Zeilen zur Analyse der Prozessfähigkeit verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "nsigmas": "Sigma - Anzahl der Sigmas, die zur Berechnung der Kontrollgrenzen verwendet werden sollen",
  "confidence_level": "Ein numerischer Wert zwischen 0 und 1, der das Niveau angibt, das zur Berechnung der Konfidenzintervalle verwendet werden soll",
  "stddev": "Standardabweichungsmethode für Variation innerhalb der Untergruppen",
  "stddevR": "Standardabweichungsmethode für R-Diagramm (für Gruppengröße > 1 und < 9)",
  "stddevS": "Standardabweichungsmethode für S-Diagramm (für Gruppengröße > 8)",
  "stddevXbarOne": "Standardabweichungsmethode zur Berechnung von I-MR",
  "DoNotUseUnbiasingConstantChk": "Verwenden Sie keine Entbiasierungs-Konstante zur Schätzung der Standardabweichung für die Gesamtprozessfähigkeitsindizes",
  "lower": "LSL - numerischer Wert der unteren Spezifikationsgrenze (geben Sie NA an, um einseitige Spezifikationsgrenzen anzugeben)",
  "upper": "USL - numerischer Wert der oberen Spezifikationsgrenze (geben Sie NA an, um einseitige Spezifikationsgrenzen anzugeben)",
  "target": "Ziel - ein optionaler Wert, der das Ziel des Prozesses angibt",
  "addlSpecLines": "Zusätzliche Spezifikationslinien im Diagramm hinzufügen (durch Kommas getrennt, z. B. 73.98, 74.01, 74.03)",
  "addlSpecLinesLabel": "Bezeichnung für die zusätzlichen Spezifikationslinien (durch Kommas getrennt, z. B. Spec 1, Spec 2, Spec 3)",
  "addRefLines": "Referenzlinien hinzufügen",
  "digits": "Ziffern - Anzahl der anzuzeigenden Ziffern",
  "help": {
    "title": "Prozessfähigkeit (qcc pkg)",
    "r_help": "help(process.capability, package = qcc)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tqcc-Funktion zur Berechnung von Fähigkeitsindizes \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür detaillierte Hilfe - verwenden Sie R help(process.capability, package = qcc), help(qcc, package = qcc), help(sd.xbar, package = qcc) und help(sd.xbar.one, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm dies auszuprobieren, können Sie den Datensatz namens pistonrings aus dem qcc-Paket mit dem Menü Datensatz laden, indem Sie das qcc-Paket auswählen und dann den Datensatz pistonrings auswählen\n\t\t\t\t<br/>\n\t\t\t\tWählen Sie Option 1, Durchmesser zur Variable (beobachtet..), Stichprobe zur Gruppierungsvariable, \n\t\t\t\t<br/>\n\t\t\t\tGeben Sie 1:25 in die gruppierten Zeilen ein, die verwendet werden sollen\n\t\t\t\t<br/>\n\t\t\t\tFür die Analyse der Prozessfähigkeit - geben Sie 73.95 in LSL, 74.05 in USL und 74.0 in Zielgrenze ein\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tBefolgen Sie das qcc-Tutorial unter https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMethoden zur Standardabweichung:\n\t\t\t\t<br/>\n\t\t\t\t\"UWAVE-R\"\n\t\t\t\t<br/>\n\t\t\t\tUngewichteter Durchschnitt der Schätzungen der Untergruppen basierend auf den Untergruppenbereichen\n\t\t\t\t<br/>\n\t\t\t\tMaximale unterstützte Stichprobengröße beträgt 25 \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t\"UWAVE-SD\"\n\t\t\t\t<br/>\n\t\t\t\tUngewichteter Durchschnitt der Schätzungen der Untergruppen basierend auf den Standardabweichungen der Untergruppen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t\"MVLUE-R\"\n\t\t\t\t<br/>\n\t\t\t\tMinimum Variance Linear Unbiased Estimator, berechnet als gewichteter Durchschnitt der Schätzungen der Untergruppen basierend auf den Untergruppenbereichen\n\t\t\t\t<br/>\n\t\t\t\tMaximale unterstützte Stichprobengröße beträgt 25 \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t\"MVLUE-SD\"\n\t\t\t\t<br/>\n\t\t\t\tMinimum Variance Linear Unbiased Estimator, berechnet als gewichteter Durchschnitt der Schätzungen der Untergruppen basierend auf den Standardabweichungen der Untergruppen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t\"RMSDF\"\n\t\t\t\t<br/>\n\t\t\t\tRoot-Mean-Square-Schätzer, berechnet als gewichteter Durchschnitt der Schätzungen der Untergruppen basierend auf den Standardabweichungen der Untergruppen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMapping der Begriffe:\n\t\t\t\t<br/>\n\t\t\t\tDurchschnitt der unverzerrten SDs → UWAVE-SD\n\t\t\t\t<br/>\n\t\t\t\tDurchschnitt der Bereiche → UWAVE-R\n\t\t\t\t<br/>\n\t\t\t\tUnverzerrte gepoolte SD → RMSDF\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}