{
  "title": "Zufällige Teilung",
  "navigation": "Zufällige Teilung",
  "traindataset": "Geben Sie den Namen des Trainingsdatensatzes ein",
  "testdataset": "Geben Sie den Namen des Testdatensatzes ein",
  "split": "Geben Sie den Teilungsprozentsatz ein",
  "replace": "Soll die Stichprobe mit Ersatz erfolgen?",
  "seed": "Setze Seed",
  "dependent": "Variable zur Konstruktion stratifizierter Stichproben",
  "help": {
    "title": "Zufällige Teilung",
    "r_help": "hilfe(stichprobe, paket=\"basis\")",
    "body": "\n<b>Beschreibung</b></br>\nstichprobe nimmt eine Stichprobe der angegebenen Größe aus den Elementen von x unter Verwendung von mit oder ohne Ersatz.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nstichprobe(x, größe, ersatz = FALSCH, wahrscheinlichkeit = NULL)\nstichprobe.int(n, größe = n, ersatz = FALSCH, wahrscheinlichkeit = NULL)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: Entweder ein Vektor von einem oder mehreren Elementen, aus denen gewählt werden soll, oder eine positive ganze Zahl. Siehe 'Details.'\n</li>\n<li>\nn: eine positive Zahl, die Anzahl der Elemente, aus denen gewählt werden soll. Siehe 'Details.'\n</li>\n<li>\ngröße: eine nicht-negative ganze Zahl, die die Anzahl der auszuwählenden Elemente angibt.\n</li>\n<li>\nersatz: Soll die Stichprobe mit Ersatz erfolgen?\n</li>\n<li>\nwahrscheinlichkeit: Ein Vektor von Wahrscheinlichkeitsgewichten für das Erhalten der Elemente des Vektors, der ausgewählt wird.\n</li>\n</ul>\n<b>Details</b></br>\nWenn x die Länge 1 hat, numerisch ist (im Sinne von is.numeric) und x >= 1, erfolgt die Stichprobe über sample von 1:x. Beachten Sie, dass diese Komfortfunktion zu unerwünschtem Verhalten führen kann, wenn x in Aufrufen wie sample(x) variierende Längen hat. Siehe die Beispiele.<br/>\nAndernfalls kann x ein beliebiges R-Objekt sein, für das die Länge und das Subsetting durch ganze Zahlen sinnvoll sind: S3- oder S4-Methoden für diese Operationen werden entsprechend dispatchiert.<br/>\nFür sample ist die Standardgröße die Anzahl der Elemente, die aus dem ersten Argument abgeleitet wird, sodass sample(x) eine zufällige Permutation der Elemente von x (oder 1:x) erzeugt.<br/>\nEs ist erlaubt, eine Größe = 0 Stichprobe mit n = 0 oder einem Länge-null x zu verlangen, aber ansonsten ist n > 0 oder positive Länge(x) erforderlich.<br/>\nNicht-ganzzahlige positive numerische Werte von n oder x werden auf die nächstkleinere ganze Zahl gekürzt, die nicht größer als .Machine$integer.max sein darf.<br/>\nDas optionale Argument wahrscheinlichkeit kann verwendet werden, um einen Vektor von Gewichten für das Erhalten der Elemente des Vektors, der ausgewählt wird, anzugeben. Sie müssen nicht auf eins summieren, sollten jedoch nicht negativ und nicht alle null sein. Wenn ersatz wahr ist, wird die Alias-Methode von Walker (Ripley, 1987) verwendet, wenn es mehr als 200 vernünftig wahrscheinliche Werte gibt: dies führt zu Ergebnissen, die mit denen von R < 2.2.0 inkompatibel sind.<br/>\nWenn ersatz falsch ist, werden diese Wahrscheinlichkeiten nacheinander angewendet, das heißt, die Wahrscheinlichkeit, das nächste Element auszuwählen, ist proportional zu den Gewichten unter den verbleibenden Elementen. Die Anzahl der nicht nullen Gewichte muss in diesem Fall mindestens so groß wie die Größe sein.<br/>\nstichprobe.int ist eine einfache Schnittstelle, bei der sowohl n als auch größe als ganze Zahlen angegeben werden müssen.<br/>\nAb R 3.0.0 kann n größer sein als die größte ganze Zahl vom Typ integer, bis zur größten darstellbaren ganzen Zahl vom Typ double. Nur gleichmäßige Stichproben werden unterstützt. Zwei Zufallszahlen werden verwendet, um eine gleichmäßige Stichprobe großer Ganzzahlen sicherzustellen.<br/>\n<b>Paket</b></br>\nbasis\n<b>Hilfe</b></br>\nhilfe(stichprobe, paket=\"basis\")\n"
  }
}