{
  "title": "Variablen umkodieren",
  "navigation": "Umkodierung",
  "oldvars": "Zu umkodierende Variablen",
  "label1": "Optionen",
  "newvarradio": "Neue Variable(n)",
  "newvar": "Geben Sie neue Variablennamen ein, getrennt durch , z.B. newVar1, newVar2",
  "oldvarradio": "Vorhandene Variable(n) überschreiben",
  "suffix": "Geben Sie ein Suffix für umkodierte Variablen an",
  "prefix": "Geben Sie ein Präfix für umkodierte Variablen an",
  "enterSuffix": "Geben Sie ein Suffix ein",
  "enterPrefix": "Geben Sie ein Präfix ein",
  "label3": "Beim Angeben mehrerer Umkodierungskriterien verwenden Sie ; als Trennzeichen.",
  "label4": "HINWEIS: STRING-WERTE MÜSSEN IN DOPPELTE ANFÜHRUNGSZEICHEN (\") UND NICHT IN EINZELNE ANFÜHRUNGSZEICHEN (') EINGESCHLOSSEN WERDEN.",
  "label5": "Geben Sie alte Werte und neue Werte getrennt durch ; ein, z.B. \"Männlich\"=\"Mann\";\"Weiblich\"=2;\"Houston, Texas\"=\"Texas\";\"Nicht verfügbar\"=NA",
  "label5a": "Für die Umkodierung des numerischen Typs geben Sie 70=100;71=101;99=NA ein",
  "label5b": "Bereich von Werten wird unterstützt, z.B. 5:10=\"mittel\" Besondere Werte lo und hi können in einem Bereich erscheinen, z.B. lo:10=\"niedrig\";11:89=\"mittel\";90:hi=\"hoch\"",
  "label6": "Das Schlüsselwort else kann für alles verwendet werden, was nicht zu einer Spezifikation passt, z.B. else =NA",
  "dontMakeFactor": "Standardmäßig wird die umkodierte Variable ein Faktor sein, wenn die Quellvariable ein Faktor ist. Um dies zu überschreiben, aktivieren Sie das Kontrollkästchen",
  "oldnewvals": "Geben Sie Umkodierungskriterien ein",
  "help": {
    "title": "Variablen umkodieren",
    "r_help": "help(recode, package=car)",
    "body": "\n<b>Beschreibung</b></br>\nKodiert einen oder mehrere numerische Vektoren, Zeichenvektoren oder Faktoren gemäß den Umkodierungsspezifikationen. Sie können die Ergebnisse speichern, indem Sie vorhandene Variablen überschreiben, neue Variablennamen angeben, um umkodierte Werte zu speichern, oder wählen, die umkodierten Werte in neuen Variablen mit einem geeigneten Präfix oder Suffix zu speichern. Das Präfix oder Suffix wird auf den vorhandenen Variablennamen angewendet.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nBSkyRecode(colNames,newColNames,OldNewVals,NewCol=TRUE,dataSetNameOrIndex='Dataset2')\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ncolNames: Ein Zeichenvektor, der eine oder mehrere Variablen im Datensatz enthält, die umkodiert werden sollen\n</li>\n<li>\nnewColNames:  Ein Zeichenvektor, der die Namen der neuen Spalten enthält.\n</li>\n<li>\nOldNewVals: Ein Zeichenstring von Umkodierungsspezifikationen in der Form oldval1,newval1, oldval2,newval2\n</li>\n<li>\nNewCol: Ein Boolean, der angibt, ob umkodierte Werte in neuen Variablen (TRUE) oder vorhandene Variablen überschrieben werden (FALSE).\n</li>\n<li>\nprefixOrSuffix: Geben Sie an, ob Sie die umkodierten Werte in neuen Variablen speichern möchten, die mit dem von Ihnen angegebenen Namen präfixiert oder suffixiert sind. Geben Sie Präfix oder Suffix ein.\n</li>\n<li>\nprefixOrSuffixString: Geben Sie eine Zeichenfolge an, die als Präfix oder Suffix für den vorhandenen Variablennamen verwendet werden soll. Umkodierte Werte werden in diesen Variablen gespeichert.\n</li>\n<li>\ndataSetNameOrIndex: Der Name des Datensatzes/Dataframes\n</li>\n</ul>\nHinweis: Wir werden nicht von numerisch zu Faktor konvertieren. Wenn eine numerische Variable umkodiert wird, bleibt sie numerisch, wenn eine Faktorvariable umkodiert wird, bleibt sie ein Faktor.<br/>\n<b>Paket</b></br>\ncar</br>\n<b>Hilfe</b></br>\nGeben Sie die folgende Zeile im BlueSky Statistics R-Syntax-Editor ein</br>\nhelp(recode, package=car)\n"
  }
}