{
  "helpText": "Die wiederholte Messung ANOVA erfordert, dass die Daten im langen Format vorliegen. Wenn Ihre Daten nicht im langen Format vorliegen, siehe Datensätze > Umformen > Länger",
  "repMeasuresConfig": "Konfiguration",
  "modelname": "Modellnamen eingeben",
  "title": "Wiederholte Messungen ANOVA - Weit",
  "subjectID": "Optional eine Variable angeben, die als Subjektidentifikator verwendet werden soll",
  "dependentVariable": "Abhängige Variable",
  "navigation": "ANOVA, Wiederholte Messungen, Weit",
  "response": "Innerhalb der Subjekte Variable(n) z.B. Zeit",
  "Fixed": "Faktor zwischen den Subjekten",
  "covariates": "Kovariaten",
  "Summary": "Geschätzte marginale Mittelwerte",
  "Scatter_plot": "Posthocs",
  "Residual": "Residuen vs. Angepasster Plot",
  "Histogram": "Histogrammplot der Residuen",
  "brownForsythe": "Brown-Forsythe-Test",
  "levenesTest": "Levene-Test",
  "plotMeansCI": "Plot der Mittelwerte und Konfidenzintervalle",
  "simpleEffectsTest": "Einfacher Effekttest",
  "label2": "Optionen für Posthocs und einfachen Effekttest",
  "combon": "Mittelwerte vergleichen mit:",
  "adjust": "Methode zur Anpassung der p-Werte",
  "displayBoxMDetails": "Details zu Box's M-Test anzeigen (Hinweis: Die Ergebnisse des Box's M-Tests werden immer angezeigt)",
  "help": {
    "title": "Wiederholte Messungen ANOVA",
    "r_help": "help(aov_ez , package='afex')",
    "body": "\n<b>Beschreibung</b></br>\nHINWEIS:<br/>\n1. Wir müssen die Daten umformen, wenn wir eine wiederholte Messung ANOVA auf einem breiten Datensatz durchführen<br/>\n2. Wir unterstützen mehrere wiederholte Messungen für eine einzelne Variable, z.B. Blutzucker, der bei Voruntersuchungen, Nachuntersuchungen und bei einem Folgetermin gemessen wird<br/>\n3. Sie müssen einen Namen für den wiederholten Faktor angeben, z.B. Blutzucker, und die Anzahl der Ebenen. Wir erstellen eine Faktorvariable, z.B. mit dem Namen Blutzucker, mit Ebenen, die aus den Namen der Variablen bestehen, die die wiederholten Messungen enthalten, z.B. die Ebenen des Faktors sind Voruntersuchung, Nachuntersuchung und Nachuntersuchung<br/>\n4. Sie müssen einen Messnamen angeben, z.B. Wert. Wir erstellen eine Variable, z.B. Wert, mit allen Blutzuckerwerten, die den Voruntersuchungen, Nachuntersuchungen und Nachuntersuchungen für jedes Subjekt entsprechen.<br/>\n5. Wir unterstützen einen einzelnen zwischen-subjektlichen und innerhalb-subjektlichen Faktor.<br/>\n6. Zukünftige Versionen werden mehrere Messungen sowie mehrere zwischen-subjektliche und innerhalb-subjektliche Faktorvariablen unterstützen.<br/>\n7. Standardmäßig entspricht jede Zeile des Datensatzes einem einzigartigen Subjekt, Sie können auch eine Variable für die Subjekt-ID angeben.</br>\n<br/>\nBei wiederholten Messungen ANOVA werden F-Statistiken für jeden innerhalb der Subjekte Faktor, zwischen-subjektlichen Faktor und den Interaktionsterm für gemischte ANOVA berechnet</br>\nSuchen Sie nach den zusätzlichen ANOVA-Wertetabellen in der Ausgabe, die MSE (mittlerer quadratischer Fehler) und pes (partielles eta-Quadrat) anzeigen</br>\nDerzeit unterstützen wir einen einzelnen innerhalb-subjektlichen und zwischen-subjektlichen Faktor, der zwischen-subjektliche Faktor ist optional.</br>\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"abhängigeVariable\", \n\tid = \"Identifikator\", innerhalb = c(\"Zeit\"), \tzwischen = c(\"Behandlung\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndaten: Ein data.frame, das die Daten enthält. Obligatorisch\n</li>\n<li>\ndv: Zeichenvektor (Länge 1), der die Spalte angibt, die die abhängige Variable in den Daten enthält.\n</li>\n<li>\nzwischen: Zeichenvektor, der die zwischen-subjektlichen Faktoren/Spalten in den Daten angibt. Standard ist NULL, was keine zwischen-subjektlichen Faktoren bedeutet.\n</li>\n<li>\ninnerhalb: Zeichenvektor, der die innerhalb-subjektlichen (oder wiederholten Messungen) Faktoren/Spalten in den Daten angibt. Standard ist NULL, was keine innerhalb-subjektlichen Faktoren bedeutet.\n</li>\n<li>\nkowariate: Zeichenvektor, der die zwischen-subjektlichen Kovariaten (d.h. Spalten) in den Daten angibt. Standard ist NULL, was keine Kovariaten bedeutet. Bitte beachten Sie, dass factorize auf FALSE gesetzt werden muss, falls die Kovariate numerisch ist und als solche behandelt werden soll.\n</li>\n<li>\nanovatable: Liste weiterer Argumente, die an die Funktion übergeben werden, die die ANOVA-Tabelle erzeugt. \n</li>\n</ul>\n<br/>\n<b>Details</b></br>\nSiehe detaillierte R-Hilfe</br>\n<b>Wert</b><br/>\naov_car, aov_4 und aov_ez sind Wrapper für Anova und aov, der Rückgabewert hängt vom Rückgabeargument ab. Standardmäßig wird ein S3-Objekt der Klasse \"afex_aov\" zurückgegeben, das die folgenden Slots enthält:<br/>\n\"anova_table\": Eine ANOVA-Tabelle der Klasse c(\"anova\", \"data.frame\").<br/>\n\"aov\": aov-Objekt, das von aov zurückgegeben wird (sollte nicht verwendet werden, um die Signifikanz von Effekten zu bewerten, kann aber an emmeans für Post-hoc-Tests übergeben werden).<br/>\n\"Anova\": Objekt, das von Anova zurückgegeben wird, ein Objekt der Klasse \"Anova.mlm\" (wenn innerhalb-subjektliche Faktoren vorhanden sind) oder der Klasse c(\"anova\", \"data.frame\").<br/>\n\"lm\": das Objekt, das mit lm angepasst und an Anova übergeben wird (d.h. ein Objekt der Klasse \"lm\" oder \"mlm\"). Wird auch zurückgegeben, wenn return = \"lm\".<br/>\n\"daten\": eine Liste, die enthält: (1) lang (die möglicherweise aggregierten Daten im langen Format, die für aov verwendet werden), breit (die Daten, die verwendet werden, um das lm-Objekt anzupassen) und idata (wenn innerhalb-subjektliche Faktoren vorhanden sind, das idata-Argument, das an car::Anova übergeben wird). Wird auch zurückgegeben, wenn return = \"data\".<br/>\n<b>Paket</b></br>\nafex</br>\n<b>Hilfe</b></br>\nhelp(aov_ez, package ='afex')\nKlicken Sie auf die R-Hilfe-Schaltfläche, um detaillierte R-Hilfe zu erhalten. Sie können auch help(aov_ez, package ='afex') eingeben und STRG + Eingabetaste im R-Syntax-Editor drücken, um Hilfe zu erhalten\n    "
  }
}