{
  "title": "Risiko-Set-Matching",
  "navigation": "Risiko-Set-Matching",
  "newdatasetnamelabel": "Datensatzname zum Speichern der übereinstimmenden Daten",
  "groupvarlabel": "Ereignisvariable (1=Ereignis, 0=Zensur)",
  "timevarlabel": "Zeitvariable",
  "calipervarslabel": "Variablen für das Matching (numerisch)",
  "caliperslabel": "Geben Sie die Kaliber in der Reihenfolge der Matching-Variablen an, getrennt durch Kommas, z.B. 5, 2; geben Sie 0 für exakte Übereinstimmungen an",
  "ratiolabel": "Anzahl der Kontrollen pro Fall",
  "repeatcontrolslabel": "Erlauben Sie, dass Kontrollen mehr als einmal zugeordnet werden",
  "supercontrolslabel": "Keine Fälle zulassen, die mit anderen Fällen übereinstimmen",
  "help": {
    "title": "Risiko-Set-Matching",
    "body": "\n            Führt das Matching von Subjekten innerhalb einer Kohorte durch. Diejenigen mit dem Ergebnisereignis (Fälle) werden mit denen abgeglichen, die das Ereignis nicht hatten (Kontrollen) und sich zum Zeitpunkt des Ereignisses des Falls im Risikosatz befinden. Dies ist ein verschachteltes Fall-/Kontroll-Design. Baseline-Variablen, die beim Eintritt in die Kohorte bekannt sind, werden ebenfalls verwendet, um Fälle und Kontrollen abzugleichen.\n\t\t\t<br/><br/>\n\t\t\tBaseline-Variablen, für die die Werte genau übereinstimmen müssen, und Werte, die innerhalb numerischer Kaliber übereinstimmen, werden unterstützt. Kontrollen werden zufällig aus allen geeigneten Kontrollen für jeden Fall ausgewählt.\n\t\t\t<br/><br/>\n\t\t\tDer Ausgabedatensatz, der die übereinstimmenden Daten enthält, enthält die ursprünglichen Variablen, den Ereignisindikator (\"fehlgeschlagen\") und eine Variable, die das übereinstimmende Set identifiziert (\"match.num\").\n\t\t\t<br/><br/>\n\t\t\tBeobachtungen mit fehlenden Werten für Variablen, die am Matching-Prozess beteiligt sind, werden vor dem Matching entfernt.\n\t\t\t<br/><br/>\n\t\t\tEine kurze Einführung in verschachtelte Fall-/Kontroll-Designs finden Sie in:\n\t\t\tEssebag V, et al. Die verschachtelte Fall-Kontroll-Studie in der Kardiologie. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>Datensatzname zum Speichern der übereinstimmenden Daten:</b>\n\t\t\t<br/>Name des Ausgabedatensatzes, der die übereinstimmenden Subjektsets enthält.\n\t\t\t<br/><br/>\n\t\t\t<b>Ereignisvariable (1=Ereignis, 0=Zensur):</b>\n\t\t\t<br/>Name der Variablen, die diejenigen mit Ereignissen anzeigt. Muss numerisch sein mit 1=Ereignis und 0=Zensur.\n\t\t\t</br><br/>\n\t\t\t<b>Variablen für das Matching:</b>\n\t\t\t<br/>Geben Sie die Basisvariablen an, für die Sie die Fall-/Kontroll-Sets abgleichen möchten. Diese müssen numerisch sein.\n\t\t\t<br/><br/>\n\t\t\t<b>Geben Sie die Kaliber in der Reihenfolge der Matching-Variablen an:</b>\n\t\t\t<br/>Geben Sie die numerischen Kaliberwerte für jede der Variablen in der Reihenfolge der Variablen an. Exakte Übereinstimmungen sollten ein Kaliber von 0 verwenden. \n\t\t\tWenn beispielsweise das Alter (in Jahren) mit einem Kaliber von 5 angegeben wurde, bedeutet dies, dass die Kontrollen innerhalb von +/- 5 Jahren ihres übereinstimmenden Falls liegen müssen.\n\t\t\tJede Matching-Variable muss einen Kaliberwert angegeben haben.\n\t\t\t<br/><br/>\n\t\t\t<b>Anzahl der Kontrollen pro Fall:</b>\n\t\t\t<br/>Dies ist die maximale Anzahl von Kontrollen, die mit jedem Fall abgeglichen werden. Einige übereinstimmende Sets können weniger als diesen Wert haben, wenn geeignete Übereinstimmungen nicht identifiziert werden können.\n            <br/><br/>\n\t\t\t<b>Erlauben Sie, dass Kontrollen mehr als einmal zugeordnet werden:</b>\n\t\t\t<br/>Geben Sie an, ob Sie möchten, dass Kontrollen möglicherweise mit mehr als einem Fall abgeglichen werden. Wir empfehlen, diese Option auszuwählen, um Verzerrungen zu vermeiden.\n            <br/><br/>\n\t\t\t<b>Keine Fälle zulassen, die mit anderen Fällen übereinstimmen:</b>\n\t\t\t<br/>Geben Sie an, ob Fälle vor dem Ereigniszeitpunkt des Falls als Kontrollen betrachtet werden sollen. Wir empfehlen, diese Option nicht auszuwählen, um Verzerrungen zu vermeiden. Das Nicht-Auswählen dieser Option bedeutet, dass ein Fall im Pool der Kontrollrisikogruppen ist und bis zu seinem Ereigniszeitpunkt für eine Übereinstimmung mit einem anderen Fall in Frage kommt.\n            <br/><br/>\n            <b>Erforderliche R-Pakete:</b> dplyr, tidyr\n"
  }
}