{
  "title": "R Paket Hilfe",
  "navigation": "R Paket Hilfe",
  "packageName": "Wählen Sie ein installiertes R-Paket aus",
  "help": {
    "title": "R Paket Hilfe",
    "r_help": "hilfe()",
    "body": "\n<b>Beschreibung</b></br>\nhilfe ist die primäre Schnittstelle zu den Hilfesystemen.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nhilfe(Thema, Paket = NULL, lib.loc = NULL,\n    verbose = getOption(\"verbose\"),\n    try.all.packages = getOption(\"help.try.all.packages\"),\n    help_type = getOption(\"help_type\"))\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nThema: normalerweise ein Name oder ein Zeichenfolgen, das das Thema angibt, für das Hilfe gesucht wird. Eine Zeichenfolge (in expliziten einfachen oder doppelten Anführungszeichen eingeschlossen) wird immer als Benennung eines Themas angesehen. Wenn der Wert von Thema ein ein-elementiger Zeichenvektor ist, wird das Thema als der Wert des einzigen Elements angesehen. Andernfalls muss das Thema ein Name oder ein reserviertes Wort (wenn syntaktisch gültig) oder eine Zeichenfolge sein. \n</li>\n<li>\nPaket: ein Name oder ein Zeichenvektor, der die Pakete angibt, in denen nach Dokumentation gesucht werden soll, oder NULL. Standardmäßig werden alle Pakete verwendet, deren Namensräume geladen sind. Um zu vermeiden, dass ein Name deparsiert wird, verwenden Sie z.B. (pkg_ref).\n</li>\n<li>\nlib.loc: ein Zeichenvektor von Verzeichnisnamen von R-Bibliotheken oder NULL. Der Standardwert NULL entspricht allen derzeit bekannten Bibliotheken. Wenn der Standardwert verwendet wird, werden die geladenen Pakete und Namensräume vor den Bibliotheken durchsucht.\n</li>\n<li>\nverbose: logisch; wenn TRUE, wird der Dateiname gemeldet.\n</li>\n<li>\ntry.all.packages: logisch; siehe Hinweis.\n</li>\n<li>\nhelp_type: Zeichenfolge: die Art der benötigten Hilfe. Mögliche Werte sind \"text\", \"html\" und \"pdf\". Die Groß- und Kleinschreibung wird ignoriert, und partielle Übereinstimmungen sind erlaubt.\n</li>\n</ul>\n<b>Details</b></br>\nDie Hilfe zum Paket</br>\n<b>Beispiele</b><br/>\n<code> \nhilfe(paket = \"splines\")\n</code> <br/>\n<b>Paket</b></br>\nutils</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogfelds oder führen Sie den folgenden Befehl im R-Syntax-Editor aus: hilfe()\n                "
  }
}