{
  "title": "Stichprobengröße, Test zweier Mittelwerte",
  "navigation": "Zwei Mittelwerte",
  "howtouse": "Um die Stichprobengröße zu berechnen: Geben Sie beide Gruppenmittelwerte und die Power an\nUm die Power zu berechnen: Geben Sie beide Gruppenmittelwerte und die Stichprobengröße an\nUm den nachweisbaren Mittelwertunterschied zu berechnen: Geben Sie die Stichprobengröße und die Power an",
  "n": "Stichprobengröße",
  "power": "Power (0-1)",
  "meangrp1": "Mittelwert der Behandlungsgruppe",
  "meangrp2": "Mittelwert der Kontrollgruppe",
  "ratio": "Verhältnis der Stichprobengröße Behandlung vs Kontrolle",
  "sd": "Standardabweichung",
  "siglevel": "Signifikanzniveau (0-1)",
  "alternativeopt": "Alternativhypothese",
  "twosided": "Zweiseitig",
  "onesided": "Einsseitig",
  "help": {
    "title": "Stichprobengröße, Test zweier Mittelwerte",
    "r_help": "help(epi.sscompc, package ='epiR')",
    "body": "\nDies ist eine Bewertung der Stichprobengröße für einen zweiseitigen t-Test der Mittelwerte. Es berechnet die Stichprobengröße, Power oder Mittelwertdifferenz (Delta), wenn der Benutzer die anderen beiden angibt.\n<br/><br/>\n<b>Stichprobengröße:</b> Geben Sie die Anzahl der Probanden in der Studie an\n<br/><br/>\n<b>Power:</b> Geben Sie die gewünschte Power der Studie an, d.h. die Wahrscheinlichkeit, dass der Test die Nullhypothese ablehnt, wenn die Alternativhypothese wahr ist.\n<br/><br/>\n<b>Mittelwert der Behandlungsgruppe:</b> Geben Sie den Mittelwert für die Behandlungsgruppe an\n<br/><br/>\n<b>Mittelwert der Kontrollgruppe:</b> Geben Sie den Mittelwert für die Kontrollgruppe an\n<br/><br/>\n<b>Verhältnis der Stichprobengröße Behandlung vs Kontrolle:</b> Geben Sie das gewünschte Verhältnis der Stichprobengrößen an (Behandlungs-N geteilt durch Kontroll-N). Ein Verhältnis von 1 bedeutet gleiche Stichprobengrößen.\n<br/><br/>\n<b>Standardabweichung:</b> Schätzung der gepoolten Standardabweichung der Gruppen\n<br/><br/>\n<b>Signifikanzniveau:</b> Geben Sie das gewünschte Signifikanzniveau (d.h. Typ-I-Fehler) des Tests an\n<br/><br/>\n<b>Alternativhypothese:</b> Geben Sie an, ob der Test zweiseitig oder einsseitig ist\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> epiR\n\t\t\t"
  }
}