{
  "title": "Stichprobengröße, Test zweier gepaarter Proportionen",
  "navigation": "Zwei gepaarte Proportionen",
  "howtouse": "Um die Stichprobengröße (Anzahl der Paare) zu berechnen: geben Sie die Power an\nUm die Power zu berechnen: geben Sie die Stichprobengröße (Anzahl der Paare) an",
  "n": "Stichprobengröße (Anzahl der Paare)",
  "power": "Power (0-1)",
  "pdisc": "Proportion der discordanten Paare (PD) (0-1)",
  "pdiff": "Differenz der Proportionen, muss zwischen -PD und PD liegen",
  "siglevel": "Signifikanzniveau (0-1)",
  "alternativeopt": "Alternativhypothese",
  "twosided": "Zweiseitig",
  "onesided": "Einsseitig",
  "help": {
    "title": "Stichprobengröße, Test zweier gepaarter Proportionen",
    "r_help": "help(qnorm, package ='stats')",
    "body": "\nDies ist eine Bewertung der Stichprobengröße für einen gepaarten Test von Proportionen unter Verwendung des McNemar-Tests. Es berechnet die Stichprobengröße (Anzahl der Paare) oder die Power, wenn der Benutzer die andere angibt. Die Berechnungen verwenden eine normale Approximation, die von der Proportion der discordanten Paare abhängt. Siehe Connor R. J. 1987. Stichprobengröße für den Test von Unterschieden in Proportionen für das gepaarte Design. Biometrics 43(1):207-211.\n<br/><br/>\n<b>Stichprobengröße (Anzahl der Paare):</b> Geben Sie die Stichprobengröße in der Studie an. Dies ist die Anzahl der Probanden, die binäre Ergebniswerte zu beiden Zeitpunkten in einem Vor- und Nachdesign oder die Anzahl der Paare in einem gepaarten Design (z. B. gepaarte Fall-Kontroll-Studie) bereitstellen.\n<br/><br/>\n<b>Power:</b> Geben Sie die gewünschte Power der Studie an, d. h. die Wahrscheinlichkeit, dass der Test die Nullhypothese ablehnt, wenn die Alternativhypothese wahr ist.\n<br/><br/>\n<b>Proportion der discordanten Paare:</b> Geben Sie die erwartete Proportion der Paare an, die nicht übereinstimmen, z. B. 'ja'/'nein' oder 'nein'/'ja' Antworten, aus der Gesamtzahl der Paare.\n<br/><br/>\n<b>Differenz der Proportionen:</b> Geben Sie die gewünschte Differenz in den Ergebnisproportionen (d. h. Proportion, die 'ja' ist) an, die erkannt werden soll. Zum Beispiel ist dies in einer gepaarten Fall-Kontroll-Studie die Differenz zwischen der Proportion der Fälle, die 'ja' sind, und der Proportion der Kontrollen, die 'ja' sind.\n<br/><br/>\n<b>Signifikanzniveau:</b> Geben Sie das gewünschte Signifikanzniveau (d. h. Fehler 1. Art) des Tests an.\n<br/><br/>\n<b>Alternativhypothese:</b> Geben Sie an, ob der Test zweiseitig oder einsseitig ist.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> stats\n\t\t\t"
  }
}