{
  "title": "Stichprobengröße, Test für einen Mittelwert oder gepaarte Mittelwerte",
  "navigation": "Ein Mittelwert oder gepaarte Mittelwerte",
  "howtouse": "Geben Sie zwei der Stichprobengröße, den Unterschied zwischen den Mittelwerten und die Power an, und der dritte wird berechnet",
  "n": "Stichprobengröße",
  "delta": "Unterschied zwischen den Mittelwerten",
  "power": "Power (0-1)",
  "sd": "Standardabweichung",
  "siglevel": "Signifikanzniveau (0-1)",
  "alternativeopt": "Alternativhypothese",
  "twosided": "Zweiseitig",
  "onesided": "Einseitig",
  "help": {
    "title": "Stichprobengröße, Test für einen Mittelwert",
    "r_help": "help(power.t.test, package ='stats')",
    "body": "\nDies ist eine Bewertung der Stichprobengröße für einen t-Test mit einer Stichprobe eines Mittelwerts oder einen Test gepaarter Mittelwerte. Es berechnet die Stichprobengröße, den Unterschied zwischen den Mittelwerten oder die Power, wenn der Benutzer zwei davon angibt.\n<br/><br/>\n<b>Stichprobengröße:</b> Geben Sie die Anzahl der Probanden in der Studie an\n<br/><br/>\n<b>Unterschied zwischen den Mittelwerten:</b> Wenn es sich um einen t-Test mit einer Stichprobe handelt, geben Sie den Unterschied zwischen dem Mittelwert unter der alternativen Hypothese und dem Mittelwert unter der Nullhypothese an. Wenn es sich um einen gepaarten t-Test handelt, geben Sie den Unterschied zwischen den gepaarten Mittelwerten unter der alternativen Hypothese an.\n<br/><br/>\n<b>Power:</b> Geben Sie die gewünschte Power der Studie an, d.h. die Wahrscheinlichkeit, dass der Test die Nullhypothese ablehnt, wenn die alternative Hypothese wahr ist.\n<br/><br/>\n<b>Standardabweichung:</b> Geben Sie eine Schätzung der Standardabweichung des Ergebnismaßes an. Für gepaarte Tests ist dies die Standardabweichung der gepaarten Unterschiede.\n<br/><br/>\n<b>Signifikanzniveau:</b> Geben Sie das gewünschte Signifikanzniveau (d.h. Typ-I-Fehler) des Tests an\n<br/><br/>\n<b>Alternativhypothese:</b> Geben Sie an, ob der Test zweiseitig oder einseitig ist\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> stats, broom\n\t\t\t"
  }
}