{
  "title": "Vorhergesagte Überlebenswahrscheinlichkeiten",
  "label100": "Dieser Dialog gibt die vorhergesagte Überlebenswahrscheinlichkeit zu einem oder mehreren \nspezifizierten Nachbeobachtungszeiten aus. \nDie folgenden Anforderungen müssen erfüllt sein.\n1. Sie müssen ein Cox-Regression-Modell auf einem Datensatz erstellt haben, bei dem 1=Ereignis, 0=Zensur. \n2. Der Datensatz, für den Sie Vorhersagen generieren möchten, muss alle unabhängigen Variablen enthalten, die zur Erstellung \ndes ursprünglichen Modells verwendet wurden. \n3. Der Zeitrahmen, der für die Nachbeobachtungszeit verwendet wird, muss mit dem Zeitrahmen übereinstimmen, der zur Erstellung des ursprünglichen Modells verwendet wurde. \n4. Wenn Sie Vorhersagen für eine einzelne Beobachtung wünschen, müssen Sie einen neuen Datensatz mit dieser Beobachtung erstellen.",
  "navigation": "Cox-Bewertung",
  "filterModels": "Modelle nach Klasse filtern",
  "modelSelection": "Wählen Sie ein Modell aus, um einen Datensatz zu bewerten",
  "label1": "Diagnosetests",
  "followUpTime": "Geben Sie eine oder mehrere Nachbeobachtungszeiten an, z.B. 1200, 1250, vorhergesagte Überlebenswahrscheinlichkeiten werden für jede Nachbeobachtungszeit generiert",
  "levelOfInterest": "Wenn die zu prognostizierende Variable 2 Ebenen hat, geben Sie die Ebene von Interesse an. Die Verwirrungsmatrix und verwandte Statistiken werden mit der angegebenen Ebene von Interesse als Referenz angezeigt",
  "label12": "Testergebnisse: Sobald ein Modell ausgewählt wurde, führen wir Tests durch, um zu sehen, ob die im Modell angegebenen abhängigen Variablen im Datensatz, der bewertet werden soll, \nverfügbar sind. Die Ergebnisse werden hier angezeigt",
  "label2": "Überlebenswahrscheinlichkeiten speichern.",
  "label3": "Vorhergesagte Wahrscheinlichkeiten werden als neue Variablen mit dem unten angegebenen Präfix vor dem ursprünglichen Ereignisvariablennamen gespeichert",
  "label4": "**Für abhängige Variablen mit 2 Ebenen wird die 2. Ebene als positive Ebene behandelt. Siehe Daten > Faktorstufen > Stufen manuell neu anordnen, um die Reihenfolge der Faktorstufen zu ändern und das Modell neu zu erstellen.",
  "conflevel": "Speichern Sie Konfidenzintervalle für einzelne vorhergesagte Werte **(Gültig nur für lineare Modelle (Klasse lm))",
  "roctable": "ROC-Tabelle anzeigen (**Nur für binäre abhängige Variablen)",
  "colname": "Geben Sie das Präfix für den Spaltennamen an",
  "label5": "**Das Aktivieren des obigen Kontrollkästchens führt zu einem Leistungsabfall bei großen Datensätzen.",
  "level": "Geben Sie das Konfidenzniveau an",
  "confusioncheck": "Verwirrungsmatrix generieren",
  "help": {
    "title": "Bewerten Sie einen Datensatz mit einem Modell",
    "r_help": "help(predict, package='stats')",
    "body": "\n    WENN MEHRERE ZEITRAHMEN ANGEGEBEN WERDEN, WIRD FÜR DEN ERSTEN ZEITRAHMEN NUR EINE VERWIRRUNGSMATRIX UND ROC-KURVE GENERIERT\n    <b>Beschreibung</b></br>\n    Die Modellbewertung macht Folgendes</br>\n    1. Bewertet den aktuellen Datensatz mit dem ausgewählten vorgefertigten Modell. Speichert Vorhersagen mit dem angegebenen Konfidenzintervall im aktuellen Datensatz unter Verwendung des angegebenen Präfixes.</br>\n    2. Optional wird eine Verwirrungsmatrix und eine ROC-Kurve erstellt</br>\n    3. Im Fall, dass Sie einen Trainingsdatensatz bewerten, der die abhängige Variable/Variable, die vorhergesagt werden soll, enthält und die abhängige Variable 2 Ebenen hat, haben Sie die Möglichkeit, die Referenzebene/Ebene von Interesse auszuwählen.<br/>\n    4. Die Verwirrungsmatrix und verwandte Statistiken werden unter Verwendung der angegebenen Ebene von Interesse erstellt.<br/>\n    Siehe Einzelheiten zur Vorhersagefunktion und zur Verwirrungsmatrix unten\n    <br/>\n    <br/>\n    <b>Beschreibung</b></br>\n    predict ist eine generische Funktion zur Erstellung von Vorhersagen mit dem ausgewählten Modell. \n    <br/>\n    <b>Verwendung</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argumente</b><br/>\n    <ul>\n    <li>\n    modelname: ein Modellobjekt, für das eine Vorhersage gewünscht wird.\n    </li>\n    <li>\n    prefix: Präfixzeichenfolge, die verwendet wird, um neue Variablen zu erstellen, die die Vorhersagen enthalten.\n    </li>\n    <li>\n    datasetname: ist der aktuelle Datensatz, der bewertet werden soll und in dem die Vorhersagen gespeichert werden.\n    </li>\n    </ul>\n    <b>Einzelheiten</b></br>\n    Speichert Vorhersagen mit dem angegebenen Konfidenzintervall im aktuellen Datensatz unter Verwendung des angegebenen Präfixes.</br>\n    <b>Paket</b></br>\n    stats</br>\n    <b>Hilfe</b></br>\n    Für detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl help(predict, package ='stats') im R-Editorfenster aus\n    </br>\n    </br>\n    <b>Beschreibung</b></br>\n    Erstellt eine Verwirrungsmatrix durch Kreuztabellierung der beobachteten und vorhergesagten Klassen mit zugehörigen Statistiken. \n    <br/>\n    <b>Verwendung</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argumente</b><br/>\n    <ul>\n    <li>\n    modelname : ein Modellobjekt, für das eine Verwirrungsmatrix gewünscht wird.\n    </li>\n    <li>\n    showCofusionMatrix:  logisch, wenn TRUE, wird die Verwirrungsmatrix generiert (wenn zutreffend), wenn FALSE, wird die Verwirrungsmatrix nicht generiert.\n    </li>\n    <li>\n    predictions : ein Objekt, das als Ergebnis des predict()-Aufrufs zurückgegeben wird.\n    </li>\n    <li>\n    datasetname: ist der aktuelle Datensatzname, mit dem wir Vorhersagen machen möchten.\n    </li>\n    </ul>\n    <b>Einzelheiten</b></br>\n    Zeigt die Verwirrungsmatrix unter Verwendung der Funktion confusionMatrix im Paket caret an</br>\n    <b>Paket</b></br>\n    caret</br>\n    <b>Hilfe</b></br>\n    Für detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl help(confusionMatrix, package ='caret') im R-Editorfenster aus\n                "
  }
}