{
  "title": "Shewhart-Diagramme (I-MR Zwischen/Intra)",
  "navigation": "Shewhart-Diagramme (I-MR Zwischen/Intra)",
  "label2": "Zwei Optionen - entweder eine Variable zum Diagramm auswählen (und eine Gruppierungsvariable nach Bedarf) oder die Variablen im Datensatz auswählen, wenn sie bereits gruppiert sind",
  "selectVariableRad": "Option 1: Wählen Sie eine Variable aus dem Datensatz aus, die gruppiert werden muss",
  "variableSelcted": "Variable (beobachtete Daten) zum Diagramm",
  "groupingVariable": "Gruppierungsvariable",
  "sampleSize": "Die Stichprobengröße wird ignoriert, wenn oben eine Gruppierungsvariable ausgewählt ist",
  "variableControlLimits": "Zeilen, die verworfen werden sollen, wenn sie vor der Gruppierung für die Variablenkontrollgrenzen (d.h. Variablenstichprobengrößen) vorhanden sind, z.B. angeben als 1:25 oder 1,4,5,7:12",
  "displayGroupsChk": "Die Gruppierungen im Datensatz UI-Raster anzeigen",
  "selectDatasetRad": "Option 2: Wählen Sie die Variablen aus dem Datensatz aus, wenn sie bereits gruppiert sind",
  "variablelistSelcted": "Wählen Sie eine oder mehrere gruppierte Variablen (beobachtete Daten) zum Diagramm aus",
  "showMRChartChk": "Das MR-Diagramm der Untergruppenmittelwerte anzeigen",
  "printStatChk": "Statistiken zusätzlich zu Diagrammen drucken",
  "printObjectSummaryChk": "QCC-Objektsummary drucken",
  "printTestSummaryChk": "Zusammenfassung der Tests auf spezielle Ursachen drucken",
  "printTestDetailChk": "Details der Tests auf spezielle Ursachen drucken",
  "markTestNumberChk": "Testnummer im Diagramm markieren (nur die erste Testnummer wird markiert, wenn mehr als ein Test durch einen Datenpunkt verletzt wird)",
  "rowsTobeUsed": "Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedAsNewData": "Neue Daten - gruppierte Zeilen, die als neue Daten zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12) - neue Daten zum Plotten, aber nicht in die Berechnungen einbezogen",
  "additionalPhasesLabel": "Daten für zusätzliche Phasen zum Diagramm angeben. Sie können das Feld 'Gruppierte Zeilen' oben als Phase 1-Daten verwenden. Maximal 10 Phasen, um praktisch auf einem einzigen Diagramm darzustellen.",
  "rowsTobeUsedPhase2": "Gruppierte Zeilen der Phase 2, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase3": "Gruppierte Zeilen der Phase 3, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase4": "Gruppierte Zeilen der Phase 4, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase5": "Gruppierte Zeilen der Phase 5, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase6": "Gruppierte Zeilen der Phase 6, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase7": "Gruppierte Zeilen der Phase 7, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase8": "Gruppierte Zeilen der Phase 8, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase9": "Gruppierte Zeilen der Phase 9, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase10": "Gruppierte Zeilen der Phase 10, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "phaseNames": "Phasennamen (kommagetrennt) für ein Mehrphasen-Diagramm angeben - Standardphasennamen sind Phase 1, Phase 2, ...",
  "nsigmas": "Sigma - Anzahl der Sigmas, die zur Berechnung der Kontrollgrenzen verwendet werden sollen. Es wird ignoriert, wenn das Argument confidence.level bereitgestellt wird",
  "confidence_level": "Konfidenzniveau - Wert zwischen 0 und 1, der das Konfidenzniveau der berechneten Wahrscheinlichkeitsgrenzen angibt",
  "sdWarnLimits": "Zusätzliche Grenzlinien (kommagetrennt) im Diagramm an den spezifischen Standardabweichungen hinzufügen (z.B. 1.5, 2)",
  "digits": "Ziffern - Anzahl der anzuzeigenden Ziffern",
  "SStddev": "Standardabweichungsmethode, die für das zugrunde liegende 'Within' S-Diagramm verwendet werden soll",
  "lower": "LSL - numerischer Wert der unteren Spezifikationsgrenze, um eine LSL-Linie zu zeichnen",
  "upper": "USL - numerischer Wert der oberen Spezifikationsgrenze, um eine USL-Linie zu zeichnen",
  "addlSpecLinesBetween": "Zusätzliche Spezifikationslinien (kommagetrennt) im I-MR Zwischen-Diagramm hinzufügen (z.B. 73.98, 74.01, 74.03)",
  "addlSpecLinesLabelBetween": "Bezeichnung für die zusätzlichen Spezifikationslinien (Standard ist Spec)",
  "addlSpecLinesMR": "Zusätzliche Spezifikationslinien (kommagetrennt) im MR-Diagramm hinzufügen (z.B. 0.02, 0.04, 0.06)",
  "addlSpecLinesLabelMR": "Bezeichnung für die zusätzlichen Spezifikationslinien (Standard ist Spec)",
  "addlSpecLinesWithin": "Zusätzliche Spezifikationslinien (kommagetrennt) im I-MR Intra-Diagramm hinzufügen (z.B. 0.02, 0.04, 0.06)",
  "addlSpecLinesLabelWithin": "Bezeichnung für die zusätzlichen Spezifikationslinien (Standard ist Spec)",
  "performTestLabel": "Ausgewählte Tests auf spezielle Ursachen durchführen",
  "test1Chk": "Test 1 durchführen",
  "test2Chk": "Test 2 durchführen",
  "test3Chk": "Test 3 durchführen",
  "test4Chk": "Test 4 durchführen",
  "test5Chk": "Test 5 durchführen",
  "test6Chk": "Test 6 durchführen",
  "test7Chk": "Test 7 durchführen",
  "test8Chk": "Test 8 durchführen",
  "test1": "Ein Punkt mehr als Kσ von der Mittellinie (Standard 3)",
  "test2": "K Punkte in Folge auf der gleichen Seite der Mittellinie (Standard 9)",
  "test3": "K Punkte in Folge, alle steigend oder alle fallend (Standard 6)",
  "test4": "K Punkte in Folge, abwechselnd auf und ab (Standard 14)",
  "test5": "K von K+1 Punkten mehr als 2σ von der Mittellinie auf derselben Seite (Standard 2 von 2+1)",
  "test6": "K von K+1 Punkten mehr als 1σ von der Mittellinie auf derselben Seite (Standard 4 von 4+1)",
  "test7": "K Punkte in Folge innerhalb von 1σ von der Mittellinie auf beiden Seiten (Standard 15)",
  "test8": "K Punkte in Folge mehr als 1σ von der Mittellinie auf beiden Seiten (Standard 8)",
  "sigmaSymbol": "Wenn das Sigma-Symbol 'σ' im Output nicht korrekt gedruckt wird, geben Sie ein Zeichen oder eine Zeichenfolge an, z.B. s oder sigma anstelle des σ-Symbols",
  "chart_title": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "supressSampleSizeInfoChk": "Stichprobengrößeninformationen im Diagrammtitel unterdrücken",
  "plotPhases": "Phasen plotten",
  "plotTests": "Tests auf spezielle Ursachen",
  "addRefLines": "Referenzlinien hinzufügen",
  "help": {
    "title": "Shewhart-Diagramme (I-MR Zwischen/Intra-Diagramme)",
    "r_help": "help(qcc, package = qcc)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tqcc-Funktion zur Durchführung statistischer Qualitätskontrolle und zum Zeichnen von Shewhart-Diagrammen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür die detaillierte Hilfe - verwenden Sie R help(qcc, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm dies auszuprobieren, können Sie den Datensatz namens pistonrings aus dem qcc-Paket mit dem Menü Datensatz laden, indem Sie das qcc-Paket auswählen und dann den Datensatz pistonrings auswählen\n\t\t\t\t<br/>\n\t\t\t\tWählen Sie Option 1, Durchmesser zur Variable (beobachtet..), Stichprobe zur Gruppierungsvariable, klicken Sie auf Ausführen\n\t\t\t\t<br/>\n\t\t\t\tZusätzlich geben Sie 1:20 in die zu verwendenden gruppierten Zeilen ein, klicken Sie auf Ausführen\n\t\t\t\t<br/>\n\t\t\t\tUm ein Diagramm mit mehreren Phasen zu zeichnen\n\t\t\t\t<br/>\n\t\t\t\tGeben Sie 25:30 in die gruppierten Zeilen der Phase 2 ein\n\t\t\t\t<br/>\n\t\t\t\tGeben Sie 31:38 in die gruppierten Zeilen der Phase 3 ein\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tBefolgen Sie das qcc-Tutorial unter https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
  }
}