{
  "title": "Shewhart-Diagramme (p, np, c, u)",
  "navigation": "Shewhart-Diagramme (P, NP, C, U)",
  "chartTypePChk": "p-Diagramm",
  "chartTypeNPChk": "np-Diagramm",
  "chartTypeCChk": "c-Diagramm",
  "chartTypeUChk": "u-Diagramm",
  "variableSelcted2": "Variable (beobachtete Daten) zum Diagramm",
  "sizes": "Erforderlich für p-, np- und u-Diagramme, aber optional für c-Diagramme - Variable mit Werten, die die Stichprobengrößen für jede Gruppe angeben",
  "printStatChk": "Statistiken zusätzlich zu Diagrammen drucken",
  "printObjectSummaryChk": "QCC-Objektzusammenfassung drucken",
  "printTestSummaryChk": "Zusammenfassung der Tests auf spezielle Ursachen drucken",
  "printTestDetailChk": "Details der Tests auf spezielle Ursachen drucken",
  "markTestNumberChk": "Testnummer im Diagramm markieren (nur die erste Testnummer wird markiert, wenn mehr als ein Test durch einen Datenpunkt verletzt wurde)",
  "ocCurvesChk": "Betriebskennlinien zeichnen, wo anwendbar (müssen gleiche Stichprobengrößen haben)",
  "rowsTobeUsed": "Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedAsNewData": "Neue Daten - gruppierte Zeilen, die als neue Daten zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben) - neue Daten zum Zeichnen, aber nicht in die Berechnungen einbezogen",
  "additionalPhasesLabel": "Daten für zusätzliche Phasen zum Diagramm angeben (auf maximal 10 Phasen beschränkt, um praktisch auf einem einzigen Diagramm darzustellen)",
  "rowsTobeUsedPhase2": "Phase 2 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedPhase3": "Phase 3 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedPhase4": "Phase 4 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedPhase5": "Phase 5 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedPhase6": "Phase 6 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedPhase7": "Phase 7 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedPhase8": "Phase 8 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedPhase9": "Phase 9 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedPhase10": "Phase 10 Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. als 1:25 oder 1,4,5,7:12 angeben)",
  "phaseNames": "Phasennamen angeben (durch Kommas getrennt) für ein Mehrphasen-Diagramm - Standardphasennamen sind Phase 1, Phase 2, ...",
  "nsigmas": "Sigma - Anzahl der Sigmas, die zur Berechnung der Kontrollgrenzen verwendet werden sollen. Es wird ignoriert, wenn das Argument confidence.level angegeben ist",
  "confidence_level": "Konfidenzniveau - Wert zwischen 0 und 1, der das Konfidenzniveau der berechneten Wahrscheinlichkeitsgrenzen angibt",
  "sdWarnLimits": "Zusätzliche Grenzlinien (durch Kommas getrennt) auf dem Diagramm bei den spezifischen Standardabweichungen hinzufügen (z. B. 1.5, 2)",
  "addlSpecLines": "Zusätzliche Spezifikationslinien (durch Kommas getrennt) auf dem Diagramm hinzufügen (z. B. 73.98, 74.01, 74.03)",
  "addlSpecLinesLabel": "Bezeichnung für die zusätzlichen Spezifikationslinien (Standard ist Spec)",
  "digits": "Ziffern - Anzahl der anzuzeigenden Ziffern",
  "lower": "LSL - numerischer Wert der unteren Spezifikationsgrenze, um eine LSL-Linie zu zeichnen",
  "upper": "USL - numerischer Wert der oberen Spezifikationsgrenze, um eine USL-Linie zu zeichnen",
  "performTestLabel": "Ausgewählte Tests auf spezielle Ursachen durchführen",
  "test1Chk": "Test 1 durchführen",
  "test2Chk": "Test 2 durchführen",
  "test3Chk": "Test 3 durchführen",
  "test4Chk": "Test 4 durchführen",
  "test5Chk": "Test 5 durchführen",
  "test6Chk": "Test 6 durchführen",
  "test7Chk": "Test 7 durchführen",
  "test8Chk": "Test 8 durchführen",
  "test1": "Ein Punkt mehr als Kσ von der Mittellinie (Standard 3)",
  "test2": "K Punkte in einer Reihe auf der gleichen Seite der Mittellinie (Standard 9)",
  "test3": "K Punkte in einer Reihe, alle steigend oder alle fallend (Standard 6)",
  "test4": "K Punkte in einer Reihe, abwechselnd auf und ab (Standard 14)",
  "test5": "K von K+1 Punkten mehr als 2σ von der Mittellinie auf der gleichen Seite (Standard 2 von 2+1)",
  "test6": "K von K+1 Punkten mehr als 1σ von der Mittellinie auf der gleichen Seite (Standard 4 von 4+1)",
  "test7": "K Punkte in einer Reihe innerhalb von 1σ der Mittellinie auf beiden Seiten (Standard 15)",
  "test8": "K Punkte in einer Reihe mehr als 1σ von der Mittellinie auf beiden Seiten (Standard 8)",
  "sigmaSymbol": "Wenn das Sigma-Symbol 'σ' nicht korrekt in der Ausgabe gedruckt wird, geben Sie ein Zeichen oder eine Zeichenfolge an, z. B. s oder sigma anstelle des σ-Symbols",
  "help": {
    "title": "Shewhart-Diagramme (p, np, c, u)",
    "r_help": "hilfe(qcc, paket = qcc)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tqcc-Funktion zur Durchführung statistischer Qualitätskontrolle und zum Zeichnen von Shewhart-Diagrammen, Zeichnen von OC-Kurven\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür die detaillierte Hilfe - verwenden Sie R hilfe(qcc, paket = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm dies auszuprobieren, können Sie den Datensatz orangejuice aus dem qcc-Paket mit dem Menü Datensatz laden, indem Sie das qcc-Paket auswählen und dann den Datensatz pistonrings auswählen\n\t\t\t\t<br/>\n\t\t\t\tWählen Sie D für die Variable (beobachtet..), Größe für das Stichprobengrößenfeld,\n\t\t\t\t<br/>\n\t\t\t\tGeben Sie 1:25 in die zu verwendenden Datenzeilen ein, 30:40 in Neue Daten\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tBefolgen Sie das qcc-Tutorial unter https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
  }
}