{
  "title": "Shewhart-Diagramme (I-MR zwischen/in)",
  "navigation": "Shewhart-Diagramme (I-MR zwischen/in), Grundlegend",
  "label2": "Zwei Optionen - entweder eine Variable zum Diagramm auswählen (und eine Gruppierungsvariable nach Bedarf) oder die Variablen im Datensatz auswählen, wenn sie bereits gruppiert sind",
  "selectVariableRad": "Option 1: Wählen Sie eine Variable aus dem Datensatz aus, die gruppiert werden muss",
  "variableSelcted": "Variable (beobachtete Daten) zum Diagramm",
  "groupingVariable": "Gruppierungsvariable",
  "variableControlLimits": "Zeilen, die verworfen werden sollen, falls vorhanden, bevor die Gruppierung für die Variablenkontrollgrenzen erfolgt (d.h. Variablenstichprobengrößen) z.B. angeben als 1:25 oder 1,4,5,7:12",
  "displayGroupsChk": "Die Gruppierungen im Datensatz-UI-Gitter anzeigen",
  "selectDatasetRad": "Option 2: Wählen Sie die Variablen aus dem Datensatz aus, wenn sie bereits gruppiert sind",
  "variablelistSelcted": "Wählen Sie eine oder mehrere gruppierte Variablen (beobachtete Daten) zum Diagramm aus",
  "showMRChartChk": "Das MR-Diagramm der Untergruppenmittelwerte anzeigen",
  "printStatChk": "Statistiken zusätzlich zu Diagrammen drucken",
  "printObjectSummaryChk": "QCC-Objektsummary drucken",
  "printTestSummaryChk": "Zusammenfassung der Tests auf besondere Ursachen drucken",
  "printTestDetailChk": "Details der Tests auf besondere Ursachen drucken",
  "markTestNumberChk": "Testnummer im Diagramm markieren (nur die erste Testnummer wird markiert, wenn mehr als ein Test durch einen Datenpunkt verletzt wurde)",
  "rowsTobeUsed": "Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedAsNewData": "Neue Daten - gruppierte Zeilen, die als neue Daten zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12) - neue Daten zum Plotten, aber nicht in die Berechnungen einbezogen",
  "additionalPhasesLabel": "Daten angeben, um zusätzliche Phasen zu diagrammieren (auf maximal 10 Phasen beschränkt, um praktisch auf einem einzigen Diagramm darstellbar zu sein)",
  "rowsTobeUsedPhase2": "Phase 2 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase3": "Phase 3 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase4": "Phase 4 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase5": "Phase 5 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase6": "Phase 6 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase7": "Phase 7 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase8": "Phase 8 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase9": "Phase 9 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "rowsTobeUsedPhase10": "Phase 10 gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z.B. angeben als 1:25 oder 1,4,5,7:12)",
  "phaseNames": "Phasennamen angeben (durch Kommas getrennt) für ein Mehrphasen-Diagramm - Standardphasennamen sind Phase 1, Phase 2, ...",
  "nsigmas": "Sigma - Anzahl der Sigmas, die zur Berechnung der Kontrollgrenzen verwendet werden sollen. Es wird ignoriert, wenn das Argument confidence.level angegeben ist",
  "confidence_level": "Konfidenzniveau - Wert zwischen 0 und 1, der das Konfidenzniveau der berechneten Wahrscheinlichkeitsgrenzen angibt",
  "sdWarnLimits": "Zusätzliche Grenzlinien (durch Kommas getrennt) auf dem Diagramm bei den spezifischen Standardabweichungen hinzufügen (z.B. 1.5, 2)",
  "digits": "Ziffern - Anzahl der anzuzeigenden Ziffern",
  "SStddev": "Standardabweichungsmethode, die für das zugrunde liegende 'Within' S-Diagramm verwendet werden soll",
  "lower": "LSL - numerischer Wert der unteren Spezifikationsgrenze, um eine LSL-Linie zu zeichnen",
  "upper": "USL - numerischer Wert der oberen Spezifikationsgrenze, um eine USL-Linie zu zeichnen",
  "performTestLabel": "Ausgewählte Tests auf besondere Ursachen durchführen",
  "test1Chk": "Test 1 durchführen",
  "test2Chk": "Test 2 durchführen",
  "test3Chk": "Test 3 durchführen",
  "test4Chk": "Test 4 durchführen",
  "test5Chk": "Test 5 durchführen",
  "test6Chk": "Test 6 durchführen",
  "test7Chk": "Test 7 durchführen",
  "test8Chk": "Test 8 durchführen",
  "test1": "Ein Punkt mehr als Kσ von der Mittellinie (Standard 3)",
  "test2": "K Punkte in Folge auf der gleichen Seite der Mittellinie (Standard 9)",
  "test3": "K Punkte in Folge, alle steigend oder fallend (Standard 6)",
  "test4": "K Punkte in Folge, abwechselnd auf und ab (Standard 14)",
  "test5": "K von K+1 Punkten mehr als 2σ von der Mittellinie auf der gleichen Seite (Standard 2 von 2+1)",
  "test6": "K von K+1 Punkten mehr als 1σ von der Mittellinie auf der gleichen Seite (Standard 4 von 4+1)",
  "test7": "K Punkte in Folge innerhalb von 1σ der Mittellinie auf beiden Seiten (Standard 15)",
  "test8": "K Punkte in Folge mehr als 1σ von der Mittellinie auf beiden Seiten (Standard 8)",
  "help": {
    "title": "Shewhart-Diagramme (I-MR zwischen/in Diagramme)",
    "r_help": "hilfe(qcc, paket = qcc)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tqcc-Funktion zur Durchführung statistischer Qualitätskontrolle und zum Zeichnen von Shewhart-Diagrammen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür die detaillierte Hilfe - verwenden Sie R Hilfe(qcc, paket = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm dies auszuprobieren, können Sie den Datensatz namens pistonrings aus dem qcc-Paket mit dem Menü Datensatz laden, indem Sie das qcc-Paket auswählen und dann den Datensatz pistonrings auswählen\n\t\t\t\t<br/>\n\t\t\t\tWählen Sie Option 1, Durchmesser zur Variable (beobachtet..), Probe zur Gruppierungsvariable, klicken Sie auf Ausführen\n\t\t\t\t<br/>\n\t\t\t\tZusätzlich geben Sie 1:20 in die gruppierten Zeilen ein, die verwendet werden sollen, klicken Sie auf Ausführen\n\t\t\t\t<br/>\n\t\t\t\tUm ein Diagramm mit mehreren Phasen zu zeichnen\n\t\t\t\t<br/>\n\t\t\t\tGeben Sie 25:30 in die gruppierten Zeilen der Phase 2 ein\n\t\t\t\t<br/>\n\t\t\t\tGeben Sie 31:38 in die gruppierten Zeilen der Phase 3 ein\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFolgen Sie dem qcc-Tutorial unter https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t"
  }
}