{
  "title": "Einfaches Rasch-Modell",
  "navigation": "Einfaches Rasch-Modell",
  "modelname": "Modellnamen eingeben",
  "destinationvars": "Zielvariable(n)",
  "estimationlbl": "Schätzung",
  "rad1": "CML-Schätzung verwenden",
  "chk1": "Standardfehler berechnen",
  "chk2": "Parameter auf Summe (0) normieren",
  "rad2": "MML-Schätzung verwenden",
  "help": {
    "title": "Einfaches Rasch-Modell",
    "r_help": "help(RM, package='eRm')",
    "body": "\n            <b>Beschreibung</b>\n            <br/>\n            Erstellt ein einfaches Rasch-Modell unter Verwendung der CML- oder MML-Schätzung.\n            <br/><br/>\n            Für die CML-Schätzung rufen wir eRm::RM auf, um die Parameter-Schätzungen eines Rasch-Modells für binäre Itemantworten unter Verwendung der CML-Schätzung zu berechnen.\n            <br/><br/>\n            Für die MML-Schätzung rufen wir TAM::tam.mml auf, um Parameter-Schätzungen eines eindimensionalen Modells zu generieren.\n            <br/><br/>\n            <b>Verwendung der CML-Schätzung</b>\n            <br/>\n            <code>\n            eRm::RM(X, se = TRUE, sum0 = TRUE, etaStart) \n            </code>\n            <br/><br/>\n            <b>Argumente</b>\n            <br/>          \n            <ul>\n            <li>\n            X:  Eingabematrix oder Datenrahmen mit 0/1-Daten; Zeilen repräsentieren Individuen, Spalten repräsentieren Items. Fehlende Werte werden als NA eingefügt.\n            </li>\n            <li>\n            W:  Entwurfsmatrix für das Rasch-Modell. Wenn weggelassen, berechnet die Funktion W automatisch.\n            </li>\n            <li>\n            se: Wenn TRUE, werden die Standardfehler berechnet.\n            </li>\n            <li>\n            sum0: Wenn TRUE, werden die Parameter auf Summe-0 normiert, indem ein entsprechendes W angegeben wird. Wenn FALSE, wird der erste Parameter auf 0 beschränkt.\n            </li>\n            <li>\n            etaStart: Ein Vektor von Startwerten für die eta-Parameter kann angegeben werden. Wenn nicht angegeben, wird der 0-Vektor verwendet.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>Verwendung der MML-Schätzung</b>\n            <br/>\n            <code>\n            tam.mml(resp,verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Argumente</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Datenrahmen mit polytomen Itemantworten k=0,...,K. Fehlende Antworten müssen als NA deklariert werden.\n            </li>\n            <li>\n            irtmodel: Für feste Itemneigungen (in tam.mml) umfassen die Optionen PCM (partielles Kreditmodell), PCM2 (partielles Kreditmodell mit ConQuest-Parametrisierung 'item+item*step') und RSM (Rating-Skalen-Modell; die ConQuest-Parametrisierung 'item+step'). \n            <br/>\n            Für geschätzte Itemneigungen (nur verfügbar in tam.mml.2pl) sind die Optionen 2PL (alle Neigungen der Itemkategorien werden geschätzt; Nominal Item Response Model), GPCM (generalisiertes partielles Kreditmodell, bei dem jedes Item einen und nur einen Neigungsparameter pro Dimension erhält) und 2PL.groups (Untergruppen von Items erhalten dieselben Schätzungen der Itemneigung) sowie eine Entwurfsmatrix E zu den Itemneigungen im generalisierten partiellen Kreditmodell (GPCM.design, siehe Beispiele). Beachten Sie, dass Itemneigungen mit facettierten Designs unter Verwendung der Funktion tam.mml.mfr nicht geschätzt werden können. Es ist jedoch einfach, vordefinierte Entwurfsmatrizen zu verwenden und einige Einschränkungen auf tam.mml.2pl anzuwenden.\n            </li>\n            <li>\n            verbose: Logisch, das angibt, ob die Ausgabe während der Iterationen gedruckt werden soll. \n            </li>\n            </ul>\n            <br/><br/>\n            <b>Pakete</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>            \n            <b>Hilfe</b>\n            <br/>\n            help(RM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
  }
}