{
  "title": "Variablen standardisieren",
  "navigation": "Standardisieren",
  "label1": "Standardisierte Werte werden in neuen Variablen mit dem angegebenen Präfix/Nachsuffix gespeichert.",
  "dest": "Wählen Sie die zu standardisierenden Variablen aus",
  "label2": "Wählen Sie ein Präfix oder Nachsuffix",
  "suffix": "Nachsuffix",
  "prefix": "Präfix",
  "txt1": "Geben Sie ein Präfix/Nachsuffix ein",
  "label3": "Zentrieren und/oder skalieren",
  "Center": "Zentrieren",
  "Scale": "Skalieren",
  "help": {
    "title": "Variablen standardisieren",
    "r_help": "",
    "body": "\n<b>Beschreibung</b></br>\nStandardisiert Variablen (z-Werte). Die standardisierten Werte werden in neuen Variablen mit dem Präfix oder Nachsuffix der ursprünglichen Variablen gespeichert. Es besteht die Möglichkeit, zu zentrieren und/oder zu skalieren.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nBSkyStandardizeVars (vars, center, scale, prefix, datasetname)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nvars: Eine oder mehrere Variablen, die standardisiert werden sollen. Nur numerische Variablen (keine Faktoren) werden unterstützt.\n</li>\n<li>\ncenter: Wenn center TRUE ist, wird das Zentrieren durch Subtrahieren der Spaltenmittelwerte (unter Ausschluss von NAs) von x durchgeführt, und wenn center FALSE ist, wird kein Zentrieren durchgeführt.\n</li>\n<li>\nscale: Wenn scale TRUE ist, wird das Skalieren durchgeführt, indem die (zentrierten) Spalten von x durch ihre Standardabweichungen geteilt werden, wenn center TRUE ist, und durch die Quadratwurzel des Mittelwerts, andernfalls. Wenn scale FALSE ist, wird kein Skalieren durchgeführt.\n</li>\n<li>\nstingToPrefixOrSuffix: Ein Zeichenfolgen, die das Präfix oder Nachsuffix angibt, das für die neuen standardisierten Variablen verwendet werden soll (d.h. neue Spalten im Datensatz).\n</li>\n<li>\nprefixOrSuffix: Geben Sie an, ob Sie ein Präfix oder ein Nachsuffix möchten\n</li>\n<li>\ndatasetname: Der Name des Datensatzes/Dataframes\n</li>\n</ul>\nHinweis: Wir werden nicht von numerisch zu Faktor konvertieren. Wenn eine numerische Variable umcodiert wird, bleibt sie numerisch, wenn eine Faktorvariable umcodiert wird, bleibt sie ein Faktor.</br>\n<b>Paket</b></br>\nBlueSky</br>\n"
  }
}