{
  "title": "Subjektanpassung",
  "navigation": "Subjektanpassung",
  "newdatasetnamelabel": "Datensatzname zum Speichern der übereinstimmenden Daten",
  "groupvarlabel": "Fall-/Kontrollvariable (Kontrolle=niedriger Wert, Fall=höherer Wert)",
  "notelabel": "Hinweis: Sie müssen mindestens eine Variable für exakte oder Kaliper-Variablen angeben",
  "exactvarslabel": "Variablen für exakte Anpassung",
  "calipervarslabel": "Variablen für Kaliperanpassung",
  "caliperslabel": "Geben Sie Kaliper in der Reihenfolge der Kalipervariablen getrennt durch Kommas an, z.B. 5, 2",
  "idvarlabel": "Subjekt-ID-Variable",
  "ratiolabel": "Anzahl der Kontrollen pro Fall",
  "help": {
    "title": "Subjektanpassung",
    "r_help": "hilfe(matchit, paket = 'MatchIt')",
    "body": "\n            Führt eine nächstgelegene Nachbaranpassung durch, bei der eine Gruppe von Fällen mit 1 oder mehr Kontrollen übereinstimmt. Dies ist geeignet für Fall-/Kontrollstudien und angepasste Kohortenstudien.\n\t\t\t<br/><br/>\n\t\t\tVariablen, für die Werte genau übereinstimmen müssen und Werte, die innerhalb numerischer Kaliper übereinstimmen, werden unterstützt.\n\t\t\tDie Anpassung erfolgt ohne Ersatz (jedes Subjekt kann nur einmal angepasst werden) und die Kontrollen unter den potenziellen Kontrollen werden entsprechend der Datenreihenfolge für jeden Fall ausgewählt.\n\t\t\t<br/><br/>\n\t\t\tDer Ausgabedatensatz enthält die Originaldaten und zwei zusätzliche Variablen: 1) Unterklasse: eine Variable, die die angepasste Gruppe identifiziert, und 2) Gewichte: eine Anpassungsfallgewichtvariable, die in nachfolgenden Analysen verwendet werden kann, falls gewünscht.\n\t\t\t<br/><br/>\n\t\t\t<b>Datensatzname zum Speichern der übereinstimmenden Daten:</b>\n\t\t\t<br/>Name des Ausgabedatensatzes, der die angepassten Subjektgruppen enthält.\n\t\t\t<br/><br/>\n\t\t\t<b>Fall-/Kontrollvariable (Kontrolle=niedriger Wert, Fall=höherer Wert):</b>\n\t\t\t<br/>Name der Variable, die Fälle und Kontrollen angibt. Kann numerisch, faktorisiert oder charakteristisch sein.  \n\t\t\tWenn es sich um eine numerische Variable handelt, muss diese als 0=Kontrolle, 1=Fall codiert werden. Wenn es sich um eine faktorisierte Variable handelt, ist die niedriger geordnete Ebene die Kontrolle und die höher geordnete Ebene die Fälle.  \n\t\t\tWenn es sich um eine charakteristische Variable handelt, ist der niedriger geordnete Wert (alphabetisch) die Kontrollen und der höher geordnete Wert (alphabetisch) die Fälle.\n\t\t\tUm auf Nummer sicher zu gehen, empfehlen wir die Codierung als 0=Kontrolle, 1=Fall.\n\t\t\t</br><br/>\n\t\t\t<b>Variablen für exakte Anpassung:</b>\n\t\t\t<br/>Geben Sie die Variablen an, für die Sie möchten, dass die Fall-/Kontrollgruppen genau angepasst werden.  \n\t\t\tDas bedeutet, dass die Fälle und Kontrollen in einer angepassten Gruppe genau die gleichen Werte für diese Variablen haben. Diese können charakteristisch, datum, numerisch, faktorisiert oder ordinal sein.\n\t\t\t<br/><br/>\n\t\t\t<b>Variablen für Kaliperanpassung:</b>\n\t\t\t<br/>Geben Sie die Variablen an, für die Sie möchten, dass die Fall-/Kontrollgruppen auf numerischen Kaliperwerten angepasst werden. Die Kontrollen liegen innerhalb einer bestimmten Kaliperbreite für jede dieser Variablen.\n\t\t\tDiese können numerische oder Datumsvariablen sein. Jede Kalipervariable muss einen Kaliperwert angegeben haben.\n\t\t\t<br/><br/>\n\t\t\t<b>Geben Sie Kaliper in der Reihenfolge der Kalipervariablen getrennt durch Kommas an:</b>\n\t\t\t<br/>Geben Sie die numerischen Kaliperwerte für jede der Kalipervariablen in der Reihenfolge der Kalipervariablen an.  \n\t\t\tWenn beispielsweise das Alter (in Jahren) mit einem Kaliper von 5 angegeben wurde, bedeutet dies, dass die Kontrollen innerhalb von +/- 5 Jahren ihres angepassten Falls liegen müssen.\n\t\t\tJede Kalipervariable muss einen Kaliperwert angegeben haben. Wenn es keine Kalipervariablen gibt, muss dieses Feld leer sein.\n\t\t\t<br/><br/>\n\t\t\t<b>Anzahl der Kontrollen pro Fall:</b>\n\t\t\t<br/>Dies ist die maximale Anzahl von Kontrollen, die jedem Fall zugeordnet werden. Einige angepasste Gruppen können weniger als diesen Wert haben, wenn geeignete Übereinstimmungen nicht identifiziert werden können.\n            <br/><br/>\n            <b>Erforderliche R-Pakete:</b> dplyr, tidyr, MatchIt\n"
  }
}