{
  "title": "Tabelle, Grundlegend",
  "navigation": "Tabelle, Grundlegend",
  "sumvarslabel": "Variablen zur Zusammenfassung",
  "bygroupvarlabel": "Gruppen zum Vergleichen (optional)",
  "stratavarlabel": "Strata (optional)",
  "tabletitlelabel": "Tabellentitel",
  "totalcolchkboxlabel": "Gesamtsäule einbeziehen",
  "groupvarchkboxlabel": "Gruppenvariablenname einbeziehen",
  "digitslabel": "Ziffern nach dem Dezimalpunkt",
  "contdigitslabel": "Kontinuierliche Werte",
  "pctdigitslabel": "Prozentsätze",
  "pvaluedigitslabel": "P-Werte",
  "simplifylabel": "Vereinfachen Sie Mehrzeilige Variablenzusammenfassungen auf Eine Zeile (wenn möglich)",
  "numericsimplifylabel": "Numerische Variablen",
  "categorysimplifylabel": "Kategorische Variablen",
  "ordinalsimplifylabel": "Ordinale Variablen",
  "datesimplifylabel": "Datumsvariablen",
  "labelsimplifylabel": "Letzte Ebene im Label der Kategorischen Variablen verwenden",
  "conflevellabel": "Konfidenzniveau",
  "ciFootNote": "Fußnote zum Konfidenzniveau",
  "stattestschkboxlabel": "Statistische Tests",
  "numtestlabel": "Numerische Tests",
  "anovaoptlabel": "ANOVA",
  "kwoptlabel": "Kruskal-Wallis",
  "medoptlabel": "Median-Test",
  "cattestlabel": "Kategorische Nominaltests",
  "chisqoptlabel": "Pearson's Chi-Quadrat",
  "fisheroptlabel": "Fisher's Exakt",
  "simchkboxlabel": "Simulieren Sie p-Werte für Pearson und Fisher",
  "simnumlabel": "Anzahl der Simulationen",
  "ordtestlabel": "Kategorische Ordinaltests",
  "trendoptlabel": "Trend",
  "footnotechkboxlabel": "Fußnote zu Testnamen",
  "sampsizelabel": "Stichprobengröße",
  "meanlabel": "Mittelwert",
  "quantileslabel": "Quantile",
  "otherlabel": "Andere",
  "nmissanylabel": "Anzahl der fehlenden Werte, falls vorhanden",
  "nmissalwayslabel": "Anzahl der fehlenden Werte, immer",
  "meansdlabel": "Mittelwert (SD)",
  "meancilabel": "Mittelwert (CI)",
  "meanselabel": "Mittelwert (SE)",
  "gmeanlabel": "Geometrischer Mittelwert",
  "gmeansdlabel": "Geometrischer Mittelwert (SD)",
  "gmeancilabel": "Geometrischer Mittelwert (CI)",
  "trimmeancilabel": "Beschnittener Mittelwert (CI)",
  "trimpctlabel": "Geben Sie den Prozentsatz des beschnittenen Mittelwerts an",
  "medianlabel": "Median",
  "medianq1q3label": "Median (25. %-ile, 75. %-ile)",
  "q1q3label": "(25. %-ile, 75. %-ile)",
  "iqrlabel": "Interquartilsbereich",
  "medianrangelabel": "Median (Bereich)",
  "medianmadlabel": "Median (Median Absolute Deviation)",
  "rangelabel": "Bereich",
  "minlabel": "Minimum",
  "maxlabel": "Maximum",
  "pct1label": "1. %-ile (CI)",
  "pct5label": "5. %-ile (CI)",
  "pct10label": "10. %-ile (CI)",
  "pct25label": "25. %-ile (CI)",
  "pct33label": "33 1/3 %-ile (CI)",
  "pct50label": "Median (CI)",
  "pct66label": "66 2/3 %-ile (CI)",
  "pct75label": "75. %-ile (CI)",
  "pct90label": "90. %-ile (CI)",
  "pct95label": "95. %-ile (CI)",
  "pct99label": "99. %-ile (CI)",
  "custquantlabel": "Benutzerdefinierte %-ile (CI)",
  "custquantvaluelabel": "Geben Sie %-ile an",
  "sumlabel": "Summe",
  "sdlabel": "SD",
  "varlabel": "Varianz",
  "gsdlabel": "Geometrischer Mittelwert SD",
  "cvlabel": "Variationskoeffizient",
  "skewnesslabel": "Schiefe",
  "kurtosislabel": "Kurtosis",
  "freqlabel": "Häufigkeit",
  "freqtotallabel": "Häufigkeit/Gesamt",
  "freqpctlabel": "Häufigkeit (%)",
  "propcilabel": "Proportion (CI)",
  "help": {
    "title": "Tabelle, Grundlegend",
    "r_help": "help(tableby, package ='arsenal')",
    "body": "\nDies erstellt eine Tabelle mit Zusammenfassungsstatistiken mit Optionen zur Angabe von Gruppen zum Vergleichen und einer Stratifizierungsvariablen, um die Vergleiche innerhalb zu machen. Eine Spalte für jede Gruppenvariablenkategorie wird erstellt. Die Kategorien der Stratifizierungsvariablen bilden zusätzliche Zeilen für die Tabelle. Verschiedene Zusammenfassungsstatistiken und statistische Tests können angegeben werden.\n<br/><br/>\n<b>Variablen zur Zusammenfassung:</b> Variablen, für die Zusammenfassungsstatistiken berechnet werden. Variablen können numerisch, nominale Faktoren, ordinale Faktoren oder Daten sein. Daten jeder Klasse werden nur für Zusammenfassungszwecke in die Datums-Klasse umgewandelt. Ihr ursprünglicher Datensatz bleibt unverändert. Dies bedeutet auch, dass zusammengefasste Daten nur bis zum Tag genau sind.\n<br/><br/>\n<b>Gruppen zum Vergleichen (optional):</b> Variable, die die Kategorien definiert, die verglichen werden sollen\n<br/><br/>\n<b>Strata (optional):</b> Variable, die die Kategorien definiert, innerhalb derer die Vergleiche angestellt werden\n<br/><br/>\n<b>Tabellentitel:</b> Geben Sie den Tabellentitel an\n<br/><br/>\n<b>Gesamtsäule einbeziehen:</b> ob eine Gesamtsäule in die Tabelle einbezogen wird oder nicht\n<br/><br/>\n<b>Gruppenvariablenname einbeziehen:</b> ob der Gruppenvariablenname in die Tabelle einbezogen wird oder nicht\n<br/><br/>\n<b>Ziffern nach dem Dezimalpunkt:</b> Geben Sie an, wie viele Ziffern nach dem Dezimalpunkt für kontinuierliche Werte, Prozentsätze und p-Werte angezeigt werden sollen\n<br/><br/>\n<b>Vereinfachen Sie Mehrzeilige Variablenzusammenfassungen auf Eine Zeile (wenn möglich):</b> Für zweikategoriale kategoriale (Faktor/Ordinal) Variablen oder einzelne Zusammenfassungen von numerischen oder Datumsvariablen können Sie die Zeilen zusammenfassen, sodass alle Variablennamen und Statistiken in einer einzigen Zeile erscheinen. Die Zusammenfassungen für die letzte Kategorie jeder kategorialen Variablen werden angezeigt. Jede Variable, für die eine Zusammenfassung nicht möglich ist, nimmt mehrere Zeilen ein. Diese Option kann für jeden Variablentyp separat ein- oder ausgeschaltet werden.\n<br/><br/>\n<b>Letzte Ebene im Label der Kategorischen Variablen verwenden:</b> Für vereinfachte Tabellen wird die letzte Ebene der Faktor-/Ordinalvariablen im Zeilenlabel einbezogen.\n<br/><br/>\n<b>Konfidenzniveau:</b> Dies legt das Konfidenzniveau der Konfidenzintervalle fest.\n<br/><br/>\n<b>Statistische Testoptionen</b>\n<br/><br/>\n<b>Statistische Tests:</b> Ob statistische Tests zum Vergleichen von Gruppen gewünscht sind und welche Tests verwendet werden sollen. Alle numerischen Variablen (kontinuierliche Werte und Daten) verwenden den im Abschnitt Numerische Tests angegebenen Test. Alle nominalen Faktoren verwenden den im Abschnitt Kategorische Nominaltests angegebenen Test. Alle ordinalen Faktoren verwenden den im Abschnitt Kategorische Ordinaltests angegebenen Test. Pearson- und Fisher-Simulationen bieten die Möglichkeit, simulierte p-Werte für Pearson's Chi-Quadrat-Tests und Fisher's Exakt-Tests zu erhalten. Dieses Verfahren erstellt Monte-Carlo-Simulationen die angegebene Anzahl von Malen (Anzahl der Simulationen). Dies kann in Fällen nützlich sein, in denen die Standardberechnungen, insbesondere für den Fisher's Exakt-Test, zu Computer-Speicherfehlern führen.\n<br/><br/>\n<b>Fußnote zu Testnamen:</b> ob p-Wert-Fußnoten, die die durchgeführten statistischen Tests für jede Variable auflisten, einbezogen werden sollen oder nicht\n<br/><br/>\n<b>Numerische Statistikoptionen:</b>\n<br/>Statistiken, die für numerische Variablen angezeigt werden\n<br/><br/>\n<b>Kategorische Statistikoptionen:</b> \n<br/>Statistiken, die sowohl für nominale als auch für ordinale Faktoren angezeigt werden\n<br/><br/>\n<b>Datumsstatistiken:</b>\n<br/>Statistiken, die für Datumsvariablen angezeigt werden\n<br/><br/>\n<b>Hinweis:</b> Wenn Sie eine Variable eines bestimmten Typs zusammenfassen möchten, wird empfohlen, mindestens eine Statistik in dieser Kategorie auszuwählen, die nicht \"Anzahl der fehlenden Werte, falls vorhanden\" ist. Wenn \"Anzahl der fehlenden Werte, falls vorhanden\" die einzige ausgewählte Option ist und keine Variablen einen fehlenden Wert haben, tritt ein Fehler auf.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
  }
}