{
  "title": "Liniendiagramm mit zwei Y-Achsen",
  "navigation": "Zwei Y-Achsen",
  "x": "X-Achse",
  "y": "Y1-Achse, geben Sie eine numerische Variable an",
  "y2": "Y2-Achse, geben Sie eine numerische Variable an",
  "y1_sf": "Y1-Skalierungsfaktor",
  "y2_sf": "Y2-Skalierungsfaktor",
  "help": {
    "title": "Liniendiagramm",
    "r_help": "help(geom_line, package=ggplot2)",
    "body": "\n            <b>Beschreibung</b></br>\n            Erstellt ein Liniendiagramm (verbunden nach Reihenfolge) oder ein Treppenstufen-Diagramm oder ordnet das Liniendiagramm nach dem Auftreten der Punkte im Datensatz. Klicken Sie auf die Registerkarte, die dem Typ des Liniendiagramms entspricht, den Sie möchten.</br>\n            Liniendiagramm (verbunden nach Reihenfolge): Ein Liniendiagramm plottet eine Linie durch Punkte, die durch die x- und y-Koordinaten definiert sind, und verbindet sie in der Reihenfolge der Variablen auf der x-Achse. Wenn eine Farbe auf eine Faktorvariable gesetzt wird, werden die Punkte nach Farbe gruppiert und für jede Farbgruppe wird eine separate Linie erzeugt. Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die x- und y-Achse angeben.</br>\n            Treppenstufen-Diagramm: Ein Liniendiagramm plottet eine Linie durch Punkte, die durch die x- und y-Koordinaten definiert sind, und erstellt ein Treppenstufen-Diagramm, das genau hervorhebt, wann Änderungen auftreten. Wenn eine Farbe auf eine Faktorvariable gesetzt wird, werden die Punkte nach Farbe gruppiert und für jede Farbgruppe wird eine separate Linie erzeugt. Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die x- und y-Achse angeben.</br>\n            Nach Auftreten geordnet: Ein Liniendiagramm plottet eine Linie durch Punkte, die durch die x- und y-Koordinaten definiert sind, und verbindet sie in der Reihenfolge, in der die Variablen im Datensatz auftreten. Wenn eine Farbe auf eine Faktorvariable gesetzt wird, werden die Punkte nach Farbe gruppiert und für jede Farbgruppe wird eine separate Linie erzeugt. Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die x- und y-Achse angeben.</br>\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code> \n            #Liniendiagramm<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_line( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Liniendiagramm für ...\")<br/>\n            #Treppenstufen-Diagramm<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_step( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Liniendiagramm für ...\")<br/>\n            #Nach Auftreten geordnet<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_path( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Liniendiagramm für ...\")\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            data: Der Standarddatensatz​\n            </li>\n            <li>\n            aes(): Generieren Sie ästhetische Zuordnungen, die beschreiben, wie Variablen in den Daten auf visuelle Eigenschaften (Ästhetik) von Geoms abgebildet werden.​\n            </li>\n            <li>\n            x: Eine numerische oder Faktorvariable\n            </li>\n            <li>\n            y: die numerische/Skalenvariable, für die Punkte auf der y-Achse geplottet werden​\n            </li>\n            <li>\n            color: eine optionale Faktorvariable zur Gruppierung von Punkten (nach Farbe)​\n            </li>\n            <li>\n            labs(): Ändern Sie Achsenbeschriftungen und Legendentitel (dies ist optional)​\n            </li>\n            <li>\n            facet_grid(): Panels in einem Raster anordnen (dies ist optional)​\n            </li>\n            <li>\n            theme_calc(): Gibt das Rechner-Thema an (dies ist optional)​\n            </li>\n            <li>\n            geom_line(): Verbindet Beobachtungen, die nach x-Wert geordnet sind, siehe x:​\n            </li>\n            <li>\n            coord_flip(): Achse umdrehen (dies ist optional)​\n            </li>\n            </ul>\n            <b>Pakete</b></br>\n            ggplot2;ggthemes;</br>\n            <b>Hilfe</b></br>\n            #Liniendiagramm\n            help(geom_line, package='ggplot2')\n            #Liniendiagramm Treppenstufen\n            help(geom_step, package=ggplot2)\n            #Variablenreihenfolge\n            help(geom_path, package='ggplot2')\n            Andere: Klicken Sie auf die R-Hilfe-Schaltfläche, um detaillierte R-Hilfe zu erhalten. Sie können auch help(labs), help(geom_line), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) eingeben.​            \n    "
  }
}