{
  "title": "Cox，二元時間依賴性協變數",
  "navigation": "Cox，二元時間依賴性協變數",
  "modelname": "輸入模型名稱",
  "timevar": "事件或審查的時間",
  "eventvar": "事件（1 = 事件 1，0 = 審查）",
  "modelterms": "獨立變數的模型表達式生成器",
  "switchtimeslabel": "時間依賴性協變數的暴露時間變數",
  "tdprefixlabel": "時間依賴性協變數的前綴",
  "subjectidlabel": "受試者識別碼",
  "weightvar": "權重（可選）",
  "tiemethod": "綁定時間方法",
  "forestplotbox": "森林圖",
  "diagnosticsbox": "模型診斷",
  "martscalebox": "空模型馬丁蓋殘差軸最小值（-Inf 到 1）：",
  "devbox": "偏差分析（類型 II）",
  "devtype": "檢驗統計量",
  "startstopboxlabel": "顯示（開始，停止）時間數據集",
  "startstopnamelabel": "數據集名稱",
  "help": {
    "title": "Cox，二元時間依賴性協變數",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n擬合一個Cox比例風險模型，用於包含一個或多個二元時間依賴性“暴露”協變數的時間到事件數據，並且有審查觀察。這種類型的協變數是指在隨訪開始後可能會發生“是”的情況，一旦發生“是”，它在隨訪期間將保持為“是”。一個例子是移植後的移植物排斥（即在排斥發生之前，患者尚未“暴露”；排斥發生後，患者已經“暴露”）。\n將這樣的協變數視為在隨訪開始時已知是一種未來預測的形式，會導致偏倚的估計（也稱為“不死時間偏倚”）。\n<br/><br/>\n提供模型擬合統計、參數估計和風險比。可用的選項包括綁定時間方法、森林圖、模型診斷，以及查看生成的基礎計數過程數據集的能力。提供一個描述計數過程數據的表格，以檢查這些數據是否正確生成。\n<br/><br/>  \n計數過程數據摘要：\n<br/>\n<b>早期：</b>預測變數在隨訪時間開始之前變化的時間<br/>\n<b>晚期：</b>預測變數在隨訪結束後變化的時間<br/>\n<b>內部：</b>預測變數在隨訪期間內變化的時間<br/>\n<b>領先：</b>預測變數在隨訪開始時變化的時間<br/>\n<b>滯後：</b>預測變數在隨訪結束時變化的時間<br/>\n<b>邊界：</b>預測變數在隨訪開始或結束時變化的時間\n<br/><br/>\n有關此表的更多信息，請參見時間依賴性協變數小冊子，網址為 <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>。\n<br/><br/>\n該模型使用生存包中的coxph函數擬合。\n<br/><br/>\n<b>輸入模型名稱：</b>將存儲模型結果的名稱\n<br/><br/>\n<b>事件或審查的時間：</b>對於經歷事件的人，事件的結果時間或對於未經歷結果事件的人，最後隨訪的時間\n<br/><br/>\n<b>事件（1=事件，0=審查）：</b>數值事件指示符；1=事件，0=審查\n<br/><br/>\n<b>公式生成器：</b>構建要包含在模型中的項。因子、字符串和邏輯變數將被虛擬編碼。提供的按鈕允許您指定主要效應、全因子效應（主要效應和所有與相關變數的交互作用）、多項式、特定交互作用，並從列表中刪除項。\n<br/><br/>\n<b>時間依賴性協變數的暴露時間變數：</b>存儲受試者首次“暴露”時間的數值變數。這必須與時間變數在同一時間尺度上。對於從未暴露的受試者，應使用缺失值。這裡指定的每個變數將創建一個單獨的時間依賴性協變數。指定的時間假設受試者在此時間之前未暴露，並在此時間之後暴露（即當預測變數從“否”變為“是”時）。僅指定正值意味著受試者在隨訪開始後的一段時間內未暴露。指定一些正值和負值表示某些受試者在隨訪開始之前和之後分別暴露。如果您知道某個受試者在隨訪開始之前已經暴露，但您不知道確切的時間，那麼您可以使用任何負時間，模型將正確地將該受試者視為在整個隨訪期間都已暴露。如果受試者在隨訪後暴露，那麼他們將被正確地視為在整個隨訪期間都未暴露。\n<br/><br/>\n<b>時間依賴性協變數的前綴：</b>要用於在<b>暴露時間變數</b>字段中指定的每個時間依賴性協變數的所需前綴。每個時間依賴性協變數的名稱將以此前綴開頭。\n<br/><br/>\n<b>受試者識別碼：</b>存儲受試者識別碼的變數。這是創建基礎計數過程數據集所必需的。\n<br/><br/>\n<b>權重：</b>觀察權重的數值變數。在每條記錄不應被計算為一個觀察的情況下非常有用。\n<br/><br/>\n<b>選項：</b>\n<br/><br/>\n<b>綁定時間方法：</b>打破綁定觀察時間的方法。當綁定時間不多時，Efron通常是更好的選擇。如果有很多綁定時間，如在離散時間情況下，則精確方法可能是有益的，但模型擬合可能需要更長的時間。\n<br/><br/>\n<b>森林圖：</b>將創建風險比和置信區間的森林圖\n<br/><br/>\n<b>顯示（開始，停止）數據集：</b>將顯示用於計算的基礎計數過程數據集。這將每個受試者的隨訪時間分成幾個部分，具體取決於時間依賴性協變數何時應該改變值。\n<br/><br/>\n<b>模型診斷：</b>如果選擇，將提供比例風險檢驗和圖形，此外還將評估模型中每個協變數的功能形式。\n空模型馬丁蓋殘差軸最小值選項可能需要更改，以便所有殘差都出現在圖中。要獲得功能形式評估，您必須僅指定數值預測變數，並且沒有缺失數據。請參見變數 > 缺失值 > 刪除NAs。\n<br/><br/>\n<b>偏差分析（類型 II）：</b>模型中每個預測變數的全局檢驗。將為具有超過2個水平的效應提供多自由度檢驗。\n可以獲得Wald和似然比檢驗，似然比檢驗具有更好的小樣本特性。\n<br/><br/>\n<b>所需包：</b>survival，broom，survminer，car\n"
  }
}