{
  "title": "Aggiungi una Variabile di Numero Campione Ricalibrata",
  "navigation": "Ricalibra Numero Campione",
  "sampleVariableToCalibrate": "Seleziona la variabile campione da ricalibrare",
  "sampleVarName": "Specifica il nome della nuova variabile di campione ricalibrata da aggiungere (ad es., sample_recal). Se il nome della variabile è già presente nel dataset, verrà aggiornato",
  "help": {
    "title": "Aggiungi una Variabile di Numero Campione Ricalibrata",
    "body": "\n\t\t\t\t<b>Descrizione</b></br>\n\t\t\t\tOrganizzazione dei sottogruppi (cioè gruppo campione) per la Capacità di Processo e altre analisi di sottogruppo\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tAnalisi come l'analisi della Capacità di Processo presuppongono che i dati siano inseriti nell'ordine in cui sono stati raccolti (ordine cronologico). Ciò significa che tutte le osservazioni dello stesso sottogruppo devono apparire in righe consecutive del dataset. Una colonna ID sottogruppo è tipicamente utilizzata per definire quali righe appartengono allo stesso sottogruppo.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSe questa condizione non è soddisfatta (ad esempio, se le righe dello stesso sottogruppo sono sparse nel dataset e non sono collocate una accanto all'altra), allora gli ID dei sottogruppi devono essere ricalibrati.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa ricalibrazione significa:\n\t\t\t\t<br/>\n\t\t\t\tUn nuovo numero di sottogruppo viene assegnato ogni volta che l'ID del sottogruppo cambia da una riga all'altra.\n\t\t\t\t<br/>\n\t\t\t\tSe lo stesso ID del sottogruppo riappare più tardi ma non è adiacente alla sua occorrenza precedente, verrà trattato come un nuovo sottogruppo.\n\t\t\t\t<br/>\n\t\t\t\tIn altre parole, solo i valori identici che appaiono uno accanto all'altro sono considerati parte dello stesso sottogruppo. Valori identici separati da altri sottogruppi saranno divisi in sottogruppi separati durante la ricalibrazione.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa variabile di numero campione ricalibrata nel dataset è necessaria per eseguire molte analisi, ad es. Capacità di Processo, grafici di Shewhart come xbar, R, S, ecc.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}