{
  "title": "ANOVA, unidirezionale con blocchi casuali",
  "navigation": "ANOVA, 1 via (blocchi casuali)",
  "tvarbox1": "Variabile di Risposta",
  "tvarbox2": "Effetto Fisso",
  "blockVar": "Variabile(i) di Blocco",
  "Post_hoc": "Analisi post-hoc",
  "chk1": "Istogramma dei residui",
  "help": {
    "title": "ANOVA, unidirezionale con blocchi casuali",
    "r_help": "help(lmer, package ='lme4')",
    "body": "\n<b>Descrizione</b></br>\nAdatta un modello lineare a effetti misti (LMM) ai dati, tramite REML o massima verosimiglianza.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nlmer(formula, data = NULL, REML = TRUE, control = lmerControl(),\n        start = NULL, verbose = 0L, subset, weights, na.action,\n        offset, contrasts = NULL, devFunOnly = FALSE, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nformula: un oggetto formula lineare a due lati che descrive sia la parte a effetti fissi che quella a effetti casuali del modello, con la risposta a sinistra di un operatore ~ e i termini, separati da operatori +, a destra. I termini a effetti casuali sono distinti da barre verticali (|) che separano le espressioni per le matrici di design dai fattori di raggruppamento. Due barre verticali (||) possono essere utilizzate per specificare più effetti casuali non correlati per la stessa variabile di raggruppamento. (A causa del modo in cui è implementato, la sintassi || funziona solo per matrici di design contenenti predittori numerici (continui); per adattare modelli con effetti categorici indipendenti, vedere dummy o la funzione lmer_alt dal pacchetto afex.)\n</li>\n<li>\ndata: un frame di dati opzionale contenente le variabili nominate nella formula. Per impostazione predefinita, le variabili vengono prese dall'ambiente da cui viene chiamato lmer. Anche se i dati sono opzionali, gli autori del pacchetto raccomandano fortemente il loro utilizzo, specialmente quando si applicano metodi come update e drop1 al modello adattato (tali metodi non sono garantiti per funzionare correttamente se i dati vengono omessi). Se i dati vengono omessi, le variabili verranno prese dall'ambiente della formula (se specificata come formula) o dal frame genitore (se specificata come vettore di caratteri).\n</li>\n<li>\nREML: scalare logico - Le stime devono essere scelte per ottimizzare il criterio REML (anziché la log-verosimiglianza)?\nna.action: una funzione che indica cosa dovrebbe accadere quando i dati contengono NAs. L'azione predefinita (na.omit, ereditata dal valore 'factory fresh' di getOption(\"na.action\")) rimuove qualsiasi osservazione con valori mancanti in qualsiasi variabile.\n</li>\n</ul>\n<b>Valore</b></br>\nUn oggetto di classe merMod (più specificamente, un oggetto di sottoclasse lmerMod), per il quale sono disponibili molti metodi (ad es. methods(class=\"merMod\"))</br>\n<b>Pacchetto</b></br>\nlme4</br>\n<b>Aiuto</b></br>\nhelp(lmer, package ='lme4')</br></br>\n<b>Descrizione</b></br>\nMetodi di descrizione per la funzione anova nel pacchetto lmerTest\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \n## Metodo S4 per firma 'merModLmerTest' anova(object, ... , ddf=\"Satterthwaite\", type=3)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nobject: oggetto di classe \"merModLmerTest\" ... oggetto di classe \"merModLmerTest\". Quindi verranno calcolate le statistiche di confronto del modello\n</li>\n<li>\nddf: Per impostazione predefinita, viene calcolata l'approssimazione di Satterthwaite ai gradi di libertà. Se ddf=\"Kenward-Roger\", allora viene calcolata l'approssimazione di Kenward-Roger utilizzando la funzione KRmodcomp dal pacchetto pbkrtest. Se ddf=\"lme4\" allora viene restituita la tabella anova che proviene dal pacchetto lme4.\n</li>\n<li>\nType: tipo di ipotesi da testare. Potrebbe essere type=3 o type=2 o type=1 (La definizione proviene dalla teoria SAS) Dettagli Secondo (Goodnight, J.H. 1976) il comportamento dell'ipotesi di tipo 3 non è completamente studiato per le situazioni con celle mancanti (dove le osservazioni mancano in alcune combinazioni di livelli di fattore). Viene restituito un avviso in tali casi.\n</li>\n</ul>\n<b>Dettagli</b></br>\nSecondo (Goodnight, J.H. 1976) il comportamento dell'ipotesi di tipo 3 non è completamente studiato per le situazioni con celle mancanti (dove le osservazioni mancano in alcune combinazioni di livelli di fattore). Viene restituito un avviso in tali casi.</br>\n<b>Pacchetto</b></br>\nlme4;lmerTest;rcompanion;ggplot2;multcomp</br>\n<b>Aiuto</b></br>\nhttps://cran.r-project.org/web/packages/lmerTest/lmerTest.pdf</br>\nhelp(nagelkerke, package ='rcompanion')</br>\nhelp(emmeans,package=\"cld\")</br>\nhelp(cld,package='emmeans')</br>\n<b>Materiale di riferimento</b></br>\nhttp://rcompanion.org/handbook/I_07.html\n"
  }
}