{
  "title": "ANOVA, N way",
  "modelname": "Inserisci un nome per il modello",
  "label3": "Dimensione dell'effetto",
  "confInterval": "Intervallo di confidenza per le dimensioni dell'effetto",
  "effectsizes": "Seleziona la misura della dimensione dell'effetto",
  "navigation": "ANOVA, N way",
  "target": "Variabile target (numerica/scala)",
  "dest": "Specifica un massimo di 2 variabili fattoriali",
  "options": "Opzioni",
  "type": "Seleziona tipo I/II/III Sums of squares",
  "levene": "Test di Levene per l'omogeneità delle varianze",
  "label1": "Post-hoc",
  "combon": "Confronta le medie utilizzando:",
  "adjust": "Metodo per l'aggiustamento dei valori p",
  "compactly": "Confronto delle medie in modo compatto",
  "alpha": "Inserisci un valore di alpha:",
  "label2": "Grafici",
  "label4": "Grafici",
  "diag": "Grafici diagnostici",
  "plot1": "Grafico di tutti i confronti",
  "horizontalAxis": "Linee separate",
  "separateLines": "Asse orizzontale",
  "separatePlots": "Grafici separati",
  "labelSaveResiduals": "Salva le statistiche del modello nel dataset",
  "residuals": "I residui sono salvati con un nome di variabile residui con un prefisso opzionale",
  "stuResiduals": "I residui studentizzati sono salvati con un nome di variabile resStudentized con un prefisso opzionale",
  "fittedVals": "I valori adattati sono salvati con un nome di variabile fitted con un prefisso opzionale",
  "prefixForSavedStatistics": "Inserisci facoltativamente un prefisso per i valori salvati sopra, il prefisso è aggiunto ai nomi delle variabili sopra",
  "help": {
    "title": "ANOVA, N way",
    "r_help": "help(aov, package='stats')",
    "body": "\nNOTA:</br>\n1. Per ottenere tutte le medie marginali e i post-hoc è necessario costruire una formula con gli effetti principali e tutti i termini di interazione nel modello.</br> \nQuindi, se stai cercando di analizzare un'interazione a 3 vie, devi specificare</br>\nA + B + C + A:B + B:C + A:C + A:B:C</br>\nSe invece specifichi A*B*C, otterrai la tabella ANOVA completa, NON otterrai le medie marginali stimate e i post-hoc per tutte le interazioni.</br>\n2. Le medie marginali stimate E I POST-HOC sono calcolati per tutti gli effetti principali e le INTERAZIONI SPECIFICATE</br>\n<b>Descrizione</b></br>\nAdatta un modello di analisi della varianza, visualizza il tipo I, II, III somma dei quadrati, visualizza le medie marginali e i contrasti (utilizzando le medie marginali).</br> \nEsegue facoltativamente il test di Levene per l'omogeneità della varianza tra i gruppi e traccia grafici.</br>\nIl test di Levene viene eseguito per tutti gli effetti principali</br></br>\nCostruisce e riassume un modello anova utilizzando la formula specificata utilizzando la funzione aov</br>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nhelp(aov, package='stats')</br></br>\nVisualizza la tabella Anova con la somma dei quadrati di tipo I/II/III</br>\nUtilizza la funzione Anova nel pacchetto car per la somma dei quadrati di tipo II, III, funzione anova nel pacchetto stats per la somma dei quadrati di tipo I. Quando si calcola la somma dei quadrati di tipo III, i contrasti appropriati (contr.sum) sono impostati per le variabili fattoriali.</br>\n<b>Pacchetto</b></br>\ncar</br>\n<b>Aiuto</b></br>\nhelp(Anova, package='car')</br></br>\nVisualizza le medie marginali stimate</br>\n<b>Pacchetto</b></br>\nemmeans</br>\n<b>Aiuto</b></br>\nhelp(emmeans, package='car')</br></br>\nCalcola il test di Levene per l'omogeneità della varianza tra i gruppi. \n<b>Pacchetto</b></br>\ncar</br>\n<b>Aiuto</b></br>\nhelp(leveneTest, package='car')\n"
  }
}