{
  "title": "ANOVA, un modo con blocchi",
  "navigation": "ANOVA, 1 modo con blocchi",
  "tvarbox1": "Variabile di risposta (una)",
  "tvarbox2": "Effetto fisso",
  "blockVar": "Variabile(i) di blocco",
  "chk1": "Istogramma dei residui",
  "chk2": "Analisi post-hoc",
  "help": {
    "title": "ANOVA, un modo con blocchi",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>Descrizione</b></br>\nTabelle ANOVA per vari modelli statistici​\nCalcola tabelle di analisi della varianza di tipo-II o tipo-III per oggetti modello prodotti da lm, glm, multinom (nel pacchetto nnet), polr (nel pacchetto MASS), coxph (nel pacchetto survival), coxme (nel pacchetto coxme), svyglm (nel pacchetto survey), rlm (nel pacchetto MASS), lmer nel pacchetto lme4, lme nel pacchetto nlme, e (per il metodo predefinito) per la maggior parte dei modelli con un predittore lineare e coefficienti asintoticamente normali (vedi dettagli di seguito). Per i modelli lineari, vengono calcolati i test F; per i modelli lineari generalizzati, vengono calcolati il chi-quadro del rapporto di verosimiglianza, il chi-quadro di Wald o i test F; per i modelli logit multinomiali e logit a odds proporzionali, vengono calcolati i test del rapporto di verosimiglianza. Vengono forniti vari test statistici per modelli lineari multivariati prodotti da lm o manova. Vengono forniti test del rapporto di verosimiglianza parziale o test di Wald per i modelli Cox. I test chi-quadro di Wald sono forniti per effetti fissi in modelli misti lineari e lineari generalizzati. I test chi-quadro di Wald o i test F sono forniti nel caso predefinito.​\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nmod: lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm, o altro oggetto modello adatto.​\n</li>\n<li>\ntype: tipo di test, \"II\", \"III\", 2, o 3.​\n</li>\n</ul>\n<b>Dettagli</b></br>\nLe designazioni \"tipo-II\" e \"tipo-III\" sono prese in prestito da SAS, ma le definizioni utilizzate qui non corrispondono precisamente a quelle impiegate da SAS. I test di tipo-II vengono calcolati secondo il principio di marginalità, testando ciascun termine dopo tutti gli altri, tranne ignorando i parenti di ordine superiore del termine; i cosiddetti test di tipo-III violano la marginalità, testando ciascun termine nel modello dopo tutti gli altri. Questa definizione di test di tipo-II corrisponde ai test prodotti da SAS per modelli di analisi della varianza, dove tutti i predittori sono fattori, ma non più in generale (cioè, quando ci sono predittori quantitativi). Fai molta attenzione nella formulazione del modello per i test di tipo-III, o le ipotesi testate non avranno senso.​</br>\nCome implementato qui, i test di Wald di tipo-II sono una generalizzazione delle ipotesi lineari utilizzate per generare questi test nei modelli lineari.​</br>\nPer i test per modelli lineari, modelli lineari multivariati e test di Wald per modelli lineari generalizzati, modelli Cox, modelli misti, modelli lineari generalizzati adattati ai dati di indagine, e nel caso predefinito, Anova trova le statistiche di test senza riadattare il modello. Il metodo svyglm chiama semplicemente il metodo predefinito e quindi può prendere gli stessi argomenti.​</br>\n<b>Valore</b><br/>\nUn oggetto di classe \"anova\", o \"Anova.mlm\", che di solito viene stampato. Per oggetti di classe \"Anova.mlm\", c'è anche un metodo di riepilogo, che fornisce molte più informazioni rispetto al metodo di stampa riguardo alla MANOVA, inclusi test F univariati tradizionali con correzioni di Greenhouse-Geisser e Huynh-Feldt.​​</br>\n<b>Pacchetto</b></br>\nAnova</br>\n<b>Aiuto</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>Descrizione</b></br>\nTest di separazione media post-hoc. Per eseguire test di separazione media post-hoc per ciascuna variabile fattore principale utilizzeremo il pacchetto emmeans. Il modello lineare in considerazione è chiamato modello, creato dalla funzione lm sopra.  \n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>Pacchetto</b></br>\nFSA;car;emmeans;ggplot2;multcomp</br>\n<b>Aiuto</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
  }
}