{
  "title": "ANOVA e Test del Rapporto di Verosimiglianza",
  "navigation": "ANOVA e Test del Rapporto di Verosimiglianza",
  "label1": "L'ANOVA viene eseguita per modelli con le seguenti classi (classi R tra parentesi) Modelli lineari (lm), Modelli lineari generalizzati (glm), Modello lineare logaritmico negativo binomiale (negbin), Modello lineare utilizzando i minimi quadrati generalizzati (gls), Modello di regressione di sopravvivenza (survreg), Modello di rischio proporzionale (coxph), Regressione Loess (loess)",
  "label2": "**NOTA: Il test di verosimiglianza non è supportato per modelli creati tramite la Sintonizzazione del Modello (classe train),",
  "modelselector1": "Seleziona un modello",
  "help": {
    "title": "ANOVA e Test del Rapporto di Verosimiglianza",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>Descrizione</b></br>\nTabelle ANOVA: Calcola le tabelle di analisi della varianza e esegue test del rapporto di verosimiglianza per un oggetto modello adattato. Per i modelli ad effetti misti, la tabella simile all'ANOVA per gli effetti casuali è visualizzata. \n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nobject: un oggetto contenente i risultati restituiti da una funzione di adattamento del modello (ad es., lm o glm).\n</li>\n</ul>\n<b>Valore</b><br/>\nQuesta funzione (generica) restituisce un oggetto di classe anova. Questi oggetti rappresentano tabelle di analisi della varianza e di analisi della devianza. Quando viene fornito un singolo argomento, produce una tabella che testa se i termini del modello sono significativi. Quando viene fornita una sequenza di oggetti, anova testa i modelli l'uno contro l'altro nell'ordine specificato.<br/>\nIl metodo di stampa per gli oggetti anova stampa tabelle in una forma 'carina'.<br/>\n<b>Avviso</b><br/>\nIl confronto tra due o più modelli sarà valido solo se sono adattati allo stesso set di dati. Questo potrebbe essere un problema se ci sono valori mancanti e il valore predefinito di R di na.action = na.omit è utilizzato.<br/>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nPer un aiuto dettagliato clicca sull'icona R nell'angolo in alto a destra di questo overlay di dialogo o esegui il seguente comando nell'editor di sintassi R help(anova,package='stats')</br></br>\n<b>Descrizione</b></br>\nTest del Rapporto di Verosimiglianza di Modelli Annidati: lrtest è una funzione generica per eseguire test del rapporto di verosimiglianza. Il metodo predefinito può essere impiegato per confrontare modelli lineari (generalizzati) annidati (vedi dettagli di seguito).\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Metodo S3 predefinito:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Metodo S3 per la classe 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nobject: un oggetto. Vedi sotto per dettagli.\n</li>\n<li>\n...: ulteriori specifiche dell'oggetto passate ai metodi. Vedi sotto per dettagli.\n</li>\n<li>\nname: una funzione per estrarre un nome/descrizione adatta da un oggetto modello adattato. Per impostazione predefinita, il nome viene interrogato chiamando formula.\n</li>\n<li>\ndata: un data frame contenente le variabili nel modello.\n</li>\n</ul>\n<b>Dettagli</b></br>\nlrtest è destinato a essere una funzione generica per confronti di modelli tramite test del rapporto di verosimiglianza asintotici. Il metodo predefinito confronta consecutivamente l'oggetto modello adattato con i modelli passati in .... Invece di passare gli oggetti modello adattati in ..., sono possibili diverse altre specifiche. Il meccanismo di aggiornamento è lo stesso di waldtest: i modelli in ... possono essere specificati come interi, caratteri (entrambi per termini che dovrebbero essere eliminati dal modello precedente), formule di aggiornamento o oggetti modello adattati. Ad eccezione dell'ultimo caso, si presume l'esistenza di un metodo di aggiornamento. Vedi waldtest per dettagli.<br/>\nSuccessivamente, viene eseguito un test del rapporto di verosimiglianza asintotico per ciascuno dei due modelli consecutivi: Due volte la differenza nei log-verosimiglianze (come derivato dai metodi logLik) viene confrontata con una distribuzione Chi-quadrato.<br/>\nIl metodo \"formula\" adatta prima un lm e poi chiama il metodo predefinito.<br/>\n<b>Valore</b><br/>\nUn oggetto di classe \"anova\" che contiene la log-verosimiglianza, i gradi di libertà, la differenza nei gradi di libertà, la statistica del test del rapporto di verosimiglianza Chi-quadrato e il corrispondente valore p.\n<b>Esempi</b><br/>\n<code> \n## con dati di Greene (1993):<br/>\n## carica i dati e calcola i lag<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## varie specifiche equivalenti del test LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>Descrizione</b></br>\nTabella Simile all'ANOVA per Effetti Casuali: Calcola una tabella simile all'ANOVA con test dei termini ad effetto casuale nel modello. Ogni termine ad effetto casuale viene ridotto o rimosso e i test del rapporto di verosimiglianza delle riduzioni del modello sono presentati in una forma simile a quella di drop1. rand è un alias per ranova.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nmodel: un modello ad effetti misti lineari adattato con lmer() (che eredita dalla classe lmerMod).\n</li>\n<li>\nreduce.terms: se TRUE (predefinito) i termini ad effetto casuale vengono ridotti (se possibile). Se FALSE i termini ad effetto casuale vengono semplicemente rimossi.\n</li>\n</ul>\n<b>Dettagli</b></br>\nSe il modello è adattato con REML, i test sono test del rapporto di verosimiglianza REML.<br/>\nUn termine ad effetto casuale della forma (f1 + f2 | gr) viene ridotto a termini della forma (f2 | gr) e (f1 | gr) e questi modelli ridotti vengono confrontati con il modello originale. Se reduce.terms è FALSE (f1 + f2 | gr) viene rimosso invece.<br/>\nUn termine ad effetto casuale della forma (f1 | gr) viene ridotto a (1 | gr) (a meno che reduce.terms sia FALSE).<br/>\nUn termine ad effetto casuale della forma (1 | gr) non viene ridotto ma semplicemente rimosso.<br/>\nUn termine ad effetto casuale della forma (0 + f1 | gr) o (-1 + f1 | gr) viene ridotto (se reduce.terms = TRUE) a (1 | gr).<br/>\nUn termine ad effetto casuale della forma (1 | gr1/gr2) viene automaticamente espanso in due termini: (1 | gr2:gr1) e (1 | gr1) utilizzando findbars.<br/>\nIn questa esposizione non è rilevante se f1 e f2 sono fattori o variabili continue.<br/>\n<b>Valore</b><br/>\nUna tabella simile all'ANOVA con cancellazioni di singoli termini di effetti casuali che eredita dalla classe anova e data.frame con le colonne:</br>\nnpar: numero di parametri del modello.</br>\nlogLik: la log-verosimiglianza per il modello. Nota che questa è la logLik REML se il modello è adattato con REML.</br>\nAIC: l'AIC per il modello valutato come -2*(logLik - npar). Minore è meglio.</br>\nLRT: la statistica del test del rapporto di verosimiglianza; due volte la differenza nella log-verosimiglianza, che è asintoticamente distribuita come chi-quadrato.</br>\nDf: gradi di libertà per il test del rapporto di verosimiglianza: la differenza nel numero di parametri del modello.</br>\nPr(>Chisq) :il valore p.</br>\n<b>Avviso</b></br>\nIn alcuni casi possono essere generati test di modelli non annidati. Un esempio è quando (0 + poly(x, 2) | gr) viene ridotto (il predefinito) a (1 | gr). A nostro avviso, i confronti di modelli non annidati vengono generati solo in casi che sono comunque statisticamente insensati (come in questo esempio in cui l'intercetta casuale è soppressa).</br>\nNota: Nota che anova può essere utilizzato per confrontare due modelli e spesso sarà in grado di produrre gli stessi test di ranova. Questo, tuttavia, non è sempre il caso come illustrato negli esempi.</br>\n<b>Esempi</b><br/>\n<code> \n# Test di riduzione di (Days | Subject) a (1 | Subject):<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # test 2 df<br/>\n# Questo test può essere ottenuto anche con anova():<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# Illustra l'argomento reduce.test:<br/>\n# Test di rimozione di (Days | Subject):<br/>\nranova(fm1, reduce.terms = FALSE) # test 3 df<br/>\n# La statistica del test del rapporto di verosimiglianza è in questo caso:<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() non è sempre in grado di eseguire gli stessi test di ranova(),<br/>\n# ad esempio:<br/>\nanova(fm1, fm3, refit=FALSE) # confronta REML con ML e non dovrebbe essere usato<br/>\nanova(fm1, fm3, refit=TRUE) # è un test di adattamenti ML e non ciò che cerchiamo<br/>\n# Nota anche che il fit lmer deve venire prima - non un fit lm:<br/>\n# anova(fm3, fm1) # non funziona e genera un errore<br/>\n# ranova() potrebbe non generare tutti i test rilevanti:<br/>\n# Per il seguente modello ranova() indica che non dovremmo ridurre<br/>\n# (TVset | Assessor):\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Assessor), data=TVbo)<br/>\nranova(fm)<br/>\n# Tuttavia, un modello più appropriato è:<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Assessor), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm e fm2 hanno essenzialmente lo stesso adattamento ai dati ma fm utilizza 5 parametri in più rispetto a fm.<br/>\n</code> <br/>\n<b>Pacchetto</b></br>\nlmerTest</br>\n<b>Aiuto</b></br>\nPer un aiuto dettagliato clicca sull'icona R nell'angolo in alto a destra di questo overlay di dialogo o esegui il seguente comando nell'editor di sintassi R help(ranova, package ='lmerTest')\n                "
  }
}