{
  "title": "Grafico a barre",
  "navigation": "Grafico a barre",
  "optionsLabels": "Opzioni per le etichette",
  "suppressLabels": "Sopprimi tutte le etichette per conteggi e percentuali",
  "suppressThreshold": "Sopprimi le etichette per conteggi e percentuali al di sotto della soglia percentuale specificata",
  "label1": "Clicca sulla scheda qui sotto per selezionare conteggio o media. Quando è selezionato il conteggio, una variabile Y è facoltativa. Quando è selezionato il conteggio e una variabile Y NON è specificata, vengono visualizzati i conteggi della variabile X. Quando il conteggio è specificato e una variabile Y è specificata, i valori della variabile Y vengono sommati. Quando è selezionata la media, è necessario selezionare una variabile Y e una variabile X. Le medie vengono calcolate per la variabile Y.",
  "x": "Variabile X",
  "y": "Variabile(i) Y, specificare una variabile numerica",
  "fill": "Specifica una variabile fattoriale per riempire le barre.",
  "dropna": "Elimina i valori mancanti",
  "bottomlbl": "Seleziona Grafico a barre",
  "meanlbl": "Media",
  "countlbl": " Conteggio",
  "fill1": "Seleziona un colore per le barre. Nota: Questo viene ignorato quando è specificata una variabile per riempire le barre.",
  "barType": "Tipo di grafico a barre",
  "stackedBar": "Grafico a barre impilate",
  "sideBySide": "Mostra i gruppi affiancati",
  "fillPercent": "Riempi le barre",
  "errorBarOptions": "Barre di errore",
  "noErrBars": "Nessuna barra di errore",
  "stderr": "Errori standard",
  "stddev": "Deviazione standard",
  "cilevel": "Specifica il livello di confidenza:",
  "confidenceInterval": "Livello di confidenza:",
  "alpha": "Opacità (0-1)",
  "flipBox": "Capovolgi asse",
  "specify_a_title": "Inserisci un titolo",
  "x_title": "Etichetta asse X",
  "y_title": "Etichetta asse Y",
  "hide": "Mostra solo la parte superiore delle barre di errore (devi impostare l'opacità a 1)",
  "Facetrow": "Riga di faccette",
  "Facetcolumn": "Colonna di faccette",
  "Facetwrap": "Avvolgi faccette",
  "Facetscale": "Scala delle faccette",
  "relFreq": "Frequenze relative",
  "facets_lbl": "Faccette",
  "help": {
    "title": "Aiuto Grafico a barre",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Un grafico a barre è un grafico che presenta dati raggruppati con barre rettangolari le cui lunghezze sono proporzionali ai valori che rappresentano. Le barre possono essere tracciate verticalmente o orizzontalmente. Le barre possono essere raggruppate da una variabile fattoriale opzionale. I gruppi possono essere impilati su una singola barra o visualizzati affiancati. Le faccette possono essere create specificando una variabile fattoriale. Puoi anche specificare temi, e specificare un titolo e etichette per gli assi x e y.\n        Puoi creare un grafico a barre per una singola variabile fattoriale, le barre rappresenteranno i conteggi di ciascun livello della variabile fattoriale. Qui la variabile fattoriale sarà sull'asse x, vedi esempio qui sotto. Quando la casella di controllo delle frequenze relative è selezionata, mostriamo la frequenza relativa invece dei conteggi sull'asse y.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=1) +\n         labs(x =\"year\",y =\"Count\",title= \"Grafico a barre per asse X: year, asse Y: Count\")\n        </code>\n        <br />\n        Puoi creare un grafico a barre posizionando una variabile scala/numerica sull'asse y, e riempiendo le barre con una variabile fattoriale. La barra sarà riempita sommando i valori della variabile y per ciascun livello della variabile fattoriale, vedi esempio qui sotto\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=1,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"Grafico a barre per asse X:, asse Y: weight, Riempimento: origin\")\n        </code>\n        <br />\n        Puoi specificare una variabile x, una variabile y e un riempimento. La barra è riempita dalla somma dei valori della variabile y per ciascun livello della variabile x, raggruppata per il livello della variabile specificata nel riempimento.\n        Quando specifichi più variabili x, creiamo un grafico a barre separato per ciascuna variabile x. \n        <br />\n        Utilizzo:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Il dataset predefinito​\n        </li>\n        <li>\n        aes():    Genera mappature estetiche che descrivono come le variabili nei dati sono mappate alle proprietà visive (estetiche) dei geoms.​\n        </li>\n        <li>\n        x: Una variabile fattoriale/categorica. La lunghezza della barra corrisponde ai conteggi di ciascun livello della variabile fattoriale.​\n        </li>\n        <li>\n        fill: Una variabile fattoriale/categorica opzionale per raggruppare i conteggi dei livelli in x: (vedi sopra)​\n        </li>\n        <li>\n        geom_bar(): Crea il grafico a barre, position =”stack” impila i gruppi su una singola barra, position =”dodge” impila i gruppi affiancati, position =\"fill\" riempie la barra con una percentuale di ciascun livello di raggruppamento.​\n        </li>\n        <li>\n        Labs(): Cambia le etichette degli assi e i titoli della legenda (questo è facoltativo)​\n        </li>\n        <li>\n        facet_grid(): Dispone i pannelli in una griglia (questo è facoltativo)​\n        </li>\n        <li>\n        theme_calc(): Specifica il tema del calcolatore (questo è facoltativo)​\n        </li>\n        <li>\n        coord_flip(): Capovolgi asse (questo è facoltativo)​\n        </li>\n        <li>\n        alpha: Controlla l'opacità, assume valori tra 0-1. 1 significa nessuna opacità.\n        </li>\n        </ul>\n        Pacchetto: ggplot2,ggthemes​\n        <br />\n        Altro: Clicca sul pulsante Aiuto R per ottenere aiuto dettagliato su R. Puoi anche inserire help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n        "
  }
}