{
  "title": "Grafico a barre",
  "navigation": "Grafico a barre",
  "optionsLabels": "Opzioni per le etichette",
  "suppressLabels": "Sopprimi tutte le etichette per conteggi e percentuali",
  "suppressThreshold": "Sopprimi le etichette per conteggi e percentuali al di sotto della soglia percentuale specificata",
  "label1": "Clicca sulla scheda qui sotto per selezionare conteggio o media. Quando il conteggio è selezionato, una variabile Y è facoltativa. Quando il conteggio è selezionato e una variabile Y NON è specificata, vengono visualizzati i conteggi della variabile X. Quando il conteggio è specificato e una variabile Y è specificata, i valori della variabile Y vengono sommati. Quando la media è selezionata, è necessario selezionare una variabile Y e una variabile X. Le medie vengono calcolate per la variabile Y(e)",
  "x": "Variabile X, specifica una variabile categorica",
  "y": "Variabile(e) Y, specifica una variabile numerica(e)",
  "fill": "Specifica una variabile categorica per riempire le barre",
  "dropna": "Elimina valori mancanti",
  "bottomlbl": "Seleziona Grafico a barre",
  "meanlbl": "Media",
  "countlbl": " Conteggio",
  "fill1": "Seleziona un colore per le barre. Nota: Questo viene ignorato quando è specificata una variabile per riempire le barre",
  "legends": "Mostra legende e, in tal caso, posizione delle legende (di default a destra)",
  "digitsCountDisplay": "Cifre - numero di cifre da visualizzare per conteggi e percentuali",
  "barType": "Tipo di grafico a barre",
  "stackedBar": "Grafico a barre impilate",
  "sideBySide": "Mostra gruppi affiancati",
  "fillPercent": "Riempi barre",
  "errorBarOptions": "Barre di errore",
  "noErrBars": "Nessuna barra di errore",
  "stderr": "Errori standard",
  "stddev": "Deviazioni standard",
  "cilevel": "Specifica il livello di confidenza:",
  "confidenceInterval": "Livello di confidenza:",
  "drawSignificance": "Aggiungi significatività (valori p) confronto medio tra ogni coppia di barre (seleziona faccetta per analisi di gruppo). Per tukey_hsd e games_howell_test, i valori p sono già aggiustati. Il metodo di aggiustamento dei valori p aggiuntivi è ignorato.",
  "methodForMeanDiffSignificance": "Metodo di test utilizzato per confrontare le medie",
  "adjPvalue": "Aggiusta i valori p per confrontare le medie prodotte dal metodo di test",
  "pValueFromatting": "Formato dei valori p (significatività) visualizzati",
  "alpha": "Opacità (0-1)",
  "flipBox": "Capovolgi asse",
  "specify_a_title": "Inserisci un titolo",
  "x_title": "Etichetta asse X",
  "y_title": "Etichetta asse Y",
  "showErrorBar": "Mostra entrambe le estremità della barra di errore (di default), solo sopra o solo sotto",
  "Facetrow": "Riga faccetta",
  "Facetcolumn": "Colonna faccetta",
  "Facetwrap": "Avvolgi faccetta",
  "Facetscale": "Scala faccetta",
  "relFreq": "Frequenze relative",
  "facets_lbl": "Faccette",
  "xyLimits": "Limiti degli assi X e Y",
  "label5": "Specifica un intervallo per i valori degli assi X e Y",
  "rangeYValues": "Specifica l'intervallo dell'asse Y, ad esempio 0,100",
  "help": {
    "title": "Aiuto Grafico a barre",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Un grafico a barre è un grafico che presenta dati raggruppati con barre rettangolari le cui lunghezze sono proporzionali ai valori che rappresentano. Le barre possono essere tracciate verticalmente o orizzontalmente. Le barre possono essere raggruppate da una variabile fattore opzionale. I gruppi possono essere impilati su una singola barra o visualizzati affiancati. Le faccette possono essere create opzionalmente specificando una variabile fattore. Puoi anche specificare temi e specificare un titolo e etichette per gli assi x e y.\n        Puoi creare un barplot per una singola variabile fattore, le barre rappresenteranno i conteggi di ciascun livello della variabile fattore. Qui la variabile fattore sarà sull'asse x, vedi esempio qui sotto. Quando la casella di controllo delle frequenze relative è selezionata, mostriamo la frequenza relativa invece dei conteggi sull'asse y.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=0.4) +\n         labs(x =\"year\",y =\"Count\",title= \"Bar plot for X axis: year,Y axis: Count\")\n        </code>\n        <br />\n        Puoi creare un barplot posizionando una variabile scala/numerica sull'asse y e riempiendo le barre con una variabile fattore. La barra sarà riempita sommando i valori della variabile y per ciascun livello della variabile fattore, vedi esempio qui sotto\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=0.4,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"Bar plot for X axis:,Y axis: weight,Fill: origin\")\n        </code>\n        <br />\n        Puoi specificare una variabile x, una variabile y e un riempimento. La barra è riempita dalla somma dei valori della variabile y per ciascun livello della variabile x, raggruppata per il livello della variabile specificata nel riempimento.\n        Quando specifichi più variabili x, creiamo un grafico a barre separato per ciascuna variabile x.\n        <br />\n        Utilizzo:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Il dataset predefinito​\n        </li>\n        <li>\n        aes():    Genera mappature estetiche che descrivono come le variabili nei dati sono mappate alle proprietà visive (estetiche) dei geoms.​\n        </li>\n        <li>\n        x: Una variabile fattore/categorica. La lunghezza della barra corrisponde ai conteggi di ciascun livello della variabile fattore.​\n        </li>\n        <li>\n        fill: Una variabile fattore/categorica opzionale per raggruppare i conteggi dei livelli in x: (vedi sopra)​\n        </li>\n        <li>\n        geom_bar(): Crea il grafico a barre, position =”stack” impila i gruppi su una singola barra, position =”dodge” impila i gruppi affiancati, position =\"fill\" riempie la barra con una percentuale di ciascun livello di raggruppamento.​\n        </li>\n        <li>\n        Labs(): Cambia le etichette degli assi e i titoli delle legende (questo è facoltativo)​\n        </li>\n        <li>\n        facet_grid(): Dispone i pannelli in una griglia (questo è facoltativo)​\n        </li>\n        <li>\n        theme_calc(): Specifica il tema calcolatore (questo è facoltativo)​\n        </li>\n        <li>\n        coord_flip(): Capovolgi asse (questo è facoltativo)​\n        </li>\n        <li>\n        alpha: Controlla l'opacità, assume valori tra 0-1. 1 significa nessuna opacità.\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tse 'Aggiungi significatività (valori p) confronto medio tra ogni coppia di barre' è selezionato sotto Media, i codici per i valori p sul grafico sono i seguenti\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tMetodi di aggiustamento dei valori P:\n\t\t<br/>\n\t\tI metodi di aggiustamento dei valori P includono la correzione di Bonferroni (\"bonferroni\") in cui i valori p sono moltiplicati per \n\t\til numero di confronti. Correzioni meno conservative sono incluse anche da Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" o il suo alias \"fdr\"), e Benjamini & Yekutieli (2001) (\"BY\"), \n\t\trispettivamente. È inclusa anche un'opzione di pass-through (\"none\"). L'insieme di metodi è contenuto nel vettore p.adjust.methods \n\t\tper il beneficio dei metodi che devono avere il metodo come opzione e passarla a p.adjust.\n\t\t<br/>\n\t\t<br/>\n\t\tI primi quattro metodi sono progettati per dare un forte controllo del tasso di errore familiare. Non sembra esserci motivo di utilizzare la \n\t\tcorrezione di Bonferroni non modificata perché è dominata dal metodo di Holm, che è anche valido sotto assunzioni arbitrarie.\n\t\t<br/>\n\t\t<br/>\n\t\tI metodi di Hochberg e Hommel sono validi quando i test ipotetici sono indipendenti o quando sono associati in modo non negativo \n\t\t(Sarkar, 1998; Sarkar e Chang, 1997). Il metodo di Hommel è più potente di quello di Hochberg, ma la differenza è solitamente piccola \n\t\ted i valori p di Hochberg sono più veloci da calcolare.\n\t\t<br/>\n\t\t<br/>\n\t\tI metodi \"BH\" (alias \"fdr\") e \"BY\" di Benjamini, Hochberg e Yekutieli controllano il tasso di scoperta falsa, la proporzione attesa \n\t\tdi scoperte false tra le ipotesi rifiutate. Il tasso di scoperta falsa è una condizione meno rigorosa rispetto al \n\t\ttasso di errore familiare, quindi questi metodi sono più potenti degli altri.\n\t\t<br/>\n\t\t<br/>\n\t\tVedi anche \n\t\t<br/>\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br/>\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br/>\n\t\t<br />\n        Pacchetto: ggplot2,ggthemes​\n        <br />\n        Altro: Clicca sul pulsante Aiuto R per ottenere aiuto dettagliato su R. Puoi anche inserire help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n      "
  }
}