{
  "title": "Test di Bartlett",
  "navigation": "Test di Bartlett",
  "tvarbox1": "Variabile di risposta",
  "tvarbox2": "Variabili numeriche o fattoriali",
  "help": {
    "title": "Test di Bartlett",
    "r_help": "help(bartlett.test, package=stats)",
    "body": "\n<b>Descrizione</b></br>\nEsegue il test di Bartlett dell'ipotesi nulla che le varianze in ciascuno dei gruppi (campioni) siano le stesse.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nbartlett.test(x, ...)</br>\n## Metodo S3 predefinito:</br>\nbartlett.test(x, g, ...)</br>\n## Metodo S3 per la classe 'formula'</br>\nbartlett.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nArgomenti\nx: un vettore numerico di valori dei dati, o un elenco di vettori di dati numerici che rappresentano i rispettivi campioni, o oggetti di modelli lineari adattati (che ereditano dalla classe \"lm\").\n</li>\n<li>\ng: un vettore o oggetto fattoriale che fornisce il gruppo per gli elementi corrispondenti di x. Ignorato se x è un elenco.\n</li>\n<li>\nformula: una formula della forma lhs ~ rhs dove lhs fornisce i valori dei dati e rhs i gruppi corrispondenti.\n</li>\n<li>\ndata: una matrice o un data frame opzionale (o simile: vedere model.frame) contenente le variabili nella formula formula. Per impostazione predefinita, le variabili vengono prese dall'ambiente(formula).\n</li>\n<li>\nsubset: un vettore opzionale che specifica un sottoinsieme di osservazioni da utilizzare.\n</li>\n<li>\nna.action: una funzione che indica cosa dovrebbe accadere quando i dati contengono NAs. Per impostazione predefinita, è impostato su getOption(\"na.action\").\n</li>\n<li>\n...: ulteriori argomenti da passare a o da metodi.\n</li>\n</ul>\n<b>Dettagli</b></br>\nSe x è un elenco, i suoi elementi vengono presi come i campioni o i modelli lineari adattati da confrontare per omogeneità delle varianze. In questo caso, gli elementi devono essere tutti vettori di dati numerici o oggetti di modelli lineari adattati, g viene ignorato e si può semplicemente usare bartlett.test(x) per eseguire il test. Se i campioni non sono ancora contenuti in un elenco, utilizzare bartlett.test(list(x, ...)).</br>\nAltrimenti, x deve essere un vettore di dati numerici e g deve essere un vettore o oggetto fattoriale della stessa lunghezza di x che fornisce il gruppo per gli elementi corrispondenti di x.</br>\n<b>Valore</b><br/>\nUn elenco di classe \"htest\" contenente i seguenti componenti:<br/>\nstatistic: statistica del test K-quadrato di Bartlett.<br/>\nparameter: i gradi di libertà della distribuzione chi-quadrato approssimativa della statistica del test.<br/>\np.value: il valore p del test.<br/>\nmethod: la stringa carattere \"Test di Bartlett di omogeneità delle varianze\".<br/>\ndata.name: una stringa carattere che fornisce i nomi dei dati.<br/>\n<b>Esempi</b><br/>\n<code> \nDataset <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))\nResult_Bartlett_Test = bartlett.test(sales ~ interaction(Dataset$Gender),data=Dataset)\n</code> <br/>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nhelp(bartlett.test, package=stats)\n"
  }
}