{
  "title": "BIC",
  "navigation": "BIC",
  "modelselector1": "Seleziona un modello di una delle seguenti classi (classe tra parentesi) Modello lineare (lm) Modelli lineari generalizzati (glm) Regressione logistica ordinata o Probit (polr) Modelli log-lineari multinomiali (multinom)",
  "help": {
    "title": "BIC",
    "r_help": "help(BIC,package='stats')",
    "body": "\n                <b>Descrizione</b></br>\nFunzione generica che calcola il criterio di informazione di Akaike per uno o più oggetti modello adattati per i quali è possibile ottenere un valore di log-verosimiglianza, secondo la formula -2*log-verosimiglianza + k*npar, dove npar rappresenta il numero di parametri nel modello adattato, e k = 2 per il classico AIC, o k = log(n) (n essendo il numero di osservazioni) per il cosiddetto BIC o SBC (criterio bayesiano di Schwarz).\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nAIC(object, ..., k = 2)\nBIC(object, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nobject: un oggetto modello adattato per il quale esiste un metodo logLik per estrarre la corrispondente log-verosimiglianza, o un oggetto che eredita dalla classe logLik.\n</li>\n<li>\n... opzionalmente più oggetti modello adattati.\n</li>\n<li>\nk: numerico, la penalità per parametro da utilizzare; il valore predefinito k = 2 è il classico AIC.\n</li>\n</ul>\n<b>Dettagli</b></br>\nQuando si confrontano modelli adattati per massima verosimiglianza ai medesimi dati, più piccolo è l'AIC o il BIC, migliore è l'adattamento.\nLa teoria dell'AIC richiede che la log-verosimiglianza sia stata massimizzata: mentre l'AIC può essere calcolato per modelli non adattati per massima verosimiglianza, i loro valori AIC non dovrebbero essere confrontati.</br>\nEsempi di modelli non 'adattati agli stessi dati' sono quelli in cui la risposta è trasformata (i modelli di vita accelerata sono adattati a log-tempi) e dove sono state utilizzate tabelle di contingenza per riassumere i dati.</br>\nQueste sono funzioni generiche (con generici S4 definiti nel pacchetto stats4): tuttavia i metodi dovrebbero essere definiti per la funzione di log-verosimiglianza logLik piuttosto che per queste funzioni: l'azione dei loro metodi predefiniti è quella di chiamare logLik su tutti gli oggetti forniti e assemblare i risultati. Si noti che in diversi casi comuni logLik non restituisce il valore al MLE: vedere la sua pagina di aiuto.</br>\nLa log-verosimiglianza e quindi l'AIC/BIC è definita solo fino a una costante additiva. Costanti diverse sono state convenzionalmente utilizzate per scopi diversi e quindi extractAIC e AIC possono dare valori diversi (e lo fanno per modelli di classe \"lm\": vedere l'aiuto per extractAIC). È necessaria particolare attenzione quando si confrontano adattamenti di classi diverse (con, ad esempio, un confronto tra un GLM di Poisson e gamma che è privo di significato poiché uno ha una risposta discreta, l'altro continua).</br>\nIl BIC è definito come AIC(object, ..., k = log(nobs(object))). Questo richiede che il numero di osservazioni sia noto: il metodo predefinito cerca prima un attributo \"nobs\" sul valore di ritorno dal metodo logLik, quindi prova il generico nobs, e se nessuno dei due ha successo restituisce BIC come NA.</br>\n<b>Valore</b><br/>\nSe viene fornito solo un oggetto, un valore numerico con il corrispondente AIC (o BIC, o ..., a seconda di k).\nSe vengono forniti più oggetti, un data.frame con righe corrispondenti agli oggetti e colonne che rappresentano il numero di parametri nel modello (df) e l'AIC o BIC.<br/>\n<b>Esempi</b><br/>\n<code> \nlm1 <- lm(Fertility ~ . , data = swiss)</br>\nAIC(lm1)</br>\nstopifnot(all.equal(AIC(lm1),<br/>\n                    AIC(logLik(lm1))))<br/>\nBIC(lm1)</br>\nlm2 <- update(lm1, . ~ . -Examination)</br>\nAIC(lm1, lm2)</br>\nBIC(lm1, lm2)</br>\n</code> <br/>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nPer aiuto dettagliato clicca sull'icona R in alto a destra di questo dialogo sovrapposto o esegui il seguente comando nell'editor di sintassi R help(BIC,package='stats')\n                "
  }
}