{
  "title": "Test di Outlier Bonferroni",
  "navigation": "Test di Outlier",
  "label1": "Seleziona un modello di una delle seguenti classi (classe tra parentesi) - Modello lineare (lm), Modello lineare generalizzato (glm)",
  "modelselector1": "Seleziona un modello",
  "help": {
    "title": "Test di Outlier Bonferroni",
    "r_help": "help(outlierTest, package='car')",
    "body": "\n                <b>Descrizione</b></br>\nRiporta i valori p di Bonferroni per testare ciascuna osservazione a turno come outlier di spostamento medio, basato sui residui Studentizzati in modelli lineari (test t), modelli lineari generalizzati (test normali) e modelli misti lineari.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## Metodo S3 per classe 'lm'<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## Metodo S3 per classe 'lmerMod'<br/>\noutlierTest(model, ...)<br/>\n## Metodo S3 per classe 'outlierTest'<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nmodel: un oggetto modello lm, glm o lmerMod; il metodo \"lmerMod\" chiama il metodo \"lm\" e può prendere gli stessi argomenti.\n</li>\n<li>\ncutoff: le osservazioni con valori p di Bonferroni superiori al cutoff non vengono riportate, a meno che non siano nominate osservazioni, nel qual caso viene riportata quella con il residuo Studentizzato più grande.\n</li>\n<li>\nn.max: numero massimo di osservazioni da riportare (predefinito, 10).\n</li>\n<li>\norder: riportare i residui Studentizzati in ordine decrescente di grandezza? (predefinito, TRUE).\n</li>\n<li>\nlabels: un vettore facoltativo di nomi di osservazione.\n</li>\n<li>\n...: argomenti passati alle funzioni dei metodi.\n</li>\n<li>\nx: oggetto outlierTest.\n</li>\n<li>\ndigits: numero di cifre per i valori p riportati.\n</li>\n</ul>\n<b>Dettagli</b></br>\nPer un modello lineare, i valori p riportati utilizzano la distribuzione t con gradi di libertà uno in meno rispetto ai df residui per il modello. Per un modello lineare generalizzato, i valori p sono basati sulla distribuzione normale standard. L'aggiustamento di Bonferroni moltiplica il valore p usuale a due lati per il numero di osservazioni. Il metodo lm funziona per oggetti glm. Per mostrare tutte le osservazioni impostare cutoff=Inf e n.max=Inf.<br/>\n<b>Valore</b><br/>\nun oggetto di classe outlierTest, che di solito viene semplicemente stampato.<br/>\n<b>Esempi</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>Pacchetto</b></br>\ncar</br>\n<b>Aiuto</b></br>\nPer aiuto dettagliato clicca sull'icona R nell'angolo in alto a destra di questo overlay di dialogo o esegui il seguente comando nell'editor di sintassi R help(outlierTest, package=\"car\")\n                "
  }
}