{
    "title": "Diagramma a scatola",
    "navigation": "Diagramma a scatola",
    "x": "Variabile X, specificare una variabile categoriale",
    "y": "Variabile/i Y, specificare una o più variabili numeriche",
    "Fill": "Specificare una variabile di raggruppamento (categoriale)",
    "flipaxis": "Inverti asse",
    "dataPoints": "Seleziona un'opzione per tracciare i punti dati",
    "alpha": "Opacità (0-1)",
    "notch": "Intaglio",
    "outliers": "Mostra i valori anomali (in rosso)",
    "barcolor": "Seleziona un colore per i bordi delle scatole (dopo la selezione, clicca fuori per applicare)",
    "showCountsChk": "Mostra i valori sulla scatola (1Q, mediana, 3Q)",
    "drawSignificanceChk": "Aggiungi significatività (valori p) per il confronto delle medie tra ogni coppia di scatole (seleziona la faccetta per raggruppare l'analisi)",
    "methodForMeanDiffSignificance": "Metodo di test utilizzato per confrontare le medie",
    "adjPvalue": "Correggi i valori p dai confronti delle medie",
    "pValueFromatting": "Formato dei valori p (significatività) visualizzati",
    "specify_a_title": "Inserisci un titolo",
    "x_title": "Etichetta asse X",
    "y_title": "Etichetta asse Y",
    "angleXaxis_text": "Angolo di inclinazione del testo dell’asse X (predefinito 0 per nessuna inclinazione)",
    "angleYaxis_text": "Angolo di inclinazione del testo dell’asse Y (predefinito 0 per nessuna inclinazione)",
    "axisTickmarksCount": "Quanti valori dell’asse (graduazioni) mostrare (predefinito 10)",
    "facets_lbl": "Faccette",
    "Facetrow": "Riga faccetta",
    "Facetcolumn": "Colonna faccetta",
    "Facetwrap": "Avvolgi faccetta (se selezionato, riga e colonna vengono ignorati)",
    "Facetscale": "Scala faccetta",
    "label1": "Linee orizzontali",
    "yIntercept": "Inserire i valori di intercetta Y separati da virgole, es: 100, 200, 300",
    "hLineColor": "Seleziona un colore per le linee e le etichette (clicca fuori per applicare dopo la selezione)",
    "lineType": "Seleziona il tipo di linea",
    "horizontalLinelabel": "Specifica etichette separate da virgole (senza virgolette) per le linee orizzontali",
    "horizontalLinelabel_angle_text": "Angolo di inclinazione del testo dell'etichetta della linea orizzontale (predefinito 0)",
    "label2": "Nota: valori più grandi abbassano il testo, valori più piccoli lo alzano",
    "addHoriRefLines": "Aggiungi linee di riferimento",
    "xyLimits": "Limiti degli assi X e Y",
    "label5": "Specifica un intervallo per i valori degli assi X e Y",
    "rangeXValues": "Specifica l'intervallo dell'asse X, es: 0,100 (lascia vuoto per asse categoriale)",
    "rangeYValues": "Specifica l'intervallo dell'asse Y, es: 0,100",
    "labelHori_HorizontalJustification": "Nota: valori maggiori spostano il testo a sinistra, valori minori a destra",
    "verticalJustification": "Controlla l’allineamento verticale dell’etichetta",
    "hori_HorizontalJustification": "Controlla l’allineamento orizzontale dell’etichetta",
    "addlLabelHlineTextPositionOffset": "Regolazioni aggiuntive della posizione del testo per le etichette delle linee orizzontali",
    "horiMovementHReflineLabel": "Sposta il testo orizzontalmente a sinistra o destra (+ o -) (lascia 0 per asse categoriale)",
    "nobreaklineHRefLabelandValueChk": "Seleziona per rimuovere l’interruzione di riga tra valore ed etichetta",
    "vertiMovementHReflineLabel": "Sposta il testo verticalmente su o giù (+ o -) (lascia 0 per asse categoriale)",
    "help": {
        "title": "Diagramma a scatola",
        "r_help": "help(geom_boxplot, package=ggplot2)",
        "body": "In statistica descrittiva, il diagramma a scatola rappresenta graficamente gruppi di dati numerici in base ai loro quartili. Le 'whiskers' (linee verticali) indicano la variabilità fuori dai quartili. I valori anomali sono rappresentati come punti singoli. I bordi inferiore e superiore della scatola rappresentano il primo e il terzo quartile; la linea centrale rappresenta la mediana. Le whiskers si estendono fino a 1.5 × IQR. È possibile creare faccette specificando variabili categoriali. Se si seleziona l’opzione per tracciare i punti dati, viene utilizzata geom_dotplot. Di default i valori anomali sono neri; se selezionato l’opzione in rosso, vengono messi in maggiore evidenza."
    }
}
