{
  "title": "Box Plot",
  "navigation": "Box Plot",
  "x": "Variabile X, specificare una variabile Categoria",
  "y": "Variabile(i) Y, specificare una variabile(i) Numerica(e)",
  "Fill": "Specificare una variabile di raggruppamento (Categoria)",
  "flipaxis": "Inverti asse",
  "dataPoints": "Seleziona un'opzione per tracciare i punti dati",
  "alpha": "Opacità (0-1)",
  "notch": "Intaglio",
  "outliers": "Mostra Outliers (In Rosso)",
  "barcolor": "Seleziona un colore per le linee attorno alle scatole (Dopo la selezione del colore, fai clic all'esterno del controllo per applicare)",
  "specify_a_title": "Inserisci un titolo",
  "x_title": "Etichetta asse X",
  "y_title": "Etichetta asse Y",
  "angleXaxis_text": "Angolo per inclinare i valori del testo dell'asse x (predefinito 0 per nessuna inclinazione)",
  "angleYaxis_text": "Angolo per inclinare i valori del testo dell'asse y (predefinito 0 per nessuna inclinazione)",
  "axisTickmarksCount": "Quanti valori dell'asse (cioè tickmark) visualizzare (predefinito 10)",
  "Facetrow": "Riga Facet",
  "Facetcolumn": "Colonna Facet",
  "Facetwrap": "Avvolgimento Facet (se scelto, qualsiasi selezione di riga e colonna Facet sarà ignorata)",
  "Facetscale": "Scala Facet",
  "facets_lbl": "Facets",
  "label1": "Linee orizzontali",
  "yIntercept": "Inserisci valori di intercetta Y separati da virgola per le linee orizzontali, ad es. 100, 200, 300",
  "hLineColor": "Seleziona un colore per la/le linea(e) e l'etichetta(e) (Dopo la selezione del colore, fai clic all'esterno del controllo per applicare)",
  "lineType": "Seleziona il tipo di linea",
  "horizontalLinelabel": "Specificare etichette separate da virgola (senza virgolette) per la/le linea(e) orizzontale(i)",
  "horizontalLinelabel_angle_text": "Angolo per inclinare il testo dell'etichetta della linea orizzontale (predefinito 0 per nessuna inclinazione)",
  "label2": "Nota: valori maggiori spostano il testo più in basso, valori minori spostano il testo più in alto",
  "addHoriRefLines": "Aggiungi linee di riferimento",
  "xyLimits": "Limiti degli assi X e Y",
  "label5": "Specificare un intervallo per i valori degli assi X e Y",
  "rangeXValues": "Specificare l'intervallo dell'asse X, ad es. 0,100 (Lascia vuoto per asse categorico/fattore)",
  "rangeYValues": "Specificare l'intervallo dell'asse Y, ad es. 0,100",
  "labelHori_HorizontalJustification": "Nota: valori maggiori posizionano il testo a sinistra, valori minori spostano il testo a destra",
  "verticalJustification": "Controlla la giustificazione verticale dell'etichetta",
  "hori_HorizontalJustification": "Controlla la giustificazione orizzontale dell'etichetta",
  "addlLabelHlineTextPositionOffset": "Regolazioni aggiuntive per posizionare il testo dell'etichetta per le linee orizzontali",
  "horiMovementHReflineLabel": "Sposta il testo orizzontalmente a sinistra o a destra - usa qualsiasi numero con segno + o - (lascia 0 per asse categorico)",
  "nobreaklineHRefLabelandValueChk": "Seleziona questa casella per rimuovere l'interruzione di linea tra il valore dell'etichetta e il testo dell'etichetta",
  "vertiMovementHReflineLabel": "Sposta il testo verticalmente su o giù - usa qualsiasi numero con segno + o - (lascia 0 per asse categorico)",
  "help": {
    "title": "Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descrizione</b></br>\n        Nella statistica descrittiva, un box plot o boxplot è un modo conveniente per rappresentare graficamente gruppi di dati numerici attraverso i loro quartili. I box plot possono anche avere linee che si estendono verticalmente dalle scatole (whiskers) che indicano la variabilità al di fuori dei quartili superiore e inferiore, da cui i termini box-and-whisker plot e box-and-whisker diagram. Gli outliers possono essere tracciati come punti individuali. I box e whisker plots sono uniformi nel loro uso della scatola: il fondo e la parte superiore della scatola sono sempre il primo e il terzo quartile, e la banda all'interno della scatola è sempre il secondo quartile (la mediana). Il whisker superiore si estende dal cardine al valore più alto che è entro 1.5 * IQR del cardine, dove IQR è l'intervallo interquartile, o distanza tra il primo e il terzo quartile. Il whisker inferiore si estende dal cardine al valore più basso entro 1.5 * IQR del cardine. I dati oltre la fine dei whiskers sono outliers e tracciati come punti (come specificato da Tukey).​</br>\n        I Facets possono essere creati opzionalmente specificando una variabile fattoriale. Puoi anche specificare opzionalmente temi, e specificare un titolo e etichette per gli assi x e y​</br>\n        Quando selezioni l'opzione per tracciare i punti dati, lo facciamo utilizzando geom_dotplot</br>\n        Per impostazione predefinita, gli outliers sono mostrati con punti neri, quando selezioni l'opzione per mostrare gli outliers (In Rosso) tramite la casella di controllo, gli outliers diventano più evidenti.\n        <br/>\n        <b>Utilizzo</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argomenti</b><br/>\n        <ul>\n        <li>\n        data: Il dataset predefinito​\n        </li>\n        <li>\n        x: Una variabile fattoriale/categorica che definisce il raggruppamento della variabile y​\n        </li>\n        <li>\n        y: Una variabile numerica per la quale viene calcolato il boxplot​\n        </li>\n        <li>\n        fill: Una variabile fattoriale/categorica opzionale per raggruppare ulteriormente i gruppi esistenti. Ogni sottogruppo sarà mostrato in un colore distinto.​\n        </li>\n        <li>\n        aes():    Genera mappature estetiche che descrivono come le variabili nei dati sono mappate alle proprietà visive (estetiche) dei geoms.​\n        </li>\n        <li>\n        geom_boxplot():Crea il boxplot. I \"cardini\" superiori e inferiori corrispondono ai primi e terzi quartili (il 25° e il 75° percentile).​\n        </li>\n        <li>\n        geom_dotplot: Traccia i punti dati\n        </li>\n        <li>\n        Labs(): Cambia le etichette degli assi e i titoli della legenda (questo è opzionale)​\n        </li>\n        <li>\n        facet_grid(): Dispone i pannelli in una griglia (questo è opzionale)​\n        </li>\n        <li>\n        theme_calc(): Specifica il tema del calcolatore (questo è opzionale)​\n        </li>\n        <li>\n        coord_flip(): Inverti asse (questo è opzionale)​\n        </li>\n        <li>\n        notch: I box plot intagliati applicano un \"intaglio\" o restringimento della scatola attorno alla mediana. Gli intagli sono utili per offrire una guida approssimativa alla significatività della differenza delle mediane; se gli intagli di due scatole non si sovrappongono, questo offre evidenza di una differenza statisticamente significativa tra le mediane. In un box plot intagliato, gli intagli si estendono 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n        <b>Pacchetto</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Aiuto</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Fai clic sul pulsante Aiuto R per ottenere aiuto dettagliato su R. Puoi anche inserire help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}