{
  "title": "Box Plot",
  "navigation": "Box Plot",
  "x": "Variabile X, specificare una variabile di Categoria",
  "y": "Variabile(i) Y, specificare una variabile(i) Numerica(e)",
  "Fill": "Specificare una variabile di raggruppamento (Categoria)",
  "flipaxis": "Capovolgi asse",
  "dataPoints": "Seleziona un'opzione per tracciare i punti dati",
  "alpha": "Opacità (0-1)",
  "notch": "Incavo",
  "outliers": "Mostra Outliers (In Rosso)",
  "barcolor": "Seleziona un colore per le linee attorno alle scatole (Dopo la selezione del colore, clicca al di fuori del controllo per applicare)",
  "showCountsChk": "Visualizza valori sulla scatola (1Q, mediana, 3Q)",
  "drawSignificanceChk": "Aggiungi significatività (p-value) confronto medio tra ogni coppia di scatole (seleziona il fattore per raggruppare l'analisi). Per tukey_hsd e games_howell_test, i p-value sono già aggiustati. Il metodo di aggiustamento del p-value aggiuntivo è ignorato.",
  "methodForMeanDiffSignificance": "Metodo di test utilizzato per confrontare le medie",
  "adjPvalue": "Aggiusta i p-value dal confronto delle medie",
  "pValueFromatting": "Formato dei p-value (significatività) visualizzati",
  "specify_a_title": "Inserisci un titolo",
  "x_title": "Etichetta asse X",
  "y_title": "Etichetta asse Y",
  "legends": "Mostra Legende e, in tal caso, posizione delle Legende (di default a destra)",
  "angleXaxis_text": "Angolo per inclinare i valori del testo dell'asse x (di default 0 per nessuna inclinazione)",
  "angleYaxis_text": "Angolo per inclinare i valori del testo dell'asse y (di default 0 per nessuna inclinazione)",
  "axisTickmarksCount": "Quanti valori dell'asse (cioè tickmark) visualizzare (di default 10)",
  "positionJitterWidth": "Diffusione dei punti jitter (scegli un valore tra 0 e 1. Di default è 0.2)",
  "Facetrow": "Riga di Facet",
  "Facetcolumn": "Colonna di Facet",
  "Facetwrap": "Avvolgimento di Facet (se scelto, qualsiasi selezione di riga e colonna di Facet sarà ignorata)",
  "Facetscale": "Scala di Facet",
  "label1": "Linee orizzontali",
  "connectMedianPointsChk": "Collega i punti mediani tra le scatole",
  "connectMeanPointsChk": "Collega i punti medi tra le scatole",
  "plotMedianLineChk": "Traccia una linea orizzontale per la mediana complessiva della variabile Y (numerica)",
  "plotMeanLineChk": "Traccia una linea orizzontale per la media complessiva della variabile Y (numerica)",
  "yIntercept": "Inserisci valori di intercetta Y separati da virgola per le linee orizzontali, ad es. 100, 200, 300",
  "hLineColor": "Seleziona un colore per la linea(e) e l'etichetta(e) (Dopo la selezione del colore, clicca al di fuori del controllo per applicare)",
  "lineType": "Seleziona il tipo di linea",
  "horizontalLinelabel": "Specificare etichette separate da virgola (senza virgolette) per la linea(e) orizzontale(i)",
  "horizontalLinelabel_angle_text": "Angolo per inclinare il testo dell'etichetta della linea orizzontale (di default 0 per nessuna inclinazione)",
  "label2": "Nota: valori maggiori spostano il testo verso il basso, valori minori spostano il testo verso l'alto",
  "addHoriRefLines": "Aggiungi linee di riferimento",
  "xyLimits": "Limiti degli assi X e Y",
  "label5": "Specificare un intervallo per i valori degli assi X e Y",
  "rangeYValues": "Specificare l'intervallo dell'asse Y, ad es. 0,100",
  "labelHori_HorizontalJustification": "Nota: valori maggiori posizionano il testo a sinistra, valori minori spostano il testo a destra",
  "verticalJustification": "Controlla la giustificazione verticale dell'etichetta",
  "hori_HorizontalJustification": "Controlla la giustificazione orizzontale dell'etichetta",
  "addlLabelHlineTextPositionOffset": "Regolazioni aggiuntive per posizionare il testo dell'etichetta per le linee orizzontali",
  "horiMovementHReflineLabel": "Sposta il testo orizzontalmente a sinistra o a destra - usa qualsiasi numero con segno + o - (lascia 0 per asse Categoriale)",
  "nobreaklineHRefLabelandValueChk": "Spunta questa casella per rimuovere il ritorno a capo tra il valore dell'etichetta e il testo dell'etichetta",
  "vertiMovementHReflineLabel": "Sposta il testo verticalmente su o giù - usa qualsiasi numero con segno + o - (lascia 0 per asse Categoriale)",
  "facets_lbl": "Facets",
  "help": {
    "title": "Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descrizione</b></br>\n        Nelle statistiche descrittive, un box plot o boxplot è un modo conveniente per rappresentare graficamente gruppi di dati numerici attraverso i loro quartili. I box plot possono anche avere linee che si estendono verticalmente dalle scatole (baffi) che indicano la variabilità al di fuori dei quartili superiore e inferiore, da cui i termini box-and-whisker plot e box-and-whisker diagram. Gli outlier possono essere tracciati come punti individuali. I box e whisker plots sono uniformi nel loro uso della scatola: il fondo e la parte superiore della scatola sono sempre il primo e il terzo quartile, e la banda all'interno della scatola è sempre il secondo quartile (la mediana). Il baffo superiore si estende dal cardine al valore più alto che è entro 1.5 * IQR del cardine, dove IQR è l'intervallo interquartile, o distanza tra il primo e il terzo quartile. Il baffo inferiore si estende dal cardine al valore più basso entro 1.5 * IQR del cardine. I dati oltre la fine dei baffi sono outlier e tracciati come punti (come specificato da Tukey).​</br>\n        I Facets possono essere creati opzionalmente specificando una variabile fattoriale. Puoi anche specificare opzionalmente temi, e specificare un titolo e etichette per gli assi x e y​</br>\n        Quando selezioni l'opzione per tracciare i punti dati, lo facciamo utilizzando geom_dotplot</br>\n        Di default, gli outlier sono mostrati con punti neri, quando selezioni l'opzione per mostrare gli outlier (In Rosso) tramite la casella di controllo, gli outlier diventano più prominenti.\n        <br/>\n        <b>Utilizzo</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argomenti</b><br/>\n        <ul>\n        <li>\n        data: Il dataset predefinito​\n        </li>\n        <li>\n        x: Una variabile fattoriale/categoriale che definisce il raggruppamento della variabile y​\n        </li>\n        <li>\n        y: Una variabile numerica per la quale viene calcolato il boxplot​\n        </li>\n        <li>\n        fill: Una variabile fattoriale/categoriale opzionale per raggruppare ulteriormente i gruppi esistenti. Ogni sottogruppo sarà mostrato in un colore distinto.​\n        </li>\n        <li>\n        aes():    Genera mappature estetiche che descrivono come le variabili nei dati sono mappate a proprietà visive (estetiche) dei geoms.​\n        </li>\n        <li>\n        geom_boxplot():Crea il boxplot. I \"cardini\" superiori e inferiori corrispondono ai primi e terzi quartili (il 25° e il 75° percentile).​\n        </li>\n        <li>\n        geom_dotplot: Traccia i punti dati\n        </li>\n        <li>\n        Labs(): Cambia le etichette degli assi e i titoli delle legende (questo è opzionale)​\n        </li>\n        <li>\n        facet_grid(): Disporre i pannelli in una griglia (questo è opzionale)​\n        </li>\n        <li>\n        theme_calc(): Specifica il tema del calcolatore (questo è opzionale)​\n        </li>\n        <li>\n        coord_flip(): Capovolgi asse (questo è opzionale)​\n        </li>\n        <li>\n        notch: I box plot con incavo applicano un \"incavo\" o restringimento della scatola attorno alla mediana. Gli incavi sono utili per offrire una guida approssimativa alla significatività della differenza delle mediane; se gli incavi di due scatole non si sovrappongono, ciò offre evidenza di una differenza statisticamente significativa tra le mediane. In un box plot con incavo, gli incavi si estendono 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tse 'Aggiungi significatività (p-value) confronto medio tra ogni coppia di scatole' è selezionato, i codici per i p-value sul grafico sono i seguenti\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tMetodi di aggiustamento P-value:\n\t\t<br/>\n\t\tI metodi di aggiustamento P-value includono la correzione di Bonferroni (\"bonferroni\") in cui i p-value sono moltiplicati per \n\t\til numero di confronti. Correzioni meno conservative sono incluse anche da Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" o il suo alias \"fdr\"), e Benjamini & Yekutieli (2001) (\"BY\"), \n\t\trispettivamente. Un'opzione pass-through (\"none\") è anche inclusa. L'insieme di metodi è contenuto nel vettore p.adjust.methods \n\t\tper il beneficio dei metodi che devono avere il metodo come opzione e passarla a p.adjust.\n\t\t<br/>\n\t\t<br />\n\t\tI primi quattro metodi sono progettati per dare un forte controllo del tasso di errore familiare. Non sembra esserci motivo di utilizzare la \n\t\tcorrezione di Bonferroni non modificata perché è dominata dal metodo di Holm, che è anche valido sotto assunzioni arbitrarie.\n\t\t<br/>\n\t\t<br />\n\t\tI metodi di Hochberg e Hommel sono validi quando i test ipotetici sono indipendenti o quando sono associati in modo non negativo \n\t\t(Sarkar, 1998; Sarkar e Chang, 1997). Il metodo di Hommel è più potente di quello di Hochberg, ma la differenza è solitamente piccola \n\t\ted i p-value di Hochberg sono più veloci da calcolare.\n\t\t<br/>\n\t\t<br />\n\t\tI metodi \"BH\" (alias \"fdr\") e \"BY\" di Benjamini, Hochberg e Yekutieli controllano il tasso di scoperta falsa, la proporzione attesa \n\t\tdi scoperte false tra le ipotesi respinte. Il tasso di scoperta falsa è una condizione meno rigorosa rispetto al \n\t\ttasso di errore familiare, quindi questi metodi sono più potenti degli altri.\n\t\t<br/>\n\t\t<br />\n\t\tVedi anche \n\t\t<br/>\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br/>\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br/>\n\t\t<br />\n        <b>Pacchetto</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Aiuto</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Clicca sul pulsante Aiuto R per ottenere aiuto dettagliato su R. Puoi anche inserire help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}