{
  "title": "Accordo Categoriale",
  "navigation": "Accordo Categoriale",
  "ratervars": "Variabili del Valutatore:",
  "cilevel": "Livello di Fiducia:",
  "options": "Avanzate",
  "categLabels": "Specifica facoltativamente tutte le valutazioni possibili separate da , ad es. 1,2,3,4,5 o \"basso\",\"medio\",\"alto\" ",
  "weightschkbox": "Mostra i pesi delle categorie",
  "weights": "Seleziona i pesi delle categorie",
  "N": "Dimensione della popolazione finita (se presente)",
  "help": {
    "title": "Accordo Categoriale",
    "r_help": "help(fleiss.kappa.raw, package=irrCAC)",
    "body": "\n<b>Descrizione</b></br>\nCalcola la percentuale di accordo, il kappa di Conger/Cohen, il kappa di Fleiss, l'AC1/AC2 di Gwet, l'alpha di Krippendorff e il coefficiente di Brennan-Prediger tra più valutatori (2, 3, +) quando i dati di input rappresentano le valutazioni grezze riportate per ciascun soggetto e ciascun valutatore. Versioni non pesate e pesate di queste statistiche sono disponibili, con diversi metodi di pesatura delle categorie.</br>\nI valori mancanti sono incorporati nei calcoli di accordo casuale secondo Gwet (2014).</br>\nOffriamo anche l'opzione di visualizzare i pesi delle categorie di valutazione.</br>\nPer ulteriori informazioni, vedere: </br></br>Gwet, K.L. (2014, ISBN:978-0970806284). “Manuale di Affidabilità tra Valutatori,” 4a Edizione. Advanced Analytics, LLC\n</br></br>Klein, D. (2018) doi:https://doi.org/10.1177/1536867X1801800408. “Implementazione di un quadro generale per valutare l'accordo tra valutatori in Stata,” The Stata Journal Volume 18, Numero 4, pp. 871-901.</br></br> \n<b>Utilizzo</b>\n<br/>\n<br/>\n<ul>\n<li>\n<b>Variabili del Valutatore:</b>  Variabili corrispondenti a ciascun valutatore dove ogni colonna rappresenta un valutatore e ogni riga un soggetto. Possono essere variabili numeriche, fattoriali, ordinali o carattere.</br>\n</li>\n<li>\n<b>Livello di Fiducia:</b>  Il livello di fiducia associato all'intervallo di confidenza. Il suo valore predefinito è 0.95.</br>\n</li>\n<li>\n<b>Mostra i pesi delle categorie:</b> mostra i pesi numerici per le categorie di valutatori secondo i pesi selezionati.  Il peso selezionato dovrebbe corrispondere alla vicinanza desiderata tra le categorie.\n</li>\n<li>\n<b>Seleziona i pesi delle categorie:</b> Un parametro obbligatorio che è o una variabile stringa o una matrice. La stringa descrive uno dei pesi predefiniti e deve assumere uno dei valori (\"non pesato\",\"quadratico\", \"ordinal\", \"lineare\", \"radicale\", \"rapporto\", \"circolare\", \"bipolare\"). </br>\nSe questo parametro è una matrice, deve essere una matrice quadrata qxq dove q è il numero di categorie possibili in cui un soggetto può essere classificato. Se alcune delle q categorie possibili non vengono utilizzate, è fortemente consigliato specificare l'elenco completo delle categorie possibili. Altrimenti, il programma potrebbe non funzionare.</br>\nNOTA: Specificare una matrice NON è supportato nella sintassi. È necessario incollare il codice e modificarlo per specificare una matrice.</br>\n</li>\n<li>\n<b>Dimensione della popolazione finita (se presente):</b> Parametro facoltativo che rappresenta la dimensione della popolazione (se presente). Può essere utilizzato per eseguire una correzione della popolazione finita alla varianza. Il suo valore predefinito è infinito.\n</li>\n<li>\n<b>Specifica facoltativamente tutte le valutazioni possibili:</b> Elenco facoltativo utilizzato nel caso in cui nessun valutatore utilizzi una categoria possibile. Se non viene specificato nulla, si presume che le categorie osservate siano l'intero insieme di categorie.\n</li>\n</ul>\n<b>Pacchetto R</b></br>\nirrCAC</br>\n<b>Aiuto</b></br>\nQuesta finestra di dialogo utilizza le funzioni pa.coeff.raw, conger.kappa.raw, fleiss.kappa.raw, gwet.ac1.raw, krippen.alpha.raw e bp.coeff.raw.\nPer aiuto dettagliato, vedere l'aiuto del pacchetto irrCAC nel menu a tre punti > Aiuto > Aiuto del Pacchetto R.\n"
  }
}