{
  "title": "Quantili Chi-quadrato",
  "navigation": "Quantili Chi-quadrato",
  "prob": "Inserisci le probabilità separate da una virgola. Esempio: 0.3,0.2,0.5",
  "degoffree": "Gradi di libertà",
  "labelSig": "Livello di significatività",
  "lowtail": "Coda inferiore",
  "uptail": "Coda superiore",
  "help": {
    "title": "Quantili Chi-quadrato",
    "r_help": "help(qchisq, package=stats)",
    "body": "\n            ​​\n            <b>Descrizione</b>\n            <br/>\n            Densità, funzione di distribuzione, funzione quantile e generazione casuale per la distribuzione chi-quadrato (chi^2) con df gradi di libertà e parametro di non centralità opzionale ncp.\n            <br/>\n            <b>Utilizzo</b>\n            <br/>\n            <code>\n                dchisq(x, df, ncp = 0, log = FALSE)\n                <br/>\n                pchisq(q, df, ncp = 0, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qchisq(p, df, ncp = 0, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rchisq(n, df, ncp = 0)\n                <br/>\n            </code>\n            <br/>\n            <b>Argomenti</b>\n            <br/>\n            <ul>\n                <li>x, q : vettore di quantili.</li>\n                \n                \n                <li>p : vettore di probabilità.</li>\n                \n                \n                <li>n : numero di osservazioni. Se length(n) > 1, la lunghezza è presa come quella richiesta.</li>\n                \n                \n                <li>df : gradi di libertà (non negativo, ma può essere non intero).</li>\n                \n                \n                <li>ncp : parametro di non centralità (non negativo).</li>\n                \n                \n                <li>log, log.p : logico; se TRUE, le probabilità p sono date come log(p).</li>\n                \n                \n                <li>lower.tail : logico; se TRUE (predefinito), le probabilità sono P[X ≤ x], altrimenti, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Dettagli</b>\n            <br/>\n            La distribuzione chi-quadrato con df= n ≥ 0 gradi di libertà ha densità\n            <br/>\n            <code>f_n(x) = 1 / (2^(n/2) Γ(n/2)) x^(n/2-1) e^(-x/2)</code>\n            <br/>\n            per x > 0. La media e la varianza sono n e 2n.\n            <br/>\n            La distribuzione chi-quadrato non centrale con df= n gradi di libertà e parametro di non centralità ncp = λ ha densità\n            <br/>\n            <code>f(x) = exp(-λ/2) SUM_{r=0}^∞ ((λ/2)^r / r!) dchisq(x, df + 2r)</code>\n            <br/>\n            per x ≥ 0. Per n intero, questa è la distribuzione della somma dei quadrati di n normali ciascuno con varianza uno, λ essendo la somma dei quadrati delle medie normali; ulteriormente, \n            <br/>\n             <code>E(X) = n + λ, Var(X) = 2(n + 2*λ), e E((X - E(X))^3) = 8(n + 3*λ).</code>\n             <br/>\n            Nota che i gradi di libertà df= n, possono essere non interi, e anche n = 0 che è rilevante per la non centralità λ > 0, vedere Johnson et al (1995, capitolo 29). In quel caso (non centrale, zero df), la distribuzione è una miscela di una massa puntuale in x = 0 (di dimensione pchisq(0, df=0, ncp=ncp)) e una parte continua, e dchisq() non è una densità rispetto a quella misura di miscela ma piuttosto il limite della densità per df -> 0.\n            <br/>\n            Nota che valori di ncp superiori a circa 1e5 possono dare risultati imprecisi con molti avvisi per pchisq e qchisq.\n            <br/>\n            <br/><b>Valore</b>\n            <br/>\n            dchisq fornisce la densità, pchisq fornisce la funzione di distribuzione, qchisq fornisce la funzione quantile, e rchisq genera deviazioni casuali.\n            <br/>\n            Argomenti non validi restituiranno un valore NaN, con un avviso.\n            <br/>\n            La lunghezza del risultato è determinata da n per rchisq, ed è il massimo delle lunghezze degli argomenti numerici per le altre funzioni.\n            <br/>\n            Gli argomenti numerici diversi da n vengono riciclati alla lunghezza del risultato. Solo i primi elementi degli argomenti logici vengono utilizzati.\n            <br/>\n            <br/><b>Nota</b>\n            <br/>\n            Fornire ncp = 0 utilizza l'algoritmo per la distribuzione non centrale, che non è lo stesso algoritmo utilizzato se ncp è omesso. Questo è per dare un comportamento coerente nei casi estremi con valori di ncp molto vicini a zero.\n            <br/>\n            Il codice per ncp diverso da zero è principalmente destinato ad essere utilizzato per valori moderati di ncp: non sarà altamente accurato, specialmente nelle code, per valori grandi."
  }
}