{
  "title": "Rischi Competitivi, confronta gruppi",
  "navigation": "Rischi Competitivi, confronta gruppi",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Eventi (0 = censura, 1 = evento 1, 2 = evento 2, ...)",
  "groupvarlabel": "Gruppo",
  "eventnum": "Codice Evento",
  "singleeventchkbox": "Traccia per un Singolo Evento",
  "printallest": "Tabella delle Stime Inclusa Tutti i Tempi",
  "printspecest": "Tabella delle Stime per Tempi Specifici",
  "spectimes": "Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1)",
  "styleoptions": "Opzioni di Stile",
  "axisoptions": "Opzioni degli Assi",
  "titleboxall": "Titolo del Grafico (grafici di tutti gli eventi)",
  "titleboxsingle": "Titolo del Grafico (grafico di un singolo evento)",
  "plottitlesizelabel": "Dimensione del Titolo del Grafico (5-50)",
  "themedropdown": "Tema del Grafico",
  "label1": "Legenda",
  "legendpos": "Posizione",
  "keywidthlabel": "Larghezza Chiave (cm; grafico combinato solo)",
  "legendeventslabel": "Eventi",
  "legendtitle": "Titolo",
  "eventlabels": "Etichette (specifica le etichette separate da virgole in ordine dei codici evento: ad es. 'Evento 1', 'Evento 2', ecc; non codice di censura)",
  "legendgroupslabel": "Gruppi",
  "grouplabels": "Etichette (specifica le etichette separate da virgole in ordine dei gruppi: ad es. 'Gruppo 1', 'Gruppo 2', ecc.)",
  "legendfontsize": "Dimensione Etichette Legenda (5-50)",
  "wraplabelfontsize": "Dimensione Etichetta Evento per Grafico per Evento (5-50)",
  "label2": "Numero a Rischio",
  "natriskchkbox": "Includi Numero a Rischio",
  "risktableprop": "Altezza Tabella Rischi (0-1)",
  "risktablevaluesize": "Dimensione Valore Tabella Rischi (1-15)",
  "risktabletitlesize": "Dimensione Titolo Tabella Rischi (5-50)",
  "risktableaxislabelsize": "Dimensione Etichetta Asse Tabella Rischi (5-50)",
  "risktableticklabelsize": "Dimensione Etichetta Tick Tabella Rischi (5-50)",
  "risktableclean": "Rimuovi Assi e Linee della Griglia dalla Tabella Rischi",
  "label3": "Opzioni Linea",
  "linesize": "Dimensione (0-5)",
  "colorpalette": "Palette di Colori",
  "label4": "Intervallo di Confidenza",
  "cichkbox": "Includi CI al 95%",
  "labelblank": "",
  "cistyle": "Stile",
  "citransparency": "Trasparenza (0-1)",
  "censorlabel": "Tempi Censurati",
  "censorchkbox": "Includi Tempi Censurati",
  "censorsize": "Dimensione (0-10)",
  "pvaluelabel": "P-Valore (grafico di un singolo evento solo)",
  "pvaluechkbox": "Includi p-valore",
  "pvaluelocationx": "Posizione X-Axis (Tempo)",
  "pvaluelocationy": "Posizione Y-Axis (Probabilità)",
  "pvaluesize": "Dimensione (1-20)",
  "pvalueaccuracy": "Accuratezza (0-1)",
  "label5": "Asse di Incidenza",
  "incaxislabelall": "Etichetta (grafici di tutti gli eventi)",
  "incaxislabelsingle": "Etichetta (grafico di un singolo evento)",
  "label6": "Scala",
  "defbutton": "proporzione",
  "pctbutton": "percentuale",
  "label7": "Limiti degli Assi e Incrementi delle Etichette Tick (0-1)",
  "incaxismin": "Minimo",
  "incaxismax": "Massimo",
  "incaxisinc": "Incremento",
  "label8": "Asse del Tempo",
  "timeaxislabel": "Etichetta",
  "label9": "Limiti degli Assi e Incrementi delle Etichette Tick",
  "timeaxismin": "Minimo",
  "timeaxismax": "Massimo",
  "timeaxisinc": "Incremento",
  "label10": "Nota: il massimo può essere specificato senza che l'incremento sia specificato. L'incremento non può essere specificato senza che il massimo sia specificato.",
  "axislabelsize": "Dimensione Etichetta Asse (5-50)",
  "ticklabelsize": "Dimensione Etichetta Tick Asse (5-50)",
  "help": {
    "title": "Rischi Competitivi, Confronta Gruppi",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n            <br/>\n            Un rischio competitivo è un evento la cui occorrenza preclude l'occorrenza dell'evento primario di interesse. Eseguire un'analisi standard di Kaplan-Meier in tali casi è distorto e sovrastima il rischio di evento. Questa finestra di dialogo è utilizzata per stimare il rischio cumulativo di avere l'evento primario dopo l'inizio del follow-up per quell'evento (o tempo zero), quando uno o più rischi competitivi sono presenti. La somma delle incidenze cumulative per ogni evento è uguale all'incidenza cumulativa per qualsiasi evento. I soggetti devono essere a rischio per tutti gli eventi a partire dal tempo zero. I grafici di incidenza cumulativa per tutti gli eventi (curve separate per ogni evento sullo stesso grafico), e opzionalmente per un evento specifico da solo, sono forniti. \n            <br/>\n            Un'introduzione all'argomento dei rischi competitivi può essere trovata in \"Introduzione all'Analisi dei Dati di Sopravvivenza in Presenza di Rischi Competitivi\" di Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Tempo fino all'evento o censura:</b> Per ogni soggetto, la lunghezza di tempo fino al primo evento, se è avvenuto un evento, o ultimo follow-up per eventi, se non si sono verificati eventi.\n            <br/><br/>\n            <b>Eventi:</b> Indicatore numerico di quale evento si è verificato (1=evento 1, 2=evento 2, ecc.) o quando non si sono verificati eventi (0=censura) per ogni soggetto\n            <br/><br/>\n            <b>Traccia per un Singolo Evento:</b> Se desideri tracciare l'incidenza cumulativa per un evento specifico da solo. Il <b>Codice Evento</b> corrisponde all'evento che sarà tracciato.\n            <br/><br/>\n            <b>Tabella delle Stime Inclusa Tutti i Tempi:</b> Opzione per includere una tabella che elenca le probabilità di incidenza cumulativa e gli intervalli di confidenza al 95% per ogni tempo osservato nel dataset\n            <br/>\n            <br/>\n\t\t\t<b>Tabella delle Stime per Tempi Specifici:</b> Opzione per includere una tabella che ha le probabilità di incidenza cumulativa per un insieme di tempi selezionati dall'utente.\n\t\t\t<br/><br/>\n\t\t\t<b>Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1):</b> Questi sono i tempi specifici che saranno inclusi nella tabella per tempi specifici. Possono essere specificati individualmente con virgole, o come una sequenza di valori equidistanti.\n\t\t\t<br/><br/>\t\t\t\n            Le tabelle vengono prodotte con la dimensione del campione, il numero di soggetti con ciascun evento, il tempo medio ristretto nello stato e il tempo mediano di follow-up. Il tempo mediano di follow-up è calcolato utilizzando l'estimatore di Kaplan-Meier inverso, che tratta i veri eventi come osservazioni censurate e le vere osservazioni censurate come eventi. Pertanto, l'\"evento\" in questo stimatore è \"seguire i soggetti per tutto il tempo che lo studio potrebbe\".\n            <br/>\n            Una tabella delle stime di incidenza cumulativa è fornita a ciascun tempo osservato nel dataset, con intervalli di confidenza al 95%. \n            <br/>\n            <br/>\n            <b>Pacchetti R Richiesti:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>Opzioni di Stile</b>\n            <br/>\n            <br/>\n            <b>Titolo del Grafico (grafici di tutti gli eventi):</b> Titolo dei grafici che mostrano tutti gli eventi; elimina tutto il testo per nessun titolo\n            <br/><br/>\n            <b>Titolo del Grafico (grafico di un singolo evento):</b> Titolo del grafico che mostra l'evento singolo selezionato; elimina tutto il testo per nessun titolo\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione del Titolo del Grafico:</b> Dimensione dei titoli del grafico.\n\t\t\t<br/><br/>\n            <b>Tema del Grafico:</b> Stile generale del grafico\n            <br/><br/>\n            <b>Opzioni Legenda:</b>\n            <br/>\n            L'opzione <b>Posizione</b> controlla la posizione della legenda (alto, basso, sinistra, destra). <b>Larghezza Chiave</b> viene utilizzata per cambiare la larghezza delle chiavi della legenda nel grafico che combina tutti gli eventi e tutti i gruppi. Questo può essere utilizzato per rendere i tipi di linea più leggibili nella legenda.\n\t\t\t<b>Titolo Evento</b> è il titolo per la parte della legenda che delinea gli eventi. <b>Titolo Gruppo</b> è il titolo per la parte della legenda che delinea i gruppi. Elimina il testo se non è desiderato alcun titolo. <b>Etichette Evento</b> vengono utilizzate per mostrare il testo per ciascun codice evento numerico invece dei codici. <b>Etichette Gruppo</b> vengono utilizzate per cambiare il testo per i gruppi. Se specifichi delle etichette, tutte le etichette devono essere specificate.\n\t\t\tL'opzione <b>Dimensione Etichette Legenda</b> controlla la dimensione di tutto il testo contenuto nella legenda.\n\t\t\tL'opzione <b>Dimensione Etichetta Evento per Grafico per Evento</b> controlla la dimensione del testo del nome dell'evento nel grafico che si divide per tipo di evento.\n            <br/>\n            <br/>\n            <b>Numero a Rischio:</b>\n\t\t\t<br/>\n\t\t\tOpzionalmente, includi una tabella per il numero di soggetti ancora a rischio nel tempo in fondo ai grafici. Questo non è fornito per il grafico che si divide per evento per motivi di spazio e leggibilità. L'<b>Altezza Tabella Rischi</b> controlla la proporzione dell'area di tracciamento che la tabella occuperà.\n\t\t\tL'<b>Dimensione Valore Tabella Rischi</b> controlla la dimensione dei numeri a rischio. L'<b>Dimensione Titolo Tabella Rischi</b> controlla la dimensione del titolo per la tabella del numero a rischio.\n\t\t\tL'<b>Dimensione Etichetta Asse Tabella Rischi</b> controlla la dimensione delle etichette degli assi. \n\t\t\tL'<b>Dimensione Etichetta Tick Tabella Rischi</b> controlla la dimensione delle etichette dei tick. Se si desidera rimuovere tutti gli assi e le linee della griglia \n\t\t\tdalla tabella del numero a rischio, l'opzione <b>Rimuovi Assi e Linee della Griglia dalla Tabella Rischi</b> può essere selezionata. Questo includerà solo i numeri a rischio nella tabella.           \n            <br/><br/>\n            <b>Opzioni Linea:</b>\n            <br/>\n            <b>Dimensione</b> controlla lo spessore. L'opzione <b>Palette di Colori</b> controlla la palette di colori utilizzata per le linee in tutti i grafici. Sono fornite anche schemi di colori che imitano le riviste scientifiche. Si può opzionalmente includere un intervallo di confidenza al 95% per le stime in formato <b>ribbon</b> (area ombreggiata) o <b>step</b> (linea). <b>Trasparenza</b> controlla quanto è scura la fascia ed è ignorata quando l'opzione step è selezionata.\n\t\t\t<br/><br/>\n\t\t\t<b>Includi Tempi Censurati:</b> I tempi censurati (quando i soggetti non sono più a rischio per gli eventi) possono essere inclusi come segni più sulle linee. Questo è più utile in dataset più piccoli o in casi di numeri più piccoli di soggetti censurati. Non sono forniti nel grafico che sovrappone tutti gli eventi e i gruppi per motivi di leggibilità.\n\t\t\t<b>Dimensione</b> controlla la dimensione dei segni più del tempo censurato.\n\t\t\t<br/><br/>\n\t\t\t<b>Includi p-valore</b> può essere utilizzato per includere il p-valore del test di Gray dell'evento selezionato nel grafico di un singolo evento. <b>Posizione X-Axis (Tempo)</b> e <b>Posizione Y-Axis (Probabilità)</b> forniscono le coordinate (X, Y) del p-valore nel grafico.\n\t\t\t<b>Dimensione</b> controlla la dimensione del p-valore nel grafico. <b>Accuratezza</b> controlla l'accuratezza del p-valore. Ad esempio, il valore predefinito di 0.0001 visualizzerebbe p-valori non inferiori a 0.0001. Qualsiasi p-valore inferiore a 0.0001 sarebbe visualizzato come \"p<0.0001\". \n            <br/><br/><br/>\n\t\t\t<b>Opzioni degli Assi</b>\n            <br/>\n            <br/>\n            Le opzioni <b>Etichetta</b> specificano l'etichetta di testo per l'asse. I <b>Limiti degli Assi</b> specificano i valori minimi e massimi dell'asse. L'opzione <b>Incrementi delle Etichette Tick</b> controlla la spaziatura delle etichette tick sull'asse. Gli incrementi sull'asse del tempo controllano anche i tempi per la tabella opzionale del numero a rischio.\n            <br/>\n            L'asse di incidenza <b>Scala</b> specifica se si desidera che le stime siano su una scala di proporzione (0-1) o percentuale (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione Etichetta Asse:</b> Questo controlla la dimensione delle etichette sia dell'asse di incidenza che dell'asse del tempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione Etichetta Tick Asse:</b> Questo controlla la dimensione delle etichette tick sia dell'asse di incidenza che dell'asse del tempo.\n"
  }
}