{
    "title": "Calcola i valori delle variabili del modello per raggiungere la risposta target",
    "navigation": "Calcola la risposta target",
    "label100": "Questa finestra di dialogo calcola le variabili del modello per raggiungere il valore di risposta target del modello\nNota: Se nel modello selezionato è presente una variabile non numerica,\n         il calcolo della risposta target richiederà più tempo",
    "modelSelection": "Seleziona un modello per calcolare i valori ottimali delle variabili",
    "targetResponse": "Specifica il valore di risposta target (numerico) desiderato per il modello selezionato",
    "targetResponseLower": "(Facoltativo) Specifica il valore di risposta target inferiore (numerico) desiderato per il modello selezionato",
    "targetResponseUpper": "(Facoltativo) Specifica il valore di risposta target superiore (numerico) desiderato per il modello selezionato",
    "label200": "Vincoli dell'Ottimizzatore di Risposta Target",
    "label12": "Variabili (fattori) nel modello selezionato elencate di seguito nello stesso ordine in cui appaiono nel modello",
    "factorConstraintUseDatasetLowerChk": "Vincoli di Limite Inferiore: Se selezionato, il valore minimo (solo per variabili numeriche) di ciascuna variabile utilizzata nel modello sarà utilizzato per il limite inferiore",
    "factorConstraintLower": "Vincoli di Limite Inferiore: (Ignorato se selezionato sopra) Lascia vuoto per nessun vincolo sul limite inferiore per i valori delle variabili del modello (cioè fattori). Altrimenti, devi digitare valori separati da virgola per ogni variabile del modello. Se una particolare variabile del modello non ha limite inferiore, digita -Inf e.g., 0, 0.1, -Inf, 20",
    "factorConstraintUseDatasetUpperChk": "Vincoli di Limite Superiore: Se selezionato, il valore massimo (solo per variabili numeriche) di ciascuna variabile utilizzata nel modello sarà utilizzato per il limite superiore",
    "factorConstraintUpper": "Vincoli di Limite Superiore: (Ignorato se selezionato sopra) Lascia vuoto per nessun vincolo sul limite superiore per i valori delle variabili del modello (cioè fattori). Altrimenti, devi digitare valori separati da virgola per ogni variabile del modello. Se una particolare variabile del modello non ha limite superiore, digita Inf e.g. 0, 0.2, 0.9, Inf",
    "factorInitalValues": "Valori Iniziali: Lascia vuoto per consentire al sistema di scegliere i valori iniziali per le variabili del modello (solo per variabili numeriche) (predefinito: tutti zeri). Altrimenti, devi digitare valori separati da virgola per ogni variabile del modello e.g., 0, 0, 0, 0",
    "confidenceLevel": "Livello di fiducia",
    "showModelEquationChk": "Mostra l'equazione del modello (se il modello contiene variabili categoriche, l'equazione potrebbe non essere visualizzata)",
    "help": {
      "title": "Calcola i valori delle variabili del modello (fattori) per la risposta target per il modello selezionato",
      "r_help": "help(optim, package = 'stats')",
      "body": "\n        "
    }
}