{
  "title": "Calcola i valori delle variabili del modello per raggiungere la risposta target",
  "label100": "Questa finestra di dialogo calcola le variabili del modello per raggiungere il valore della risposta target del modello\nNota: Se è presente una variabile non numerica nel modello selezionato, il calcolo della risposta target non avrà successo",
  "navigation": "Calcola la risposta target",
  "modelSelection": "Seleziona un modello per calcolare i valori ottimali delle variabili",
  "targetResponse": "Specifica il valore della risposta target (numerico) desiderato per il modello selezionato",
  "targetResponseLower": "(Opzionale) Specifica il valore inferiore della risposta target (numerico) desiderato per il modello selezionato",
  "targetResponseUpper": "(Opzionale) Specifica il valore superiore della risposta target (numerico) desiderato per il modello selezionato",
  "label200": "Vincoli per l'ottimizzazione della risposta target",
  "label12": "Variabili (fattori) nel modello selezionato elencate di seguito nello stesso ordine in cui appaiono nel modello",
  "factorConstraintUseDatasetLowerChk": "Vincoli sul limite inferiore: Se selezionato, il valore minimo di ciascuna variabile utilizzata nel modello sarà utilizzato per il limite inferiore",
  "factorConstraintLower": "Vincoli sul limite inferiore: (Ignorato se selezionato sopra) Lascia vuoto per non avere vincoli sul limite inferiore per i valori delle variabili del modello (cioè fattori). In caso contrario, devi digitare valori separati da virgola per ogni variabile del modello. Se una particolare variabile del modello non ha un limite inferiore, digita -Inf, ad esempio, 0, 0.1, -Inf, 20",
  "factorConstraintUseDatasetUpperChk": "Vincoli sul limite superiore: Se selezionato, il valore massimo di ciascuna variabile utilizzata nel modello sarà utilizzato per il limite superiore",
  "factorConstraintUpper": "Vincoli sul limite superiore: (Ignorato se selezionato sopra) Lascia vuoto per non avere vincoli sul limite superiore per i valori delle variabili del modello (cioè fattori). In caso contrario, devi digitare valori separati da virgola per ogni variabile del modello. Se una particolare variabile del modello non ha un limite superiore, digita Inf, ad esempio, 0, 0.2, 0.9, Inf",
  "factorInitalValues": "Valori iniziali: Lascia vuoto affinché il sistema scelga i valori iniziali per le variabili del modello (cioè fattori) (predefinito: tutti zeri). In caso contrario, devi digitare valori separati da virgola per ogni variabile del modello, ad esempio, 0, 0, 0, 0",
  "help": {
    "title": "Calcola i valori delle variabili del modello (fattori) per la risposta target per il modello selezionato",
    "r_help": "help(optim, package = 'stats')",
    "body": "\n        "
  }
}