{
  "title": "Confronta N Modelli",
  "navigation": "Confronta N Modelli",
  "label1": "Confronta N modelli.",
  "label2": "Seleziona modelli delle seguenti classi (la classe R è tra parentesi qui sotto)",
  "label3": "Modelli lineari (lm), Modello lineare generalizzato (glm), Modello ad effetti misti lineari (lme), Regressione logistica ordinata o Probit (polr), Modello di rischio proporzionale (coxph), Modello lineare usando i minimi quadrati generalizzati (gls), Modello di regressione di sopravvivenza (survreg), Adattamento di regressione polinomiale locale (loess), Modello non lineare a minimi quadrati (nls), Modelli log-lineari multinomiali (multinom)",
  "label4": "**NOTA: I modelli creati da Model Tuning (classe train) non sono supportati",
  "modelselector1": "Seleziona uno o più modelli da confrontare:",
  "help": {
    "title": "Confronta N Modelli",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>\nConfronta 2 modelli nidificati utilizzando un test F o un test Chi-quadro a seconda della stima. I test F sono utilizzati per la stima dei minimi quadrati, i test Chi-quadro sono utilizzati per la stima della massima verosimiglianza. Entrambi i modelli devono essere creati sullo stesso dataset poiché differenze nei valori mancanti possono causare problemi</b></br>\n<b>Descrizione</b></br>\nTabelle Anova: Calcola tabelle di analisi della varianza e esegue test del rapporto di verosimiglianza per un oggetto modello adattato.  \n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nobject:  un oggetto contenente i risultati restituiti da una funzione di adattamento del modello (ad es., lm o glm).\n</li>\n</ul>\n<b>Valore</b><br/>\nQuesta funzione (generica) restituisce un oggetto di classe anova. Questi oggetti rappresentano tabelle di analisi della varianza e di analisi della devianza. Quando viene fornito un singolo argomento, produce una tabella che testa se i termini del modello sono significativi. Quando viene fornita una sequenza di oggetti, anova testa i modelli l'uno contro l'altro nell'ordine specificato.<br/>\nIl metodo di stampa per gli oggetti anova stampa tabelle in una forma 'carina'.<br/>\n<b>Avviso</b><br/>\nIl confronto tra due o più modelli sarà valido solo se sono adattati allo stesso dataset. Questo può essere un problema se ci sono valori mancanti e il valore predefinito di R di na.action = na.omit è utilizzato.<br/>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nPer un aiuto dettagliato clicca sull'icona R nell'angolo in alto a destra di questo overlay di dialogo o esegui il seguente comando nell'editor di sintassi R help(anova,package='stats')</br></br>\n<b>Descrizione</b></br>\nTest del Rapporto di Verosimiglianza di Modelli Nidificati: lrtest è una funzione generica per eseguire test del rapporto di verosimiglianza. Il metodo predefinito può essere impiegato per confrontare modelli lineari (generalizzati) nidificati (vedi dettagli qui sotto).\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Metodo S3 predefinito:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Metodo S3 per classe 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nobject: un oggetto. Vedi sotto per dettagli.\n</li>\n<li>\n...: ulteriori specifiche degli oggetti passati ai metodi. Vedi sotto per dettagli.\n</li>\n<li>\nname: una funzione per estrarre un nome/descrizione adeguata da un oggetto modello adattato. Per impostazione predefinita, il nome viene interrogato chiamando formula.\n</li>\n<li>\ndata: un dataframe contenente le variabili nel modello.\n</li>\n</ul>\n<b>Dettagli</b></br>\nlrtest è inteso come una funzione generica per confronti di modelli tramite test del rapporto di verosimiglianza asintotici. Il metodo predefinito confronta consecutivamente l'oggetto modello adattato con i modelli passati in .... Invece di passare gli oggetti modello adattati in ..., sono possibili diverse altre specifiche. Il meccanismo di aggiornamento è lo stesso di waldtest: i modelli in ... possono essere specificati come interi, caratteri (entrambi per termini che dovrebbero essere eliminati dal modello precedente), formule di aggiornamento o oggetti modello adattati. Ad eccezione dell'ultimo caso, si presume l'esistenza di un metodo di aggiornamento. Vedi waldtest per dettagli.<br/>\nSuccessivamente, viene eseguito un test del rapporto di verosimiglianza asintotico per ciascuno dei due modelli consecutivi: Due volte la differenza nei log-likelihood (come derivato dai metodi logLik) viene confrontata con una distribuzione Chi-quadro.<br/>\nIl metodo \"formula\" adatta prima un lm e poi chiama il metodo predefinito.<br/>\n<b>Valore</b><br/>\nUn oggetto di classe \"anova\" che contiene il log-likelihood, i gradi di libertà, la differenza nei gradi di libertà, la statistica Chi-quadro del rapporto di verosimiglianza e il corrispondente valore p.\n<b>Esempi</b><br/>\n<code> \n## con dati di Greene (1993):<br/>\n## carica i dati e calcola i lag<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## varie specifiche equivalenti del test LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
  }
}