{
  "title": "Rischi Competitivi, un gruppo",
  "navigation": "Rischi Competitivi, un gruppo",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Eventi (0 = censura, 1 = evento 1, 2 = evento 2, ...)",
  "eventnum": "Codice Evento",
  "singleeventchkbox": "Traccia per un Singolo Evento",
  "printallest": "Tabella delle Stime Inclusa Tutti i Tempi",
  "printspecest": "Tabella delle Stime per Tempi Specifici",
  "spectimes": "Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1)",
  "styleoptions": "Opzioni di Stile",
  "axisoptions": "Opzioni degli Assi",
  "label12": "Clicca sul pulsante ? in alto a destra della finestra di dialogo per dettagli sui dataset di esempio e sul formato dei dati supportato.",
  "titleboxall": "Titolo del Grafico (grafico di tutti gli eventi)",
  "titleboxsingle": "Titolo del Grafico (grafico di un singolo evento)",
  "plottitlesizelabel": "Dimensione del Titolo del Grafico (5-50)",
  "themedropdown": "Tema del Grafico",
  "label1": "Legenda (grafico di tutti gli eventi)",
  "legendpos": "Posizione",
  "legendtitle": "Titolo",
  "eventlabels": "Etichette degli Eventi (specifica le etichette separate da virgole in ordine dei codici evento: ad es. 'Evento 1', 'Evento 2', ecc; non codice di censura)",
  "legendfontsize": "Dimensione delle Etichette della Legenda (5-50)",
  "label2": "Numero a Rischio",
  "natriskchkbox": "Includi Numero a Rischio",
  "risktableprop": "Altezza della Tabella dei Rischi (0-1)",
  "risktablevaluesize": "Dimensione del Valore della Tabella dei Rischi (1-15)",
  "risktabletitlesize": "Dimensione del Titolo della Tabella dei Rischi (5-50)",
  "risktableaxislabelsize": "Dimensione dell'Etichetta dell'Asse della Tabella dei Rischi (5-50)",
  "risktableticklabelsize": "Dimensione dell'Etichetta dei Tick della Tabella dei Rischi (5-50)",
  "risktableclean": "Rimuovi Assi e Linee della Griglia dalla Tabella dei Rischi",
  "label3": "Opzioni della Linea",
  "linesize": "Dimensione (0-5)",
  "colorpalette": "Palette di Colori (grafico di tutti gli eventi)",
  "linecolor": "Colore (grafico di un singolo evento)",
  "label4": "Intervallo di Confidenza",
  "cichkbox": "includi CI al 95%",
  "labelblank": "",
  "cistyle": "Stile",
  "citransparency": "Trasparenza (0-1)",
  "censorchkbox": "Includi Tempi Censurati",
  "label5": "Asse di Incidenza",
  "incaxislabelall": "Etichetta (grafico di tutti gli eventi)",
  "incaxislabelsingle": "Etichetta (grafico di un singolo evento)",
  "label6": "Scala",
  "defbutton": "proporzione",
  "pctbutton": "percentuale",
  "label7": "Limiti degli Assi e Incrementi dei Tick (0-1)",
  "incaxismin": "Minimo",
  "incaxismax": "Massimo",
  "incaxisinc": "Incremento",
  "label8": "Asse del Tempo",
  "timeaxislabel": "Etichetta",
  "label9": "Limiti degli Assi e Incrementi dei Tick",
  "timeaxismin": "Minimo",
  "timeaxismax": "Massimo",
  "timeaxisinc": "Incremento",
  "label10": "Nota: il massimo può essere specificato senza che l'incremento sia specificato. L'incremento non può essere specificato senza che il massimo sia specificato.",
  "axislabelsize": "Dimensione dell'Etichetta dell'Asse (5-50)",
  "ticklabelsize": "Dimensione dell'Etichetta dei Tick dell'Asse (5-50)",
  "help": {
    "title": "Rischi Competitivi, Un Gruppo",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n\t\t\tVedi il dataset di esempio nella directory di installazione, la posizione predefinita è nella lettera dell'unità:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\melanoma_upd.RData. La variabile tempo deve essere inserita come tempo fino all'evento o censura e la variabile morte deve essere inserita come Eventi.<br/>\t\t\t\n            Questo dataset è una versione aggiornata del dataset melanoma nel pacchetto MASS.\n            <br/>\n            <br/>\n            Un rischio competitivo è un evento la cui occorrenza preclude l'occorrenza dell'evento primario di interesse. Eseguire un'analisi standard di Kaplan-Meier in tali casi è distorto e sovrastima il rischio di evento. Questa finestra di dialogo è utilizzata per stimare il rischio cumulativo di avere l'evento primario dopo l'inizio del follow-up per quell'evento (o tempo zero), quando sono presenti uno o più rischi competitivi. La somma delle incidenze cumulative per ciascun evento è uguale all'incidenza cumulativa per qualsiasi evento. I soggetti devono essere a rischio per tutti gli eventi a partire dal tempo zero. I grafici delle incidenze cumulative per tutti gli eventi (curve separate per ciascun evento sullo stesso grafico), e facoltativamente per un evento specifico da solo, sono forniti. \n            <br/>\n            Un'introduzione all'argomento dei rischi competitivi può essere trovata in \"Introduzione all'Analisi dei Dati di Sopravvivenza in Presenza di Rischi Competitivi\" di Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Tempo fino all'evento o censura:</b> Per ciascun soggetto, la lunghezza del tempo fino al primo evento, se è avvenuto un evento, o l'ultimo follow-up per eventi, se non si sono verificati eventi.\n            <br/><br/>\n            <b>Eventi:</b> Indicatore numerico di quale evento si è verificato (1=evento 1, 2=evento 2, ecc.) o quando non si sono verificati eventi (0=censura) per ciascun soggetto\n            <br/><br/>\n            <b>Traccia per un Singolo Evento:</b> Se desideri tracciare l'incidenza cumulativa per un evento specifico da solo. Il <b>Codice Evento</b> corrisponde all'evento che sarà tracciato.\n            <br/><br/>\n            <b>Tabella delle Stime Inclusa Tutti i Tempi:</b> Opzione per includere una tabella che elenca le probabilità di incidenza cumulativa e gli intervalli di confidenza al 95% per ogni tempo osservato nel dataset\n            <br/>\n            <br/>\n\t\t\t<b>Tabella delle Stime per Tempi Specifici:</b> Opzione per includere una tabella che ha le probabilità di stima di sopravvivenza per un insieme di tempi selezionati dall'utente.\n\t\t\t<br/><br/>\n\t\t\t<b>Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1):</b> Questi sono i tempi specifici che saranno inclusi nella tabella per tempi specifici. Possono essere specificati individualmente con virgole, o come una sequenza di valori equidistanti.\n\t\t\t<br/><br/>\n            Le tabelle vengono restituite con la dimensione del campione, il numero di soggetti con ciascun evento, il tempo medio ristretto nello stato e il tempo mediano di follow-up. Il tempo mediano di follow-up è calcolato utilizzando l'estimatore di Kaplan-Meier inverso, che tratta i veri eventi come osservazioni censurate e le vere osservazioni censurate come eventi. Pertanto, l'\"evento\" in questo stimatore è \"seguire i soggetti per tutto il tempo che lo studio potrebbe\".\n            <br/>\n            Una tabella delle stime di incidenza cumulativa è fornita a ciascun tempo osservato nel dataset, con intervalli di confidenza al 95%. \n            <br/>\n            <br/>\n            <b>Pacchetti R Richiesti:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n            <br/>\n            <br/>\n            <br/>\n            <b>Opzioni di Stile</b>\n            <br/>\n            <br/>\n            <b>Titolo del Grafico (grafico di tutti gli eventi):</b> Titolo del grafico che mostra tutti gli eventi; elimina tutto il testo per nessun titolo\n            <br/><br/>\n            <b>Titolo del Grafico (grafico di un singolo evento):</b> Titolo del grafico che mostra l'evento singolo selezionato; elimina tutto il testo per nessun titolo\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione del Titolo del Grafico:</b> Dimensione dei titoli del grafico.\n\t\t\t<br/><br/>\n            <b>Tema del Grafico:</b> Stile generale del grafico\n            <br/><br/>\n            <b>Opzioni della Legenda:</b>\n            <br/>\n            L'opzione <b>Posizione</b> controlla la posizione della legenda (alto, basso, sinistra, destra). Il <b>Titolo</b> è il titolo della legenda. Per rimuovere il titolo, rimuovi tutto il testo dalla casella di testo. Le <b>Etichette degli Eventi</b> vengono utilizzate per mostrare il testo per ciascun codice evento numerico invece dei codici. Se specifichi delle etichette, tutti gli eventi devono essere etichettati.\n\t\t\tL'opzione <b>Dimensione delle Etichette della Legenda</b> controlla la dimensione di tutto il testo contenuto nella legenda.\n            <br/>\n            <br/>\n            <b>Numero a Rischio:</b>\n\t\t\t<br/>\n\t\t\tOpzionalmente, includi una tabella per il numero di soggetti ancora a rischio nel tempo in fondo ai grafici. L'<b>Altezza della Tabella dei Rischi</b> controlla la proporzione dell'area di tracciamento che la tabella occuperà.\n\t\t\tL'<b>Dimensione del Valore della Tabella dei Rischi</b> controlla la dimensione dei numeri a rischio. L'<b>Dimensione del Titolo della Tabella dei Rischi</b> controlla la dimensione del titolo per la tabella del numero a rischio.\n\t\t\tL'<b>Dimensione dell'Etichetta dell'Asse della Tabella dei Rischi</b> controlla la dimensione delle etichette degli assi. \n\t\t\tL'<b>Dimensione dell'Etichetta dei Tick della Tabella dei Rischi</b> controlla la dimensione delle etichette dei tick. Se si desidera rimuovere tutti gli assi e le linee della griglia \n\t\t\tdalla tabella del numero a rischio, l'opzione <b>Rimuovi Assi e Linee della Griglia dalla Tabella dei Rischi</b> può essere selezionata. Questo includerà solo i numeri a rischio nella tabella.           \n            <br/><br/>\n            <b>Opzioni della Linea:</b>\n            <br/>\n            <b>Dimensione</b> controlla lo spessore. Le opzioni <b>Colore</b> controllano la palette di colori utilizzata per le linee nel grafico di tutti gli eventi e il colore della linea nel grafico di un singolo evento. Sono fornite anche schemi di colori che imitano le riviste scientifiche. Si può opzionalmente includere un intervallo di confidenza al 95% per le stime in formato <b>ribbon</b> (area ombreggiata) o <b>step</b> (linea). La <b>Trasparenza</b> controlla quanto è scura la fascia ed è ignorata quando l'opzione step è selezionata.\n\t\t\t<br/><br/>\n\t\t\t<b>Includi Tempi Censurati:</b> I tempi censurati (quando i soggetti non sono più a rischio per gli eventi) possono essere inclusi come un rug vicino all'asse del tempo di entrambi i grafici. Questo è più utile in dataset più piccoli o in casi di numeri minori di soggetti censurati.\n            <br/><br/><br/>\n\t\t\t<b>Opzioni degli Assi</b>\n            <br/>\n            <br/>\n            L'opzione <b>Etichetta</b> specifica l'etichetta di testo per l'asse. I <b>Limiti degli Assi</b> specificano i valori minimi e massimi dell'asse. L'opzione <b>Incrementi dei Tick Mark</b> controlla la spaziatura dei tick sull'asse. Gli incrementi sull'asse del tempo controllano anche i tempi per la tabella opzionale del numero a rischio.\n            <br/>\n            L'opzione <b>Scala</b> dell'asse di incidenza specifica se si desidera che le stime siano su una scala di proporzione (0-1) o percentuale (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione dell'Etichetta dell'Asse:</b>  Questo controlla la dimensione delle etichette degli assi di incidenza e tempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione dell'Etichetta dei Tick Mark dell'Asse:</b>  Questo controlla la dimensione delle etichette dei tick mark degli assi di incidenza e tempo.\t\t\t\t\n      "
  }
}