{
  "title": "Carattere da Data e Ora",
  "navigation": "Carattere da Data e Ora",
  "labelInfo": "Se la conversione della variabile carattere di data, ora o data e ora in tipo di dato solo data o data e ora ha successo, verrà sempre creata la nuova variabile di data con formato YYYY-MM-DD se è disponibile solo la data, e YYYY-MM-DD HH:MM:SS, o YYYY-MM-DD HH:MM:SS.xxx con xxx millisecondi se è disponibile l'ora",
  "label1": "Seleziona un suffisso o un prefisso per la variabile convertita",
  "suffix": "Suffisso",
  "prefix": "Prefisso",
  "prefixOrSuffix": "Inserisci un prefisso o un suffisso",
  "Destination": "Seleziona la variabile carattere da convertire in data",
  "DateFormat": "Specifica il formato per la parte data della variabile carattere selezionata, ad es. solo data come 2024-10-07 o data e ora come 2024-10-07 16:34:56 (lascia vuoto se non è disponibile alcun elemento di data)",
  "TimeFormat": "Specifica il formato per la parte ora della variabile carattere selezionata, ad es. data e ora inclusi i millisecondi come 2024-10-07 16:34:56.789 o solo ora come 16:34:56 (lascia vuoto se non è disponibile alcun elemento di ora)",
  "TimeZone": "Seleziona un fuso orario (predefinito - niente selezionato è il fuso orario locale del PC)",
  "missingYear": "Anno mancante: se l'anno è mancante nella variabile carattere di data, digita l'anno, ad es. 2024. Lascia vuoto per utilizzare l'anno corrente",
  "missingMonth": "Mese mancante: se il mese è mancante nella variabile carattere di data, digita il mese, ad es. 03, Mar, o Marzo per Marzo. Lascia vuoto per utilizzare il mese corrente",
  "missingDay": "Giorno mancante: se il giorno è mancante nella variabile carattere di data, digita il giorno del mese, ad es. 17. Lascia vuoto per utilizzare oggi",
  "missingHour": "Ora mancante: se l'ora è mancante nella variabile carattere di data/ora, digita l'ora, ad es. 7 o 16. Lascia vuoto per utilizzare l'ora corrente",
  "missingMinute": "Minuto mancante: se il minuto è mancante nella variabile carattere di data/ora, digita il minuto, ad es. 10 o 35. Lascia vuoto per utilizzare il minuto corrente",
  "missingSeconds": "Secondi mancanti: se i secondi sono mancanti nella variabile carattere di data/ora, digita i secondi, ad es. 17 o 59. Lascia vuoto per utilizzare i secondi correnti",
  "help": {
    "title": "Converti caratteri di data parziali o completi in tipo di dato Data",
    "r_help": "help(package=\"lubridate\")",
    "body": "\n\t\t\t<b>Descrizione</b></br>\n\t\t\tConverte una stringa carattere di data, ora o data e ora con elementi di data e ora parziali o completi, cioè, elementi di data come anno, mese e giorno del mese in un tipo di dato data (classe POSIXct) o solo l'ora come Ore Min Sec Millisec, Ore Min Sec, .. in un tipo di dato data completo (classe POSIXct).\n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tSeleziona un formato dall'elenco possibile di formati dai formati di data se sono disponibili solo elementi di data nella stringa carattere selezionata\n\t\t\t<br/> \n\t\t\tSeleziona un formato di ora dall'elenco possibile di formati di ora se sono disponibili solo elementi di ora nella stringa carattere selezionata\n\t\t\t<br/>\n\t\t\tSeleziona sia i formati di data che di ora dall'elenco di selezione dei formati di data e ora se sono disponibili sia elementi di data che di ora nella stringa carattere selezionata\n\t\t\t<br/>\n\t\t\tSeleziona il formato appropriato che rappresenta la stringa carattere di data e ora (cioè, ordine e presenza/assenza di mese, giorno o anno o ora, min, secondi o millisecondi)\n\t\t\t<br/>\n\t\t\tMolti passaggi di preparazione della stringa vengono eseguiti internamente prima di chiamare le funzioni dal pacchetto lubridate per convertire la stringa di data, ora o data e ora carattere preparata in una nuova variabile di data POSIXct.\n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tOPZIONI\n\t\t\t<br/>\n\t\t\tEspandi le OPZIONI per affinare ulteriormente se utilizzare l'anno, il mese o oggi corrente se gli elementi di anno, mese o data sono assenti nella variabile stringa di data carattere o ora corrente, minuto, secondi se uno o più elementi di ora sono mancanti dalla stringa di ora carattere.\n\t\t\t<br/>\n\t\t\t<br/> \n\t\t\tScelte di formattazione della data per la variabile stringa di data carattere selezionata sono:\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tmese giorno:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene solo il mese seguito da un giorno e nessun anno, come 03/17, 05-25, Mar,15 , Mag-21, ...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tgiorno mese:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene solo il giorno seguito dal mese e nessun anno, come 17/03, 25-05, 15,Mar , 21-Mag,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tmese anno:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene solo il mese seguito dall'anno e nessun giorno del mese, come 03/2024, 05-2020, Mar,2023 , Lug-2018,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tanno mese:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene solo l'anno seguito dal mese e nessun giorno del mese, come 2024/03, 2020-05, 2023,Mar, 2018-Lug,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tsolo anno:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene solo l'anno e nessun giorno o mese, come 2020, 2024, 1995, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tsolo mese:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene solo il mese e nessun giorno o anno, come 03, 11, Mar, Novembre, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tsolo giorno:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene solo il giorno e nessun mese o anno, come giorno del mese come 03, 17, 28, o giorno della settimana come Lun, Sabato, ....\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tanno mese giorno:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene anno, seguito da mese e giorno come 2024/03/22, 2020-05-19, 2019,Mar,26,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tmese giorno anno:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene il mese, seguito dal giorno e dall'anno, come 03/22/2024, 05-19-2020, Mar,26,2019,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tgiorno mese anno:\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data carattere selezionata contiene un giorno, seguito da un mese e anno, come 22/03/2024, 19-05-2020, 26 Marzo 2019,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tScelte di formattazione dell'ora per la variabile stringa di data carattere selezionata sono:\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tOre Min Sec\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data/ora carattere selezionata contiene Ore, seguite da Minuti e Secondi, come 22/03/2024 17:15:48, o solo ora come 17:15:48,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tOre Min Sec Millisec (o Microsec)\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data/ora carattere selezionata contiene Ore, seguite da Minuti, Secondi e Millisecondi, o Microsecondi, come 22/03/2024 17:15:48.784, o solo ora come 17:15:48.784,17:15:48.784239,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMin Sec Millisec (o Microsec)\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di ora carattere selezionata contiene Minuti, Secondi e Millisecondi, o Microsecondi, come solo ora 15:48.784,15:48.784239... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tOre Min \n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di data/ora carattere selezionata contiene Ore, seguite da Minuti, come 22/03/2024 17:15, o solo ora 17:15,...\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMin Sec\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di ora carattere selezionata contiene Minuti e Secondi come ora 15:48,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tSec Millisec (o Microsec)\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di ora carattere selezionata contiene Secondi e Millisecondi, o Microsecondi, come ora 48.784, 55.784239,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tOre solo \n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di ora carattere selezionata contiene solo Ore come ora 10, 14, o 22,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMin solo\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di ora carattere selezionata contiene solo Minuti come ora 10, 29, 44, o 59,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tSec solo\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di ora carattere selezionata contiene solo Secondi come ora 10, 29, 44, o 59,... \n\t\t\t</br>\n\t\t\t</br>\t\n\t\t\tMillisec solo\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di ora carattere selezionata contiene solo Millisecondi come ora 10, 290, 448, o 759,... \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMicrosec solo\n\t\t\t</br>\n\t\t\tScegli questo quando la stringa di ora carattere selezionata contiene solo Microsecondi come ora 101, 2901, 448890, o 759123,... \n\t\t\t</br>\n\t\t\t</br>\n<b>Aiuto</b></br>\nhelp(package=\"lubridate\")\n"
  }
}