{
  "title": "Grafico Coxcomb",
  "navigation": "Coxcomb",
  "x": "Variabile(i) asse X, specificare una variabile fattoriale",
  "y": "Variabile Y, specificare una variabile numerica",
  "fill": "Riempimento, specificare una variabile fattoriale",
  "alpha": "Opacità (0-1)",
  "width": "Larghezza",
  "rdgrp1": "Proporzioni di riempimento",
  "flip": "Capovolgi asse",
  "barcolor": "Colore della barra (Dopo la selezione del colore, clicca al di fuori del controllo per applicare)",
  "specify_a_title": "Inserisci un titolo",
  "x_title": "Etichetta asse X",
  "y_title": "Etichetta asse Y",
  "Facetrow": "Riga Facet",
  "Facetcolumn": "Colonna Facet",
  "Facetwrap": "Avvolgi Facet",
  "Facetscale": "Scala Facet",
  "facets_lbl": "Facets",
  "help": {
    "title": "Grafico Coxcomb",
    "r_help": "help(coord_polar, package='ggplot2')",
    "body": "\n            <b>Descrizione</b></br>\nUn grafico Coxcomb/Bulls Eye (o un grafico circolare) è un grafico statistico circolare, che è diviso in fette/cerchi concentrici per illustrare la proporzione numerica. In un grafico Coxcomb/Bulls Eye, la lunghezza della larghezza di ciascun cerchio concentrico (e di conseguenza la sua area) è proporzionale alla quantità che rappresenta. La quantità può essere rappresentata come un conteggio o una percentuale.</br>​\nI Facets possono essere creati opzionalmente specificando una variabile fattoriale. Puoi anche specificare opzionalmente temi e specificare un titolo e etichette per gli assi x e y.</br>\nQuando specifichi più variabili x, creiamo un grafico Coxcomb/Bulls eye separato per ogni variabile x.</br>\n<b>Utilizzo</b>\n<br/>\n<code>\n#Puoi creare un grafico Bulls Eye per una singola variabile fattoriale, verrà creato un cerchio concentrico per ogni livello della variabile fattoriale. La larghezza del cerchio concentrico è proporzionale ai conteggi di ciascun livello della variabile fattoriale. Qui la variabile fattoriale corrisponderà al riempimento come di seguito<br/>\n#penguins è un dataset nel pacchetto R equatiomatic\nggplot(data=penguins,aes(x ='',fill=species)) +​\n                 geom_bar(alpha=1,width =0.9) +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"Conteggio\",fill =\"var1\",title= \"Grafico Bulls Eye con Riempimento: specie\")​</br></br>\n#Puoi creare un grafico Bulls Eye specificando una variabile scala/numerica come variabile y e una variabile fattoriale che funge da riempimento. Qui viene creato un cerchio concentrico per ogni livello della variabile fattoriale di riempimento. La larghezza del cerchio concentrico è proporzionale alla somma dei valori y a ciascun livello della variabile fattoriale. Qui la variabile fattoriale corrisponderà al riempimento come di seguito<br/>\nggplot(data=penguins,aes(x ='', y = bill_length_mm, fill = species)) +​\n                 geom_bar(alpha=1,width =0.9,stat=\"identity\") +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"var1\",fill =\"var2\",title= \"Grafico Bulls Eye con Estetica X:, Estetica Y: var1, Riempimento: var2\") </br></br>\n\n#Puoi creare un grafico Coxcomb specificando una variabile x. Le fette vengono create per ogni livello della variabile x, il raggio di ciascuna fetta è proporzionale al conteggio<br/>\n    ggplot(data=penguins, aes(x=island, )) +\n        geom_bar( alpha=1,width=1,) +\n        coord_polar(\"x\") +\n        labs(x=\"island\",  title= \"Grafico Coxcomb con Estetica X: island\") +\n        xlab(\"island\") + ylab(\"Conteggio\")</br></br>\n\n#Puoi generare un grafico Coxcomb specificando una variabile X e un riempimento. Le fette vengono create per ogni livello della variabile x. Ogni fetta è riempita dal conteggio dei casi in ciascun livello della variabile di riempimento specificata.\nggplot(data=penguins, aes(x=island,fill=species )) +\n\tgeom_bar( alpha=1, width=1) +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\",  title= \"Grafico Coxcomb con Estetica X: island riempimento: species\") +\n\txlab(\"island\") + ylab(\"Conteggio\")</br></br>\n\n\n#Puoi creare un grafico Coxcomb specificando una variabile x, una variabile y e un riempimento. Le fette vengono create per ogni livello della variabile x e riempite dalla somma dei valori della variabile y per ciascun livello della variabile specificata nel riempimento. Le fette sono divise per livelli della variabile di riempimento. L'area occupata da ciascun livello della variabile di riempimento all'interno della fetta è proporzionale alla somma dei conteggi della variabile y che corrispondono alla fetta e alla variabile di riempimento.<br/>\nggplot(data=penguins, aes(x=island,y=bill_depth_mm,fill=species )) +\n\tgeom_bar( alpha=1,width=1,stat = \"identity\") +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\", y=\"bill_depth_mm\", title= \"Grafico Coxcomb con Estetica X: island Estetica Y: bill_depth_mm riempimento: species\") +\n\txlab(\"island\") + ylab(\"bill_depth_mm\")</br></br>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\ndata: Il dataset predefinito​\n</li>\n<li>\naes(): Genera mappature estetiche che descrivono come le variabili nei dati sono mappate alle proprietà visive (estetiche) dei geoms.​\n</li>\n<li>\nx: (Opzionale) Una variabile fattoriale/categorica. La lunghezza della barra corrisponde ai conteggi di ciascun livello della variabile fattoriale.​\n</li>\n<li>\nY: (Opzionale) una variabile numerica\n</li>\n<li>\nfill: (Opzionale) Una variabile fattoriale/categorica opzionale per raggruppare i conteggi dei livelli in x: (vedi sopra)​\n</li>\n<li>\ngeom_bar(): Crea il grafico a barre, position =\"fill\" riempie la barra con una percentuale di ciascun livello di raggruppamento.​\n</li>\n<li>\nCoor_polar(): Il sistema di coordinate polari è comunemente usato per i grafici a torta, che sono un grafico a barre impilato in coordinate polari.\n</li>\n<li>\nLabs(): Cambia le etichette degli assi e i titoli della legenda (questo è opzionale)​\n</li>\n<li>\nfacet_grid(): Dispone i pannelli in una griglia (questo è opzionale)​\n</li>\n<li>\ntheme_calc(): Specifica il tema del calcolatore (questo è opzionale)​\n</li>\n<li>\ncoord_flip(): Capovolgi asse (questo è opzionale)​\n</li>\n<li>\nalpha: Controlla l'opacità, assume valori tra 0-1. 1 significa nessuna opacità.\n</li>\n</ul>\n<b>Pacchetto</b></br>\nggplot2;ggthemes;</br>\n<b>Aiuto</b></br>\nhelp(coord_polar, package=ggplot2)</br>\nAltro: Clicca sul pulsante Aiuto R per ottenere aiuto dettagliato su R. Puoi anche inserire help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n    "
  }
}