{
  "title": "Cox, Fine-Gray",
  "navigation": "Cox, Fine-Gray",
  "modelname": "Inserisci il nome del modello",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Eventi (0 = censura, 1 = evento 1, 2 = evento 2, ...)",
  "eventcodelabel": "Codice Evento",
  "modelterms": "Costruttore di espressioni del modello per variabili indipendenti",
  "stratavarslabel": "Variabili di Stratificazione (opzionale)",
  "weightvar": "Pesi (opzionale)",
  "tiemethod": "Metodo del Tempo Legato",
  "diagnosticsbox": "Diagnostica del Modello",
  "martminlabel": "Valore Minimo dell'Asse dei Residui Martingale del Modello Nullo (-Inf a 1)",
  "anovachkboxlabel": "Analisi della Deviance (Tipo II)",
  "help": {
    "title": "Cox, Fine-Gray",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nAdatta un modello di rischi proporzionali di Fine-Gray per dati di tempo fino all'evento con osservazioni censurate quando sono presenti rischi concorrenti. I modelli di Fine-Gray modellano l'effetto delle \nvariabili sui funzioni di incidenza cumulativa. Un'alternativa è modellare l'effetto delle variabili sul rischio specifico della causa, per il quale possono essere utilizzati modelli di regressione Cox standard. \nUn'introduzione all'argomento dei rischi concorrenti può essere trovata in \"Introduzione all'Analisi dei Dati di Sopravvivenza in Presenza di Rischi Concorrenti\" di Peter Austin, \net. al., Circulation, 2016; 133:601-609. \n<br/><br/>\nStatistiche di adattamento del modello, stime dei parametri e rapporti di rischio sono forniti. Le opzioni disponibili includono il metodo del tempo legato e la diagnostica del modello. Il modello è adattato utilizzando le \nfinegray e coxph funzioni nel pacchetto survival.\n<br/><br/>\n<b>Inserisci il nome del modello:</b> Specifica il nome del modello dove i risultati saranno memorizzati.\n<br/><br/>\n<b>Tempo fino all'evento o censura:</b> Tempo fino al primo evento per coloro che sperimentano un evento o tempo fino all'ultimo follow-up per coloro che non sperimentano alcun evento\n<br/><br/>\n<b>Eventi (0 = censura, 1 = evento 1, 2 = evento 2, ...):</b> Indicatore numerico dell'evento; 0=censura, 1=evento 1, 2=evento 2, ecc.\n<br/><br/>\n<b>Codice Evento:</b> Seleziona l'evento di interesse che desideri modellare. Può essere selezionato o digitato.\n<br/><br/>\n<b>Costruttore di Formula:</b> Costruisci termini da includere nel modello. Fattori, stringhe e variabili logiche saranno codificate in modo fittizio. I pulsanti forniti ti consentono di specificare effetti principali, effetti fattoriali completi (effetti principali e tutte le interazioni con le variabili coinvolte), polinomi, interazioni specifiche e eliminare termini dall'elenco. Le interazioni \ncon le variabili di stratificazione sono consentite.\n<br/><br/>\n<b>Variabili di Stratificazione:</b> Specifica una o più variabili di stratificazione. Queste possono essere variabili numeriche, fattoriali, fattoriali ordinate o variabili carattere. Gli strati dividono i \nsoggetti in gruppi separati in cui ogni gruppo ha una funzione di rischio di base distinta. Se vengono fornite più variabili di stratificazione, viene utilizzata una funzione di rischio di base separata per ogni combinazione di livelli delle variabili di stratificazione.\n<br/><br/>\n<b>Pesi:</b> Variabile numerica per i pesi delle osservazioni. Utile in situazioni in cui ogni record non dovrebbe essere conteggiato come un'osservazione. \n<br/><br/>\n<b>Metodo del Tempo Legato:</b> Metodo per rompere i tempi osservati legati. Efron è solitamente la scelta migliore quando non ci sono molti tempi legati.\n<br/><br/>\n<b>Diagnostica del Modello:</b> Se selezionato, verrà valutata una valutazione dei rischi proporzionali e della forma funzionale delle variabili, inclusi i grafici pertinenti. \nSe ci sono variabili di stratificazione o predittori non numerici, i grafici della forma funzionale non verranno prodotti. \nIl <b>Valore Minimo dell'Asse dei Residui Martingale del Modello Nullo</b> potrebbe dover essere cambiato per vedere tutti i residui Martingale.\n<br/><br/>\n<b>Analisi della Deviance (Tipo II):</b> Se selezionato, verranno forniti test su variabili intere (inclusi test a più gradi di libertà per covariate a più categorie). I test di Wald \nsaranno utilizzati.\n<br/><br/>\n<b>Pacchetti R richiesti:</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nClicca sul pulsante Aiuto R per ottenere aiuto dettagliato su R riguardo alla funzione coxph. Vai su Aiuto-> Aiuto Funzione R per ottenere ulteriori informazioni sulla funzione finegray, che crea il \ndataset necessario.\n"
  }
}