{
  "title": "Cox, Base",
  "navigation": "Cox, Base",
  "helplabel": "Clicca sul pulsante ? in alto a destra della finestra di dialogo per dettagli sui dataset di esempio e sul formato dei dati supportato.",
  "modelname": "Inserisci il nome del modello",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Eventi (1 = evento 1, 0 = censura)",
  "destvars": "Variabili indipendenti",
  "weightvar": "Pesi (opzionale)",
  "tiemethod": "Metodo del tempo legato",
  "forestplotbox": "Grafico a dispersione",
  "diagnosticsbox": "Diagnostica del modello",
  "martscalebox": "Valore minimo dell'asse dei residui di Martingale del modello nullo (-Inf a 1):",
  "devbox": "Analisi della devianza (Tipo II)",
  "devtype": "Statistica del test",
  "help": {
    "title": "Cox, Base",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n\t\t\tVedi il dataset di esempio nella directory di installazione, la posizione predefinita è nella lettera di unità:&bsol;program files&bsol;BioStat Prime&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. La variabile Followup_time deve essere inserita come il tempo fino all'evento o censura e la variabile Event deve essere inserita come gli Eventi (1 = evento, 0 = censura). Sesso, età e bmi possono essere le variabili indipendenti. \n\t\t\t<br/>\n            La variabile evento deve essere numerica, i fattori non sono consentiti. Se hai una variabile evento di tipo fattore con 2 valori, ad esempio 0 e 1, convertila in numerica\n\t\t\tQuesto dataset è una versione aggiornata del dataset mockstudy nel pacchetto arsenal.\n\t\t\t<br/><br/>\n            <b>Modello di rischi proporzionali di Cox</b>\n            <br/>\n            <br/>\n            Si adatta a un modello di rischi proporzionali di Cox per dati di tempo fino all'evento con osservazioni censurate. Statistiche di adattamento del modello, stime dei parametri e rapporti di rischio sono forniti. Le opzioni disponibili includono il metodo del tempo legato, diagnosi del modello come valutazioni dei rischi proporzionali e della forma funzionale delle covariate, e un grafico a dispersione dei rapporti di rischio con intervalli di confidenza. Il modello è adattato utilizzando la funzione coxph nel pacchetto survival.\n            <br/>\n            <br/>\n            <b>Tempo:</b> Tempo fino all'evento per coloro che sperimentano l'evento o tempo fino all'ultimo follow-up per coloro che non sperimentano l'evento\n            <br/><br/>\n            <b>Evento:</b> Indicatore numerico dell'evento; 1=evento, 0=censura\n            <br/><br/>\n            <b>Variabili Indipendenti:</b> Variabili indipendenti da includere nel modello. Fattori, stringhe e variabili logiche saranno codificate in modo fittizio.\n            <br/><br/>\n            <b>Pesi:</b> Variabile numerica per i pesi delle osservazioni. Utile in situazioni in cui ogni record non dovrebbe essere conteggiato come un'osservazione. \n            <br/>\n            <br/>\n            <b>Pacchetti richiesti:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Clicca sul pulsante Ottieni aiuto R per ottenere aiuto dettagliato su R riguardo alla funzione coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opzioni</b>\n            <br/>\n            <br/>\n            <b>Metodo del tempo legato:</b>\n            <br/>\n            Metodo per rompere i tempi osservati legati. Efron è di solito la scelta migliore quando non ci sono molti tempi legati. Il metodo esatto può essere vantaggioso se ci sono molti tempi legati, come nelle situazioni di tempo discreto, ma può richiedere un po' più di tempo per adattare il modello. \n            <br/>\n            <br/>\n            <b>Grafico a dispersione:</b>\n            <br/>\n            Grafico dei rapporti di rischio e degli intervalli di confidenza per ciascun predittore nel modello.\n            <br/>\n            <br/>\n            <b>Diagnostica del modello:</b>\n            <br/>\n            Se selezionato, verranno forniti test e grafici dei rischi proporzionali, oltre a valutazioni della forma funzionale per ciascuna covariata nel modello. L'opzione del valore minimo dell'asse dei residui di Martingale del modello nullo potrebbe dover essere cambiata affinché tutti i residui appaiano nel grafico. Per ottenere valutazioni della forma funzionale, devi specificare solo predittori numerici e non avere dati mancanti. Vedi Variabili > Valori mancanti > Rimuovi NAs.\n            <br/>\n            <br/>\n            <b>Analisi della devianza (Tipo II):</b>\n            Test globale di ciascun predittore nel modello. Verranno forniti test a più gradi di libertà per effetti con più di 2 livelli. I test di Wald e di rapporto di verosimiglianza possono essere ottenuti, con i test di rapporto di verosimiglianza che hanno migliori proprietà per campioni piccoli.\n            \n        "
  }
}