{
  "title": "Cox, Stratificato",
  "navigation": "Cox, Stratificato",
  "modelname": "Inserisci il nome del modello",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Eventi (1 = evento 1, 0 = censura)",
  "modelterms": "Costruttore di espressioni del modello per variabili indipendenti",
  "stratavarslabel": "Variabili di Stratificazione",
  "weightvar": "Pesi (opzionale)",
  "tiemethod": "Metodo del Tempo Legato",
  "diagnosticsbox": "Diagnostica del Modello",
  "help": {
    "title": "Cox, Stratificato",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n            Adatta un modello di rischi proporzionali di Cox stratificato per dati di tempo fino all'evento con osservazioni censurate. Questo è un modello di Cox che consente una funzione di rischio di base separata per ogni livello di strata. Statistiche di adattamento del modello, stime dei parametri e rapporti di rischio sono forniti. Le opzioni disponibili includono il metodo del tempo legato e la diagnostica del modello. Il modello è adattato utilizzando la funzione coxph nel pacchetto survival. \n            <br/>\n            <br/>\n            <b>Tempo fino all'evento o censura:</b> Tempo fino all'evento per coloro che sperimentano l'evento o tempo fino all'ultimo follow-up per coloro che non sperimentano l'evento\n            <br/><br/>\n            <b>Eventi (1=evento, 0=censura):</b> Indicatore numerico dell'evento; 1=evento, 0=censura\n            <br/><br/>\n            <b>Costruttore di Formula:</b> Costruisci termini da includere nel modello. Fattori, stringhe e variabili logiche saranno codificate in modo fittizio. I pulsanti forniti ti consentono di specificare effetti principali, effetti fattoriali completi (effetti principali e tutte le interazioni con le variabili coinvolte), polinomi, interazioni specifiche e eliminare termini dalla lista. Sono consentite interazioni con variabili di stratificazione.\n            <br/><br/>\n\t\t\t<b>Variabili di Stratificazione:</b> Specifica una o più variabili di stratificazione. Queste possono essere variabili numeriche, fattoriali, fattoriali ordinate o caratteri. Gli strata dividono i soggetti in gruppi separati in cui ogni gruppo ha una distinta funzione di rischio di base. Se vengono fornite più variabili di stratificazione, viene utilizzata una funzione di rischio di base separata per ogni combinazione di livelli delle variabili di stratificazione.\n\t\t\t<br/><br/>\n            <b>Pesi:</b> Variabile numerica per i pesi delle osservazioni. Utile in situazioni in cui ogni record non dovrebbe essere conteggiato come un'osservazione. \n            <br/>\n            <br/>\n            <b>Pacchetti richiesti:</b> survival, broom, survminer\n            <br/>\n            <br/>\n            Fai clic sul pulsante R Help per ottenere aiuto dettagliato su R riguardo alla funzione coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opzioni</b>\n            <br/>\n            <br/>\n            <b>Metodo del Tempo Legato:</b>\n            <br/>\n            Metodo per rompere i tempi osservati legati. Efron è di solito la scelta migliore quando non ci sono molti tempi legati. Il metodo esatto può essere vantaggioso se ci sono molti tempi legati, come nelle situazioni di tempo discreto, ma può richiedere un po' più di tempo per adattare il modello. \n            <br/>\n            <br/>\n            <b>Diagnostica del Modello:</b>\n            <br/>\n            Se selezionato, verranno forniti test e grafici di rischi proporzionali, oltre a un grafico dei residui di Martingale.\n"
  }
}