{
  "title": "Cox, covariabili binarie dipendenti dal tempo",
  "navigation": "Cox, covariabili binarie dipendenti dal tempo",
  "modelname": "Inserisci il nome del modello",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Eventi (1 = evento 1, 0 = censura)",
  "modelterms": "Costruttore di espressioni del modello per variabili indipendenti",
  "switchtimeslabel": "Variabili di tempo di esposizione per covariabili dipendenti dal tempo",
  "tdprefixlabel": "Prefisso per covariabili dipendenti dal tempo",
  "subjectidlabel": "Identificatore del soggetto",
  "weightvar": "Pesi (opzionale)",
  "tiemethod": "Metodo del tempo legato",
  "forestplotbox": "Grafico a foresta",
  "diagnosticsbox": "Diagnostica del modello",
  "martscalebox": "Valore minimo dell'asse dei residui di Martingale del modello nullo (-Inf a 1):",
  "devbox": "Analisi della devianza (Tipo II)",
  "devtype": "Statistica del test",
  "startstopboxlabel": "Mostra il dataset (inizio, fine) del tempo",
  "startstopnamelabel": "Nome del dataset",
  "help": {
    "title": "Cox, covariabili binarie dipendenti dal tempo",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nAdatta un modello di rischi proporzionali di Cox per dati di tempo fino all'evento con osservazioni censurate che include una o più covariabili \"esposizione\" binarie dipendenti dal tempo. Questo tipo di \ncovariabile è una in cui l'occorrenza di un \"sì\" può avvenire dopo l'inizio del follow-up e una volta che quel \"sì\" si verifica rimane un \"sì\" per la durata del follow-up. Un esempio \npotrebbe essere il rigetto di un innesto post-trapianto (cioè, prima che si verifichi il rigetto, il paziente non è stato \"esposto\"; dopo che si verifica il rigetto, il paziente è stato \"esposto\").  \nTrattare tale covariabile come conosciuta all'inizio del follow-up è una forma di guardare nel futuro e porta a stime distorte (noto anche come \"bias di tempo immortale\").\n<br/><br/>\nStatistiche di adattamento del modello, stime dei parametri e rapporti di rischio sono forniti. Le opzioni disponibili includono il metodo del tempo legato, grafici a foresta, diagnostica del modello e la possibilità \ndi visualizzare il dataset del processo di conteggio sottostante che viene creato. Una tabella che descrive i dati del processo di conteggio è fornita come verifica che questi dati vengano creati \nappropriatamente.\n<br/><br/>  \nRiepiloghi dei dati del processo di conteggio:\n<br/>\n<b>presto:</b> tempo in cui il predittore cambia prima dell'inizio del tempo di follow-up<br/>\n<b>tardi:</b> tempo in cui il predittore cambia dopo la fine del follow-up<br/>\n<b>all'interno:</b> tempo in cui il predittore cambia all'interno del periodo di follow-up<br/>\n<b>in testa:</b> tempo in cui il predittore cambia all'inizio del follow-up<br/>\n<b>in coda:</b> tempo in cui il predittore cambia alla fine del follow-up<br/>\n<b>confine:</b> tempo in cui il predittore cambia sia all'inizio che alla fine del follow-up\n<br/><br/>\nPer ulteriori informazioni su questa tabella, vedere il vignetta delle covariabili dipendenti dal tempo su <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>.  \n<br/><br/>\nIl modello è adattato utilizzando la funzione coxph nel pacchetto survival.\n<br/><br/>\n<b>Inserisci il nome del modello:</b> Nome dove verranno memorizzati i risultati del modello\n<br/><br/>\n<b>Tempo fino all'evento o censura:</b> Tempo fino all'evento per coloro che sperimentano l'evento o tempo fino all'ultimo follow-up per coloro che non sperimentano l'evento\n<br/><br/>\n<b>Eventi (1=evento, 0=censura):</b> Indicatore numerico dell'evento; 1=evento, 0=censura\n<br/><br/>\n<b>Costruttore di formule:</b> Costruire termini da includere nel modello. Fattori, stringhe e variabili logiche saranno codificate dummy. I pulsanti forniti ti consentono di specificare effetti principali, effetti fattoriali completi (effetti principali e tutte le interazioni con le variabili coinvolte), polinomi, interazioni specifiche e eliminare termini dall'elenco.\n<br/><br/>\n<b>Variabili di tempo di esposizione per covariabili dipendenti dal tempo:</b> Variabili numeriche che memorizzano il tempo in cui il soggetto è stato \"esposto\" per la prima volta. Questo deve essere sulla stessa scala temporale della variabile Tempo. I valori mancanti dovrebbero essere utilizzati per i soggetti che non sono mai stati esposti. Ogni variabile specificata qui creerà una covariabile dipendente dal tempo separata. Un tempo specificato presuppone che un soggetto non sia esposto prima di questo tempo ed esposto dopo questo tempo (cioè quando il predittore cambia da \"no\" a \"sì\"). Specificare solo valori positivi significa \nche i soggetti non sono esposti per un certo tempo dopo l'inizio del follow-up. Specificare alcuni tempi positivi e negativi indica che alcuni soggetti sono stati esposti dopo e alcuni prima \ndell'inizio del follow-up, rispettivamente. Se sai che un soggetto è stato esposto prima dell'inizio del follow-up, ma non sai esattamente quando, puoi utilizzare qualsiasi tempo negativo \ne il modello tratterà correttamente quel soggetto come esposto per l'intero tempo di follow-up. Se i soggetti sono esposti dopo il follow-up, allora vengono trattati correttamente come non esposti per l'intero tempo di follow-up.\n<br/><br/>\n<b>Prefisso per covariabili dipendenti dal tempo:</b> Prefisso desiderato da utilizzare per ogni covariabile dipendente dal tempo specificata nel campo <b>Variabili di tempo di esposizione</b>. Il nome di\ne ogni covariabile dipendente dal tempo inizierà con questo prefisso.\n<br/><br/>\n<b>Identificatore del soggetto:</b> La variabile che memorizza l'identificatore del soggetto. Questo è richiesto per scopi di creazione del dataset del processo di conteggio sottostante.\n<br/><br/>\n<b>Pesi:</b> Variabile numerica per i pesi di osservazione. Utile in situazioni in cui ogni record non dovrebbe essere conteggiato come un'osservazione. \n<br/><br/>\n<b>Opzioni:</b>\n<br/><br/>\n<b>Metodo del tempo legato:</b> Metodo per rompere i tempi osservati legati. Efron è di solito la scelta migliore quando non ci sono molti tempi legati. Il metodo esatto può essere vantaggioso se \nci sono molti tempi legati, come nelle situazioni di tempo discreto, ma può richiedere un po' più di tempo per adattare il modello.\n<br/><br/>\n<b>Grafico a foresta:</b> creerà un grafico a foresta di rapporti di rischio e intervalli di confidenza\n<br/><br/>\n<b>Mostra il dataset (inizio, fine):</b> Mostrerà il dataset del processo di conteggio sottostante utilizzato nei calcoli. Questo suddivide il tempo di follow-up di ciascun soggetto in parti, a seconda \ndel momento in cui la covariabile dipendente dal tempo dovrebbe cambiare valori.\n<br/><br/>\n<b>Diagnostica del modello:</b> Se selezionato, verranno forniti test e grafici di rischi proporzionali, oltre a valutazioni della forma funzionale per ciascuna covariabile nel modello.  \nL'opzione del valore minimo dell'asse dei residui di Martingale del modello nullo potrebbe dover essere cambiata affinché tutti i residui appaiano nel grafico. Per ottenere valutazioni della forma funzionale, devi \nspecificare solo predittori numerici e non avere dati mancanti. Vedi Variabili > Valori mancanti > Rimuovi NAs.\n<br/><br/>\n<b>Analisi della devianza (Tipo II):</b> Test globale di ciascun predittore nel modello. Verranno forniti test a più gradi di libertà per effetti con più di 2 livelli.  \nI test di Wald e di rapporto di verosimiglianza possono essere ottenuti, con i test di rapporto di verosimiglianza che hanno migliori proprietà per campioni piccoli.           \n<br/><br/>\n<b>Pacchetti richiesti:</b> survival, broom, survminer, car\n"
  }
}