{
  "title": "Crosstab",
  "navigation": "Crosstab",
  "label6": "Quando vengono specificate più variabili di riga e di colonna, generiamo una tabella incrociata separata per ogni coppia di variabili di riga e di colonna.",
  "rowlabel": "Variabile di Riga",
  "collabel": "Variabile di Colonna",
  "layerlabel": "Variabile(i) di Strato",
  "weightlabel": "Peso (uno)",
  "label1": "Statistiche",
  "chisqlabel": "Chisq",
  "chisqNoContCorrection": "Nessuna correzione di continuità per il test del Chi-quadrato",
  "chisqContCorrection": "Applica correzione di continuità per il test del Chi-quadrato (si applica a una tabella 2 per 2)",
  "chisqSimulatePValues": "Calcola i valori p utilizzando la simulazione Monte Carlo",
  "chisqNoOfReplicates": "Numero di repliche utilizzate nel test Monte Carlo",
  "mcnemar": "McNemar",
  "mcnemarContCorrection": "Applica correzione di continuità per il test di McNemar (si applica a una tabella 2 per 2)",
  "fisher": "Fisher",
  "fisherSimulatePValues": "Calcola i valori p utilizzando la simulazione Monte Carlo",
  "fisherNoOfReplicates": "Numero di repliche utilizzate nel test Monte Carlo",
  "fishersAlternative": "Ipotesi alternativa per il test esatto di Fisher",
  "label2": "Residui",
  "unstandardized": "Non standardizzati",
  "standardized": "Standardizzati",
  "adjusted": "Regolati",
  "label3": "Percentuali",
  "rowpercent": "Riga",
  "colpercent": "Colonna",
  "label4": "Conteggi",
  "expected": "Atteso",
  "label5": "Formato di output",
  "longTbl": "Tabella in stile elenco (Limita la larghezza della tabella quando ci sono molti livelli)",
  "help": {
    "title": "Crosstab",
    "r_help": "help(CrossTable, package=gmodels)",
    "body": "\n            <b>Descrizione</b></br>\nCrea una tabella incrociata con variabili di riga, colonna e strato. Quando vengono specificate più variabili di riga e di colonna, generiamo una tabella incrociata separata per ogni coppia di variabili di riga e di colonna. Inoltre, vengono visualizzati i seguenti elementi<br/>\nConteggi attesi<br/>\nPercentuali di riga e colonna<br/>\nResidui non standardizzati, standardizzati e regolati<br/>\nChisq con rapporto di probabilità, statistiche di McNemar e Fisher<br/>\nNOTA: Rimuoviamo automaticamente tutte le righe in cui ogni conteggio è 0. Questo può influenzare il modo in cui vengono eseguiti i test di Chisq, McNemar e Fisher. Ad esempio, potresti aspettarti 3 righe e 2 colonne poiché la variabile di riga ha 3 livelli e la variabile di colonna 2 livelli. Tuttavia, poiché un livello di riga ha tutti i conteggi a 0, ottieni una tabella 2*2. Mentre la simulazione Monte Carlo con il test di Fisher funziona su una tabella 3*2, non si applica a una tabella 2*2 e viene eseguito il normale test di Fisher. \n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nBSkyCrossTable(x,y,layers, weight, datasetname, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE,long_table = FALSE )\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nx: variabile di riga\n</li>\n<li>\ny: variabile di colonna\n</li>\n<li>\nlayers: una o più variabili per gli strati\n</li>\n<li>\nweights: una variabile numerica contenente i pesi di frequenza\n</li>\n<li>\ndatasetname: Nome del dataset da cui vengono scelte x,y e layers (variabili)\n</li>\n<li>\nchisq:  se TRUE genera la tabella del chi-quadrato\n</li>\n<li>\nprop.r: Le percentuali di riga vengono prodotte se questo è TRUE\n</li>\n<li>\nprop.c: Le percentuali di colonna vengono generate se questo è TRUE\n</li>\n<li>\nresid: se TRUE, vengono generati residui non standardizzati\n</li>\n<li>\nsresid: se TRUE, vengono generati residui standardizzati\n</li>\n<li>\nexpected: I conteggi attesi vengono generati se questo è TRUE\n</li>\n<li>\nasresid:  se TRUE, vengono generati residui regolati\n</li>\n<li>\nlong_table: L'opzione della tabella lunga è introdotta per accomodare analisi effettuate su un gran numero di variabili. Scegliere il formato lungo controlla la larghezza della tabella di output rendendo facile visualizzare i risultati senza dover scorrere a destra nella finestra di output. \n</li>\n</ul>\n<b>valore</b></br>\nUna lista con i risultati\n<br/>\n<b>Esempio</b></br>\n<code> \nBSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>\nlayers=c('type'),datasetname='Dataset2',<br/>\nchisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>\nresid=FALSE,sresid=FALSE,expected=FALSE,<br/>\nasresid=FALSE)</br>\nBSkyFormat(BSky_Multiway_Cross_Tab)</br>\n</code> <br/>\n<b>Pacchetto</b></br>\ngmodels</br>\n<b>Aiuto</b></br>\nPer un aiuto dettagliato clicca sull'icona R in alto a destra di questo dialogo o esegui il seguente comando help(CrossTable, package=gmodels) creando un blocco di codice R cliccando + nella finestra di output  \n    "
  }
}