{
  "title": "Test Diagnostici",
  "navigation": "Test Diagnostici",
  "outvar": "Variabile di Risultato (1=positivo, 0=negativo):",
  "testvar": "Variabile di Test (1=positivo, 0=negativo):",
  "cilevel": "Livello di Confidenza:",
  "help": {
    "title": "Test Diagnostici",
    "r_help": "help(epi.tests,package=epiR)",
    "body": "\n<b>Descrizione</b></br>\nQuesto calcola varie misure appropriate negli studi di test diagnostici per un test binario rispetto a un risultato binario di gold standard per la rilevazione di una \"malattia\".<br/>\nVariabile di Risultato: Variabile contenente i valori per il gold standard. Questa deve essere una variabile numerica codificata come 1 = \"malattia\" positiva e 0 = \"malattia\" negativa, poiché i calcoli dipendono da questo ordine.<br/>\nVariabile di Test: Variabile contenente i valori per il test in considerazione. Questa deve essere una variabile numerica codificata come 1 = \"malattia\" positiva e 0 = \"malattia\" negativa, poiché i calcoli dipendono da questo ordine.<br/>\nLivello di Confidenza: Livello desiderato dell'intervallo di confidenza<br/>\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nepi.tests(dat, conf.level = 0.95)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\ndat: Un oggetto di classe tabella contenente le frequenze delle celle individuali create tabulando la variabile di risultato e la variabile di test. La Variabile di Risultato contiene i valori per il gold standard. Questa deve essere una variabile numerica codificata come 1 = \"malattia\" positiva e 0 = \"malattia\" negativa, poiché i calcoli dipendono da questo ordine. La variabile di test contiene i valori per il test in considerazione. Questa deve essere una variabile numerica codificata come 1 = \"malattia\" positiva e 0 = \"malattia\" negativa, poiché i calcoli dipendono da questo ordine.\n</li>\n<li>\nLivello di Confidenza: Livello desiderato dell'intervallo di confidenza\n</li>\n</ul>\n<b>Dettagli</b></br>\nI limiti di confidenza binomiale esatti sono calcolati per sensibilità del test, specificità e valore predittivo positivo e negativo (vedi Collett 1999 per dettagli).</br>\nGli intervalli di confidenza per i rapporti di verosimiglianza positivi e negativi si basano su formule fornite da Simel et al. (1991).</br>\nL'accuratezza diagnostica è definita come la proporzione di tutti i test che danno un risultato corretto. Il rapporto di odds diagnostico è definito come quanto è più probabile che il test faccia una diagnosi corretta piuttosto che una diagnosi errata nei pazienti con la malattia (Scott et al. 2008). Il numero necessario per diagnosticare è definito come il numero di pazienti che devono essere testati per dare un test positivo corretto. L'indice di Youden è la differenza tra il tasso di veri positivi e il tasso di falsi positivi. L'indice di Youden varia da -1 a +1 con valori più vicini a 1 se sia la sensibilità che la specificità sono elevate (cioè vicine a 1).</br>\n<b>Valore</b></br>\nVedi aiuto dettagliato qui sotto per accedere all'aiuto R che descriverà i valori restituiti</br>\n<b>Pacchetto</b></br>\nepiR;DescTools</br>\n<b>Aiuto</b></br>\nPer aiuto dettagliato clicca sull'icona R in alto a destra di questo overlay di dialogo o esegui il seguente comando help(epi.tests,package=epiR) creando un blocco di codice R cliccando + nella finestra di output\n\t\t\t"
  }
}