{
  "title": "Grafico di Cullen e Frey con descrittivi di una distribuzione empirica per dati non censurati",
  "navigation": "Analisi della Distribuzione (grafico di Cullen e Frey)",
  "variableSelcted": "Seleziona una variabile che contiene la distribuzione",
  "boot": "(Facoltativo) Valori di boot di asimmetria e curtosi. Se specificato deve essere un intero superiore a 10",
  "discreteChk": "Discreto - non selezionato (predefinito) per uniforme, normale, logistica, lognormale, beta e gamma. Selezionato per poisson e binomiale negativo",
  "method": "Non distorto (predefinito) per valori stimati non distorti delle statistiche o campione per valori di campione",
  "help": {
    "title": "Descrizione di una distribuzione empirica per dati non censurati",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descrizione</b></br>\n\t\t\t\tCalcola i parametri descrittivi di una distribuzione empirica per dati non censurati e fornisce un grafico di asimmetria-curtosi\n\t\t\t\t<br/>\n\t\t\t\tPer l'aiuto dettagliato - usa R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMinimo, massimo, mediana, media, sd del campione e stime (se il metodo==\"campione\") o per impostazione predefinita stime non distorte di \n\t\t\t\tasimmetria e valori di curtosi di Pearson sono stampati (Sokal e Rohlf, 1995). Un grafico di asimmetria-curtosi come il \n\t\t\t\tquello proposto da Cullen e Frey (1999) è fornito per la distribuzione empirica. In questo grafico, i valori per distribuzioni comuni \n\t\t\t\tsono anche visualizzati come strumenti per aiutare la scelta delle distribuzioni da adattare ai dati. Per alcune \n\t\t\t\tdistribuzioni (normale, uniforme, logistica, esponenziale ad esempio), c'è solo un valore possibile per l'asimmetria \n\t\t\t\te la curtosi (per una distribuzione normale ad esempio, asimmetria = 0 e curtosi = 3), e la distribuzione è quindi \n\t\t\t\trepresentata da un punto sul grafico. Per altre distribuzioni, aree di valori possibili sono rappresentate, consistenti in \n\t\t\t\tlinee (distribuzioni gamma e lognormale ad esempio), o aree più grandi (distribuzione beta ad esempio). \n\t\t\t\tLa distribuzione di Weibull non è rappresentata sul grafico ma è indicato nella legenda che forme vicine a \n\t\t\t\tdistribuzioni lognormali e gamma possono essere ottenute con questa distribuzione.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPer tenere conto dell'incertezza dei valori stimati di curtosi e asimmetria dai dati, il set di dati \n\t\t\t\tpuò essere bootstrapato fissando l'argomento boot a un intero superiore a 10. I valori di boot di asimmetria e curtosi \n\t\t\t\tcorrispondenti ai campioni bootstrap vengono quindi calcolati e riportati in blu sul grafico di asimmetria-curtosi.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSe discreto è TRUE, le distribuzioni rappresentate sono le distribuzioni Poisson, binomiale negativa e la distribuzione normale \n\t\t\t\talla quale le precedenti distribuzioni discrete possono convergere. Se discreto è FALSE, queste sono distribuzioni uniforme, normale, \n\t\t\t\tlogistica, lognormale, beta e gamma.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Per una buona panoramica dell'adattamento della distribuzione, vedere https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}