{
  "title": "Adattamento di distribuzioni univariate a dati non censurati (con P-value)",
  "navigation": "Adattamento distribuzione P-value",
  "variableSelcted": "Seleziona una variabile che contiene la distribuzione",
  "label1": "Tieni presente che il test di adattamento per le distribuzioni di solito richiede più tempo per completarsi",
  "label2": "Test di adattamento per varie distribuzioni",
  "normDistChk": "Normale",
  "weibullDistChk": "Weibull",
  "lnormDistChk": "Log Normale",
  "poissonDistChk": "Poisson",
  "expDistChk": "Esponenziale",
  "gammaDistChk": "Gamma",
  "nbinomDistChk": "Binomiale Negativa",
  "geomDistChk": "Geometrica",
  "betaDistChk": "Beta",
  "unifDistChk": "Uniforme",
  "logisDistChk": "Logistica",
  "cauchyDistChk": "Cauchy",
  "method": "Metodo di adattamento",
  "gof": "Buona adattabilità (gof) - richiesto solo quando il metodo 'mge' di adattamento è scelto sopra",
  "shoChiqTestChk": "Mostra i risultati del test del Chi-quadrato per la distribuzione continua",
  "showCompareTablesOnlyChk": "Mostra solo le tabelle e i grafici di confronto delle distribuzioni. Devi deselezionare questo se stai selezionando solo una distribuzione",
  "bootstrapIter": "Il metodo bootstrap è utilizzato per migliorare l'accuratezza del p.value. L'iterazione predefinita è 600. Maggiori iterazioni possono migliorare l'accuratezza ma richiederanno più tempo per il calcolo",
  "help": {
    "title": "Adattamento di distribuzioni univariate a dati non censurati",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descrizione</b></br>\n\t\t\t\tAdattamento di distribuzioni univariate a dati non censurati tramite massima verosimiglianza (mle), corrispondenza dei momenti (mme), corrispondenza dei quantili (qme) o massimizzazione della stima della buona adattabilità (mge) che è anche conosciuta come minimizzazione della stima della distanza.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPer il dettaglio dell'aiuto - usa R help(fitdist, package = fitdistrplus) e help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tI quattro possibili metodi di adattamento sono descritti di seguito:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method=\"mle\" (predefinito)\n\t\t\t\tLa stima della massima verosimiglianza consiste nel massimizzare il log-verosimiglianza. Un'ottimizzazione numerica viene eseguita in mledist tramite ottim per trovare i migliori valori (vedi mledist per dettagli).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method=\"mme\"\n\t\t\t\tLa stima della corrispondenza dei momenti consiste nell'uguagliare i momenti teorici ed empirici. I valori stimati dei parametri della distribuzione vengono calcolati tramite una formula in forma chiusa per le seguenti distribuzioni: \"norm\", \"lnorm\", \"pois\", \"exp\", \"gamma\", \"nbinom\", \"geom\", \"beta\", \"unif\" e \"logis\". Altrimenti, i momenti teorici ed empirici vengono abbinati numericamente, minimizzando la somma dei quadrati delle differenze tra i momenti osservati e teorici. In quest'ultimo caso, ulteriori argomenti sono necessari nella chiamata a fitdist: order e memp (vedi mmedist per dettagli).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method = \"qme\"\n\t\t\t\tLa stima della corrispondenza dei quantili consiste nell'uguagliare i quantili teorici ed empirici. Un'ottimizzazione numerica viene eseguita in qmedist tramite ottim per minimizzare la somma dei quadrati delle differenze tra i quantili osservati e teorici. L'uso di questo metodo richiede un argomento aggiuntivo probs, definito come il vettore numerico delle probabilità per le quali il(i) quantile(i) deve(no) essere abbinato(i) (vedi qmedist per dettagli).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method = \"mge\"\n\t\t\t\tLa massima stima della buona adattabilità consiste nel massimizzare una statistica di buona adattabilità. Un'ottimizzazione numerica viene eseguita in mgedist tramite ottim per minimizzare la distanza di buona adattabilità. L'uso di questo metodo richiede un argomento aggiuntivo gof coding per la distanza di buona adattabilità scelta. Si può usare la classica distanza di Cramer-von Mises (\"CvM\"), la classica distanza di Kolmogorov-Smirnov (\"KS\"), la classica distanza di Anderson-Darling (\"AD\") che dà più peso alle code della distribuzione, o una delle varianti di quest'ultima distanza proposta da Luceno (2006) (vedi mgedist per ulteriori dettagli). Questo metodo non è adatto per distribuzioni discrete.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method = \"mse\"\n\t\t\t\tLa massima stima della buona adattabilità consiste nel massimizzare la spaziatura logaritmica media. Un'ottimizzazione numerica viene eseguita in msedist tramite ottim.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa convergenza è \n\t\t\t\tun codice intero per la convergenza di optim/constrOptim definito come di seguito o definito dall'utente nella funzione di ottimizzazione fornita dall'utente. 0 indica una convergenza riuscita. 1 indica che è stato raggiunto il limite di iterazione di optim. 10 indica degenerazione del semplice di Nealder-Mead. 100 indica che optim ha incontrato un errore interno.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLe statistiche di buona adattabilità sono calcolate da gofstat(). La statistica del Chi-quadrato è calcolata utilizzando celle definite dall'argomento chisqbreaks o celle definite automaticamente dai dati, al fine di raggiungere approssimativamente lo stesso numero di osservazioni per cella, approssimativamente uguale all'argomento meancount, o leggermente di più se ci sono alcuni legami. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPer distribuzioni continue, le statistiche di Kolmogorov-Smirnov, Cramer-von Mises e Anderson-Darling sono anche calcolate, come definito da Stephens (1986).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLe statistiche di importanza sono le statistiche di Cramer-von Mises, Anderson-Darling e Kolmogorov per distribuzioni continue e le statistiche del Chi-quadrato per quelle discrete (\"binom\", \"nbinom\", \"geom\", \"hyper\" e \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Per una buona panoramica dell'adattamento della distribuzione, vedere https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Per una buona panoramica dell'adattamento della distribuzione, vedere https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}