{
  "title": "Uguaglianza delle varianze",
  "navigation": "Uguaglianza delle varianze",
  "label1": "Scegli test",
  "bartlett": "Test di Bartlett",
  "levene": "Test di Levene",
  "fligner": "Test di Fligner–Killeen",
  "normal_distribution": "Test basato sulla distribuzione normale",
  "pairwiseLeveneTest": "Test di Levene per coppie",
  "label2": "Formato dei dati",
  "wide": "Formato largo",
  "long": "Formato lungo",
  "label3": "Livello di confidenza",
  "label4": "Ipotesi alternativa",
  "alt1": "Due lati",
  "alt2": "Maggiore",
  "alt3": "Minore",
  "label5": "Metodo di aggiustamento del p-value (per il test di Levene per coppie)",
  "padj1": "Holm",
  "padj2": "Hochberg",
  "padj3": "Hommel",
  "padj4": "Bonferroni",
  "padj5": "BH",
  "padj6": "BY",
  "padj7": "FDR",
  "padj8": "Nessuno",
  "help": {
    "title": "Test per l'uguaglianza delle varianze",
    "r_help": "help(bartlett.test, package=stats); help(leveneTest, package=car); help(fligner.test, package=stats)",
    "body": "\n<b>Descrizione</b></br>\nTesta l'uguaglianza delle varianze. Supporta dati nei seguenti formati<br/>\nlargo: Ogni variabile contiene misurazioni, ad es. la variabile 1 contiene misurazioni della macchina A, la variabile 2 contiene misurazioni della macchina B...<br/>\nlungo: Le misurazioni in una variabile sono raggruppate da una o più variabili, ad es. I punteggi dei test sono raggruppati per genere e classe. <br/>\nIl metodo di aggiustamento del p-value viene applicato solo quando è selezionato il test di Levene per coppie.<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"wide\" ),<br/>\n    cols_to_compare = c('A','B','C'),<br/>\n    response_col = NULL,<br/>\n    group_col = NULL,<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"two.sided\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n    Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset1\"<br/>\n)<br/>\nBSky_variance_analysis (<br/>\n    data_format = c(\"long\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Score'),<br/>\n    group_col = c('Gender','Class'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"two.sided\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset2\"<br/>\n)<br/>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\ndata_format: Può essere largo o lungo\n</li>\n<li>\ncols_to_compare: Le variabili da confrontare per le varianze quando il dataset è in formato largo, NULL per i dati in formato lungo\n</li>\n<li>\nresponse_col: La variabile di misurazione da confrontare per le varianze tra i gruppi. NULL per i dati larghi\n</li>\n<li>\ngroup_col: Una o più variabili utilizzate per raggruppare la variabile di misurazione, testiamo l'uguaglianza delle varianze tra i gruppi\n</li>\n<li>\nconf_level: Intervallo di confidenza\n</li>\n<li>\nalt_hypothesis: Impostato su due lati\n</li>\n<li>\np_adjust_method: Metodo utilizzato per aggiustare il p-value\n</li>\n<li>\nnormal_distribution: se TRUE, assumiamo normalità\n</li>\n<li>\nFligner_Killeen: se TRUE, esegue un test di Fligner_Killeen\n</li>\n<li>\npairwiseComparison: Esegui un test di Levene per coppie\n</li>\n<li>\ndatasetname: Nome del dataset da cui vengono scelti x,y e layer (variabili)\n</li>\n</ul>\n<b>Valore</b></br>\nIntervalli di confidenza di Bonferroni per gli intervalli di confidenza specificati. Risultati del test per test di confronto multiplo (quando non si assume normalità) e risultati di altri test\n<br/>\n<b>Esempio</b></br>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"long\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Score'),<br/>\n    group_col = c('Gender','Class'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"two.sided\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset2\"<br/>\n)<br/>\n</code> <br/>\n\n<b>Dettagli</b></br>\nTest di confronto multiplo</br>\nUtilizzato quando non si seleziona “Usa test basato sulla distribuzione normale” – cioè, si favoriscono metodi robusti a distribuzioni non normali. </br>\nSe hai k > 2 gruppi, calcoliamo gli intervalli per le deviazioni standard in modo tale che se due intervalli non si sovrappongono, le deviazioni standard associate sono \ndifferenti in modo significativo.</br> \nPer k = 2 campioni, utilizza il metodo di Bonett per testare due varianze con rapporto ipotizzato = 1. </br>\nQuando il test di confronto multiplo complessivo è significativo, le deviazioni standard che corrispondono agli intervalli non sovrapposti sono statisticamente diverse.</br>\nVantaggi: Più potente del metodo di Levene in molte situazioni (per distribuzioni continue). Ma quando le dimensioni del campione sono piccole (< 20) o le distribuzioni sono \nestramente distorte/ pesanti, il tasso di errore di tipo I può essere gonfiato.</br>\nP-value per il test</br>\nSe ci sono 2 campioni nel design, calcoliamo il p-value per il test di confronto multiplo utilizzando il metodo di Bonett per un test di 2 varianze e un rapporto ipotizzato, Ρo, di 1.</br>\nSe ci sono k > 2 campioni nel design, allora sia Pij il p-value del test per qualsiasi coppia (i, j ) di campioni. Il p-value per la procedura di confronto multiplo come test complessivo di uguaglianza delle varianze è dato da quanto segue:</br>\nP =min{Pij, 1<=i<j<=k}\n</br>\nStatistiche del test di Levene</br>\nIl test di Levene viene utilizzato per testare l'ipotesi nulla che le varianze siano uguali tra i gruppi (H₀: tutte le varianze uguali) rispetto all'alternativa che almeno \nuna varianza differisce. </br>\nÈ più robusto rispetto alle deviazioni dalla normalità rispetto ai test che assumono normalità (ad es., il test di Bartlett). </br>\nIn particolare, utilizziamo la modifica di Brown-Forsythe (deviazioni assolute dalla mediana campionaria piuttosto che dalla media) per una maggiore robustezza. </br>\nInterpretazione: Se il p-value < α, rifiuti H₀ e concludi che le varianze non sono uguali. </br>\n</br>\nStatistiche del test di Bartlett</br>\nIl test di Bartlett è progettato per testare l'uguaglianza delle varianze quando i dati sono distribuiti normalmente. H₀: tutte le varianze uguali. Quando k > 2 gruppi,\nutilizziamo il test di Bartlett (se “usa test basato sulla distribuzione normale” è selezionato). </br>\nLa statistica del test (comunemente denotata B) si basa sul confronto tra la media aritmetica pesata e la media geometrica pesata delle varianze campionarie. </br>\nLa statistica segue (approssimativamente) una distribuzione chi-quadrato con k-1 df. </br>\nPoiché il test di Bartlett assume normalità, è sensibile alle deviazioni dalla normalità (cioè, distribuzioni non normali o pesanti possono portare a \nrisultati fuorvianti)</br>\n</br>\nStatistiche del test F</br>\nQuando ci sono esattamente due gruppi (k = 2), utilizziamo un test F piuttosto che il test di Bartlett (se “usa test basato sulla distribuzione normale” è selezionato). </br>\nH₀: le varianze sono uguali (σ₁² = σ₂²). </br>\nLa statistica F è calcolata come il rapporto delle due varianze campionarie (maggiore su minore). Quindi il p-value dipende dall'ipotesi alternativa\n (unilaterale “minore di” o “maggiore di”, o bilaterale). </br>\nInterpretazione: Se p-value < α, rifiuta H₀ e concludi che le varianze differiscono. È valido solo sotto l'assunzione di normalità.</br>\n<b>Valore</b><br/>\n\n<b>Pacchetto</b></br>\nBlueSky</br>\n<b>Aiuto</b></br>\nSi prega di contattare support@blueskystatistics.com per ulteriori informazioni.\n    "
  }
}