{
  "exportpro_title": "Esporta l'output attivo corrente in HTML, DOCX o PDF",
  "exportpro_subtitle": "Si prega di attendere dopo aver fatto clic sul pulsante Esporta. Il processo potrebbe richiedere del tempo a seconda delle dimensioni dell'output che stai esportando.",
  "exportPro_iconTooltip": "Esporta in HTML, DOCX, PDF",
  "exportpro_pandocHint": "È necessario avere Pandoc installato separatamente. Solo la prima volta è necessario fornire il percorso eseguibile di Pandoc dal percorso di installazione di Pandoc.",
  "exportpro_pandocPathLbl": "Percorso di Pandoc:",
  "exportpro_browsePandocPathBtn": "Scegli il percorso del file Pandoc",
  "exportpro_outputFolderLbl": "Cartella del documento esportato:",
  "exportpro_browseOutputPathBtn": "Scegli la cartella di esportazione",
  "exportpro_outputFilenameLbl": "Inserisci il nome del file esportato (senza estensione del file). Non inserire spazi né altri caratteri speciali:",
  "exportpro_selExportFormatLbl": "Seleziona il formato di file da esportare:",
  "exportpro_HTMLradioLbl": "HTML",
  "exportpro_DOCXradioLbl": "DOCX",
  "exportpro_PDFradioLbl": "PDF",
  "exportpro_ExportBtn": "Esporta",
  "exportpro_CancelBtn": "Annulla",
  "exportWaitMsg": "La generazione dell'output potrebbe richiedere del tempo. Controlla la cartella di output dopo un po'.",
  "exportMissingFieldsMsg1": "Compila tutti i campi obbligatori (contrassegnati con asterisco rosso)",
  "exportMissingFieldsMsg2": "Controlla se il percorso di Pandoc o il percorso di output esistono",
  "noPandocFoundMsg": "Pandoc non è installato o il percorso è errato. Inserisci il percorso corretto di Pandoc dove è presente l'eseguibile di Pandoc e riprova.",
  "exportOverwriteTitle": "Sovrascrivere il file esistente?",
  "exportOverwriteMsg": "I seguenti file esistono già. Vuoi sovrascrivere?",
  "exportOverwriteYes": "Sì",
  "exportOverwriteNo": "Annulla",
  "exportFileLockedTitle": "Il file è aperto in un'altra applicazione",
  "exportFileLockedMsg1": "Il seguente file è bloccato",
  "exportFileLockedMsg2": " (probabilmente aperto in un'altra applicazione)",
  "exportFileLockedMsg3": " Chiudi il file e riprova. O fornisci un nome diverso per il file esportato.",
  "invalidOutputFilenameMsg":"Il nome del file di output non può contenere spazi né altri caratteri speciali. Inserisci un nome di file di output valido contenente solo caratteri alfanumerici."
}