{
  "title": "Grafico Forestale",
  "navigation": "Grafico Forestale",
  "modelselectorlabel": "Seleziona Nome Modello",
  "plotvarslabel": "Variabili da Tracciare (nessuna specificata traccia tutte le variabili)",
  "varlabelslabel": "Etichette Variabili (specificare come varname='etichetta' separate da virgole, ad es. età='Età in anni', bmi='Indice di Massa Corporea'); è possibile utilizzare \\n per interruzioni di riga all'interno di un'etichetta",
  "notelabel": "NOTA: Cambiare le etichette richiede un nuovo adattamento del modello, quindi grandi dati potrebbero richiedere tempo",
  "label3": "NOTA: I MODELLI COSTRUITI UTILIZZANDO L'OTTIMIZZAZIONE DEL MODELLO (ALLENAMENTO) NON SONO SUPPORTATI",
  "estimateoptlabel": "Opzioni di Stima",
  "estimatelabellabel": "Etichetta",
  "exponentiatelabel": "Forza Esponenziale della Stima del Parametro",
  "linecolorlabel": "Colore della Linea",
  "pointshapelabel": "Forma del Punto",
  "pointsizelabel": "Dimensione del Punto (0-10 mm)",
  "styleoptlabel": "Opzioni di Stile",
  "factorseplinelabel": "Nomi dei Fattori su Linee Separate",
  "plotbandslabel": "Bande di Tracciamento",
  "textsizelabel": "Dimensione del Testo (1-10 mm)",
  "estticklabelsizelabel": "Dimensione dell'Etichetta del Segno di Stima (1-50)",
  "help": {
    "title": "Grafico Forestale",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nQuesto crea un grafico dei coefficienti del modello, o dei coefficienti esponenziati, da un modello di regressione. Ogni variabile è tracciata nella propria riga con totali, stime dei parametri, \nintervalli di confidenza al 95% e valori p. Le variabili possono essere etichettate per consentire una presentazione migliore. Attualmente, sono supportati modelli di classe lm (modelli lineari), glm (modelli lineari generalizzati, \nche includono logistica e Poisson), coxph (Cox proporzionale ai rischi) e rq (regressione quantile).\n<br/><br/>\n<b>Seleziona Nome Modello:</b> Scegli il nome del modello come specificato quando il modello è stato adattato. Questo è un campo obbligatorio.\n<br/><br/>\n<b>Variabili da Tracciare:</b> Se hai accesso ai dati che hanno creato il modello, puoi specificare un sottoinsieme delle variabili nel modello da includere nel grafico. Se non vengono specificate variabili, \nsi predefinisce a tutte le variabili incluse.\n<br/><br/>\n<b>Etichette Variabili:</b> Specifica etichette più belle da utilizzare invece dei nomi delle variabili. Se una variabile non viene etichettata, il nome della variabile o l'etichetta esistente utilizzata quando \nil modello è stato adattato (se esiste) verrà tracciata. Queste devono essere specificate in un formato variablename=\"etichetta\", separate da virgole. Nota che includere \\n in un'etichetta forzerà\nun'interruzione di riga all'interno dell'etichetta. Questo significa che puoi specificare etichette multi-linea e potrebbe essere vantaggioso per etichette lunghe, poiché etichette lunghe lasciate su una riga lasciano meno spazio per le stime. Fare \na un riepilogo del modello con Valutazione del Modello -> Riepiloga -> Riepiloga un Modello stamperà le variabili del modello utilizzate nel caso non si abbia accesso al dataset. NOTA: C'è un \nbug attuale nel pacchetto R forestmodel che non utilizza le etichette delle variabili per i fattori nei modelli Cox - lo sviluppatore del pacchetto è stato informato. Un'alternativa fino a quando il pacchetto non è \ncorretto è rifare il modello con variabili codificate dummy invece di fattori.\n<br/><br/><br/>\n<b>Opzioni di Stima:</b>\n<br/><br/>\n<b>Etichetta:</b> Etichetta opzionale per la colonna di stima nel grafico. La regressione logistica e i modelli Cox verranno automaticamente rilevati e le stime etichettate come \"Rapporto di Odds\" e \n\"Rapporto di Rischio\", rispettivamente. Altri modelli utilizzeranno il predefinito di \"Stima\" se non specifichi nulla.\n<br/><br/>   \n<b>Forza Esponenziale della Stima del Parametro:</b> Scegli questo per forzare i valori di exp(coefficient) a essere visualizzati, cioè 2.718 elevato alla potenza del coefficiente. I coefficienti esponenziati \nsono comunemente utilizzati nei modelli di Cox proporzionale ai rischi (per rapporti di rischio), regressione logistica (per rapporti di odds), modelli log-binomiali (per rischi relativi) e Poisson \nregressione (per rapporti di tasso). Per impostazione predefinita, la regressione logistica e i modelli Cox verranno automaticamente rilevati e exp(coefficient) verrà utilizzato.\n<br/><br/>\n<b>Colore della Linea:</b> Colore della linea per gli intervalli di confidenza.\n<br/><br/>\n<b>Forma del Punto:</b> La forma dei punti per le stime dei parametri nel grafico.\n<br/><br/>\n<b>Dimensione del Punto (0-10 mm):</b>  La dimensione dei punti, in millimetri, per le stime dei parametri nel grafico. 0 mm rimuoverebbe i punti. Il predefinito è 4 mm.\n<br/><br/><br/>\n<b>Opzioni di Stile:</b>\n<br/><br/>\n<b>Nomi dei Fattori su Linee Separate:</b> Scegli questo per visualizzare i nomi delle variabili fattore su una riga separata dai livelli del fattore.\n<br/><br/>\n<b>Bande di Tracciamento:</b> Scegli questo per visualizzare regioni alternate ombreggiate per ogni riga del grafico.\n<br/><br/>\n<b>Dimensione del Testo (1-10 mm):</b> Dimensione del testo, in millimetri, nel grafico. Il predefinito è 4 mm.\n<br/><br/>\nNota: Se desideri cambiare la dimensione complessiva del grafico, la dimensione del grafico può essere impostata utilizzando il pulsante Temi nel menu a tre punti.\n<br/><br/>\n<b>Dimensione dell'Etichetta del Segno di Stima (1-50):</b> Dimensione delle etichette dei segni per l'asse delle stime.\n<br/><br/>\n<b>Pacchetti R Richiesti:</b>  forestmodel, arsenal, survival, quantreg, insight\n"
  }
}