{
  "title": "Probabilità F",
  "navigation": "Probabilità F",
  "varvals": "Inserisci il valore della variabile separato da una virgola. Esempio: 3,0.5",
  "dfnumerator": "Gradi di libertà del numeratore",
  "dfdenominator": "Gradi di libertà del denominatore",
  "labelSig": "Livello di significatività",
  "lowtail": "Coda inferiore",
  "uptail": "Coda superiore",
  "help": {
    "title": "Probabilità F",
    "r_help": "help(pf, package=stats)",
    "body": "\n            ​​\n            <b>Descrizione</b>\n            <br/>\n            Densità, funzione di distribuzione, funzione quantile e generazione casuale per la distribuzione F con df1 e df2 gradi di libertà (e parametro di non centralità ncp opzionale).\n            <br/>\n            <b>Utilizzo</b>\n            <br/>\n            <code>\n                df(x, df1, df2, ncp, log = FALSE)\n                <br/>\n                pf(q, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qf(p, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rf(n, df1, df2, ncp)\n                <br/>\n            </code>\n            <br/>\n            <b>Argomenti</b>\n            <br/>\n            <ul>\n                <li>x, q : vettore di quantili.</li>\n                \n                \n                <li>p : vettore di probabilità.</li>\n                \n                \n                <li>n : numero di osservazioni. Se la lunghezza(n) > 1, la lunghezza è presa come quella richiesta.</li>\n                \n                \n                <li>df1, df2 : gradi di libertà. Inf è consentito.</li>\n                \n                \n                <li>ncp : parametro di non centralità. Se omesso, si assume la F centrale.</li>\n                \n                \n                <li>log, log.p : logico; se TRUE, le probabilità p sono date come log(p).</li>\n                \n                \n                <li>lower.tail : logico; se TRUE (predefinito), le probabilità sono P[X ≤ x], altrimenti, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Dettagli</b>\n            <br/>\n            La distribuzione F con df1 = n1 e df2 = n2 gradi di libertà ha densità\n            <br/>\n            <code>f(x) = Γ((n1 + n2)/2) / (Γ(n1/2) Γ(n2/2)) (n1/n2)^(n1/2) x^(n1/2 - 1) (1 + (n1/n2) x)^-(n1 + n2)/2</code>\n            <br/>\n            per x > 0.\n            <br/>\n            È la distribuzione del rapporto dei quadrati medi di n1 e n2 normali standard indipendenti, e quindi del rapporto di due variabili chi-quadrato indipendenti ciascuna divisa per i suoi gradi di libertà. Poiché il rapporto di una normale e la radice quadrata media di m normali indipendenti ha una distribuzione t_m di Student, il quadrato di una variabile t_m ha una distribuzione F su 1 e m gradi di libertà.\n            <br/>\n            La distribuzione F non centrale è di nuovo il rapporto dei quadrati medi di normali indipendenti di varianza unitaria, ma quelli nel numeratore possono avere medie diverse da zero e ncp è la somma dei quadrati delle medie. Vedi Chisquare per ulteriori dettagli sulle distribuzioni non centrali.\n            <br/>\n            <br/><b>Valore</b>\n            <br/>\n            df fornisce la densità, pf fornisce la funzione di distribuzione, qf fornisce la funzione quantile e rf genera deviazioni casuali.\n            <br/>\n            Argomenti non validi restituiranno un valore di ritorno NaN, con un avviso.\n            <br/>\n            La lunghezza del risultato è determinata da n per rf, ed è il massimo delle lunghezze degli argomenti numerici per le altre funzioni.\n            <br/>\n            Gli argomenti numerici diversi da n vengono riciclati alla lunghezza del risultato. Solo i primi elementi degli argomenti logici vengono utilizzati.\n            <br/>\n            <br/><b>Nota</b>\n            <br/>\n            Fornire ncp = 0 utilizza l'algoritmo per la distribuzione non centrale, che non è lo stesso algoritmo utilizzato se ncp è omesso. Questo è per fornire un comportamento coerente nei casi estremi con valori di ncp molto vicini a zero.\n            <br/>\n            Il codice per ncp diverso da zero è principalmente destinato ad essere utilizzato per valori moderati di ncp: non sarà altamente accurato, specialmente nelle code, per valori grandi."
  }
}