{
  "title": "Test di Friedman",
  "navigation": "Test di Friedman",
  "tvarbox1": "Variabili di Risposta, 2 o più",
  "help": {
    "title": "Test di Friedman",
    "r_help": "help(friedman.test, package=stats)",
    "body": "\n<b>Descrizione</b></br>\nEsegue un test di somma dei ranghi di Friedman con dati bloccati non replicati.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## Metodo S3 predefinito:\nfriedman.test(y, groups, blocks, ...)\n## Metodo S3 per la classe 'formula'\nfriedman.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\ny: un vettore numerico di valori dei dati, o una matrice di dati.\n</li>\n<li>\ngroups: un vettore che fornisce il gruppo per gli elementi corrispondenti di y se questo è un vettore; ignorato se y è una matrice. Se non è un oggetto fattore, viene forzato a uno.\n</li>\n<li>\nblocks: un vettore che fornisce il blocco per gli elementi corrispondenti di y se questo è un vettore; ignorato se y è una matrice. Se non è un oggetto fattore, viene forzato a uno.\n</li>\n<li>\nformula: una formula della forma a ~ b | c, dove a, b e c forniscono i valori dei dati e i gruppi e blocchi corrispondenti, rispettivamente.\n</li>\n<li>\ndata: una matrice o un data frame opzionale (o simile: vedere model.frame) contenente le variabili nella formula formula. Per impostazione predefinita, le variabili vengono prese dall'ambiente(formula).\n</li>\n<li>\nsubset: un vettore opzionale che specifica un sottoinsieme di osservazioni da utilizzare.\n</li>\n<li>\nna.action: una funzione che indica cosa dovrebbe accadere quando i dati contengono NAs. Per impostazione predefinita è impostato su getOption(\"na.action\").\n</li>\n<li>\n...: ulteriori argomenti da passare a o da metodi.\n</li>\n</ul>\n<b>Dettagli</b></br>\nfriedman.test può essere utilizzato per analizzare progetti di blocco completo non replicati (cioè, c'è esattamente un'osservazione in y per ogni combinazione di livelli di gruppi e blocchi) dove l'assunzione di normalità può essere violata.</br>\nL'ipotesi nulla è che, a parte un effetto dei blocchi, il parametro di posizione di y sia lo stesso in ciascuno dei gruppi.\nSe y è una matrice, i gruppi e i blocchi vengono ottenuti dagli indici di colonna e riga, rispettivamente. Non sono ammessi NA in gruppi o blocchi; se y contiene NA, i blocchi corrispondenti vengono rimossi.</br>\n<b>Valore</b><br/>\nUna lista con classe \"htest\" contenente i seguenti componenti:<br/>\nstatistic: il valore della statistica chi-quadrato di Friedman.<br/>\nparameter: i gradi di libertà della distribuzione chi-quadrato approssimativa della statistica del test.<br/>\np.value: il valore p del test.<br/>\nmethod: la stringa carattere \"Test di somma dei ranghi di Friedman\".<br/>\ndata.name: una stringa carattere che fornisce i nomi dei dati.​<br/>\n<b>Esempi</b><br/>\n<code> \nDataframe <- data.frame(Expenses=c(20,23,19,25,26), Sales=c(48,50,55,51,49), Gender=c('m','f','f','m','m'), Deptt=c('Contabilità', 'HR', 'Vendite','Marketing','IT'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Sales,Expenses)))<br/>\nResult_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nhelp(friedman.test, package=stats)\n"
  }
}