{
  "title": "Modello Lineare Generalizzato",
  "navigation": "GLZM",
  "modelname": "Nome del modello",
  "dependent": "Variabile dipendente",
  "offset": "Offset",
  "weights": "Pesi",
  "formulaBuilder": "Costruttore di formule",
  "family": "Seleziona una famiglia e una funzione di collegamento",
  "theta": "Specifica un valore di theta (applicato solo per la famiglia binomiale negativa)",
  "expCoefficients": "Esponenzia i coefficienti",
  "help": {
    "title": "Modello Lineare Generalizzato",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>Descrizione</b></br>\n            glm viene utilizzato per adattare modelli lineari generalizzati, specificati fornendo una descrizione simbolica del predittore lineare e una descrizione della distribuzione dell'errore.\n            <br/>\nNOTA 1: È fornita una casella di testo per specificare il valore iniziale di theta, questo si applica solo alla famiglia binomiale negativa. Se omesso, viene utilizzato un stimatore del momento dopo un adattamento iniziale utilizzando un GLM di Poisson.<br/>\nIl theta iniziale calcolato è visualizzato nell'output sopra la tabella di riepilogo del GLM.<br/>\nNOTA 2: Quando si specifica una variabile contenente pesi, si prega di notare che poiché utilizziamo l'opzione na.exclude per costruire il modello, tutti i valori NA vengono automaticamente rimossi dalle variabili dipendenti e indipendenti.<br/> \nQuesto può causare una discrepanza poiché i valori NA NON vengono rimossi automaticamente dalla variabile di ponderazione. <br/>\nIn questa situazione vedrai l'errore che le lunghezze delle variabili differiscono (trovato per (pesi))<br/>\nPer affrontare questo errore vai su Variabili>Valori mancanti>Rimuovi NAs e seleziona le variabili dipendenti, indipendenti e la variabile di ponderazione da cui rimuovere i valori mancanti e ricostruire il modello.<br/>\nNOTA 3: Variabili fattoriali codificate dummy, quando si utilizza la famiglia binomiale negativa, vedere Variabili > Calcola > Codice Dummy.<br/>\nNOTA 4: L'intercetta è inclusa per impostazione predefinita, per rimuovere l'intercetta inserire -1 nel costruttore di formule\n            <br/>\n            <b>Utilizzo</b>\n            <br/>\n            <code> \n            glm(formula, family = gaussian, data, weights, subset,\n                na.action, start = NULL, etastart, mustart, offset,\n                control = list(...), model = TRUE, method = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>Argomenti</b><br/>\n            <ul>\n            <li>\n            formula: un oggetto di classe \"formula\" (o uno che può essere convertito in quella classe): una descrizione simbolica del modello da adattare. I dettagli della specificazione del modello sono forniti sotto 'Dettagli'.\n            </li>\n            <li>\n            family: una descrizione della distribuzione dell'errore e della funzione di collegamento da utilizzare nel modello. Per glm questo può essere una stringa di caratteri che nomina una funzione di famiglia, una funzione di famiglia o il risultato di una chiamata a una funzione di famiglia. Per glm.fit solo la terza opzione è supportata. (Vedi family per dettagli sulle funzioni di famiglia.)\n            </li>\n            <li>\n            data: un data frame, una lista o un ambiente opzionale (o un oggetto convertibile tramite as.data.frame in un data frame) contenente le variabili nel modello. Se non trovate nei dati, le variabili vengono prese dall'ambiente(formula), tipicamente l'ambiente da cui viene chiamato glm.\n            </li>\n            <li>\n            weights: un vettore opzionale di 'pesi precedenti' da utilizzare nel processo di adattamento. Dovrebbe essere NULL o un vettore numerico.\n            </li>\n            <li>\n            subset: un vettore opzionale che specifica un sottoinsieme di osservazioni da utilizzare nel processo di adattamento.\n            </li>\n            <li>\n            na.action: una funzione che indica cosa dovrebbe accadere quando i dati contengono NAs. Il valore predefinito è impostato dall'impostazione na.action delle opzioni, ed è na.fail se non impostato. Il valore predefinito 'di fabbrica' è na.omit. Un altro valore possibile è NULL, nessuna azione. Il valore na.exclude può essere utile.\n            </li>\n            </ul>\n            <b>Dettagli</b><br/>\n            Un predittore tipico ha la forma risposta ~ termini dove risposta è il vettore di risposta (numerico) e termini è una serie di termini che specifica un predittore lineare per la risposta. Per le famiglie binomiale e quasibinomiale, la risposta può anche essere specificata come un fattore (quando il primo livello denota il fallimento e tutti gli altri il successo) o come una matrice a due colonne con le colonne che forniscono i numeri di successi e fallimenti. Una specificazione dei termini della forma primo + secondo indica tutti i termini nel primo insieme a tutti i termini nel secondo con eventuali duplicati rimossi.<br/>\n            <b>Valore</b><br/>\n            Un oggetto di classe \"glm\" è un elenco contenente almeno i seguenti componenti:\n            <ul>\n            <li>\n            coefficients: un vettore nominato di coefficienti\n            </li>\n            <li>\n            residuals: i residui di lavoro, cioè i residui nell'ultima iterazione dell'adattamento IWLS. Poiché i casi con pesi zero vengono omessi, i loro residui di lavoro sono NA.\n            </li>\n            <li>\n            fitted.values: i valori medi adattati, ottenuti trasformando i predittori lineari mediante l'inverso della funzione di collegamento.\n            </li>\n            <li>\n            rank: il rango numerico del modello lineare adattato.\n            </li>\n            <li>\n            family: l'oggetto famiglia utilizzato.\n            </li>\n            <li>\n            linear.predictors: l'adattamento lineare sulla scala di collegamento.\n            deviance: fino a una costante, meno due volte il logaritmo massimo della verosimiglianza. Dove sensato, la costante è scelta in modo che un modello saturo abbia devianza zero.\n            </li>\n            <li>\n            aic\t: Una versione del criterio di informazione di Akaike, meno due volte il logaritmo massimo della verosimiglianza più due volte il numero di parametri, calcolato tramite il componente aic della famiglia. Per le famiglie binomiale e di Poisson, la dispersione è fissata a uno e il numero di parametri è il numero di coefficienti. Per le famiglie gaussiane, Gamma e gaussiane inverse, la dispersione è stimata dalla devianza residua e il numero di parametri è il numero di coefficienti più uno. Per una famiglia gaussiana, viene utilizzato il MLE della dispersione, quindi questo è un valore valido di AIC, ma per le famiglie Gamma e gaussiane inverse non lo è. Per le famiglie adattate tramite quasi-verosimiglianza, il valore è NA.\n            </li>\n            </ul>\n            <b>Pacchetto</b></br>\nglm</br>\n<b>Aiuto</b></br>\nhelp(glm, package ='stats')\n"
  }
}