{
  "title": "Istogramma con Curve Normali Sovrapposte",
  "navigation": "Istogramma",
  "x": "Asse X, specifica una variabile numerica(i)",
  "bins": "Specifica il numero di bin",
  "fill": "Specifica una variabile di raggruppamento (Categoria)",
  "binwidth": "Larghezza del bin",
  "barcolor": "Seleziona facoltativamente un colore di riempimento (Dopo la selezione del colore, fai clic al di fuori del controllo per applicare)",
  "alpha": "Opacità (0-1)",
  "flip": "Capovolgi Asse",
  "specify_a_title": "Inserisci un titolo",
  "x_title": "Etichetta asse X",
  "y_title": "Etichetta asse Y",
  "Facetrow": "Riga di Facet",
  "Facetcolumn": "Colonna di Facet",
  "Facetwrap": "Avvolgimento di Facet (se scelto, qualsiasi selezione di riga e colonna di Facet sarà ignorata)",
  "Facetscale": "Scala di Facet",
  "normalCurveColor": "Seleziona facoltativamente un colore per la curva normale (Dopo la selezione del colore, fai clic al di fuori del controllo per applicare)",
  "rugPlot": "Visualizza un grafico a strisce (adatto per piccoli set di dati)",
  "normalCurve": "Visualizza una curva normale (I valori mancanti vengono rimossi per visualizzare la curva)",
  "help": {
    "title": "Istogramma",
    "r_help": "help(geom_histogram, package=ggplot2)",
    "body": "\n            <b>Descrizione</b></br>\n            Un istogramma è una rappresentazione grafica della distribuzione di dati numerici. È una stima della distribuzione di probabilità di una variabile continua (variabile quantitativa). Puoi specificare una larghezza del bin o utilizzare il valore predefinito, vedi sotto. I Facet possono essere creati facoltativamente specificando una variabile fattoriale. Puoi anche specificare facoltativamente temi e specificare un titolo e etichette per gli assi x e y.</br>\n            Quando hai selezionate più variabili per la variabile dell'asse X, creiamo un istogramma separato per ogni variabile dell'asse x. Sovrapponiamo facoltativamente una curva normale e un grafico a strisce</br>\n            <br/>\n            <b>Utilizzo</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Conteggi\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argomenti</b><br/>\n            <ul>\n            <li>\n            data: Il dataset predefinito​\n            </li>\n            <li>\n            aes(): Genera mappature estetiche che descrivono come le variabili nei dati sono mappate alle proprietà visive (estetiche) dei geoms.​\n            </li>\n            <li>\n            x: Una variabile numerica/scalare per tracciare l'istogramma.​\n            </li>\n            <li>\n            geom_histogram: Crea un istogramma, per impostazione predefinita, stat_bin utilizza 30 bin - questo non è un buon valore predefinito, ma l'idea è di farti sperimentare con diverse larghezze di bin..\n            </li>\n            <li>\n            geom_rug: Crea un grafico a strisce    \n            </li>\n            <li>\n            stat_function: Crea una curva normale (Nota: i valori mancanti devono essere rimossi per visualizzare la curva)    \n            </li>\n            <li>\n            Labs(): Cambia le etichette degli assi e i titoli della legenda (Questo è facoltativo)​\n            </li>\n            <li>\n            facet_grid(): Dispone i pannelli in una griglia (Questo è facoltativo)​\n            </li>\n            <li>\n            theme_calc(): Specifica il tema della calcolatrice (Questo è facoltativo)​\n            </li>\n            <li>\n            coord_flip(): Capovolgi l'asse (Questo è facoltativo)\n            </li>\n            <li>\n            alpha: Prende un valore tra 0-1, 1 significa nessuna opacità. L'opacità si applica al colore di riempimento dell'istogramma\n            </li>\n            </ul>\n            <b>Pacchetto</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Aiuto</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Fai clic sul pulsante Aiuto R per ottenere aiuto dettagliato su R. Puoi anche inserire help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n           "
  }
}