{
  "language": {
    "language": "Italian",
    "key": "it"
  },
  "original_json": {
    "title": "Istogramma con curve normali sovrapposte",
    "navigation": "Istogramma",
    "x": "Asse X, specifica una variabile numerica(o)",
    "bins": "Specifica il numero di bin",
    "fill": "Specifica una variabile di raggruppamento (Categoria)",
    "binwidth": "Larghezza del bin",
    "barcolor": "Seleziona facoltativamente un colore di riempimento (Dopo la selezione del colore, fai clic al di fuori del controllo per applicare)",
    "alpha": "Opacità (0-1)",
    "flip": "Capovolgi asse",
    "specify_a_title": "Inserisci un titolo",
    "x_title": "Etichetta asse X",
    "y_title": "Etichetta asse Y",
    "legends": "Mostra legende e, in tal caso, posizione delle legende (predefinito a destra)",
    "facets_lbl": "Fasce",
    "Facetrow": "Riga delle fasce",
    "Facetcolumn": "Colonna delle fasce",
    "Facetwrap": "Avvolgimento delle fasce (se scelto, qualsiasi selezione di riga e colonna delle fasce verrà ignorata)",
    "Facetscale": "Scala delle fasce",
    "normalCurveColor": "Seleziona facoltativamente un colore per la curva normale (Dopo la selezione del colore, fai clic al di fuori del controllo per applicare)",
    "rugPlot": "Visualizza un grafico a tappeto (adatto per piccoli set di dati)",
    "normalCurve": "Visualizza una curva normale",
    "normalCurveHeightScaleFactor": "Qualsiasi numero, incluso decimale, per scalare l'altezza della curva normale (per barre impilate). Digita 0 per nessuna scalatura",
    "showCountsChk": "Visualizza conteggi sui bin (i conteggi non verranno visualizzati se viene selezionata una fascia)",
    "histogramBarPosition": "Posizione della barra, se viene scelta un gruppo (impilato o affiancato)",
    "histogramBinDetailsChk": "Mostra dettagli del bin dell'istogramma in una tabella",
    "label1": "Linee orizzontali",
    "yIntercept": "Inserisci valori di intercetta Y separati da virgola per le linee orizzontali, ad es. 100, 200, 300 (cioè, valori di conteggio). Le linee verranno tracciate solo se è presente un asse dei conteggi",
    "hLineColor": "Seleziona un colore per la/e linea/e e etichetta/e (Dopo la selezione del colore, fai clic al di fuori del controllo per applicare)",
    "lineType": "Seleziona il tipo di linea",
    "horizontalLinelabel": "Specifica etichette separate da virgola (senza virgolette) per la/e linea/e orizzontale/i",
    "horizontalLinelabel_angle_text": "Angolo per inclinare il testo dell'etichetta della linea orizzontale (predefinito 0 per nessuna inclinazione)",
    "label2": "Nota: valori maggiori spostano il testo più in basso, valori minori spostano il testo più in alto",
    "addHoriRefLines": "Aggiungi linee di riferimento",
    "xyLimits": "Limiti degli assi X e Y",
    "label5": "Specifica un intervallo per i valori degli assi X e Y",
    "rangeXValues": "Specifica l'intervallo dell'asse X, ad es. 0,100",
    "labelHori_HorizontalJustification": "Nota: valori maggiori posizionano il testo a sinistra, valori minori spostano il testo a destra",
    "verticalJustification": "Controlla la giustificazione verticale dell'etichetta",
    "hori_HorizontalJustification": "Controlla la giustificazione orizzontale dell'etichetta",
    "addlLabelHlineTextPositionOffset": "Regolazioni aggiuntive per posizionare il testo dell'etichetta per le linee orizzontali",
    "horiMovementHReflineLabel": "Sposta il testo orizzontalmente a sinistra o a destra - usa qualsiasi numero con segno + o - (lascia 0 per asse categoriale)",
    "nobreaklineHRefLabelandValueChk": "Seleziona questa casella per rimuovere l'interruzione di riga tra il valore dell'etichetta e il testo dell'etichetta",
    "vertiMovementHReflineLabel": "Sposta il testo verticalmente su o giù - usa qualsiasi numero con segno + o - (lascia 0 per asse categoriale)",
    "help": {
      "title": "Istogramma",
      "r_help": "help(geom_histogram, package=ggplot2)",
      "body": "\n            <b>Descrizione</b></br>\n            Un istogramma è una rappresentazione grafica della distribuzione di dati numerici. È una stima della distribuzione di probabilità di una variabile continua (variabile quantitativa). Puoi specificare una larghezza del bin o utilizzare il valore predefinito, vedi sotto. Le fasce possono essere create facoltativamente specificando una variabile fattoriale. Puoi anche specificare facoltativamente temi e specificare un titolo e etichette per gli assi x e y.</br>\n            Quando hai selezionato più variabili per la variabile dell'asse X, creiamo un istogramma separato per ogni variabile dell'asse x. Sovrapponiamo facoltativamente una curva normale e un grafico a tappeto</br>\n            <br/>\n            <b>Utilizzo</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Conteggi\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argomenti</b><br/>\n            <ul>\n            <li>\n            data: Il dataset predefinito​\n            </li>\n            <li>\n            aes(): Genera mappature estetiche che descrivono come le variabili nei dati sono mappate a proprietà visive (estetiche) dei geoms.​\n            </li>\n            <li>\n            x: Una variabile numerica/scalare per tracciare l'istogramma. ​\n            </li>\n            <li>\n            geom_histogram: Crea un istogramma, per impostazione predefinita, stat_bin utilizza 30 bin - questo non è un buon predefinito, ma l'idea è farti sperimentare con diverse larghezze di bin..\n            </li>\n            <li>\n            geom_rug: Crea un grafico a tappeto    \n            </li>\n            <li>\n            stat_function: Crea una curva normale (Nota: i valori mancanti devono essere rimossi affinché la curva venga visualizzata)    \n            </li>\n            <li>\n            Labs(): Cambia le etichette degli assi e i titoli delle legende (questo è facoltativo)​\n            </li>\n            <li>\n            facet_grid(): Dispone i pannelli in una griglia (questo è facoltativo)​\n            </li>\n            <li>\n            theme_calc(): Specifica il tema della calcolatrice (questo è facoltativo)​\n            </li>\n            <li>\n            coord_flip(): Capovolgi l'asse (questo è facoltativo)\n            </li>\n            <li>\n            alpha: Prende un valore tra 0-1, 1 significa nessuna opacità. L'opacità si applica al colore di riempimento dell'istogramma\n            </li>\n            </ul>\n            <b>Pacchetto</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Aiuto</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Fai clic sul pulsante Aiuto R per ottenere aiuto dettagliato su R. Puoi anche inserire help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n           "
    }
  }
}