{
  "title": "Installa pacchetto(i) R",
  "navigation": "Installa pacchetto(i) R",
  "package_name": "Si prega di inserire il nome(i) di uno o più pacchetto(i) separati da una virgola",
  "instruction_text": "\nNOTA: I nomi dei pacchetti R sono case sensitive. Puoi installare più nomi di pacchetti utilizzando , come separatore\nEsempio 1: foreign\nEsempio 2: foreign, car, MASS",
  "instruction_text1": "\nNOTA: Devi avere accesso in scrittura al percorso selezionato qui sotto, altrimenti riavvia l'applicazione selezionando l'opzione esegui come \nadministratore",
  "repository": "Inserisci l'URL del repository CRAN, il predefinito https://cloud.r-project.org/ installa dal mirror CRAN più vicino a te.",
  "label1": "Esempio 1: foreign",
  "label2": "NOTA: Il logo R che viene visualizzato sulla barra dei menu è di proprietà del R foundation",
  "installPath": "Seleziona il percorso della libreria R in cui verrà installato il pacchetto R",
  "help": {
    "title": "Installa pacchetto(i) R",
    "r_help": "help(install.packages)",
    "body": "\n            <b>Descrizione</b></br>\n            Installa o aggiorna uno o più pacchetti R nel percorso della libreria selezionato.</br>\n            NOTA:</br>\n            1. Installeremo tutti i pacchetti di cui i pacchetti specificati dipendono, importano o collegano</br>\n            2. Se stai aggiornando un pacchetto esistente, devi riavviare l'applicazione BlueSky Statistics.</br>\n            3. Caricheremo il pacchetto appena installato/aggiornato dopo l'installazione.</br>\n            4. Per impostazione predefinita, installeremo sempre nella libreria personale R dell'utente sulla macchina locale.</br>\n            5. Se lo stesso pacchetto R è installato nella posizione della libreria personale e di sistema (La posizione della libreria di sistema è la posizione di installazione predefinita che contiene i pacchetti \n                che forniamo di default con BlueSky Statistics), carichiamo il pacchetto dalla posizione personale.</br>\n            <br/>\n            <b>Utilizzo</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Percorso alla libreria utente o di sistema\", repos = \"Percorso al repository contenente il pacchetto\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Argomenti</b><br/>\n            <ul>\n            <li>\n            pkgs: vettore di caratteri dei nomi dei pacchetti le cui versioni correnti devono essere scaricate dal repository specificato.\n            </li>\n            <li>\n            lib: vettore di caratteri che fornisce il percorso della libreria sulla macchina locale in cui installare il/i pacchetto/i. Di default, ci riferiamo sempre alla posizione della libreria personale dell'utente.\n            </li>\n            <li>\n            repos: vettore di caratteri, l'URL di base dei repository da utilizzare, ad esempio, l'URL di un mirror CRAN come \"https://cloud.r-project.org\".\n            </li>\n            <li>\n            BSkypackageinstall: Questo è un flag che l'applicazione BlueSky Statistics utilizza internamente per segnalare che \n            il pacchetto è installato tramite il menu e per passarci attraverso.\n            </li>\n            </ul>\n            <b>Valore</b><br/>\n            NULL invisibile.<br/>\n            <b>Esempi</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Pacchetto</b></br>\n            broom</br>\n            <b>Aiuto</b></br>\n            Per aiuto dettagliato clicca sull'icona R nell'angolo in alto a destra di questo overlay di dialogo\n\n"
  }
}