{
  "title": "Stima di Kaplan-Meier, Un Gruppo",
  "navigation": "Stima di Kaplan-Meier, Un Gruppo",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Evento (1 = evento, 0 = censura)",
  "label1": "Tipo di Grafico",
  "survivalradio": "Sopravvivenza",
  "inciradio": "Fallimento",
  "printallest": "Tabella delle Stime Inclusa Tutti i Tempi",
  "printspecest": "Tabella delle Stime per Tempi Specifici",
  "spectimes": "Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1)",
  "styleoptions": "Opzioni di Stile",
  "axisoptions": "Opzioni degli Assi",
  "label12": "Clicca sul pulsante ? in alto a destra della finestra di dialogo per dettagli sui dataset di esempio e sul formato dei dati supportato.",
  "titlebox": "Titolo del Grafico",
  "plottitlesizelabel": "Dimensione del Titolo del Grafico (5-50)",
  "themedropdown": "Tema del Grafico",
  "label2": "Numero a Rischio",
  "natriskchkbox": "Includi Numero a Rischio",
  "risktableprop": "Altezza della Tabella dei Rischi (0-1)",
  "risktablepos": "Posizione della Tabella dei Rischi",
  "risktablevaluesize": "Dimensione del Valore della Tabella dei Rischi (1-15)",
  "risktabletitlesize": "Dimensione del Titolo della Tabella dei Rischi (5-50)",
  "risktableaxislabelsize": "Dimensione dell'Etichetta dell'Asse della Tabella dei Rischi (5-50)",
  "risktableticklabelsize": "Dimensione dell'Etichetta dei Tick della Tabella dei Rischi (5-50)",
  "risktableclean": "Rimuovi Assi e Linee della Griglia dalla Tabella dei Rischi",
  "label3": "Opzioni della Linea",
  "linesize": "Dimensione (0-5)",
  "linecolor": "Colore",
  "label4": "Intervallo di Confidenza",
  "cichkbox": "includi CI al 95%",
  "cistyle": "Stile",
  "citransparency": "Trasparenza (0-1)",
  "label5": "Tempi Censurati",
  "censorchkbox": "Includi Tempi Censurati",
  "censorsize": "Dimensione (0-10)",
  "medsurvivalline": "Indica la Sopravvivenza Mediana (h=orizzontale, v=verticale)",
  "label6": "Asse di Sopravvivenza",
  "survaxislabel": "Etichetta",
  "axislabelsize": "Dimensione dell'Etichetta dell'Asse (5-50)",
  "label7": "Scala",
  "defbutton": "proporzione",
  "pctbutton": "percentuale",
  "survaxislimits": "Limiti dell'asse sulla scala di proporzione (0-1) - inserisci 'c(min, max)'",
  "survtickinc": "Incrementi dei Tick (0-1)",
  "label8": "Asse del Tempo",
  "timeaxislabel": "Etichetta",
  "timeaxislimits": "Limiti dell'Asse (NULL è predefinito, inserisci 'c(min,max)' per cambiare es. 'c(0,20)')",
  "timetickinc": "Incrementi dei Tick (NULL è predefinito, inserisci un numero per cambiare, min=0)",
  "ticklabelsize": "Dimensione dell'Etichetta dei Tick dell'Asse (5-50)",
  "help": {
    "title": "Stima di Kaplan-Meier, Un Gruppo",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tVedi il dataset di esempio nella directory di installazione, la posizione predefinita è nella lettera dell'unità:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. La variabile Followup_time dovrebbe essere inserita come il tempo fino all'evento o censura e la variabile Event dovrebbe essere inserita come l'Evento (1 = evento, 0 = censura).<br/>\n            Questo dataset è una versione aggiornata del dataset mockstudy nel pacchetto arsenal.<br/><br/>\t\t\n            <b>Curve di sopravvivenza di Kaplan-Meier</b>\n            <br/>\n            <br/>\n            Queste sono utilizzate per stimare il rischio cumulativo di non avere un certo evento (o viceversa, avere un certo evento) nel corso del tempo dopo l'inizio del follow-up per quell'evento (o tempo zero). I soggetti devono essere a rischio per l'evento a partire dal tempo zero.\n            <br/>\n            <br/>\n            <b>Tempo:</b Lunghezza del tempo fino a un evento, se l'evento è avvenuto, o ultimo follow-up per quell'evento, se l'evento non è avvenuto, per ciascun soggetto\n            <br/><br/>\n            <b>Evento:</b> Indicatore numerico di se l'evento è avvenuto o meno (1=evento, 0=censura) per ciascun soggetto\n            <br/><br/>\n            <b>Tipo di Grafico:</b> Se desideri tracciare la probabilità di non avere l'evento (sopravvivenza) o avere l'evento (fallimento)\n            <br/><br/>\n            <b>Tabella delle Stime Inclusa Tutti i Tempi:</b> Opzione per includere una tabella che ha le probabilità di stima di sopravvivenza e evento per ciascun tempo osservato nel dataset\n            <br/>\n            <br/>\n\t\t\t<b>Tabella delle Stime per Tempi Specifici:</b> Opzione per includere una tabella che ha le probabilità di stima di sopravvivenza per un insieme di tempi selezionati dall'utente.\n\t\t\t<br/><br/>\n\t\t\t<b>Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1):</b> Questi sono i tempi specifici che saranno inclusi nella tabella per tempi specifici. Possono essere specificati individualmente con virgole, o come una sequenza di valori equidistanti.\n\t\t\t<br/><br/>\n            Le tabelle vengono restituite con la dimensione del campione, il numero di soggetti con l'evento, il tempo mediano di sopravvivenza (se definito), il tempo medio di sopravvivenza limitato e il tempo mediano di follow-up. Il tempo mediano di follow-up è calcolato utilizzando l'estimatore di Kaplan-Meier inverso, che tratta i veri eventi come osservazioni censurate e le vere osservazioni censurate come eventi. Pertanto, l'\"evento\" in questo stimatore è \"seguire i soggetti per tutto il tempo che lo studio potrebbe\".\n            <br/>\n            Una tabella delle stime di sopravvivenza e evento di Kaplan-Meier è fornita a ciascun tempo osservato nel dataset, con intervalli di confidenza al 95%. \n            <br/>\n            <br/>\n            <b>Pacchetti Richiesti:</b> survival, broom, survminer, dplyr, arsenal, ggthemes \n            <br/>\n            <br/>\n            <br/>           \n            <b>Opzioni di Stile</b>\n            <br/>\n            <br/>\n            <b>Titolo del Grafico:</b> Titolo del grafico; elimina tutto il testo per nessun titolo\n            <br/><br/>\n\t\t\t<b>Dimensione del Titolo del Grafico:</b> Dimensione del titolo del grafico.\n\t\t\t<br/><br/>\n            <b>Tema del Grafico:</b> Stile generale del grafico\n            <br/><br/>\n            <b>Includi Numero a Rischio:</b> Facoltativamente, includi una tabella per il numero di soggetti ancora a rischio nel tempo in fondo al grafico.  <b>Posizione della Tabella dei Rischi</b> specifica se desideri che la tabella sia all'esterno degli assi o all'interno degli assi.  L'<b>Altezza della Tabella dei Rischi</b> controlla la proporzione dell'area di tracciamento che la tabella occuperà. Questa opzione viene ignorata quando la posizione della tabella dei rischi è all'interno degli assi. \n\t\t\tLa <b>Dimensione del Valore della Tabella dei Rischi</b> controlla la dimensione dei numeri a rischio. La <b>Dimensione del Titolo della Tabella dei Rischi</b> controlla la dimensione del titolo per la tabella del numero a rischio.\n\t\t\tLa <b>Dimensione dell'Etichetta dell'Asse della Tabella dei Rischi</b> controlla la dimensione delle etichette degli assi.\n\t\t\tLa <b>Dimensione dell'Etichetta dei Tick della Tabella dei Rischi</b> controlla la dimensione delle etichette dei tick per i tempi nella tabella del numero a rischio. Se si desidera rimuovere tutti gli assi e le linee della griglia \n\t\t\tdalla tabella del numero a rischio, l'opzione <b>Rimuovi Assi e Linee della Griglia dalla Tabella dei Rischi</b> può essere selezionata. Questo includerà solo i numeri a rischio nella tabella.\n            <br/>\n            <br/>\n            <b>Opzioni della Linea:</b>\n            <b>Dimensione</b> controlla lo spessore e <b>Colore</b> controlla il colore della linea tracciata. Si può opzionalmente includere un intervallo di confidenza al 95% per le stime in formato <b>ribbon</b> (area ombreggiata) o <b>step</b> (linea). <b>Trasparenza</b> controlla quanto è scura la fascia ed è ignorata quando l'opzione step è selezionata. <b>Tempi Censurati</b> (quando i soggetti non sono più a rischio per l'evento) possono essere indicati sulla linea con simboli \"+\". La dimensione dei simboli \"+\" può essere regolata. L'opzione <b>Indica la Sopravvivenza Mediana</b> includerà linee orizzontali o verticali al momento in cui il 50% dei soggetti è stimato aver avuto l'evento. Il tempo mediano è indefinito se la curva di sopravvivenza non incrocia il 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opzioni degli Assi</b>\n            <br/> \n            <br/> \n            L'opzione <b>Etichetta</b> specifica l'etichetta di testo per l'asse.  I <b>Limiti dell'Asse</b> specificano i valori minimi e massimi dell'asse.  L'opzione <b>Incrementi dei Tick</b> controlla la spaziatura dei tick sull'asse.  Gli incrementi sull'asse del tempo controllano anche i tempi per la tabella opzionale del numero a rischio.\n            <br/> \n            L'asse di sopravvivenza <b>Scala</b> opzione specifica se si desidera che le stime siano su una scala di proporzione (0-1) o percentuale (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione dell'Etichetta dell'Asse:</b>  Questo controlla la dimensione delle etichette degli assi di sopravvivenza e tempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione dell'Etichetta dei Tick dell'Asse:</b>  Questo controlla la dimensione delle etichette dei tick degli assi di sopravvivenza e tempo.\n"
  }
}