{
  "title": "Stima di Kaplan-Meier, Confronta Gruppi",
  "navigation": "Stima di Kaplan-Meier, Confronta Gruppi",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Evento (1 = evento, 0 = censura)",
  "groupvar": "Gruppo",
  "label1": "Tipo di Grafico",
  "survivalradio": "Sopravvivenza",
  "inciradio": "Fallimento",
  "allesttable": "Tabella delle Stime Inclusa Tutti i Tempi",
  "printspecest": "Tabella delle Stime per Tempi Specifici",
  "spectimes": "Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1)",
  "styleoptions": "Opzioni di Stile",
  "axisoptions": "Opzioni degli Assi",
  "label12": "Clicca sul pulsante ? in alto a destra della finestra di dialogo per dettagli sui dataset di esempio e sul formato dei dati supportato.",
  "titlebox": "Titolo del Grafico",
  "plottitlesizelabel": "Dimensione del Titolo del Grafico (5-50)",
  "themedropdown": "Tema del Grafico",
  "label2": "Numero a Rischio",
  "natriskchkbox": "Includi Numero a Rischio",
  "risktableprop": "Altezza della Tabella di Rischio (0-1)",
  "risktablepos": "Posizione della Tabella di Rischio",
  "risktabletext": "Includi etichette degli strati",
  "risktablevaluesize": "Dimensione dei Valori della Tabella di Rischio (1-15)",
  "risktabletitlesize": "Dimensione del Titolo della Tabella di Rischio (5-50)",
  "risktableaxislabelsize": "Dimensione dell'Etichetta dell'Asse della Tabella di Rischio (5-50)",
  "risktableticklabelsize": "Dimensione dell'Etichetta dei Tick della Tabella di Rischio (5-50)",
  "risktableclean": "Rimuovi Assi e Linee della Griglia dalla Tabella di Rischio",
  "label2b": "Legenda",
  "legendpos": "Posizione",
  "legendtitle": "Titolo",
  "legendlabels": "Etichette dei Valori (il valore predefinito è NULL; fornire in ordine di strati; ad esempio c('Maschio', 'Femmina')):",
  "legendfontsize": "Dimensione delle Etichette della Legenda (5-50)",
  "label3": "Opzioni della Linea",
  "linesize": "Dimensione (0-5)",
  "linecolor": "Palette di Colori",
  "label4": "Intervallo di Confidenza",
  "cichkbox": "includi CI al 95%",
  "cistyle": "Stile",
  "citransparency": "Trasparenza (0-1)",
  "label5": "Tempi Censurati",
  "censorchkbox": "Includi Tempi Censurati",
  "censorsize": "Dimensione (0-10)",
  "medsurvivalline": "Indica la Sopravvivenza Mediana (h=orizzontale, v=verticale)",
  "label5b": "P-Value",
  "pvaluechkbox": "Includi p-value",
  "label5c": "Tipo",
  "logrank": "Log-Rank",
  "gehanbreslow": "Gehan-Breslow (Wilcoxon)",
  "taroneware": "Tarone-Ware",
  "petopeto": "Peto-Peto",
  "modpetopeto": "Peto-Peto Modificato",
  "flemharr": "Flemington-Harrington",
  "pvaluelocation": "Posizione ((x,y), ad esempio c(tempo, proporzione)):",
  "pvaluesize": "Dimensione",
  "label6": "Asse di Sopravvivenza",
  "survaxislabel": "Etichetta",
  "label7": "Scala",
  "defbutton": "proporzione",
  "pctbutton": "percentuale",
  "survaxislimits": "Limiti dell'asse sulla scala di proporzione (0-1) - inserisci 'c(min, max)'",
  "survtickinc": "Incrementi dei Tick Mark (0-1)",
  "label8": "Asse del Tempo",
  "timeaxislabel": "Etichetta",
  "timeaxislimits": "Limiti dell'Asse (NULL è predefinito, inserisci 'c(min,max)' per cambiare ad esempio 'c(0,20)'",
  "timetickinc": "Incrementi dei Tick Mark (NULL è predefinito, inserisci un numero per cambiare, min=0",
  "axislabelsize": "Dimensione dell'Etichetta dell'Asse (5-50)",
  "ticklabelsize": "Dimensione dell'Etichetta del Tick dell'Asse (5-50)",
  "help": {
    "title": "Stima di Kaplan-Meier, Confronta Gruppi",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tVedi il dataset di esempio nella directory di installazione, la posizione predefinita è nella lettera dell'unità:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\survival\\mockstudy_upd.RData. La variabile Followup_time dovrebbe essere inserita come il tempo fino all'evento o censura e la variabile Event dovrebbe essere inserita come l'Evento (1 = evento, 0 = censura). La variabile sesso dovrebbe essere la variabile di gruppo.<br/>\n            Questo dataset è una versione aggiornata del dataset mockstudy nel pacchetto arsenal.<br/><br/>\t\t\t\n            <b>Confronto delle curve di sopravvivenza di Kaplan-Meier</b>\n            <br/>\n            <br/>\n            Queste sono utilizzate per stimare il rischio cumulativo di non avere un certo evento (o viceversa, avere un certo evento) nel corso del tempo dopo l'inizio del follow-up per quell'evento (o tempo zero). I soggetti devono essere a rischio per l'evento a partire dal tempo zero.\n            <br/>\n            <br/>\n            <b>Tempo:</b> Lunghezza del tempo fino a un evento, se l'evento è avvenuto, o ultimo follow-up per quell'evento, se l'evento non è avvenuto, per ciascun soggetto\n            <br/><br/>\n            <b>Evento:</b> Indicatore numerico di se l'evento è avvenuto o meno (1=evento, 0=censura) per ciascun soggetto\n            <br/><br/>\n            <b>Gruppo:</b> Gruppi che vuoi confrontare\n            <br/><br/>\n            <b>Tipo di Grafico:</b> Se vuoi tracciare la probabilità di non avere l'evento (sopravvivenza) o avere l'evento (fallimento)\n            <br/><br/>\n            <b>Tabella delle Stime Inclusa Tutti i Tempi:</b> Opzione per includere una tabella che ha le probabilità di stima di sopravvivenza e evento per ciascun tempo osservato nel dataset\n            <br/>\n            <br/>\n\t\t\t<b>Tabella delle Stime per Tempi Specifici:</b> Opzione per includere una tabella che ha le probabilità di stima di sopravvivenza per un insieme di tempi selezionati dall'utente.\n\t\t\t<br/><br/>\n\t\t\t<b>Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1):</b> Questi sono i tempi specifici che saranno inclusi nella tabella per tempi specifici. Possono essere specificati individualmente con virgole, o come una sequenza di valori equidistanti.\n\t\t\t<br/><br/>\n            Una tabella è prodotta con la dimensione del campione, il numero di soggetti con l'evento, il tempo mediano di sopravvivenza (se definito), e il tempo mediano di follow-up per gruppo e complessivo. Il tempo mediano di follow-up è una stima del tempo di follow-up \"tipico\". È calcolato utilizzando l'estimatore di Kaplan-Meier inverso, che tratta i veri eventi come osservazioni censurate e le vere osservazioni censurate come eventi. Pertanto, l'\"evento\" in questo stimatore è \"seguire i soggetti per tutto il tempo che lo studio potrebbe\".\n            <br/>\n            Le curve di sopravvivenza sono confrontate utilizzando diversi metodi, con il log-rank e Gehan-Breslow (Wilcoxon) che sono i più comunemente riportati.\n            Una tabella delle stime di sopravvivenza e evento di Kaplan-Meier è fornita a ciascun tempo osservato nel dataset, con intervalli di confidenza al 95%. \n            <br/>\n            <br/>\n            <b>Pacchetti Richiesti:</b> survival, broom, survminer, dplyr, arsenal, ggthemes, RColorBrewer, ggsci\n            <br/>\n            <br/>\n            <br/>\n            <b>Opzioni di Stile</b>\n            <br/>\n            <br/>\n            <b>Titolo del Grafico:</b> Titolo del grafico; elimina tutto il testo per nessun titolo\n            <br/><br/>\n\t\t\t<b>Dimensione del Titolo del Grafico:</b> Dimensione del titolo del grafico.\n\t\t\t<br/><br/>\t\t\t\n            <b>Tema del Grafico:</b> Stile generale del grafico\n            <br/><br/>\n            <b>Numero a Rischio:</b> Opzionalmente, includi una tabella per il numero di soggetti ancora a rischio nel tempo in fondo al grafico.  <b>Posizione della Tabella di Rischio</b> specifica se vuoi che la tabella sia all'esterno o all'interno degli assi.  L'<b>Altezza della Tabella di Rischio</b> controlla la proporzione dell'area di tracciamento che la tabella occuperà.  L'<b>Includi etichette degli strati</b> controlla se le etichette degli strati sono incluse o meno.  Se no, gli strati saranno differenziati solo per colore. Le opzioni di posizione della tabella e delle etichette degli strati vengono ignorate quando la posizione della tabella di rischio è all'interno degli assi.\n\t\t\tLa <b>Dimensione dei Valori della Tabella di Rischio</b> controlla la dimensione dei numeri a rischio. La <b>Dimensione del Titolo della Tabella di Rischio</b> controlla la dimensione del titolo per la tabella del numero a rischio.\n\t\t\tLa <b>Dimensione dell'Etichetta dell'Asse della Tabella di Rischio</b> controlla la dimensione delle etichette degli assi. \n\t\t\tLa <b>Dimensione dell'Etichetta dei Tick della Tabella di Rischio</b> controlla la dimensione delle etichette dei tick. Se si desidera rimuovere tutti gli assi e le linee della griglia \n\t\t\tdalla tabella del numero a rischio, l'opzione <b>Rimuovi Assi e Linee della Griglia dalla Tabella di Rischio</b> può essere selezionata. Questo includerà solo i numeri a rischio nella tabella.           \n            <br/><br/>\n            <b>Opzioni della Legenda:</b>\n            <br/>\n            L'opzione <b>Posizione</b> controlla la posizione della legenda (alto, basso, sinistra, destra).  Il <b>Titolo</b> è il titolo della legenda.  Per rimuovere il titolo, rimuovi tutto il testo dalla casella di testo.  <b>Etichette dei Valori</b> determina le etichette con cui gli strati saranno mostrati nella legenda.  Importante: Se vuoi cambiare il predefinito, devono essere specificati nell'ordine di apparizione nella legenda.  Cambiare le etichette NON cambia il colore associato a ciascun strato.\n\t\t\tL'opzione <b>Dimensione delle Etichette della Legenda</b> controlla la dimensione di tutto il testo contenuto nella legenda.\n            <br/>\n            <br/>\n            <b>Opzioni della Linea:</b>\n            <br/>\n            <b>Dimensione</b> controlla lo spessore e <b>Palette di Colori</b> controlla i colori delle linee tracciate. Scegli una delle opzioni \"grigie\" per ottenere una palette in scala di grigi. Sono anche fornite schemi di colori che imitano le riviste scientifiche. Si può opzionalmente includere un intervallo di confidenza al 95% per le stime in formato <b>ribbon</b> (area ombreggiata) o <b>step</b> (linea).  <b>Trasparenza</b> controlla quanto è scura la fascia ed è ignorata quando l'opzione step è selezionata.  I <b>Tempi Censurati</b> (quando i soggetti non sono più a rischio per l'evento) possono essere indicati sulla linea con simboli \"+\". La dimensione dei simboli \"+\" può essere regolata.  L'opzione <b>Indica la Sopravvivenza Mediana</b> includerà linee orizzontali o verticali al momento in cui il 50% dei soggetti è stimato aver avuto l'evento.  Il tempo mediano è indefinito se la curva di sopravvivenza non attraversa il 50%.\n            <br/>\n            <br/>\n            <b>Opzioni del P-Value:</b>\n            <br/>\n            Si può opzionalmente includere il p-value che confronta le curve sul grafico.  Il <b>Tipo</b> controlla quale p-value è desiderato, con il Log-Rank e Gehan-Breslow (Wilcoxon) che sono i più comunemente riportati.  La <b>Posizione</b> controlla dove il p-value sarà posizionato sul grafico, alla posizione (x,y)=(tempo,proporzione).  La <b>Dimensione</b> determina la dimensione del p-value tracciato.\n            <br/>\n            <br/>\n            <br/>      \n            <b>Opzioni degli Assi</b>\n            <br/>\n            <br/>\n            L'opzione <b>Etichetta</b> specifica l'etichetta di testo per l'asse.  I <b>Limiti dell'Asse</b> specificano i valori minimi e massimi dell'asse.  L'opzione <b>Incrementi dei Tick Mark</b> controlla la spaziatura dei tick mark sull'asse.  Gli incrementi sull'asse del tempo controllano anche i tempi per la tabella opzionale del numero a rischio.\n            <br/>\n            L'asse di sopravvivenza <b>Scala</b> specifica se vuoi che le stime siano su una scala di proporzione (0-1) o percentuale (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione dell'Etichetta dell'Asse:</b>  Questo controlla la dimensione delle etichette degli assi di sopravvivenza e tempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione dell'Etichetta dei Tick dell'Asse:</b>  Questo controlla la dimensione delle etichette dei tick dell'asse di sopravvivenza e tempo.\t\t\t\n      "
  }
}