{
  "title": "Test del rango Kruskal-Wallis",
  "navigation": "Test di Kruskal-Wallis",
  "tvarbox1": "Variabile di risposta",
  "tvarbox2": "Variabile fattore",
  "label1": "Metodo di stima",
  "default": "Asintotico",
  "exact": "Esatto NOTA: la variabile fattore deve avere esattamente 2 livelli altrimenti verrà visualizzato un errore",
  "normal": "Monte Carlo",
  "header": "NOTA: Quando si seleziona il metodo di stima esatto, la variabile fattore deve avere esattamente 2 livelli altrimenti verrà visualizzato un errore",
  "padjust": "Regolazione per confronti multipli",
  "ties": "Opzioni per gestire i pareggi",
  "simulations": "Inserisci il numero di simulazioni",
  "help": {
    "title": "Test del rango Kruskal-Wallis",
    "r_help": "help(kruskal.test, package=stats)",
    "body": "\n<b>Descrizione</b></br>\nEsegue un test del rango Kruskal-Wallis.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nkruskal.test(x, ...)\n## Metodo S3 predefinito:\nkruskal.test(x, g, ...)\n## Metodo S3 per classe 'formula'\nkruskal.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nArgomenti\nx: un vettore numerico di valori dei dati, o un elenco di vettori di dati numerici. Gli elementi non numerici di un elenco verranno forzati, con un avviso.\n</li>\n<li>\ng: un vettore o oggetto fattore che fornisce il gruppo per gli elementi corrispondenti di x. Ignorato con un avviso se x è un elenco.\n</li>\n<li>\nformula: una formula della forma risposta ~ gruppo dove risposta fornisce i valori dei dati e gruppo un vettore o fattore dei gruppi corrispondenti.\n</li>\n<li>\ndata: una matrice o un data frame opzionale (o simile: vedere model.frame) contenente le variabili nella formula formula. Per impostazione predefinita, le variabili vengono prese dall'ambiente(formula).\n</li>\n<li>\nsubset: un vettore opzionale che specifica un sottoinsieme di osservazioni da utilizzare.\n</li>\n<li>\nna.action: una funzione che indica cosa dovrebbe accadere quando i dati contengono NAs. Per impostazione predefinita, è impostato su getOption(\"na.action\").\n</li>\n<li>\n...: ulteriori argomenti da passare a o da metodi.\n</li>\n</ul>\n<b>Dettagli</b></br>\nkruskal.test esegue un test del rango Kruskal-Wallis dell'ipotesi nulla che i parametri di posizione della distribuzione di x siano gli stessi in ciascun gruppo (campione). L'alternativa è che differiscano in almeno uno.</br>\nSe x è un elenco, i suoi elementi vengono presi come i campioni da confrontare, e quindi devono essere vettori di dati numerici. In questo caso, g viene ignorato, e si può semplicemente usare kruskal.test(x) per eseguire il test. Se i campioni non sono ancora contenuti in un elenco, utilizzare kruskal.test(list(x, ...)).</br>\nAltrimenti, x deve essere un vettore di dati numerici, e g deve essere un vettore o oggetto fattore della stessa lunghezza di x che fornisce il gruppo per gli elementi corrispondenti di x.</br>\n<b>Valore</b><br/>\nUn elenco con classe \"htest\" contenente i seguenti componenti:<br/>\nstatistic: la statistica del rango Kruskal-Wallis<br/>\nparameter: i gradi di libertà della distribuzione chi-quadrato approssimativa della statistica del test<br/>\np.value: il valore p del test<br/>\nmethod: la stringa carattere \"Test del rango Kruskal-Wallis\"<br/>\ndata.name: una stringa carattere che fornisce i nomi dei dati<br/>\n<b>Descrizione</b></br>\nRegolazione per Confronti Multipli</br>\nI metodi di regolazione includono la correzione di Bonferroni (\"bonferroni\") in cui i valori p vengono moltiplicati per il numero di confronti. Correzioni meno conservative sono incluse anche da Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), Hommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" o il suo alias \"fdr\"), e Benjamini & Yekutieli (2001) (\"BY\"), rispettivamente. È inclusa anche un'opzione di pass-through (\"none\"). L'insieme di metodi è contenuto nel vettore p.adjust.methods per il beneficio dei metodi che devono avere il metodo come opzione e passarla a p.adjust.</br>\nI primi quattro metodi sono progettati per dare un forte controllo del tasso di errore familiare. Non sembra esserci motivo di utilizzare la correzione di Bonferroni non modificata perché è dominata dal metodo di Holm, che è anche valido sotto assunzioni arbitrarie.</br>\nI metodi di Hochberg e Hommel sono validi quando i test ipotetici sono indipendenti o quando sono associati in modo non negativo (Sarkar, 1998; Sarkar e Chang, 1997). Il metodo di Hommel è più potente di quello di Hochberg, ma la differenza è di solito piccola e i valori p di Hochberg sono più veloci da calcolare.</br>\nIl metodo \"BH\" (alias \"fdr\") e il metodo \"BY\" di Benjamini, Hochberg e Yekutieli controllano il tasso di scoperta falsa, la proporzione attesa di scoperte false tra le ipotesi rifiutate. Il tasso di scoperta falsa è una condizione meno rigorosa rispetto al tasso di errore familiare, quindi questi metodi sono più potenti degli altri.</br>\n</br>\nMetodo di test per confronti di gruppo a coppie:</br>\nPredefinito: viene calcolato un valore p esatto se i campioni contengono meno di 50 valori finiti e non ci sono pareggi. Altrimenti, viene utilizzata un'approssimazione normale.</br>\nEsatto: viene calcolato un valore p esatto; non raccomandato per grandi dimensioni del campione a causa del tempo di calcolo</br>\nApprossimazione Normale: vengono calcolati i valori p utilizzando un'approssimazione normale</br>\nCon Correzione di Continuità: vengono calcolati i valori p utilizzando un'approssimazione normale con una correzione di continuità</br>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nhelp(kruskal.test, package=stats)\n"
  }
}