{
  "title": "Rapporti di probabilità e grafico dei beta",
  "navigation": "Rapporti di probabilità e grafico dei beta",
  "label1": "Seleziona un modello (i modelli di classe Rm, dRm ed eRm sono supportati)",
  "label1b": "Se non sono disponibili modelli, è necessario prima creare un modello selezionando Fitting del modello -> IRT -> Modello Rasch semplice e scegliere la stima CML",
  "modelselector1": "Seleziona un modello",
  "spcr": "Criteri di divisione",
  "destination": "Seleziona le variabili per cui tracciare i beta",
  "help": {
    "title": "Rapporti di probabilità e grafico dei beta",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>Descrizione</b></br>\n                Questo test LR si basa sulla suddivisione dei sottogruppi di soggetti.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \n## Metodo S3 per la classe 'Rm'\n<br/>\nLRtest(object, splitcr = \"median\", se = TRUE)\n<br/>\n## Metodo S3 per la classe 'LR'\n<br/>\nplotGOF(x, beta.subset = \"all\", main = \"Controllo grafico del modello\", xlab, ylab,\n    tlab = \"elemento\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nobject: Oggetto di classe \"Rm\".\n</li>\n<li>\nsplitcr: Criterio di divisione per la suddivisione del punteggio grezzo del soggetto. \"all.r\" corrisponde a una suddivisione completa del punteggio grezzo, \"median\" utilizza la mediana come criterio di divisione, \"mean\" esegue una suddivisione media. Facoltativamente, splitcr può anche essere un vettore che assegna ciascuna persona a un certo sottogruppo (ad esempio, seguendo un criterio esterno). Questo vettore può essere numerico, carattere o un fattore.\n</li>\n<li>\nse: controlla il calcolo degli errori standard nei sottomodeli (predefinito: TRUE)\n</li>\n<li>\nx: Oggetto di classe \"LR\". Utilizzato anche per visualizzare l'adattamento di singoli elementi.\n</li>\n<li>\nbeta.subset: Se \"all\", tutti gli elementi vengono tracciati. Altrimenti, può essere specificato un vettore numerico di sottoinsieme.\n</li>\n<li>\ntlab: Specificazione delle etichette degli elementi: \"item\" stampa i nomi degli elementi, \"number\" fornisce interi corrispondenti all'ordine dei parametri beta, se \"none\" nessuna etichetta viene stampata. \"identify\" consente un'etichettatura interattiva. Inizialmente nessuna etichetta viene stampata, dopo aver cliccato vicino a un punto dell'elemento, l'etichetta corrispondente viene aggiunta. Il processo di identificazione termina cliccando sul secondo pulsante e selezionando 'Stop' dal menu, o dal menu 'Stop' nella finestra grafica. Per ulteriori informazioni e operazioni di base vedere identify.\n</li>\n<li>\nconf: per tracciare ellissi di confidenza per i parametri degli elementi. Se conf = NULL (il predefinito) nessuna ellisse viene tracciata. Altrimenti, conf deve essere specificato come un elenco con elementi opzionali: gamma, è il livello di confidenza (numerico), col e lty, colore e tipo di linea (vedi par), che (vettore di indice numerico) specifica per quali elementi vengono tracciate le ellissi (deve essere un sottoinsieme di beta.subset), e ia, logico, se le ellissi devono essere tracciate interattivamente (cf., tlab = \"identify\" sopra). Per dettagli sul comportamento predefinito, se conf è specificato come un elenco vuoto, vedere Dettagli ed Esempi qui sotto. Per utilizzare conf, l'oggetto LR x deve essere generato utilizzando l'opzione se = TRUE in LRtest(). Vedi help(MLoef) per ulteriori dettagli.\n</li>\n</ul>\n<b>Dettagli</b></br>\nSe il set di dati contiene valori mancanti e la media o la mediana è specificata come criterio di divisione, le medie o le mediane vengono calcolate per ciascun sottogruppo di valori mancanti e conseguentemente utilizzate per la suddivisione del punteggio grezzo.\n<br/>\nQuando si utilizza la selezione interattiva sia per l'etichettatura di singoli punti (tlab = \"identify\" e disegno di ellissi di confidenza in determinati punti (ia = TRUE), prima tutti i punti tracciati vengono etichettati e successivamente tutte le ellissi vengono generate. Entrambi i processi di identificazione possono essere terminati cliccando sul secondo pulsante del mouse (destro) e selezionando 'Stop' dal menu, o dal menu 'Stop' nella finestra grafica.\n<br/>\nUtilizzando la specificazione che consente di disegnare selettivamente ellissi solo per determinati elementi, ad esempio, which = 1:3 disegna ellissi per gli elementi da 1 a 3 (finché sono inclusi in beta.subset). Il predefinito è disegnare ellissi per tutti gli elementi. L'elemento col nell'elenco conf può essere una specificazione di colore singolo come \"blu\" o un vettore con specificazioni di colore per tutti gli elementi. La lunghezza deve essere la stessa del numero di ellissi da disegnare. Per la specificazione del colore, può essere impostata una palette utilizzando palette standard (ad esempio, rainbow) o palette dal pacchetto colorspace o RColorBrewer. Un esempio è fornito qui sotto.\n<br/>\nsintesi e metodi di stampa sono disponibili per oggetti di classe LR.\n<br/><br/>\n<b>Valore</b><br/>\nLRtest restituisce un oggetto di classe LR contenente:\n<br/><br/>\nLR: valore LR.\n<br/>\ndf: gradi di libertà della statistica del test.\n<br/>\nChisq: valore del chi-quadro con corrispondenti df.\n<br/>\n<br/>\n<b>Pacchetto</b></br>\neRm\n<br/><br/>\n<b>Aiuto</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}