{
  "title": "Regressione Lineare",
  "navigation": "Lineare, base (Legacy)",
  "modelname": "Inserisci Nome Modello",
  "dependent": "Variabile dipendente",
  "independent": "Variabile(i) indipendente(i)",
  "nointercept": "Ignora l'intercetta",
  "generateplotchk": "Traccia residui vs adattati, Q-Q normale, scala-localizzazione e residui vs leva",
  "weights": "Specifica una variabile con pesi",
  "help": {
    "title": "Regressione Lineare",
    "r_help": "help(lm, package ='stats')",
    "body": "\n            <b>Descrizione</b></br>\nCostruisce un modello di regressione lineare. Chiama internamente la funzione lm nel pacchetto stats. Restituisce un oggetto chiamato BSkyLinearRegression che è un oggetto di classe lm. Mostra un riepilogo del modello, tabella dei coefficienti, tabella Anova e tabella delle somme dei quadrati e traccia i seguenti residui vs. adattati, Q-Q normale, quantili teorici, residui vs. leva. Puoi opzionalmente specificare una variabile con pesi e scegliere di ignorare l'intercetta.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nLinearRegModel1 <- lm(depVar~indepVars, dataset)​<br/>\n#Riepilogando il modello<br/>\nsummario(LinearRegModel1)<br/>\n#Mostrando la tabella Anova<br/>\nanova(LinearRegModel1)<br/>\n#Traccia residui vs. adattati, Q-Q normale, scala-localizzazione, residui vs. leva<br/>\nplot(LinearRegModel1)<br/>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\ndepVar: Nome della variabile dipendente. Se abbiamo un dataset di auto, con una variabile mpg che vogliamo prevedere mpg (la variabile dipendente è mpg) inserisci mpg​\n</li>\n<li>\nindepVars: Nomi della variabile dipendente. Se abbiamo un dataset di auto, con variabile dipendente potenza, dimensione motore, inserisci potenza+dimensione motore. Le variabili categoriche vengono automaticamente codificate in modo fittizio.​\n</li>\n<li>\ndataset: Nome del dataframe. Quando apri frame di dati o dataset ad es. csv, file Excel, file SAS in BioStat Primegono chiamati Dataset1, Dataset2, Dataset3 quindi inserisci Dataset1\n</li>\n</ul>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nhelp(lm, package ='stats')\n\t\t\t"
  }
}