{
  "title": "Regressione Logistica",
  "navigation": "Logistica, avanzata",
  "modelname": "Inserisci il nome del modello",
  "dependent": "Variabile dipendente",
  "independent": "Variabile(i) indipendente(i)",
  "generateplotchk": "Tracciare i residui vs adattati, normale Q-Q, scala-locazione e residui vs leva",
  "destination2": "Specifica una variabile con pesi",
  "help": {
    "title": "Regressione Logistica",
    "r_help": "help(glm, package ='stats')",
    "body": "\n<b>Descrizione</b></br>\nCostruisce un modello di regressione logistica binaria utilizzando un costruttore di formule. Utilizziamo la funzione glm passando il parametro family =binomial(link='logit'). Mostriamo un riepilogo del modello, tabelle di analisi della varianza e McFadden R2.<br/>\nPuoi valutare il modello selezionando il modello creato nell'angolo in alto a destra dello schermo principale dell'applicazione e selezionando il pulsante Valuta. Puoi scegliere di visualizzare una matrice di confusione e una curva ROC<br/>\nIl nome del modello predefinito è Logistic1 che puoi cambiare.<br/><br/>\nNOTA: Quando specifichi una variabile contenente pesi, fai attenzione poiché utilizziamo l'opzione na.exclude per costruire il modello, tutti i valori NA vengono automaticamente rimossi dalle variabili dipendenti e indipendenti.<br/> \nQuesto può causare un disallineamento poiché i valori NA NON vengono automaticamente rimossi dalla variabile di ponderazione. <br/>\nIn questa situazione vedrai l'errore le lunghezze delle variabili differiscono (trovato per (pesi))<br/>\nPer risolvere questo errore vai su Variabili>Valori Mancanti>Rimuovi NAs e seleziona le variabili dipendenti, indipendenti e la variabile di ponderazione da cui rimuovere i valori mancanti e ricostruire il modello.<br/>\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nmodelname <- glm(dependentVariable ~ var1+var2+var3...,family =binomial(link='logit'),data=datasetName)\n#Riepilogare il modello<br/>\nsummary(modelname)<br/>\n#Visualizzare la tabella Anova<br/>\nanova(modelname)<br/>\n#Tracciare i residui vs. adattati, normale Q-Q, scala-locazione, residui vs. leva<br/>\nplot(modelname)<br/>\n#McFadden R2<br/>\npR2(Logistic1)<br/>\n#rapporto di probabilità e intervallo di confidenza al 95%<br/>\nexp(cbind(OR=coef(Logistic1), confint(Logistic1,level=0.95)))<br/>\n#Tracciare il modello<br/>\nplot(Logistic1)<br/>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\ndepVar: Nome della variabile dipendente.  Se abbiamo un dataset di auto, con una variabile classe che vogliamo prevedere (la variabile dipendente è classe) inserisci classe\n</li>\n<li>\nindepVars: Nomi della variabile indipendente, separati da +. Se abbiamo un dataset di auto, con variabile indipendente potenza, dimensione motore, specifica potenza+dimensione motore). Le variabili categoriche vengono automaticamente codificate in modo fittizio.​\n</li>\n<li>\ndata: Nome del dataframe. Quando apri frame di dati o dataset ad es. csv, file Excel, file SAS in BlueSky Statistics, vengono chiamati Dataset1, Dataset2, Dataset3 Quindi inserisci data=Dataset1​\n</li>\n</ul>\n<b>Pacchetto</b></br>\nglm</br>\n<b>Aiuto</b></br>\nhelp(glm, package ='stats')</br>\n<b>Riferimenti</b></br>\nhttps://datascienceplus.com/perform-logistic-regression-in-r/</br>\nhttps://www.machinelearningplus.com/machine-learning/logistic-regression-tutorial-examples-r/</br>\n<b>Altro</b></br>\nClicca sull'icona di Aiuto R per ottenere aiuto dettagliato su R​</br>\n\t\t\t"
  }
}