{
  "ProjectTitleStr": "Progetto",
  "Source_variables": "Variabili di origine",
  "Source_Datasets": "Set di dati di origine",
  "Source_Datasets_rerun": "Set di dati di origine",
  "jsoncomment000": "=======Formula Builder sotto questa linea=======",
  "FBStr0": "Costruttore di formule",
  "FBStr1": "Clicca su un pulsante qui sotto e trascina e rilascia le variabili per creare un'espressione.",
  "FBStr2": " Cliccando su un pulsante selezionato si attiverà/disattiverà.",
  "FBStr3": " Per inserire in una posizione, posiziona il cursore in quella posizione e trascina e rilascia/sposta le variabili.",
  "FBStr4": " Passa il mouse su un pulsante per aiuto.",
  "FBStr5": " Non puoi attivare/disattivare il pulsante All N way.",
  "FBttip1": "Clicca sul pulsante + e poi sposta le variabili che vuoi separare con +. Per inserire solo +, fai doppio clic su di esso",
  "FBttip2": "Clicca sul pulsante - e poi sposta le variabili che vuoi separare con -. Per inserire solo -, fai doppio clic su di esso",
  "FBttip3": "Clicca sul pulsante * e poi sposta le variabili che vuoi separare con *. Per inserire solo *, fai doppio clic su di esso",
  "FBttip4": "Clicca sul pulsante / e poi sposta le variabili che vuoi separare con /. Per inserire solo /, fai doppio clic su di esso",
  "FBttip5": "Clicca sul pulsante ( per inserirlo",
  "FBttip6": "Clicca sul pulsante ) per inserirlo",
  "FBttip7": "Clicca sul pulsante %in% per inserire %in%",
  "FBttip8": "Clicca sul pulsante | per inserirlo",
  "FBttip9": "Clicca sul pulsante : e poi sposta le variabili che vuoi separare con :. Per inserire solo : , fai doppio clic su di esso",
  "FBbtnlbl10a": "Tutti 2 modi",
  "FBbtnlbl10b": "Tutti 3 modi",
  "FBbtnlbl10c": "Tutti 4 modi",
  "FBbtnlbl10d": "Tutti 5 modi",
  "FBbtnlbl10e": "Tutti 6 modi",
  "FBbtnlbl10f": "Tutti 7 modi",
  "FBbtnlbl10g": "Tutti 8 modi",
  "FBbtnlbl10h": "Tutti 9 modi",
  "FBbtnlbl10i": "Tutti 10 modi",
  "FBttip10": "Clicca sull'opzione All N-way e poi sposta le variabili per creare interazioni N-way. Per disattivare clicca un altro pulsante.",
  "FBbtnlbl11": "Termini polinomiali",
  "FBttip11": "Seleziona un numero, clicca sul pulsante e sposta le variabili per aggiungere termini polinomiali di grado N",
  "FBbtnlbl12": "df per spline",
  "FBttip12": "Specifica un grado di libertà per le spline",
  "FBbtnlbl13": "Grado polinomiale",
  "FBttip13": "Specifica un grado polinomiale",
  "FBbtnlbl14": "B-spline",
  "FBttip14": "Clicca su B-spline e poi sposta una o più variabili. Per inserire codice generico, fai doppio clic",
  "FBbtnlbl15": "Spline naturale",
  "FBttip15": "Clicca su spline naturale e poi sposta una o più variabili. Per inserire codice generico, fai doppio clic",
  "FBbtnlbl16": "Polinomiale ortogonale",
  "FBttip16": "Clicca sul pulsante polinomiale ortogonale e poi sposta una o più variabili. Per inserire codice generico, fai doppio clic",
  "FBbtnlbl17": "Polinomiale grezzo",
  "FBttip17": "Clicca sul pulsante polinomiale grezzo e poi sposta una o più variabili. Per inserire codice generico, fai doppio clic",
  "jsoncomment001": "=======Compute Builder sotto questa linea=======",
  "CBStr1": "Clicca su un pulsante qui sotto e trascina e rilascia le variabili per creare un'espressione.",
  "CBStr2": " Cliccando su un pulsante selezionato si attiverà/disattiverà.",
  "CBStr3": " Per inserire in una posizione, posiziona il cursore in quella posizione e trascina e rilascia/sposta le variabili.",
  "CBStr4": " Passa il mouse su un pulsante per aiuto.",
  "CBtabArithmetic": "Aritmetica",
  "CBtabLogical": "Logico",
  "CBtabMath": "Matematica",
  "CBtabString1": "Stringa(1)",
  "CBtabString2": "Stringa(2)",
  "CBtabConversion": "Conversione",
  "CBtabStatistical": "Statistico",
  "CBtabRandomNumbers": "Numeri Casuali",
  "CBtabDate1": "Data(1)",
  "CBtabDate2": "Data(2)",
  "CBtabDate3": "Data(3)",
  "CBtabDate4": "Data(4)",
  "CBttip1": "Clicca il pulsante + e poi sposta le variabili che vuoi separare con +. Per inserire solo +, fai doppio clic su di esso",
  "CBttip2": "Clicca il pulsante - e poi sposta le variabili che vuoi separare con -. Per inserire solo -, fai doppio clic su di esso",
  "CBttip3": "Clicca il pulsante * e poi sposta le variabili che vuoi separare con *. Per inserire solo *, fai doppio clic su di esso",
  "CBttip4": "Clicca il pulsante / e poi sposta le variabili che vuoi separare con /. Per inserire solo /, fai doppio clic su di esso",
  "CBttip5": "Clicca ^ e sposta le variabili per esponenziare, per inserire codice generico fai doppio clic",
  "CBbtnlbl6": "sqrt",
  "CBttip6": "Clicca SQRT e sposta le variabili per calcolare una radice quadrata, per inserire codice generico fai doppio clic",
  "CBbtnlbl7": "log",
  "CBttip7": "Clicca LOG e sposta le variabili per calcolare un logaritmo naturale, per inserire codice generico fai doppio clic",
  "CBbtnlbl8": "log10",
  "CBttip8": "Clicca LOG10 e sposta le variabili per calcolare un logaritmo in base 10, per inserire codice generico fai doppio clic",
  "CBbtnlbl9": "log2",
  "CBttip9": "Clicca LOG2 e sposta le variabili per calcolare un logaritmo in base 2, per inserire codice generico fai doppio clic",
  "CBbtnlbl10": "mod",
  "CBttip10": "Clicca MOD e sposta le variabili per dividere e calcolare il resto, per inserire codice generico fai doppio clic",
  "CBbtnlbl11": "abs",
  "CBttip11": "Clicca abs e sposta le variabili per calcolare un valore assoluto, per inserire codice generico fai doppio clic",
  "CBbtnlbl12": "exp",
  "CBttip12": "Clicca exp e sposta le variabili per calcolare un esponenziale, per inserire codice generico fai doppio clic",
  "CBbtnlbl13": "",
  "CBttip13": "Clicca per inserire il simbolo >",
  "CBbtnlbl14": "",
  "CBttip14": "Clicca per inserire il simbolo <",
  "CBbtnlbl15": "",
  "CBttip15": "Clicca per inserire il simbolo >= ",
  "CBbtnlbl16": "",
  "CBttip16": "Clicca per inserire il simbolo <= ",
  "CBbtnlbl17": "",
  "CBttip17": "Clicca per inserire il simbolo == (test di uguaglianza)",
  "CBbtnlbl18": "",
  "CBttip18": "Clicca per inserire il simbolo !- (diverso da)",
  "CBbtnlbl19": "",
  "CBttip19": "Clicca per inserire il simbolo | (o logico)",
  "CBbtnlbl20": "",
  "CBttip20": "Clicca per inserire il simbolo & (e logico)",
  "CBbtnlbl21": "%/%",
  "CBttip21": "Clicca per inserire il simbolo di divisione intera (%/%)",
  "CBbtnlbl22": "isTRUE",
  "CBttip22": "Clicca isTRUE per selezionare e spostare la variabile per controllare i valori TRUE. Restituisce TRUE/FALSE, per inserire codice generico fai doppio clic",
  "CBbtnlbl23": "è.na",
  "CBttip23": "Clicca su è.na per selezionare e spostare la variabile per controllare i valori NA. Restituisce VERO/FALSO, per inserire codice generico fai doppio clic",
  "CBbtnlbl24": "%in%",
  "CBttip24": "Clicca sul pulsante %in% per inserire %in%",
  "CBbtnlbl25": "arrotonda",
  "CBttip25": "Clicca su arrotonda e sposta le variabili per arrotondare, per inserire codice generico fai doppio clic",
  "CBbtnlbl26": "soffitto",
  "CBttip26": "Clicca su soffitto e sposta le variabili per calcolare il soffitto, per inserire codice generico fai doppio clic",
  "CBbtnlbl27": "pavimento",
  "CBttip27": "Clicca su pavimento e sposta le variabili per calcolare il pavimento, per inserire codice generico fai doppio clic",
  "CBbtnlbl28": "significativo",
  "CBttip28": "Clicca su significativo e sposta le variabili per arrotondare a un numero specificato di cifre significative, per inserire codice generico fai doppio clic",
  "CBbtnlbl29": "gamma",
  "CBttip29": "Clicca su gamma e sposta le variabili per calcolare una funzione gamma, per inserire codice generico fai doppio clic",
  "CBbtnlbl30": "lgamma",
  "CBttip30": "Clicca su lgamma e sposta le variabili per calcolare una funzione lgamma, per inserire codice generico fai doppio clic",
  "CBbtnlbl31": "beta",
  "CBttip31": "Clicca su beta e sposta le variabili per calcolare una funzione beta, per inserire codice generico fai doppio clic",
  "CBbtnlbl32": "lbeta",
  "CBttip32": "Clicca su lbeta e sposta le variabili per calcolare una funzione lbeta, per inserire codice generico fai doppio clic",
  "CBbtnlbl33": "fattoriale",
  "CBttip33": "Clicca su fattoriale e sposta le variabili per calcolare i fattoriali, per inserire codice generico fai doppio clic",
  "CBbtnlbl34": "pigamma",
  "CBttip34": "Clicca su pigamma e sposta le variabili per calcolare una funzione pigamma, per inserire codice generico fai doppio clic",
  "CBbtnlbl35": "maiuscolo",
  "CBttip35": "Clicca su maiuscolo e sposta le variabili per convertire in maiuscolo, per inserire codice generico fai doppio clic",
  "CBbtnlbl36": "minuscolo",
  "CBttip36": "Clicca su minuscolo e sposta le variabili per convertire in minuscolo, per inserire codice generico fai doppio clic",
  "CBbtnlbl37": "Pad",
  "CBttip37": "Clicca su Pad e sposta le variabili per aggiungere un carattere, per inserire codice generico fai doppio clic",
  "CBbtnlbl38": "Trim",
  "CBttip38": "Clicca su Trim e sposta le variabili per rimuovere gli spazi bianchi a sinistra, a destra o da entrambi i lati, per inserire codice generico fai doppio clic",
  "CBbtnlbl39": "Lunghezza",
  "CBttip39": "Clicca su Lunghezza e sposta le variabili per restituire il numero di caratteri nella stringa, per inserire codice generico fai doppio clic",
  "CBbtnlbl40": "Conteggio(corrispondenze)",
  "CBttip40": "Clicca su Conteggio(corrispondenze) e sposta le variabili per contare le corrispondenze di un modello/sottostringa, per inserire codice generico fai doppio clic",
  "CBbtnlbl41": "Estrai Sottostringa",
  "CBttip41": "Clicca su Estrai Sottostringa e sposta le variabili per estrarre una sottostringa (sostituisci la posizione iniziale e finale con interi), per inserire codice generico fai doppio clic",
  "CBbtnlbl42": "Concatena",
  "CBttip42": "Clicca su Concatena e sposta le variabili per concatenare con un separatore opzionale, per inserire codice generico fai doppio clic",
  "CBbtnlbl43": "Sostituisci Modello",
  "CBttip43": "Clicca su Sostituisci Modello e sposta le variabili per sostituire un modello, per inserire codice generico fai doppio clic",
  "CBbtnlbl44": "Sostituisci Modello(TUTTI)",
  "CBttip44": "Clicca su Sostituisci Modello(TUTTI) e sposta le variabili per sostituire tutti i modelli, per inserire codice generico fai doppio clic",
  "CBbtnlbl45": "Estrai un Numero",
  "CBttip45": "Clicca su Estrai un Numero e sposta le variabili per estrarre un numero, per inserire codice generico fai doppio clic",
  "CBbtnlbl46": "ToNumeric",
  "CBttip46": "Clicca su ToNumeric e sposta le variabili per convertire in numerico, per inserire codice generico fai doppio clic",
  "CBbtnlbl47": "ToCharacter",
  "CBttip47": "Clicca su ToCharacter e sposta le variabili per convertire in un carattere, per inserire codice generico fai doppio clic",
  "CBbtnlbl48": "AFactor",
  "CBttip48": "Clicca AFactor e sposta le variabili per convertirle in un fattore, per inserire il codice generico fai doppio clic",
  "CBbtnlbl49": "AOrdinato",
  "CBttip49": "Clicca AOrdinato e sposta le variabili per convertirle in un fattore ordinato, per inserire il codice generico fai doppio clic",
  "CBbtnlbl50": "ALogico",
  "CBttip50": "Clicca ALogico e sposta le variabili per convertirle in un logico, per inserire il codice generico fai doppio clic",
  "CBbtnlbl51": "MAX",
  "CBttip51": "Clicca MAX e sposta le variabili per calcolare il valore massimo, per inserire il codice generico fai doppio clic",
  "CBbtnlbl52": "MIN",
  "CBttip52": "Clicca MIN e sposta le variabili per calcolare il valore minimo, per inserire il codice generico fai doppio clic",
  "CBbtnlbl53": "MEDIA",
  "CBttip53": "Clicca MEDIA e sposta le variabili per calcolare il valore medio, per inserire il codice generico fai doppio clic",
  "CBbtnlbl54": "MEDIANA",
  "CBttip54": "Clicca MEDIANA e sposta le variabili per calcolare il valore mediano, per inserire il codice generico fai doppio clic",
  "CBbtnlbl55": "SD",
  "CBttip55": "Clicca SD e sposta le variabili per calcolare la deviazione standard, per inserire il codice generico fai doppio clic",
  "CBbtnlbl56": "SOMMA",
  "CBttip56": "Clicca SOMMA e sposta le variabili per calcolare la somma, per inserire il codice generico fai doppio clic",
  "CBbtnlbl57": "VARIANZA",
  "CBttip57": "Clicca VARIANZA e sposta le variabili per calcolare la varianza, per inserire il codice generico fai doppio clic",
  "CBbtnlbl58": "runif",
  "CBttip58": "Fai doppio clic su RUNIF e verranno generati numeri casuali da una distribuzione uniforme con min e max.",
  "CBbtnlbl59": "campione",
  "CBttip59": "Clicca CAMPIONE e sposta le variabili per generare campioni casuali con/senza sostituzione, per inserire il codice generico fai doppio clic",
  "CBbtnlbl60": "rnorm",
  "CBttip60": "Fai doppio clic su rnorm per generare variabili da una distribuzione normale con una media e una deviazione standard specificate",
  "CBbtnlbl61": "Giorno della Settimana",
  "CBttip61": "Clicca Giorno della Settimana e sposta una variabile data da cui vuoi estrarre il giorno della settimana (Lunedì..) per inserire il codice generico fai doppio clic",
  "CBbtnlbl62": "Giorno del Mese",
  "CBttip62": "Clicca Giorno del Mese e sposta una variabile data da cui vuoi estrarre il giorno del mese (1-31) per inserire il codice generico fai doppio clic",
  "CBbtnlbl63": "Giorno dell'Anno",
  "CBttip63": "Clicca Giorno dell'Anno e sposta una variabile data da cui vuoi estrarre il giorno dell'anno (001-366) per inserire il codice generico fai doppio clic",
  "CBbtnlbl64": "Settimana dell'Anno",
  "CBttip64": "Clicca Settimana dell'Anno e sposta una variabile data da cui vuoi estrarre la settimana dell'anno (00-53) per inserire il codice generico fai doppio clic",
  "CBbtnlbl65": "Mese",
  "CBttip65": "Clicca Mese e sposta una variabile data da cui vuoi estrarre il Mese (Gennaio..) per inserire il codice generico fai doppio clic",
  "CBbtnlbl66": "Mese(decimale)",
  "CBttip66": "Clicca Mese(decimale) e sposta una variabile data da cui vuoi estrarre il Mese (01-12) per inserire il codice generico fai doppio clic",
  "CBbtnlbl67": "Trimestri",
  "CBttip67": "Clicca Trimestri e sposta una variabile data da cui vuoi estrarre i Trimestri (T1, T2..) per inserire il codice generico fai doppio clic",
  "CBbtnlbl68": "Anno(XXXX)",
  "CBttip68": "Clicca Anno(XXXX) e sposta una variabile data da cui vuoi estrarre l'Anno (1980) per inserire il codice generico fai doppio clic",
  "CBbtnlbl69": "Anno(XX)",
  "CBttip69": "Clicca Anno(XX) e sposta una variabile data da cui vuoi estrarre l'Anno (80) per inserire il codice generico fai doppio clic",
  "CBbtnlbl70": "Ora(00-12)",
  "CBttip70": "Clicca Ora(00-12) e sposta una variabile data da cui vuoi estrarre l'Ora (00) per inserire il codice generico fai doppio clic",
  "CBbtnlbl71": "Ora(00-23)",
  "CBttip71": "Clicca Ora(00-23) e sposta una variabile data da cui vuoi estrarre l'Ora, per inserire il codice generico fai doppio clic",
  "CBbtnlbl72": "Minuti",
  "CBttip72": "Clicca Minuti e sposta una variabile data da cui vuoi estrarre i minuti, per inserire il codice generico fai doppio clic",
  "CBbtnlbl73": "Secondi",
  "CBttip73": "Clicca su Secondi e sposta una variabile di data da cui vuoi estrarre i secondi, per inserire il codice generico fai doppio clic",
  "CBbtnlbl74": "Data da Stringa",
  "CBttip74": "Clicca su Data da Stringa e sposta una variabile di stringa che vuoi convertire in data, per inserire il codice generico fai doppio clic",
  "CBbtnlbl75": "Differenza di Data",
  "CBttip75": "Clicca su Differenza di Data e sposta una variabile di data da cui vuoi sottrarre un'altra variabile di data, per inserire il codice generico fai doppio clic",
  "CBbtnlbl76": "Numerico a data",
  "CBttip76": "Clicca su Numerico a data e sposta una variabile numerica che vuoi convertire in data, per inserire il codice generico fai doppio clic",
  "CBbtnlbl77": "Stringa a data",
  "CBttip77": "Clicca su Stringa a data e sposta una variabile di stringa che vuoi convertire in data, per inserire il codice generico fai doppio clic",
  "jsoncomment002": "=======switchCase sotto questa linea=======",
  "SCStr0": "Costruttore di Condizioni Multiple",
  "SCStr1": "Clicca su un pulsante e trascina e rilascia le variabili per creare un'espressione.",
  "SCStr2": "Cliccando su un pulsante selezionato si attiverà il suo stato.",
  "SCStr3": "Per inserire in una posizione designata, trascina e rilascia direttamente in quella posizione.",
  "SCStr4": "Passa il mouse su un pulsante per aiuto.",
  "SCifthenbtn": "SE ALLORA",
  "SCelsebtn": "ALTRIMENTI",
  "SCIFlbl": "SE",
  "SCTHENlbl": "ALLORA",
  "SCELSElbl": "ALTRIMENTI",
  "SCtabArithmetic": "Aritmetica",
  "SCtabLogical": "Logico",
  "SCtabMath": "Matematica",
  "SCtabString1": "Stringa(1)",
  "SCtabString2": "Stringa(2)",
  "SCtabConversion": "Conversione1",
  "SCtabStatistical": "Statistico",
  "SCtabRandomNumbers": "Numeri Casuali",
  "SCtabDate1": "Data(1)",
  "SCtabDate2": "Data(2)",
  "SCtabDate3": "Data(3)",
  "SCtabDate4": "Data(4)",
  "SCttip1": "Clicca sul simbolo + poi sposta le variabili che vuoi separare con +. Per inserire solo +, fai doppio clic",
  "SCttip2": "Clicca sul simbolo - poi sposta le variabili che vuoi separare con -. Per inserire solo -, fai doppio clic",
  "SCttip3": "Clicca sul simbolo * poi sposta le variabili che vuoi separare con *. Per inserire solo *, fai doppio clic",
  "SCttip4": "Clicca sul simbolo / poi sposta le variabili che vuoi separare con /. Per inserire solo /, fai doppio clic",
  "SCttip5": "Clicca su ^ e sposta le variabili da esponenziare, per inserire il codice generico fai doppio clic",
  "SCbtnlbl6": "radice quadrata",
  "SCttip6": "Clicca su SQRT e sposta le variabili per calcolare una radice quadrata, per inserire il codice generico fai doppio clic",
  "SCbtnlbl7": "log",
  "SCttip7": "Clicca su LOG e sposta le variabili per calcolare un logaritmo naturale, per inserire il codice generico fai doppio clic",
  "SCbtnlbl8": "log10",
  "SCttip8": "Clicca su LOG10 e sposta le variabili per calcolare un logaritmo in base 10, per inserire il codice generico fai doppio clic",
  "SCbtnlbl9": "log2",
  "SCttip9": "Clicca su LOG2 e sposta le variabili per calcolare un logaritmo in base 2, per inserire il codice generico fai doppio clic",
  "SCbtnlbl10": "mod",
  "SCttip10": "Clicca su MOD e sposta le variabili per dividere e calcolare il resto, per inserire il codice generico fai doppio clic",
  "SCbtnlbl11": "assoluto",
  "SCttip11": "Clicca su abs e sposta le variabili per calcolare un valore assoluto, per inserire il codice generico fai doppio clic",
  "SCbtnlbl12": "esp",
  "SCttip12": "Clicca su esp e sposta le variabili per calcolare un esponenziale, per inserire codice generico fai doppio clic",
  "SCbtnlbl13": "",
  "SCttip13": "Clicca per inserire il simbolo >",
  "SCbtnlbl14": "",
  "SCttip14": "Clicca per inserire il simbolo <",
  "SCbtnlbl15": "",
  "SCttip15": "Clicca per inserire il simbolo >=",
  "SCbtnlbl16": "",
  "SCttip16": "Clicca per inserire il simbolo <=",
  "SCbtnlbl17": "",
  "SCttip17": "Clicca per inserire il simbolo == (test di uguaglianza)",
  "SCbtnlbl18": "",
  "SCttip18": "Clicca per inserire il simbolo != (diverso da)",
  "SCbtnlbl19": "",
  "SCttip19": "Clicca per inserire il simbolo | (o logico)",
  "SCbtnlbl20": "",
  "SCttip20": "Clicca per inserire il simbolo & (e logico)",
  "SCbtnlbl21": "%/%",
  "SCttip21": "Clicca per inserire il simbolo di divisione intera (%/%)",
  "SCbtnlbl22": "isTRUE",
  "SCttip22": "Clicca su isTRUE per selezionare e spostare la variabile per controllare i valori TRUE. Restituisce TRUE/FALSE, per inserire codice generico fai doppio clic",
  "SCbtnlbl23": "is.na",
  "SCttip23": "Clicca su is.na per selezionare e spostare la variabile per controllare i valori NA. Restituisce TRUE/FALSE, per inserire codice generico fai doppio clic",
  "SCbtnlbl24": "%in%",
  "SCttip24": "Clicca su %in% per inserirlo. %in% è usato per controllare se una variabile contiene valori, ad esempio var1 %in% c(1,2)",
  "SCbtnlbl25": "round",
  "SCttip25": "Clicca su round e sposta le variabili per arrotondare, per inserire codice generico fai doppio clic",
  "SCbtnlbl26": "ceiling",
  "SCttip26": "Clicca su ceiling e sposta le variabili per calcolare il soffitto, per inserire codice generico fai doppio clic",
  "SCbtnlbl27": "floor",
  "SCttip27": "Clicca su floor e sposta le variabili per calcolare il pavimento, per inserire codice generico fai doppio clic",
  "SCbtnlbl28": "signif",
  "SCttip28": "Clicca su signif e sposta le variabili per arrotondare a un numero specificato di cifre significative, per inserire codice generico fai doppio clic",
  "SCbtnlbl29": "gamma",
  "SCttip29": "Clicca su gamma e sposta le variabili per calcolare una funzione gamma, per inserire codice generico fai doppio clic",
  "SCbtnlbl30": "lgamma",
  "SCttip30": "Clicca su lgamma e sposta le variabili per calcolare una funzione lgamma, per inserire codice generico fai doppio clic",
  "SCbtnlbl31": "beta",
  "SCttip31": "Clicca su beta e sposta le variabili per calcolare una funzione beta, per inserire codice generico fai doppio clic",
  "SCbtnlbl32": "lbeta",
  "SCttip32": "Clicca su lbeta e sposta le variabili per calcolare una funzione lbeta, per inserire codice generico fai doppio clic",
  "SCbtnlbl33": "factorial",
  "SCttip33": "Clicca su factorial e sposta le variabili per calcolare i fattoriali, per inserire codice generico fai doppio clic",
  "SCbtnlbl34": "pigamma",
  "SCttip34": "Clicca su pigamma e sposta le variabili per calcolare una funzione pigamma, per inserire codice generico fai doppio clic",
  "SCbtnlbl35": "toupper",
  "SCttip35": "Clicca su toupper e sposta le variabili per convertire in maiuscolo, per inserire codice generico fai doppio clic",
  "SCbtnlbl36": "tolower",
  "SCttip36": "Clicca su tolower e sposta le variabili per convertire in minuscolo, per inserire codice generico fai doppio clic",
  "SCbtnlbl37": "Pad",
  "SCttip37": "Clicca su Pad e sposta le variabili su Pad con un carattere, per inserire codice generico fai doppio clic",
  "SCbtnlbl38": "Trim",
  "SCttip38": "Clicca su Trim e sposta le variabili per rimuovere gli spazi bianchi a sinistra, a destra o a entrambe le estremità, per inserire codice generico fai doppio clic",
  "SCbtnlbl39": "Lunghezza",
  "SCttip39": "Clicca su Lunghezza e sposta le variabili per restituire il numero di caratteri nella stringa, per inserire codice generico fai doppio clic",
  "SCbtnlbl40": "Conteggio(corrispondenze)",
  "SCttip40": "Clicca su Conteggio(corrispondenze) e sposta le variabili per contare le corrispondenze di un modello/sottostringa, per inserire codice generico fai doppio clic",
  "SCbtnlbl41": "Estrai Sottostringa",
  "SCttip41": "Clicca su Estrai Sottostringa e sposta le variabili per estrarre una sottostringa (sostituisci la posizione iniziale e finale con interi), per inserire codice generico fai doppio clic",
  "SCbtnlbl42": "Concatena",
  "SCttip42": "Clicca su Concatena e sposta le variabili per concatenare con un separatore opzionale, per inserire codice generico fai doppio clic",
  "SCbtnlbl43": "Sostituisci Modello",
  "SCttip43": "Clicca su Sostituisci Modello e sposta le variabili per sostituire un modello, per inserire codice generico fai doppio clic",
  "SCbtnlbl44": "Sostituisci Modello(TUTTI)",
  "SCttip44": "Clicca su Sostituisci Modello(TUTTI) e sposta le variabili per sostituire tutti i modelli, per inserire codice generico fai doppio clic",
  "SCbtnlbl45": "Estrai un Numero",
  "SCttip45": "Clicca su Estrai un Numero e sposta le variabili per estrarre un numero da, per inserire codice generico fai doppio clic",
  "SCbtnlbl46": "ANumero",
  "SCttip46": "Clicca su ANumero e sposta le variabili per convertire in numerico, per inserire codice generico fai doppio clic",
  "SCbtnlbl47": "ACarattere",
  "SCttip47": "Clicca su ACarattere e sposta le variabili per convertire in un carattere, per inserire codice generico fai doppio clic",
  "SCbtnlbl48": "AFattore",
  "SCttip48": "Clicca su AFattore e sposta le variabili per convertire in un fattore, per inserire codice generico fai doppio clic",
  "SCbtnlbl49": "AOrdinato",
  "SCttip49": "Clicca su AOrdinato e sposta le variabili per convertire in un fattore ordinato, per inserire codice generico fai doppio clic",
  "SCbtnlbl50": "ALogico",
  "SCttip50": "Clicca su ALogico e sposta le variabili per convertire in un logico, per inserire codice generico fai doppio clic",
  "SCbtnlbl51": "MAX",
  "SCttip51": "Clicca su MAX e sposta le variabili per calcolare il valore massimo, per inserire codice generico fai doppio clic",
  "SCbtnlbl52": "MIN",
  "SCttip52": "Clicca su MIN e sposta le variabili per calcolare il valore minimo, per inserire codice generico fai doppio clic",
  "SCbtnlbl53": "MEDIA",
  "SCttip53": "Clicca su MEDIA e sposta le variabili per calcolare il valore medio, per inserire codice generico fai doppio clic",
  "SCbtnlbl54": "MEDIANA",
  "SCttip54": "Clicca su MEDIANA e sposta le variabili per calcolare il valore mediano, per inserire codice generico fai doppio clic",
  "SCbtnlbl55": "SD",
  "SCttip55": "Clicca su SD e sposta le variabili per calcolare la deviazione standard, per inserire codice generico fai doppio clic",
  "SCbtnlbl56": "SOMMA",
  "SCttip56": "Clicca su SOMMA e sposta le variabili per calcolare la somma, per inserire codice generico fai doppio clic",
  "SCbtnlbl57": "VARIANZA",
  "SCttip57": "Clicca su VARIANZA e sposta le variabili per calcolare la varianza, per inserire codice generico fai doppio clic",
  "SCbtnlbl58": "runif",
  "SCttip58": "Fai doppio clic su RUNIF e verranno generati numeri casuali da una distribuzione uniforme con min e max",
  "SCbtnlbl59": "campione",
  "SCttip59": "Clicca su CAMPIONE e sposta le variabili per generare campioni casuali con/senza sostituzione, per inserire codice generico fai doppio clic",
  "SCbtnlbl60": "rnorm",
  "SCttip60": "Fai doppio clic su rnorm per generare variabili da una distribuzione normale con una media e una deviazione standard specificate",
  "SCbtnlbl61": "Giorno della Settimana",
  "SCttip61": "Clicca su Giorno della Settimana e sposta una variabile data da cui vuoi estrarre il giorno della settimana (lunedì..) per inserire codice generico fai doppio clic",
  "SCbtnlbl62": "Giorno del Mese",
  "SCttip62": "Clicca su Giorno del Mese e sposta una variabile data da cui vuoi estrarre il giorno del mese (1-31) per inserire il codice generico con doppio clic",
  "SCbtnlbl63": "Giorno dell'Anno",
  "SCttip63": "Clicca su Giorno dell'Anno e sposta una variabile data da cui vuoi estrarre il giorno dell'anno (001-366) per inserire il codice generico con doppio clic",
  "SCbtnlbl64": "Settimana dell'Anno",
  "SCttip64": "Clicca su Settimana dell'Anno e sposta una variabile data da cui vuoi estrarre la settimana dell'anno (00-53) per inserire il codice generico con doppio clic",
  "SCbtnlbl65": "Mese",
  "SCttip65": "Clicca su Mese e sposta una variabile data da cui vuoi estrarre il Mese (Gennaio..) per inserire il codice generico con doppio clic",
  "SCbtnlbl66": "Mese (decimale)",
  "SCttip66": "Clicca su Mese (decimale) e sposta una variabile data da cui vuoi estrarre il Mese (01-12) per inserire il codice generico con doppio clic",
  "SCbtnlbl67": "Trimestri",
  "SCttip67": "Clicca su Trimestri e sposta una variabile data da cui vuoi estrarre i Trimestri (Q1, Q2..) per inserire il codice generico con doppio clic",
  "SCbtnlbl68": "Anno (XXXX)",
  "SCttip68": "Clicca su Anno (XXXX) e sposta una variabile data da cui vuoi estrarre l'Anno (1980) per inserire il codice generico con doppio clic",
  "SCbtnlbl69": "Anno (XX)",
  "SCttip69": "Clicca su Anno (XX) e sposta una variabile data da cui vuoi estrarre l'Anno (80) per inserire il codice generico con doppio clic",
  "SCbtnlbl70": "Ora (00-12)",
  "SCttip70": "Clicca su Ora (00-12) e sposta una variabile data da cui vuoi estrarre l'Ora (00) per inserire il codice generico con doppio clic",
  "SCbtnlbl71": "Ora (00-23)",
  "SCttip71": "Clicca su Ora (00-23) e sposta una variabile data da cui vuoi estrarre l'Ora per inserire il codice generico con doppio clic",
  "SCbtnlbl72": "Minuti",
  "SCttip72": "Clicca su Minuti e sposta una variabile data da cui vuoi estrarre i minuti per inserire il codice generico con doppio clic",
  "SCbtnlbl73": "Secondi",
  "SCttip73": "Clicca su Secondi e sposta una variabile data da cui vuoi estrarre i secondi per inserire il codice generico con doppio clic",
  "SCbtnlbl74": "Data da Stringa",
  "SCttip74": "Clicca su Data da Stringa e sposta una variabile stringa che vuoi convertire in data, per inserire il codice generico con doppio clic",
  "SCbtnlbl75": "Differenza di Data",
  "SCttip75": "Clicca su Differenza di Data e sposta una variabile data da cui vuoi sottrarre un'altra variabile data, per inserire il codice generico con doppio clic",
  "SCbtnlbl76": "Numerico a data",
  "SCttip76": "Clicca su Numerico a data e sposta una variabile numerica che vuoi convertire in data, per inserire il codice generico con doppio clic",
  "SCbtnlbl77": "Stringa a data",
  "SCttip77": "Clicca su Stringa a data e sposta una variabile stringa che vuoi convertire in data, per inserire il codice generico con doppio clic",
  "jsoncomment003": "=======Misure Rep CTRL sotto questa linea=======",
  "RMstr0": "Clicca per Visualizzare/Nascondere la Configurazione per il fattore e la misura all'interno del soggetto",
  "RMstr0a": "Nota",
  "RMstr1": "1. L'applicazione deve ristrutturare i dati quando esegue un'ANOVA a misure ripetute su un dataset ampio",
  "RMstr2": "2. Supportiamo più misure ripetute per una singola variabile, ad es. Glicemia misurata al pretest, posttest e in una visita di follow-up",
  "RMstr3": "3. Per l'applicazione per ristrutturare i dati, è necessario specificare un nome di fattore ripetuto, ad es. Glicemia e il numero di livelli. Creeremo una variabile fattore, ad es. chiamata Glicemia con livelli creati dai nomi delle variabili contenenti le misure ripetute, ad es. i livelli del fattore saranno pretest, posttest e follow-up",
  "RMstr4": "4. È necessario specificare un nome di misura, ad es. Valore. Creeremo una variabile, ad es. Valore con tutti i valori di Glicemia corrispondenti al pretest, posttest e follow-up per ciascun soggetto.",
  "RMstr5": "5. Supportiamo una singola variabile di fattore tra soggetti e all'interno del soggetto.",
  "RMstr6": "6. Le versioni future supporteranno più misure così come più variabili di fattore tra soggetti e all'interno del soggetto.",
  "RMlbl1": "Nome del Fattore All'interno del Soggetto",
  "RMlbl2": "Numero di livelli",
  "RMaddbtn": "Aggiungi",
  "RMlbl3": "Nuova variabile di fattore all'interno del soggetto",
  "RMdelbtn": "Elimina",
  "RMlbl4": "Nome della Misura",
  "RMlbl5": "Nuova variabile di misura",
  "RMdefinebtn": "Definisci",
  "RMmsgboxTitle1": "Livelli errati per il fattore",
  "RMmsgboxMsg1": "Devi specificare un nome di fattore con più di un livello.",
  "RMmsgboxTitle2": "Specificato più di 1 fattore all'interno del soggetto",
  "RMmsgboxMsg2": "Attualmente supportiamo un singolo fattore all'interno del soggetto. Supporteremo più variabili di fattori all'interno del soggetto in un prossimo rilascio.",
  "RMmsgboxTitle3": "Specificato più di 1 misura",
  "RMmsgboxMsg3": "Attualmente supportiamo una singola misura. Supporteremo più misure in un prossimo rilascio.",
  "RMmsgboxTitle4": "Variabile misura non specificata",
  "RMmsgboxMsg4": "Il nome per la variabile misura non è specificato. Devi specificare un nome di misura e cliccare su aggiungi.",
  "RMmsgboxTitle5": "Variabile fattore all'interno del soggetto non specificata",
  "RMmsgboxMsg5": "Devi cliccare sul pulsante Definisci dopo aver inserito un nome di variabile di fattore ripetuto e un nome di misura.",
  "jsoncomment004": "=======SelezionaDataset sotto questa linea=======",
  "SelDSsrclbl1": "Variabili da ",
  "SelDSsrclbl2": "attivo (sinistra) ",
  "SelDSsrclbl3": "selezionato (destra)",
  "SelDSsrclbl4": " dataset",
  "SelDSsrclbl5": "Seleziona un dataset da unire ",
  "SelDSsrclbl6": " con",
  "jsoncomment005": "=======mergejoin sotto questa linea=======",
  "MJlbl1": "Seleziona una variabile dal dataset attivo e una variabile nel dataset selezionato e clicca Aggiungi",
  "MJbtn1": "Aggiungi",
  "MJbtn2": "Elimina",
  "jsoncomment006": "=======opzioni sotto questa linea=======",
  "OptVarDefaultLbl": "Opzioni",
  "jsoncomment007": "=======Scegli file/cartella sotto questa linea=======",
  "fileOpenLbl": "Scegli",
  "fileSaveLbl": "Specifica o seleziona un",
  "jsoncomment008": "=======wrap-control sotto questa linea=======",
  "wrapCtrllabel1": "Visualizza conteggi nel dataset aggregato",
  "wrapCtrllabel2": "Inserisci facoltativamente nomi per conteggi e variabili aggregate separati da , (virgola)",
  "colpickerttip1": "Clicca per selezionare un colore",
  "sixSigmaOvrViewLbl1": "Tutorial Six Sigma dell'Istituto Pyzdek",
  "sixSigmaOvrViewLink1": "Che cos'è Six Sigma e come funziona?",
  "sixSigmaOvrViewLbl2": "Pacchetto R (QCC) - tutorial di grafico di controllo qualità",
  "sixSigmaOvrViewLink2": "Tutorial di grafico di controllo qualità R",
  "sixSigmaOvrViewLbl3": "Ulteriore tutorial Six Sigma trovato su internet (basato sul pacchetto R SixSigma)",
  "sixSigmaOvrViewLink3": "Parte-1",
  "sixSigmaOvrViewLink4": "Parte-2",
  "sixSigmaOvrViewLink5": "Parte-3",
  "sixSigmaOvrViewLink6": "Parte-4",
  "sixSigmaOvrViewLink7": "Parte-5",
  "OKBtnTxt": "Ok",
  "CancelBtnTxt": "Annulla",
  "FBRulVoiMsg": "Il controllo con etichetta: Formula Builder deve essere popolato per procedere",
  "SCruleVoilationMsgTitle1": "Violazione della regola di input",
  "SCruleVoilationMsgTitle2": "Violazione della regola di input condizionale",
  "SCruleVoilationMsg1": "Una condizione if all'interno del controllo con etichetta",
  "SCruleVoilationMsg2": "Una condizione then all'interno del controllo con etichetta",
  "SCruleVoilationMsg3": "Una condizione else all'interno del controllo con etichetta",
  "SCruleVoilationMsg4": "Input condizionale con etichetta",
  "dstVarRuleViolationMsgTitle": "Violazione della regola della lista delle variabili di destinazione",
  "dstVarRuleViolationMsg1": "Una lista di variabili di destinazione con etichetta",
  "dstVarRuleViolationMsg2": " deve essere popolato per procedere",
  "dstVarRuleViolationMsg3": " deve contenere",
  "dstVarRuleViolationMsg4": " variabili",
  "advTxtBxRulViolationMSgTitle1": "Avviso di sovrascrittura",
  "advTxtBxRulViolationMSgTitle2": "Violazione della regola del campo di input",
  "advTxtBxRulViolationMSg1": "Il valore specificato nel campo con etichetta",
  "advTxtBxRulViolationMSg2": "sovrascriverà la variabile esistente",
  "advTxtBxRulViolationMSg3": "Il valore specificato nel campo con etichetta",
  "advTxtBxRulViolationMSg4": "sovrascriverà il dataset",
  "advTxtBxRulViolationMSg5": "Campo con etichetta",
  "advTxtBxRulViolationMSg6": "deve essere popolato per procedere",
  "advTxtBxRulViolationMSg7": "deve essere popolato con un valore numerico per procedere",
  "advTxtBxRulViolationMSg8": "deve essere popolato con un valore carattere per procedere",
  "advTxtBxRulViolationMSg9": "Il campo di input con etichetta",
  "advTxtBxRulViolationMSg10": "non può iniziare con un numero. Non puoi creare nomi di variabili, dataset o modelli che iniziano con un numero.",
  "advTxtBxRulViolationMSg11": "non può contenere spazi. Non puoi creare nomi di variabili, dataset o modelli che contengono spazi.",
  "advTxtBxRulViolationMSg12": "deve contenere solo lettere, numeri e i caratteri punto o sottolineatura. Deve iniziare con una lettera o un punto non seguito da un numero.",
  "chkboxRulVoiMsgTitle": "Violazione della regola della casella di controllo",
  "chkboxRulVoiMsg1": "La casella di controllo con etichetta",
  "chkboxRulVoiMsg2": "richiede un altro controllo da essere popolato per procedere",
  "comboboxRulVoiTitle": "Violazione della regola del controllo Combobox",
  "comboboxRulVoiMsg1": "Devi fare una selezione nel Combobox con etichetta",
  "comboboxWchildRulVoiTitle": "Violazione della regola del Combobox",
  "comboboxWchildRulVoiMsg1": "È necessaria una selezione nel Combobox con etichetta",
  "CBuilderRulVoiTitle": "Violazione della regola di input",
  "CBuilderRulVoiMsg1": "Il controllo con etichetta",
  "CBuilderRulVoiMsg2": "deve essere popolato per procedere",
  "fileOpnRulVoiTitle": "Violazione della regola del campo di input del file",
  "fileOpnRulVoiMsg1": "Seleziona un file dal pulsante di ricerca con etichetta",
  "fileOpnRulVoiMsg2": "e riesegui",
  "fileOpnRulVoiMsg3": "Seleziona una cartella dal pulsante di ricerca con etichetta",
  "fileOpnRulVoiMsg4": "Il pulsante di ricerca con etichetta",
  "fileOpnRulVoiMsg5": "contiene un percorso che non esiste",
  "fileSavRulVoiMsg1": "Devi selezionare un file utilizzando il pulsante con etichetta",
  "fileSavRulVoiMsg2": " per procedere",
  "handlerRulVoiTitle1": "Tipi incompatibili",
  "handlerRulVoiTitle2": "Non supportato",
  "handlerRulVoiTitle3": "Errore",
  "handlerRulVoiTitle4": "Variabili di unione specificate in modo errato",
  "handlerRulVoiMsg1": "Un insieme di vincoli di uguaglianza deve contenere tutti i caricamenti fattoriali, le relazioni di covarianza o le relazioni strutturali. Gli elementi che stai spostando hanno tipi diversi.",
  "handlerRulVoiMsg2": "Un insieme di vincoli di uguaglianza deve contenere tutti i caricamenti fattoriali, le relazioni di covarianza o le relazioni strutturali. Non puoi combinare tipi in un singolo insieme.",
  "handlerRulVoiMsg3": "Non supportiamo più di 2 variabili in un set di mediazione. Contatta il supporto se hai bisogno di questa funzionalità.",
  "handlerRulVoiMsg4": "Le variabili di relazione di mediazione devono essere nella forma A->B e B->C",
  "handlerRulVoiMsg5": "Le variabili di relazione di mediazione devono essere nella forma A->B e B->C o B->C e A->B",
  "handlerRulVoiMsg6": "Il controllo di destinazione non consente di rilasciare variabili dal controllo sorgente con etichetta",
  "handlerRulVoiMsg7": "Devi selezionare una singola variabile sia dal dataset attivo che dal dataset di destinazione per unire",
  "inSpinerRulVoiMsg1": "è fuori dai limiti",
  "inSpinerRulVoiMsg2": "richiede che venga inserito un valore",
  "inSpinerRulVoiMsg3": "richiede che venga inserito un valore numerico",
  "inSpinerRulVoiMsg4": "richiede che venga inserito un valore carattere",
  "mergejoinRulVoiTitle1": "Seleziona la violazione della regola di controllo",
  "mergejoinRulVoiMsg1": "È necessario effettuare una selezione nel controllo di mapping Join con etichetta",
  "radioRulVoiTitle1": "Violazione della regola del radiobutton",
  "radioRulVoiMsg1": "Radiobutton con etichetta",
  "radioRulVoiMsg2": "richiede che un altro controllo sia popolato per procedere",
  "selectRulVoiMsg1": "È necessario effettuare una selezione nel controllo Select con etichetta",
  "semCtrlRulVoiMsg1": "È necessario avere 2 relazioni di mediazione specificate nel controllo con etichetta",
  "semCtrlRulVoiMsg2": "Un vincolo di uguaglianza impostato nel controllo con etichetta",
  "semCtrlRulVoiMsg3": "ha meno di 2 variabili.",
  "semCtrlRulVoiMsg4": "Uno dei nomi dei tratti latenti nel",
  "semCtrlRulVoiMsg5": "il controllo non è popolato.",
  "semCtrlRulVoiMsg6": "Uno dei nomi dei fattori di ordine superiore nel",
  "semCtrlRulVoiMsg7": "il controllo non è popolato.",
  "semCtrlRulVoiMsg8": "Hai inserito un numero in uno dei nomi dei tratti latenti nel",
  "semCtrlRulVoiMsg9": "il controllo. Si prega di inserire un nome valido.",
  "semCtrlRulVoiMsg10": "Le variabili che compongono il tratto latente non sono state specificate nel",
  "semCtrlRulVoiMsg11": "il controllo. Si prega di aggiungere variabili o eliminare il controllo.",
  "semCtrlRulVoiMsg12": "Nessun tratto latente è stato specificato nel",
  "semCtrlRulVoiMsg13": "il controllo. Si prega di aggiungere tratti latenti o eliminare il controllo.",
  "semCtrlAddBtn": "Aggiungi",
  "semModTermRulVoiTitle": "Errore di relazione",
  "semModTermRulVoiMsg1": "Hai definito una relazione tra variabili",
  "semModTermRulVoiMsg2": "nei parametri strutturali e le covarianze. È necessario definire la relazione una sola volta",
  "wrapCtrlRulVoiTitle": "Violazione della regola di controllo Wrap",
  "wrapCtrlRulVoiMsg1": "Controllo Wrap con etichetta",
  "wrapCtrlRulVoiMsg2": "ha ricevuto un numero imprevisto di variabili (atteso",
  "wrapCtrlRulVoiMsg3": "Deve essere popolato per procedere",
  "utilityRulVoiTitle1": "Variabile di misura non specificata",
  "utilityRulVoiTitle2": "Nome duplicato inserito",
  "utilityRulVoiTitle3": "Nome specificato non corretto",
  "utilityRulVoiMsg1": "Il nome per la variabile di misura non è specificato. È necessario specificare un nome di misura e fare clic su aggiungi.",
  "utilityRulVoiMsg2": "Non supportiamo più di 1 set di mediazione. Contatta il supporto se hai bisogno di questa funzionalità.",
  "utilityRulVoiMsg3": "Hai inserito un nome di variabile latente o un nome di fattore di ordine superiore che è già stato inserito. Tutti i nomi delle variabili latenti e dei nomi dei fattori di ordine superiore devono essere unici",
  "utilityRulVoiMsg4": "Un nome di variabile latente o un nome di fattore di ordine superiore non può corrispondere a un nome di una variabile del dataset.",
  "utilityRulVoiMsg5": "Devi effettuare una selezione nel controllo con etichette",
  "utilityRulVoiMsg6": "e",
  "utilityRulVoiMsg7": "prima di fare clic sul pulsante sposta.",
  "utilityRulVoiMsg8": "Non puoi selezionare la stessa variabile nel controllo con etichetta",
  "utilityRulVoiMsg9": "Si prega di effettuare selezioni diverse.",
  "utilityRulVoiMsg10": "prima di fare clic sul pulsante sposta.",
  "utilityRulVoiMsg11": "Hai già una relazione tra",
  "utilityRulVoiMsg12": "Non puoi avere 2 relazioni tra le stesse variabili.",
  "errormessageIPCmsg1": "Devi specificare una stringa non vuota da utilizzare come nome del fattore",
  "errormessageIPCmsg2": "Devi selezionare un'entrata da eliminare prima di fare clic sul pulsante elimina",
  "errormessageIPCmsg3": "Devi specificare una stringa non vuota da utilizzare come nome della misura",
  "errormessageIPCmsg4": "Devi specificare un nome di fattore con più di un livello.",
  "errormessageIPCmsg5": "Attualmente supportiamo un singolo fattore all'interno del soggetto. Supporteremo più variabili di fattore all'interno del soggetto in un prossimo rilascio.",
  "errormessageIPCmsg6": "Attualmente supportiamo una singola misura. Supporteremo più misure in un prossimo rilascio.",
  "errormessageIPCmsg7": "Esiste già una variabile di destinazione per catturare le misure del fattore all'interno del soggetto",
  "errormessageIPCmsg8": "Questo campo si aspetta un numero, non una stringa",
  "errormessageIPCmsg9": "Questo campo si aspetta una stringa, non un numerico",
  "errormessageIPCmsg10": "La variabile ",
  "errormessageIPCmsg11": "non può essere spostata, la destinazione non consente variabili di quel tipo",
  "errormessageIPCmsg12": "Devi selezionare un'entrata da eliminare prima di fare clic sul pulsante di eliminazione",
  "errormessageIPCTitle1": "Tipo non previsto",
  "projLaunchLoadMsg1": "Vuoi caricare il tuo progetto precedente ",
  "projLaunchLoadMsg2": "Questo potrebbe richiedere un po' di tempo.",
  "projSwitchMsg1": "Se passi allo stesso progetto su cui stai attualmente lavorando, le tue modifiche non salvate verranno perse e verrà caricato l'ultimo progetto salvato.",
  "projSwitchMsg2": "Vuoi continuare?",
  "projSwitchMsg3": "Attenzione: Ricaricando lo stesso progetto per l'ultima versione salvata. Le modifiche non salvate andranno perse.\n",
  "projSwitchMsg4": "Questo potrebbe richiedere un po' di tempo.",
  "projValidMsg1": "Attenzione: Caricamento di un progetto non valido o corrotto",
  "projValidMsg2": "Il progetto ",
  "projValidMsg3": " è un progetto non valido o corrotto e verrà rimosso dall'elenco",
  "projSwitchSaveCurrnentMsg1": "Passare a un progetto diverso potrebbe richiedere un po' di tempo. Temporaneamente potresti vedere uno schermo vuoto.",
  "projSwitchSaveCurrnentMsg2": "Vuoi salvare le modifiche, se presenti, nel progetto corrente '",
  "projSwitchSaveCurrnentMsg3": " prima",
  "projSwitchSaveCurrnentMsg4": " di passare a un progetto diverso ",
  "projSwitchSaveCurrnentMsg5": " di passare a un progetto 'NUOVO'?",
  "projSwitchSaveCurrnentMsg6": " di uscire dall'applicazione?",
  "projSwitchSaveCurrnentMsg7": " di aprire un altro progetto?",
  "projSaveRSpcTitle": "Il file è attualmente in uso da un'altra applicazione",
  "projSaveRSpcMsg1": "Sembra che il ",
  "projSaveRSpcMsg2": " file sia attualmente in uso da un'altra applicazione.",
  "projSaveRSpcMsg3": "Si prega di chiudere il ",
  "projSaveRSpcMsg4": " file in un'altra applicazione e riprovare",
  "projAsknameTitle": "Un progetto con lo stesso nome esiste già nel menu a discesa dei progetti",
  "projAsknameTitle2": "Attenzione: Apertura di un progetto non valido o corrotto",
  "projAsknameMsg1": "Il progetto ",
  "projAsknameMsg2": "situato in",
  "projAsknameMsg3": "esiste già.",
  "projAsknameMsg4": "che stai salvando sarà salvato in",
  "projAsknameMsg5": "Vuoi sostituire il progetto esistente con il nuovo?",
  "projAsknameMsg6": "è un progetto non valido o corrotto.",
  "jsoncomment0010": "=======Menu di livello superiore e sottomenu a discesa sotto questa linea=======",
 
  "agreement_top_level_title": "Accordo",
  "professional_Agreement_Menu": "Accordo",
  "agreement_Method": "Metodo",
  "professional_Method": "Metodo",
  "agreement_Scale": "Scala",
  "analysis_top_level_title": "Analisi",
  "contribution_Analysis_Menu": "Analisi",
  "professional_Analysis_Menu": "Analisi",
  "sixsigmapro_Analysis_Menu": "Analisi",
  "analysis_Association_Rules": "Regole di Associazione",
  "analysis_Cluster": "Cluster",
  "analysis_Correlations": "Correlazioni",
  "analysis_Crosstab": "Tabelle Incrociate",
  "professional_Crosstab": "Tabelle Incrociate",
  "analysis_Distribution_Analysis": "Analisi della Distribuzione",
  "sixsigmapro_Distribution_Analysis": "Analisi della Distribuzione",
  "analysis_Factor_Analysis": "Analisi Fattoriale",
  "analysis_Means": "Medie",
  "sixsigmapro_Means": "Medie",
  "analysis_Moments": "Momenti",
  "analysis_Non_Parametric": "Non Parametrico",
  "analysis_Outlier" : "Valore anomalo",
  "analysis_Proportions": "Proporzioni",
  "analysis_Summary": "Sommario",
  "professional_Summary": "Sommario",
  "sixsigmapro_Summary": "Sommario",
  "analysis_Survival": "Sopravvivenza",
  "contribution_Survival": "Sopravvivenza",
  "professional_Survival": "Sopravvivenza",
  "analysis_Tables": "Tabelle",
  "contribution_Tables": "Tabelle",
  "analysis_Variance": "Varianza",
  "contribution_Sample_Size_Menu": "Dimensione del Campione",
  "contribution_Precision": "Precisione",
  "contribution_Tests": "Test",
  "contribution_Datasets_Menu": "Dataset",
  "datasets_top_level_title": "Dataset",
  "datasetspro_Datasets_Menu": "Dataset",
  "professional_Datasets_Menu": "Dataset",
  "contribution_Subset": "Sottoinsieme",
  "datasets_Subset": "Sottoinsieme",
  "professional_Subset": "Sottoinsieme",
  "datasets_group_by": "Raggruppa Per",
  "datasets_Matching": "Abbinamento",
  "professional_Matching": "Abbinamento",
  "datasets_Merge": "Unisci",
  "professional_Merge": "Unisci",
  "datasets_ReShape": "Riformattare",
  "datasets_Sampling": "Campionamento",
  "datasets_Sort": "Ordina",
  "professional_Sort": "Ordina",
  "datasets_Transpose": "Trasponi",
  "distribution_top_level_title": "Distribuzione",
  "sixsigmapro_Distribution_Menu": "Distribuzione",
  "distribution_Beta": "Beta",
  "distribution_Binomial": "Binomiale",
  "distribution_Cauchy": "Cauchy",
  "distribution_Chi_squared": "Chi-quadro",
  "distribution_Exponential": "Esponenziale",
  "distribution_F": "F",
  "distribution_Gamma": "Gamma",
  "distribution_Geometric": "Geometrica",
  "distribution_Gumbel": "Gumbel",
  "distribution_Hypergeometric": "Ipergeometrica",
  "distribution_Logistic": "Logistica",
  "distribution_Lognormal": "Lognormale",
  "distribution_Negative_Binomial": "Binomiale Negativa",
  "distribution_Normal": "Normale",
  "sixsigmapro_Normal": "Normale",
  "distribution_Poisson": "Poisson",
  "distribution_t": "t",
  "distribution_Uniform": "Uniforme",
  "distribution_Weibull": "Weibull",
  "doe_top_level_title": "DoE",
  "doe_Create_DoE_Factor_Table": "Crea Tabella dei Fattori DoE",
  "doe_Create_Design": "Crea Progettazione",
  "doe_Inspect_Design": "Ispeziona Progettazione",
  "doe_Modify_Design": "Modifica Progettazione",
  "doe_Analyze_Design": "Analizza Progettazione",
  "file_top_level_title": "File",
  "modelfitting_File": "File",
  "outputpro_File_Menu": "File",
  "projectspace_File_Menu": "File",
  "utility_File_Menu": "File",
  "utilitypro_File_Menu": "File",
  "forecasting_top_level_title": "Previsioni",
  "graphics_top_level_title": "Grafici",
  "graphicspro_Graphics_Menu": "Grafici",
  "graphicspro_BoxPlots": "Diagrammi a scatola",
  "graphics_Distribution": "Distribuzione",
  "graphicspro_Distribution": "Distribuzione",
  "graphics_Line_Charts": "Grafici a Linea",
  "graphics_Maps": "Mappe",
  "graphics_Pie_Charts": "Grafici a Torta",
  "graphics_Scatter_Plot": "Grafico a Dispersione",
  "graphicspro_Scatter_Plot": "Grafico a Dispersione",
  "modelevaluation_top_level_title": "Valutazione Modello",
  "contribution_Model_Evaluation_Menu": "Valutazione Modello",
  "professional_Model_Evaluation_Menu": "Valutazione Modello",
  "modelevaluation_Compare": "Confronta",
  "modelevaluation_Fit": "Adatta",
  "modelevaluation_IRT": "IRT",
  "modelevaluation_Predict": "Predici",
  "modelevaluation_Summarize": "Riassumi",
  "modelfitting_top_level_title": "Adattamento Modello",
  "contribution_Model_Fitting_Menu": "Adattamento Modello",
  "modelfittingpro_Model_Fitting_Menu": "Adattamento Modello",
  "professional_Model_Fitting_Menu": "Adattamento Modello",
  "modelfitting_Contrasts": "Contrasti",
  "modelfitting_IRT": "IRT",
  "modelfitting_KNN": "KNN",
  "modelfitting_Regression": "Regressione",
  "contribution_Regression": "Regressione",
  "professional_Regression": "Regressione",
  "modelfitting_Neural_Nets": "Reti Neurali",
  "modelfitting_Trees": "Alberi",
  "modelfitting_File_Model": "Modello",
  "modelfitting_Nonlinear_Regression": "Regressione Non Lineare",
  "modeltuning_top_level_title": "Ottimizzazione Modello",
  "projectspace_Open_Project": "Apri Progetto",
  "projectspace_Save_Project": "Salva Progetto",
  "projectspace_SaveAs_Project": "Salva Progetto Come",
  "sixsigma_top_level_title": "Six Sigma",
  "sixsigmapro_Six_Sigma_Menu": "Six Sigma",
  "sixsigma_Pareto_Chart": "Grafico di Pareto",
  "sixsigmapro_Pareto_Chart": "Grafico di Pareto",
  "sixsigma_MSA": "MSA",
  "sixsigmapro_MSA": "MSA",
  "sixsigma_Process_Capability": "Capacità del Processo",
  "sixsigmapro_Process_Capability": "Capacità del Processo",
  "sixsigma_Shewhart_Charts": "Grafici di Shewhart",
  "sixsigmapro_Shewhart_Charts": "Grafici di Shewhart",
  "variables_top_level_title": "Variabili",
  "contribution_Variables_Menu": "Variabili",
  "professional_Variables_Menu": "Variabili",
  "variables_Box_Cox": "Box-Cox",
  "variables_Compute": "Calcola",
  "contribution_Compute": "Calcola",
  "variables_Convert": "Converti",
  "variables_Factor_Levels": "Livelli Fattoriali",
  "contribution_Factor_Levels": "Livelli Fattoriali",
  "analysis_Missing_Values": "Valori Mancanti",
  "professional_Missing_Values": "Valori Mancanti",
  "Note00": "=============Il menu sottostante è diverso dai 2 sopra===========",
  "variables_Missing_Values": "Valori Mancanti"
}