{
  "title": "Scalamento Multidimensionale",
  "navigation": "Scalamento Multidimensionale",
  "betRows": "Tra le righe",
  "betVariables": "Tra le variabili",
  "textSize": "Dimensione del testo",
  "textPos": "Posizione del testo",
  "destination": "Seleziona variabili",
  "maxDimensions": "Dimensioni massime",
  "label1": "Matrice delle distanze",
  "computationMethod": "Metodo di calcolo",
  "power": "Potenza della distanza di Minkowski",
  "dispDist": "Visualizza matrice delle distanze",
  "saveDims": "Salva dimensioni in un nuovo dataset",
  "datasetName": "Inserisci facoltativamente un nome per il dataset per salvare le dimensioni",
  "label2": "Opzioni avanzate",
  "scalingMethod": "Metodo di scalamento",
  "maxIter": "Numero massimo di iterazioni (*Non applicabile per il metodo metrico classico)",
  "plotResults": "Traccia risultati",
  "help": {
    "title": "Scalamento Multidimensionale",
    "r_help": "help(cmdscale, package=stats)",
    "body": "\n<b>Descrizione</b></br>\nEsistono diversi tipi di algoritmi MDS, tra cui</br>\n<b>Scalamento multidimensionale classico</b></br>\nPreserva la metrica di distanza originale, tra i punti, il più possibile. Cioè le distanze adattate sulla mappa MDS e le distanze originali sono nella stessa metrica. Il MDS classico appartiene alla cosiddetta categoria di scalamento multidimensionale metrico.</br>\nÈ anche conosciuto come analisi delle coordinate principali. È adatto per dati quantitativi.</br></br>\n<b>Scalamento multidimensionale non metrico</b></br>\nÈ anche conosciuto come MDS ordinale. Qui, non è la metrica di un valore di distanza che è importante o significativa, ma il suo valore in relazione alle distanze tra altre coppie di oggetti.</br>\nL'MDS ordinale costruisce distanze adattate che sono nello stesso ordine di rango delle distanze originali. Ad esempio, se la distanza degli oggetti 1 e 5 è quinta nei dati di distanza originali, allora dovrebbero anche essere quinti nella configurazione MDS.</br>\nÈ adatto per dati qualitativi.</br>\nUtilizziamo le seguenti funzioni R</br>\ncmdscale() [pacchetto stats]: Calcola lo scalamento multidimensionale classico (metrico).</br>\nisoMDS() [pacchetto MASS]: Calcola lo scalamento multidimensionale non metrico di Kruskal (una forma di MDS non metrico).</br>\nsammon() [pacchetto MASS]: Calcola la mappatura non lineare di Sammon (una forma di MDS non metrico).</br>\nTutte queste funzioni prendono un oggetto distanza come argomento principale e k è il numero desiderato di dimensioni nell'output scalato. Per impostazione predefinita, restituiscono soluzioni a due dimensioni, ma possiamo cambiare ciò attraverso il parametro k che per impostazione predefinita è 2.</br>\n<br/>\nOpzioni per visualizzare la matrice delle distanze, salvare le dimensioni in un nuovo dataset e tracciare le dimensioni possono essere selezionate. </br>\nQuando viene selezionato il metodo di scalamento metrico classico, visualizziamo i valori propri, la statistica di bontà di adattamento e il grafico scree. Per altri metodi di scalamento visualizziamo il valore di stress.\n<b>Aiuto</b></br>\nPer un aiuto dettagliato eseguire i seguenti comandi help(dist, package=\"stats\") o help(cmdscale, package ='stats') o help(isoMDS, package = \"MASS\") o help(sammon, package =\"MASS\") nell'editor R di BlueSky Statistics.           \n<br/>\n<br/>"
  }
}