{
  "title": "Regressione di Sopravvivenza Parametrica",
  "navigation": "Regressione di Sopravvivenza Parametrica",
  "modelname": "Inserisci Nome Modello",
  "timevar": "Tempo fino all'evento o censura",
  "eventvar": "Evento (1 o superiore = evento, 0 o inferiore = censura)",
  "destvars": "Variabili Indipendenti",
  "weightvar": "Pesi (opzionale)",
  "rmstChk": "Calcola il tempo medio di sopravvivenza ristretto (RMST)",
  "rmstSEChk": "Calcola l'errore standard per RMST utilizzando il bootstrap (nota: ci vorrà un po')",
  "bootIter": "Iterazione Bootstrap",
  "HazardRatioChk": "Calcola i Rapporti di Rischio",
  "labelSurvival": "Tipo di Grafico di Sopravvivenza",
  "survivalradioCI": "Sopravvivenza con CI",
  "survivalradio": "Sopravvivenza",
  "survivalradioKMCI": "Sopravvivenza con sovrapposizione di Kaplan-Meier (non parametrica) con CI",
  "survivalradioKM": "Sopravvivenza con sovrapposizione di Kaplan-Meier (non parametrica)",
  "labelFailure": "Tipo di Grafico di Fallimento Cumulativo",
  "inciradioCI": "Fallimento Cumulativo con CI",
  "inciradio": "Fallimento Cumulativo",
  "inciradioKMCI": "Fallimento Cumulativo con sovrapposizione di Kaplan-Meier (non parametrica) con CI",
  "inciradioKM": "Fallimento Cumulativo con sovrapposizione di Kaplan-Meier (non parametrica)",
  "spectimes": "Calcola la Probabilità di Sopravvivenza - specifica i tempi come time1, time2, time3, ecc. o come seq (1,5,by=1)",
  "specprobs": "Calcola il Tempo di Sopravvivenza fino all'Evento - specifica il quantile (probabilità) come 0.25, 0.50, 0.60, 0.75, ecc. o come seq (0.2,0.9,by=0.1)",
  "coVarValues": "Se lasciato vuoto, verranno utilizzati i valori medi delle variabili indipendenti (Covariate). Altrimenti, specifica valori separati da virgola da utilizzare per stimare le probabilità e tracciare",
  "labelDistribution": "Seleziona una funzione di distribuzione che si adatta meglio ai dati",
  "selectDistFuncWeibullRad": "Weibull",
  "selectDistFuncExpRad": "Esponenziale",
  "selectDistFuncGammaRad": "Gamma",
  "selectDistFuncLnormalRad": "Log Normale",
  "selectDistFuncPoissonRad": "Poisson",
  "selectDistFuncNBinomRad": "Binomiale Negativa",
  "selectDistFuncGeomRad": "Geometrica",
  "selectDistFuncBetaRad": "Beta",
  "selectDistFuncUnifRad": "Uniforme",
  "selectDistFuncLogisRad": "Logistica",
  "selectDistFuncLogLogisRad": "Logistica Logaritmica",
  "selectDistFuncCauchyRad": "Cauchy",
  "selectDistFuncNormRad": "Normale",
  "confidenceInterval": "Intervalli di confidenza per le stime di massima verosimiglianza",
  "help": {
    "title": "Regressione di Sopravvivenza Parametrica",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n\t\t\tVedi il dataset di esempio nella directory di installazione, la posizione predefinita è alla lettera dell'unità:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. La variabile Followup_time dovrebbe essere inserita come il tempo fino all'evento o censura e la variabile Event dovrebbe essere inserita come l'Evento (1 = evento, 0 = censura).<br/>\n            <br/>\n            <br/>\n\t\t\tI dataset di esempio sono lung, manufacturing_data e bulb reliability <br/><br/>\t\t\n            <b>Stime dei parametri della regressione di sopravvivenza parametrica e grafici insieme alle curve di sopravvivenza di Kaplan-Meier (modello nullo/intercetta solo) sovrapposte</b>\n            <br/>\n            <br/>\n            Questi vengono utilizzati per stimare il rischio cumulativo di non avere un evento (o viceversa, avere un evento) per un periodo di tempo dopo l'inizio del follow-up per quell'evento (o tempo zero). I soggetti devono essere a rischio per l'evento a partire dal tempo zero.\n            <br/>\n            <br/>\n            <b>Tempo:</b> Lunghezza del tempo fino a un evento, se l'evento si è verificato, o ultimo follow-up per quell'evento, se l'evento non si è verificato, per ciascun soggetto\n            <br/><br/>\n            <b>Evento:</b> Indicatore numerico di se l'evento si è verificato o meno (1=evento, 0=censura) per ciascun soggetto\n            <br/><br/>\n            <b>Tipo di Grafico:</b> Traccia la probabilità di non avere l'evento (sopravvivenza) o avere l'evento (fallimento)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Tabella di Stima per Tempi o probabilità Specifici:</b> Opzione per includere una tabella che ha le probabilità di stima di sopravvivenza per un insieme di tempi selezionati dall'utente.\n\t\t\t<br/><br/>\n\t\t\t<b>Specifica i tempi come time1, time2, time3, ecc. o come seq(1,5,by=1):</b> Questi sono i tempi specifici che saranno inclusi nella tabella per i tempi specifici. Possono essere specificati individualmente con virgole, o come una sequenza di valori equidistanti.\n\t\t\t<br/><br/>\n            Le tabelle vengono restituite con la dimensione del campione, il numero di soggetti con l'evento, il tempo mediano di sopravvivenza (se definito), il tempo medio di sopravvivenza ristretto e il tempo mediano di follow-up. Il tempo mediano di follow-up viene calcolato utilizzando l'estimatore di Kaplan-Meier inverso, che tratta i veri eventi come osservazioni censurate e le vere osservazioni censurate come eventi. Pertanto, l'\"evento\" in questo estimatore è \"seguire i soggetti per tutto il tempo che lo studio potrebbe\".\n            <br/>\n            Una tabella delle stime di sopravvivenza parametrica e degli eventi per la distribuzione scelta è fornita a ciascun tempo osservato nel dataset, con dati di intervallo di confidenza forniti. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Opzioni di Stile</b>\n            <br/>\n            <br/>\n            <b>Titolo del Grafico:</b> Titolo del grafico; elimina tutto il testo per nessun titolo\n            <br/><br/>\n\t\t\t<b>Dimensione del Titolo del Grafico:</b> Dimensione del titolo del grafico.\n\t\t\t<br/><br/>\n            <b>Tema del Grafico:</b> Stile generale del grafico\n            <br/><br/>\n            <b>Includi Numero a Rischio:</b> Opzionalmente, includi una tabella per il numero di soggetti ancora a rischio nel tempo in fondo al grafico.  <b>Posizione della Tabella di Rischio</b> specifica se si desidera che la tabella sia all'esterno degli assi o all'interno degli assi.  La <b>Dimensione della Tabella di Rischio</b> controlla la proporzione dell'area di tracciamento che la tabella occuperà. Questa opzione viene ignorata quando la posizione della tabella di rischio è all'interno degli assi. \n\t\t\tLa <b>Dimensione del Valore della Tabella di Rischio</b> controlla la dimensione dei numeri a rischio. La <b>Dimensione del Titolo della Tabella di Rischio</b> controlla la dimensione del titolo per la tabella del numero a rischio.\n\t\t\tLa <b>Dimensione dell'Etichetta dell'Asse della Tabella di Rischio</b> controlla la dimensione delle etichette degli assi.\n\t\t\tLa <b>Dimensione dell'Etichetta dei Tick della Tabella di Rischio</b> controlla la dimensione delle etichette dei segni di spunta per i tempi nella tabella del numero a rischio. Se si desidera rimuovere tutti gli assi e le linee della griglia \n\t\t\tdalla tabella del numero a rischio, l'opzione <b>Rimuovi Assi e Linee della Griglia dalla Tabella di Rischio</b> può essere selezionata. Questo includerà solo i numeri a rischio nella tabella.\n            <br/>\n            <br/>\n            <b>Opzioni di Linea:</b>\n            <b>Dimensione</b> controlla lo spessore e <b>Colore</b> controlla il colore della linea tracciata. Si può opzionalmente includere un intervallo di confidenza del 95% per le stime in formato <b>ribbon</b> (area ombreggiata) o <b>step</b> (linea).  <b>Trasparenza</b> controlla quanto è scura la fascia ed è ignorata quando l'opzione step è selezionata.  <b>Tempi Censurati</b> (quando i soggetti non sono più a rischio per l'evento) possono essere indicati sulla linea con simboli \"+\". La dimensione dei simboli \"+\" può essere regolata.  L'opzione <b>Indica la Sopravvivenza Mediana</b> includerà linee orizzontali o verticali al momento in cui il 50% dei soggetti è stimato aver avuto l'evento. Il tempo mediano è indefinito se la curva di sopravvivenza non attraversa il 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opzioni degli Assi</b>\n            <br/> \n            <br/> \n            L'opzione <b>Etichetta</b> specifica l'etichetta di testo per l'asse.  I <b>Limiti degli Assi</b> specificano i valori minimi e massimi dell'asse.  L'opzione <b>Incrementi dei Segni di Spunta</b> controlla la spaziatura dei segni di spunta sull'asse.  Gli incrementi sull'asse del tempo controllano anche i tempi per la tabella opzionale del numero a rischio.\n            <br/> \n            L'asse di sopravvivenza <b>Scala</b> specifica se si desidera che le stime siano su una scala proporzionale (0-1) o percentuale (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione dell'Etichetta dell'Asse:</b>  Questo controlla la dimensione delle etichette degli assi di sopravvivenza e tempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensione dell'Etichetta dei Segni di Spunta dell'Asse:</b>  Questo controlla la dimensione delle etichette dei segni di spunta degli assi di sopravvivenza e tempo."
  }
}