{
  "title": "Stime del Livello dei Parametri",
  "navigation": "Stime dei Parametri",
  "label1": "Sono supportati modelli delle seguenti classi, le classi sono elencate tra parentesi di seguito",
  "label2": "Modelli lineari (lm), Modelli lineari generalizzati (glm), Modelli log-lineari multinomiali (multinom), Regressione quantile (rq), Regressione lineare robusta (rlm), Oggetto curva di sopravvivenza (survfit), Modello a effetti misti lineari (lme), Oggetto di regressione a rischi proporzionali (coxph), Modello di regressione di sopravvivenza parametrica (survreg), Regressione logistica/probit ordinata (polr), Analisi fattoriale (factanal), Modelli lineari generalizzati regolarizzati Lasso ed Elastic-net (glmnet)",
  "modelselector1": "Seleziona un modello",
  "help": {
    "title": "Stime del Livello dei Parametri",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>Descrizione</b></br>\nVisualizza le stime dei parametri del modello selezionato\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nx: modello o altro oggetto R da convertire in un data frame a riga singola\n</li>\n</ul>\n<b>Dettagli</b></br>\nVisualizza le stime dei parametri dei seguenti modelli</br>\nModelli lineari (classe modello lm)</br>\nModelli lineari generalizzati (classe modello glm)</br>\nModelli Log-Linear Multinomiali (classe modello multinom)</br>\nRegressione logistica ordinata o Probit (classe modello polr)</br>\nModelli lineari generalizzati regolarizzati Lasso e Elastic-Net (classe modello glmnet)</br>\nRegressione lineare robusta (classe modello rlm)</br>\nRegressione Quantile (classe modello rq)</br>\nmodello a effetti misti lineari (lme)</br>\nOggetto di regressione a rischi proporzionali (coxph)</br>\nModello di regressione di sopravvivenza parametrica (survreg)</br>\nAnalisi fattoriale (factanal)</br>\n<b>Valore</b></br>\nUn tibble::tibble() con informazioni sui componenti del modello.</br>\nterm: Il nome del termine di regressione.</br>\nestimate: Il valore stimato del termine di regressione.</br>\nstd.error: L'errore standard del termine di regressione.</br>\nstatistic: Il valore di una statistica, quasi sempre una T-statistica, da utilizzare in un'ipotesi che il termine di regressione sia diverso da zero.</br>\np.value: Il valore p a due lati associato alla statistica osservata.</br>\nconf.low: L'estremità bassa di un intervallo di confidenza per il termine di regressione. Incluso solo se conf.int = TRUE.</br>\nconf.high: L'estremità alta di un intervallo di confidenza per il termine di regressione. Incluso solo se conf.int = TRUE.</br>\nSe il modello lineare è un oggetto mlm (modello lineare multiplo), c'è una colonna aggiuntiva:</br>\nresponse: A quale colonna di risposta corrispondono i coefficienti (tipicamente Y1, Y2, ecc)</br>\n<b>Pacchetto</b></br>\nbroom</br>\n<b>Aiuto</b></br>\nPer un aiuto dettagliato clicca sull'icona R in alto a destra di questo overlay di dialogo o esegui il seguente comando nell'editor di sintassi R help(tidy, package ='broom')\n"
  }
}