{
  "title": "Grafico di Pareto",
  "navigation": "Grafico di Pareto",
  "label1": "Tre opzioni - Formato lungo (predefinito) ovvero difetti e conteggi in colonne verticali, Formato largo ovvero difetti come nomi di colonna e conteggi come righe, e Calcola conteggi dai dati grezzi",
  "selectLongRad": "Opzione 1: Formato lungo - scegli la categoria di difetti e i conteggi dei difetti",
  "selectWideRad": "Opzione 2: Formato largo - I nomi delle colonne saranno usati come categorie di difetti e la 1ª riga (predefinita) sarà usata come conteggi",
  "selectRawRad": "Opzione 3: Dati grezzi - calcola conteggi per tracciare il grafico di Pareto",
  "rownumForCounts": "Numero di riga (predefinito 1ª riga) da utilizzare per i conteggi",
  "defects": "Variabile (ad es. categorie) da tracciare",
  "counts": "(Facoltativo) Variabile da utilizzare come conteggi da tracciare",
  "grouping": "(Facoltativo) Variabile di raggruppamento per tracciare più grafici di Pareto affiancati",
  "uniformBarOrderChk": "Traccia barre nello stesso ordine alfabetico (tra i gruppi). Deseleziona per ordinare le barre in base alla frequenza decrescente (all'interno di ciascun gruppo)",
  "grouping2": "(Facoltativo) Una variabile di raggruppamento per tracciare più grafici di Pareto affiancati",
  "rawVariable": "Variabile (ad es. categorie) con dati grezzi",
  "mainTitle": "Inserisci un titolo per il grafico",
  "xlab": "Etichetta asse X",
  "ylab": "Etichetta asse Y",
  "ylab2": "Etichetta asse Y a destra",
  "RefCumFreqLine": "Disegna una linea di riferimento orizzontale per una % cumulativa specificata (ad es., digita 80 per 80%) - lascia vuoto per nessuna linea",
  "legends": "Mostra legende e, in tal caso, posizione delle legende (predefinito a destra)",
  "percentStep": "Passo percentuale da utilizzare come tacche per il secondo asse y sul lato destro",
  "digits": "Numero di punti decimali per la tabella statistica",
  "help": {
    "title": "Grafico di Pareto",
    "r_help": "help(pareto.chart, package = qcc)",
    "body": "\n\t\t\t\t<b>Descrizione</b></br>\n\t\t\t\tfunzione pareto.chart per creare una tabella di statistiche e tracciare un grafico di Pareto\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPer l'aiuto dettagliato - usa R help(pareto.chart, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPer provare questo, puoi utilizzare il file di dataset di esempio chiamato defects_frequency_pareto_chart.xlsx. Apri il file nella griglia dati con il menu di apertura file\n\t\t\t\t<br/>\n\t\t\t"
  }
}