{
  "title": "Modello di Credito Parziale",
  "navigation": "Modello di Credito Parziale",
  "modelname": "Inserisci il nome del modello",
  "destinationvars": "Variabile(e) di destinazione",
  "estimationlbl": "Stima",
  "rad1": "Usa stima CML",
  "chk1": "Calcola errore standardizzato",
  "chk2": "Normalizza i parametri per sommare (0)",
  "rad2": "Usa stima MML",
  "help": {
    "title": "Modello di Credito Parziale",
    "r_help": "help(PCM, package='eRm')",
    "body": "\n            <b>Descrizione</b>\n            <br/>\n            Genera stime dei parametri per un modello di credito parziale\n            <br/><br/>\n            Per la stima CML, invochiamo eRm::PCM per calcolare le stime dei parametri di un modello di credito parziale per risposte a elementi politomici.\n            <br/><br/>\n            Per la stima MML, invochiamo tam.mml con i parametri appropriati vedi sotto \n            <br/><br/>\n            <b>Utilizzo per la stima CML</b>\n            <br/>\n            <code>\n            eRm::PCM(X,se=FALSE,sum0=FALSE) \n            </code>    \n            <br/><br/>\n            <b>Argomenti</b>\n            <br/>       \n            <ul>\n\n            <li>\n            X:  Matrice di dati 0/1 o data frame; le righe rappresentano gli individui, le colonne rappresentano gli elementi. I valori mancanti sono inseriti come NA.\n            </li>\n            <li>\n            W:  Matrice di design per il modello di Rasch. Se omesso, la funzione calcolerà W automaticamente.\n            </li>\n            <li>\n            se: Se TRUE, vengono calcolati gli errori standard.\n            </li>\n            <li>\n            sum0: Se TRUE, i parametri sono normalizzati per sommare 0 specificando un W appropriato. Se FALSE, il primo parametro è limitato a 0.\n            </li>\n            <li>\n            etaStart: Un vettore di valori iniziali per i parametri eta può essere specificato. Se mancante, viene utilizzato il vettore 0.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>Utilizzo per la stima MML</b>\n            <br/>\n            <code>\n            tam.mml(resp,irtmodel=\"PCM\",verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Argomenti</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Data frame con risposte a elementi politomici k=0,...,K. Le risposte mancanti devono essere dichiarate come NA.\n            </li>\n            <li>\n            irtmodel: Per pendenze fisse degli elementi (in tam.mml) le opzioni includono PCM (modello di credito parziale), PCM2 (modello di credito parziale con parametrizzazione ConQuest 'item+item*step' e RSM (modello a scala di valutazione; la parametrizzazione ConQuest 'item+step'). \n            <br/>\n            Per pendenze degli elementi stimate (disponibili solo in tam.mml.2pl) le opzioni sono 2PL (tutte le pendenze delle categorie di elementi sono stimate; Modello di Risposta agli Elementi Nominali), GPCM (modello di credito parziale generalizzato in cui ogni elemento ottiene un solo e unico parametro di pendenza per dimensione) e 2PL.groups (sottogruppi di elementi ottengono le stesse stime di pendenza degli elementi) e una matrice di design E sulle pendenze degli elementi nel modello di credito parziale generalizzato (GPCM.design, vedi Esempi). Nota che le pendenze degli elementi non possono essere stimate con design a faccette utilizzando la funzione tam.mml.mfr. Tuttavia, è facile utilizzare matrici di design predefinite e applicare alcune restrizioni a tam.mml.2pl\n            </li>\n            <li>\n            verbose: Logico che indica se l'output deve essere stampato durante le iterazioni. \n            </li>\n            </ul>\n            <br/><br/>\n            <b>Pacchetti</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>\n            <b>Aiuto</b>\n            <br/>\n            help(PCM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
  }
}