{
  "title": "Statistiche Personfit e il Test del Rapporto di Verosimiglianza di Martin-Löf",
  "navigation": "Adattamento Personale",
  "label1": "Seleziona un modello (i modelli di classe Rm, dRm ed eRm sono supportati)",
  "label1b": "Se non sono disponibili modelli, è necessario prima creare un modello selezionando Adattamento Modello -> IRT -> Modello Rasch Semplice e scegliere la stima CML",
  "modelselector1": "Seleziona un modello",
  "chkbox": "Visualizza le statistiche del Test del Rapporto di Verosimiglianza di Martin-Löf",
  "lbl2": "Criteri di Suddivisione per il Test del Rapporto di Verosimiglianza",
  "rd1": "mediana",
  "rd2": "media",
  "help": {
    "title": "Statistiche Personfit e il Test del Rapporto di Verosimiglianza di Martin-Löf",
    "r_help": "help(personfit, package='eRm')",
    "body": "\n                <b>Descrizione: statistiche personfit</b></br>\n                Per i modelli di classe Rm, eRm o dRm (creati utilizzando IRT -> Modello Rasch Semplice con stima CML) utilizza la funzione personfit per visualizzare le statistiche personfit.\n\n                <br/><br/>\n                <b>Utilizzo</b>\n                <br/>\n                <code>\n                eRm::personfit(object)\n                </code>\n                <br/><br/>\n                <b>Dettagli</b>\n                <br/>  \n                object: Oggetto di classe ppar, derivato da person.parameter, eseguire help(person.parameter) dall'editor di sintassi per assistenza.\n                <br/><br/>\n                <b>Valori</b>\n                <br/>\n                p.df: gradi di libertà per le statistiche personfit\n                <br/>\n                st.res: Residui standardizzati (dalla funzione personfit).\n                <br/>\n                p.outfitMSQ: Statistiche della media quadratica dell'outfit (dalla funzione personfit).\n                <br/>\n                p.infitMSQ: Statistiche della media quadratica dell'infit (dalla funzione personfit).\n                <br/><br/>\n                <b>Aiuto</b>\n                <br/>\n                Esegui quanto segue dall'editor di sintassi di BioStat Prime help(personfit, package ='eRm')\n                <br/><br/>\n                <b>Pacchetti</b>\n                <br/>\n                eRm\n                <br/>\n\n                <b>Descrizione: Test del Rapporto di Verosimiglianza di Martin-Löf</b></br>\n                Questo Test del Rapporto di Verosimiglianza si basa sulla suddivisione dei sottogruppi di elementi.\n                <br/><br/>\n                <b>Utilizzo</b>\n                <br/>\n                <code>\n                MLoef(robj, splitcr = \"mediana\")\n                </code>\n                <br/><br/>\n                <b>Dettagli</b>\n                <br/>  \n                robj: Un oggetto di classe 'Rm'.\n                <br/>\n                splitcr: Criterio di suddivisione per definire i gruppi di elementi. \"mediana\" e \"media\" suddividono gli elementi in due gruppi in base ai punteggi grezzi dei loro elementi. splitcr può anche essere un vettore di lunghezza k (dove k denota il numero di elementi) che assume due o più valori distinti per definire i gruppi utilizzati per il Test di Martin-Löf.\n                <br/><br/>\n                <b>Valori</b>\n                <br/>\n                MLoef restituisce un oggetto di classe MLoef contenente:\n                <br/><br/>\n                LR: valore LR\n                <br/>\n                df: gradi di libertà\n                <br/>\n                p.value: valore p del test\n                <br/>\n                fullModel: il modello Rasch complessivo\n                <br/>\n                subModels: un elenco contenente i sottomodel\n                <br/>\n                Lf: log-verosimiglianza del modello completo\n                <br/>\n                Ls: elenco delle log-verosimiglianze dei sottomodel\n                <br/>\n                i.groups: un elenco dei gruppi di elementi\n                <br/>\n                splitcr: criterio di suddivisione inviato\n                <br/>\n                split.vector: allocazione binaria degli elementi ai gruppi\n                <br/>\n                warning: elementi che eguagliano la mediana o la media per i rispettivi criteri di suddivisione\n                <br/><br/>\n                <b>Pacchetti</b>\n                <br/>\n                eRm                \n                <br/><br/>\n                <b>Aiuto</b>\n                <br/>\n                Esegui quanto segue dall'editor di sintassi di BioStat Prime  help(MLoef, package ='eRm')\n\n                "
  }
}