{
  "title": "Mappa Persona-Elemento",
  "navigation": "Mappa Persona-Elemento",
  "label1": "Seleziona un modello (modelli della classe Rm e dRm supportati)",
  "label1b": "Se non sono disponibili modelli, devi prima creare un modello selezionando Adattamento del Modello -> IRT",
  "modelselector1": "Seleziona un modello",
  "range1": "Intervallo per l'asse X",
  "help": {
    "title": "Mappa Persona-Elemento",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>Descrizione</b></br>\n                Una mappa persona-elemento mostra la posizione dei parametri degli elementi (e delle soglie) così come la distribuzione dei parametri delle persone lungo la dimensione latente. Le mappe persona-elemento sono utili per confrontare l'intervallo e la posizione della distribuzione della misura degli elementi (pannello inferiore) con l'intervallo e la posizione della distribuzione della misura delle persone (pannello superiore). Gli elementi dovrebbero idealmente essere posizionati lungo l'intera scala per misurare in modo significativo l' 'abilità' di tutte le persone.\n\n                <br/><br/>\n                <b>Utilizzo</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"Mappa Persona-Elemento\", latdim = \"Dimensione Latente\",\n                pplabel = \"Distribuzione\nParametro\nPersona\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>Argomenti</b>\n                <br/>  \n                object: Oggetto di classe Rm o dRm\n                <br/>\n                item.subset: Sottogruppo di elementi da tracciare. Può essere un vettore numerico che indica la colonna in X o un vettore di caratteri che indica il nome della colonna. Se \"all\", tutti gli elementi vengono tracciati. Il numero di elementi da tracciare deve essere > 1.\n                <br/>\n                sorted: Se TRUE, gli elementi sono ordinati in ordine crescente in base alla loro posizione sulla dimensione latente.   \n                <br/>\n                main: Titolo principale del grafico.\n                <br/>\n                latdim: Etichetta dell'asse x, cioè, la dimensione latente.\n                <br/>\n                pplabel: Titolo per il pannello superiore che mostra la distribuzione del parametro delle persone\n                <br/>\n                cex.gen: cex come parametro grafico specifica un valore numerico che indica di quanto il testo e i simboli di tracciamento dovrebbero essere ingranditi rispetto al valore predefinito. Qui cex.gen si applica a tutte le etichette di testo. Il valore predefinito è 0.7.\n                <br/>\n                xrange: Intervallo per l'asse x\n                <br/>\n                warn.ord: Se TRUE (il valore predefinito), gli asterischi vengono visualizzati nel margine destro del pannello inferiore per indicare posizioni di soglia non ordinali per elementi politomici.\n                <br/>\n                warn.ord.colour: Le posizioni di soglia non ordinali per elementi politomici sono colorate con questo colore per renderle più visibili. Questo è particolarmente utile quando ci sono molti elementi in modo che il grafico sia piuttosto denso. Il valore predefinito è \"nero\", quindi non viene fatta alcuna distinzione.\n                <br/>   \n                irug: Se TRUE (il valore predefinito), tutte le soglie sono tracciate sotto la distribuzione delle persone per indicare dove gli elementi inclusi sono più informativi.                \n                <br/>\n                pp: Se non nullo, questo contiene i dati del parametro delle persone dell'oggetto dati, evitando la necessità di ricalcolarlo.\n                <br/><br/>\n\n                <b>Pacchetti</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>Aiuto</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}