{
  "title": "Grafici P-P",
  "navigation": "P-P",
  "alpha": "Opacità (0-1)",
  "x": "Asse X, specificare una o più variabili numeriche",
  "y": "Forma, specificare una variabile categorica",
  "color": "Colore, specificare una variabile di raggruppamento (categoria)",
  "referenceline": "Linea di riferimento",
  "band": "Mostra bande",
  "detrend": "Rimuovi trend",
  "showStatsTable": "Mostra tabella statistiche per test di normalità",
  "normalityTestMethod": "Metodo test di normalità",
  "flip": "Inverti asse",
  "distribution": "Seleziona una distribuzione",
  "x_title": "Etichetta asse X",
  "y_title": "Etichetta asse Y",
  "label1": "Parametri di distribuzione, ad esempio per una distribuzione normale, i parametri potrebbero essere mean=2, sd=2 quindi inserisci mean=2, sd=2. Per una distribuzione esponenziale i parametri potrebbero essere rate=2, quindi inserisci rate=2.",
  "dparams": "Inserisci opzionalmente i parametri della distribuzione",
  "specify_a_title": "Inserisci un titolo",
  "Facetrow": "Riga faccette",
  "Facetcolumn": "Colonna faccette",
  "Facetwrap": "Avvolgi faccette",
  "Facetscale": "Scala faccette",
  "facets_lbl": "Faccette",
  "help": {
    "title": "Grafici P-P",
    "r_help": "help(stat_pp_point,package='qqplotr')",
    "body": "\n            <b>Descrizione</b></br>\n            Un grafico P–P (probability–probability plot o percent–percent plot o P value plot) è un grafico di probabilità per valutare quanto due set di dati concordino tra loro, tracciando le due funzioni di distribuzione cumulativa l’una contro l’altra. Per default confrontiamo la distribuzione cumulativa della variabile selezionata con la distribuzione normale, tuttavia puoi confrontare anche con altre distribuzioni come beta, cauchy, chisq, exp, f, gamma... Puoi anche specificare i parametri della distribuzione associata alla distribuzione con cui si confronta. Clicca sul pulsante opzioni nella finestra principale per selezionare una distribuzione e specificarne i parametri. Puoi selezionare una variabile fattore per raggruppare la variabile selezionata. In questo caso viene disegnato un grafico P-P separato per ogni gruppo.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            ggplot(data = datasetname,mapping= aes(sample = var1 ,shape = var2 ))  +stat_pp_band() + stat_pp_line() + stat_pp_point()  +labs(x = \"Punti di Probabilità\",y = \"Probabilità Cumulativa\",title =paste(\"Grafico PP per la variabile \",var1,sep=''))+facet_grid(var3 ~.)\n            </code> <br/>\n            <b>Argomenti</b><br/>\n            <ul>\n            <li>\n            data: Il dataset di default\n            </li>\n            <li>\n            aes(): Genera mappature estetiche che descrivono come le variabili nei dati sono mappate alle proprietà visive (estetiche) dei geoms.\n            </li>\n            <li>\n            sample: la variabile numerica per cui tracciare il grafico P-P\n            </li>\n            <li>\n            stat_pp_point: Traccia probabilità cumulative contro punti di probabilità. La funzione di probabilità cumulativa è costruita con i dati del campione, e poi valutata a ogni punto di probabilità.\n            </li>\n            <li>\n            stat_pp_line: Disegna una linea di identità di riferimento (x=y).\n            </li>\n            <li>\n            stat_pp_band: Disegna bande di confidenza. Per ora è disponibile solo la versione bootstrap (\"boot\").\n            </li>\n            <li>\n            shape: Una variabile fattore opzionale che raggruppa i valori assegnati al campione. Viene creato un grafico P-P separato per ogni gruppo determinato dai livelli della variabile fattore. Ogni gruppo è indicato da una forma diversa.\n            </li>\n            <li>\n            Labs(): Cambia le etichette degli assi e i titoli delle legende (opzionale)\n            </li>\n            <li>\n            facet_grid(): Dispone i pannelli in una griglia (opzionale). Vedi help(facet_grid) per ulteriori dettagli.\n            </li>\n            <li>  ​\n            coord_flip(): Inverte l’asse (opzionale)\n            </li>\n            </ul>\n            <b>Pacchetti</b></br>\n            ggplot2;ggthemes;qqplotr;\n            <br/>\n            <b>Aiuto</b></br>\n            help(stat_pp_point, package='qqplotr')<br/>\n            Altro: Clicca sul pulsante Aiuto di R per ottenere aiuto dettagliato. Puoi anche inserire help(labs), help(stat_pp_point), help(aes), help(facet_grid), help(coord_flip)<br/>\n            https://cran.r-project.org/web/packages/qqplotr/vignettes/introduction.html\n        "
  }
}
