{
  "title": "Capacità di Processo (Sixpack)",
  "navigation": "Capacità di Processo (Sixpack)",
  "summaryPlotChk": "Sixpack (underlying I-MR, Xbar, R, S charts, Probability, and Capability plots)",
  "displaySLlineonPlotChk": "Visualizza le linee LSL e USL sui grafici sottostanti",
  "printObjectSummaryChk": "Stampa il riepilogo dell'oggetto QCC per la capacità del processo",
  "label1": "Due opzioni - o selezionare una variabile (e una variabile di raggruppamento se necessario) o selezionare le variabili nel dataset se già raggruppate",
  "label2": "Opzioni avanzate",
  "selectVariableRad": "Opzione 1: Seleziona una variabile dal dataset (opzionalmente potrebbe essere necessario raggrupparla)",
  "variableSelcted": "Seleziona una variabile (dati osservati) da analizzare",
  "sampleSize": "La dimensione del campione sarà ignorata se viene selezionata una variabile di raggruppamento sopra",
  "groupingVariable": "Variabile di raggruppamento (opzionale - se i dati devono essere raggruppati)",
  "selectDatasetRad": "Opzione 2: Seleziona le variabili dal Dataset se già raggruppate",
  "displayGroupsChk": "Visualizza i raggruppamenti sulla griglia dell'interfaccia utente del dataset solo per riferimento",
  "nsigmas": "Sigma - numero di sigmi da utilizzare per il calcolo dei limiti di controllo",
  "variableControlLimits": "Righe di dati da scartare, se presenti, prima di raggruppare per i limiti di controllo delle variabili (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "variablelistSelcted": "Seleziona una o più variabili raggruppate (dati osservati) da analizzare",
  "confidence_level": "Un valore numerico compreso tra 0 e 1 che specifica il livello da utilizzare per calcolare gli intervalli di confidenza",
  "stddevXbarOne": "Metodo della deviazione standard per calcolare I-MR",
  "rowsTobeUsed": "Se le righe selezionate (raggruppate) devono essere utilizzate per analizzare la capacità del processo (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "stddev": "Metodo della deviazione standard per calcolare xbar (per dimensione del gruppo > 1)",
  "DoNotUseUnbiasingConstantChk": "Non utilizzare una costante di disbiasing per stimare la deviazione standard per gli indici di capacità del processo complessivo.",
  "target": "Target - un valore opzionale che specifica l'obiettivo del processo",
  "addlSpecLines": "Aggiungi ulteriori righe di specifica sul grafico (separate da virgole ad esempio 73.98, 74.01, 74.03)",
  "lower": "LSL - valore numerico del limite inferiore di specifica (digita NA per specificare limiti di specifica unilaterali)",
  "upper": "USL - valore numerico del limite superiore di specifica (digita NA per specificare limiti di specifica unilaterali)",
  "digits": "Digits - numero di cifre da visualizzare",
  "addlSpecLinesLabel": "Etichetta per le righe di specifica aggiuntive (separate da virgole ad es. Spec 1, Spec 2, Spec 3)"
}