{
  "title": "Foresta Casuale",
  "label1": "La foresta casuale può essere eseguita in modalità supervisionata o non supervisionata. Per eseguire in modalità non supervisionata, non specificare una variabile dipendente.",
  "navigation": "Foresta Casuale",
  "modelname": "Inserisci il nome del modello",
  "dependentvar": "Variabile dipendente",
  "independentvars": "Variabile(i) indipendente(i)",
  "ntree": "N. di alberi",
  "mtry": "mtry",
  "proximity": "Prossimità:",
  "newds": "Specifica il nome del dataset per memorizzare la prossimità:",
  "predictor": "Salva i valori previsti:",
  "newcolname": "Specifica il nuovo nome della colonna per i valori previsti:",
  "help": {
    "title": "Foresta Casuale",
    "r_help": "help(randomForest,package='randomForest')",
    "body": "\n                <b>Descrizione</b></br>\nrandomForest implementa l'algoritmo della foresta casuale di Breiman (basato sul codice originale Fortran di Breiman e Cutler) per classificazione e regressione. Può essere utilizzato anche in modalità non supervisionata per valutare le prossimità tra i punti dati.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nrandomForest(x, y=NULL,  ntree=500, importance=FALSE, proximity, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nx : Un data frame o una matrice di predittori, o una formula che descrive il modello da adattare (per il metodo di stampa, un oggetto randomForest).\n</li>\n<li>\ny: Un vettore di risposta. Se è un fattore, si assume la classificazione, altrimenti si assume la regressione. Se omesso, randomForest verrà eseguito in modalità non supervisionata.\n</li>\n<li>\nntree : Numero di alberi da far crescere. Questo non dovrebbe essere impostato su un numero troppo piccolo, per garantire che ogni riga di input venga prevista almeno un paio di volte.\n</li>\n<li>\nimportance : Dovrebbe essere valutata l'importanza dei predittori? \n</li>\n<li>\nproximity : Dovrebbe essere calcolata la misura di prossimità tra le righe?\n</li>\n<li>\n... : parametri opzionali da passare alla funzione di basso livello randomForest.default.\n</li>\n</ul>\n<b>Valore</b><br/>\nUn oggetto di classe randomForest, che è una lista con i seguenti componenti:<br/>\ncall: la chiamata originale a randomForest<br/>\ntype: uno tra regressione, classificazione o non supervisionata.<br/>\npredicted: i valori previsti dei dati di input basati su campioni fuori borsa.<br/>\nimportance:\ta matrice con nclass + 2 (per classificazione) o due (per regressione) colonne. Per la classificazione, le prime nclass colonne sono le misure specifiche della classe calcolate come diminuzione media dell'accuratezza. La nclass + 1a colonna è la diminuzione media dell'accuratezza su tutte le classi. L'ultima colonna è la diminuzione media dell'indice di Gini. Per la regressione, la prima colonna è la diminuzione media dell'accuratezza e la seconda la diminuzione media dell'MSE. Se importance=FALSE, l'ultima misura viene comunque restituita come vettore.<br/>\nimportanceSD: Gli “errori standard” della misura di importanza basata su permutazione. Per la classificazione, una matrice p per nclass + 1 corrispondente alle prime nclass + 1 colonne della matrice di importanza. Per la regressione, un vettore di lunghezza p.<br/>\nlocalImp: una matrice p per n contenente le misure di importanza caso per caso, l'elemento [i,j] è l'importanza della i-esima variabile sul j-esimo caso. NULL se localImp=FALSE.<br/>\nntree: numero di alberi cresciuti.<br/>\nmtry: numero di predittori campionati per la divisione in ogni nodo.<br/>\nforest: (una lista che contiene l'intera foresta; NULL se randomForest è eseguito in modalità non supervisionata o se keep.forest=FALSE.<br/>\nerr.rate: (solo classificazione) vettore dei tassi di errore della previsione sui dati di input, l'i-esimo elemento è il tasso di errore (OOB) per tutti gli alberi fino all'i-esimo.<br/>\nconfusion: (solo classificazione) la matrice di confusione della previsione (basata sui dati OOB).<br/>\nvotes: (solo classificazione) una matrice con una riga per ciascun punto dati di input e una colonna per ciascuna classe, che fornisce la frazione o il numero di “voti” (OOB) dalla foresta casuale.<br/>\noob.times: numero di volte che i casi sono “fuori borsa” (e quindi utilizzati nel calcolo della stima dell'errore OOB)<br/>\nproximity: se proximity=TRUE quando viene chiamato randomForest, una matrice di misure di prossimità tra gli input (basata sulla frequenza con cui coppie di punti dati si trovano negli stessi nodi terminali).<br/>\nmse\t: (solo regressione) vettore degli errori quadrati medi: somma dei residui al quadrato divisa per n.<br/>\nrsq\t: (solo regressione) “pseudo R-quadrato”: 1 - mse / Var(y).<br/>\ntest: se viene fornito un set di test (tramite gli argomenti xtest o ytest aggiuntivi), questo componente è una lista che contiene i corrispondenti previsti, err.rate, confusione, voti (per classificazione) o previsti, mse e rsq (per regressione) per il set di test. Se proximity=TRUE, c'è anche un componente, proximity, che contiene la prossimità tra il set di test e quello di addestramento.<br/>\n<b>Pacchetto</b></br>\nrandomForest​;BlueSky</br>\n<b>Aiuto</b></br>\nPer aiuto dettagliato clicca sull'icona R in alto a destra di questo overlay di dialogo o esegui il seguente comando nell'editor di sintassi R</br>\nhelp(randomForest,package='randomForest')\n                "
  }
}