{
  "title": "Divisione Casuale",
  "navigation": "Divisione Casuale",
  "traindataset": "Inserisci il nome del dataset di addestramento",
  "testdataset": "Inserisci il nome del dataset di test",
  "split": "Inserisci la percentuale di divisione",
  "replace": "Il campionamento deve essere con sostituzione",
  "seed": "Imposta il seme",
  "dependent": "Variabile da cui costruire campioni stratificati",
  "help": {
    "title": "Divisione Casuale",
    "r_help": "help(sample, package=\"base\")",
    "body": "\n<b>Descrizione</b></br>\nsample prende un campione della dimensione specificata dagli elementi di x utilizzando con o senza sostituzione.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nsample(x, size, replace = FALSE, prob = NULL)\nsample.int(n, size = n, replace = FALSE, prob = NULL)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nx: Un vettore di uno o più elementi da cui scegliere, o un numero intero positivo. Vedi 'Dettagli'.\n</li>\n<li>\nn: un numero positivo, il numero di elementi da scegliere. Vedi 'Dettagli'.\n</li>\n<li>\nsize: un intero non negativo che indica il numero di elementi da scegliere.\n</li>\n<li>\nreplace: Il campionamento deve essere con sostituzione?\n</li>\n<li>\nprob: Un vettore di pesi di probabilità per ottenere gli elementi del vettore campionato.\n</li>\n</ul>\n<b>Dettagli</b></br>\nSe x ha lunghezza 1, è numerico (nel senso di is.numeric) e x >= 1, il campionamento tramite sample avviene da 1:x. Nota che questa funzionalità di comodità può portare a comportamenti indesiderati quando x ha lunghezze variabili in chiamate come sample(x). Vedi gli esempi.<br/>\nAltrimenti x può essere qualsiasi oggetto R per il quale lunghezza e sottogruppi per interi abbiano senso: i metodi S3 o S4 per queste operazioni verranno dispatchati come appropriato.<br/>\nPer sample il valore predefinito per size è il numero di elementi inferito dal primo argomento, in modo che sample(x) generi una permutazione casuale degli elementi di x (o 1:x).<br/>\nÈ consentito richiedere campioni di size = 0 con n = 0 o un x di lunghezza zero, ma altrimenti n > 0 o lunghezza(x) positiva è richiesta.<br/>\nValori numerici positivi non interi di n o x verranno troncati al prossimo intero più piccolo, che non deve essere maggiore di .Machine$integer.max.<br/>\nL'argomento prob opzionale può essere utilizzato per fornire un vettore di pesi per ottenere gli elementi del vettore campionato. Non è necessario che sommino a uno, ma dovrebbero essere non negativi e non tutti zero. Se replace è vero, il metodo dell'alias di Walker (Ripley, 1987) viene utilizzato quando ci sono più di 200 valori ragionevolmente probabili: questo dà risultati incompatibili con quelli di R < 2.2.0.<br/>\nSe replace è falso, queste probabilità vengono applicate sequenzialmente, cioè la probabilità di scegliere il prossimo elemento è proporzionale ai pesi tra gli elementi rimanenti. Il numero di pesi non nulli deve essere almeno size in questo caso.<br/>\nsample.int è un'interfaccia nuda in cui sia n che size devono essere forniti come interi.<br/>\nA partire da R 3.0.0, n può essere maggiore del più grande intero di tipo intero, fino al più grande intero rappresentabile in tipo double. Solo il campionamento uniforme è supportato. Vengono utilizzati due numeri casuali per garantire un campionamento uniforme di grandi interi.<br/>\n<b>Pacchetto</b></br>\nbase\n<b>Aiuto</b></br>\nhelp(sample, package=\"base\")\n"
  }
}