{
  "title": "Ricodifica Variabili",
  "navigation": "Ricodifica",
  "oldvars": "Variabili da Ricodificare",
  "label1": "Opzioni",
  "newvarradio": "Nuova Variabile(i)",
  "newvar": "Inserisci i nomi delle nuove variabili separati da , ad esempio newVar1, newVar2",
  "oldvarradio": "Sovrascrivi variabile(i) esistente(i)",
  "suffix": "Specifica un suffisso per le variabili ricodificate",
  "prefix": "Specifica un prefisso per le variabili ricodificate",
  "enterSuffix": "Inserisci un suffisso",
  "enterPrefix": "Inserisci un prefisso",
  "label3": "Quando si specificano più criteri di ricodifica, utilizzare ; come separatore.",
  "label4": "NOTA: I VALORI STRINGA DEVONO ESSERE RACCHIUSI TRA DOPPIE VIRGOLETTE(\") E NON TRA VIRGOLETTE SINGOLE(').",
  "label5": "Inserisci valori vecchi e nuovi separati da ; ad esempio \"Maschio\"=\"Uomo\";\"Fem\"=2;\"Houston, Texas\"=\"Texas\";\"Non Disponibile\"=NA ",
  "label5a": "Per la ricodifica di tipo numerico inserire 70=100;71=101;99=NA",
  "label5b": "È supportato un intervallo di valori, ad esempio 5:10=\"medio\" Valori speciali lo e hi possono apparire in un intervallo, ad esempio lo:10=\"basso\";11:89=\"medio\";90:hi=\"Alto\"",
  "label6": "La parola chiave else può essere utilizzata per tutto ciò che non si adatta a una specifica, ad esempio else =NA",
  "dontMakeFactor": "Per impostazione predefinita, la variabile ricodificata sarà un fattore se la variabile sorgente è un fattore. Per sovrascrivere, seleziona la casella di controllo",
  "oldnewvals": "Inserisci criteri di ricodifica",
  "help": {
    "title": "Ricodifica Variabili",
    "r_help": "help(recode, package=car)",
    "body": "\n<b>Descrizione</b></br>\nRicodifica uno o più vettori numerici, vettori carattere o fattori secondo le specifiche di ricodifica. Puoi memorizzare i risultati sovrascrivendo le variabili esistenti, specificando nuovi nomi di variabili per memorizzare i valori ricodificati o scegliendo di memorizzare i valori ricodificati in nuove variabili con un prefisso o suffisso adeguato. il prefisso o suffisso sarà applicato al nome della variabile esistente.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nBSkyRecode(colNames,newColNames,OldNewVals,NewCol=TRUE,dataSetNameOrIndex='Dataset2')\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\ncolNames: Un vettore carattere contenente una o più variabili nel dataset da ricodificare\n</li>\n<li>\nnewColNames:  Un vettore carattere contenente i nomi delle nuove colonne.\n</li>\n<li>\nOldNewVals: Una stringa carattere delle specifiche di ricodifica nella forma oldval1,newval1, oldval2,newval2\n</li>\n<li>\nNewCol: Un Booleano che indica se i valori ricodificati sono memorizzati in nuove variabili (TRUE) o se le variabili esistenti vengono sovrascritte (FALSE).\n</li>\n<li>\nprefixOrSuffix: Specifica se desideri memorizzare i valori ricodificati in nuove variabili con prefisso o suffisso con il nome che specifichi.  Inserisci prefisso o suffisso.\n</li>\n<li>\nprefixOrSuffixString: Inserisci una stringa da utilizzare come prefisso o suffisso al nome della variabile esistente. I valori ricodificati saranno memorizzati in queste variabili.\n</li>\n<li>\ndataSetNameOrIndex: Il nome del dataset/dataframe\n</li>\n</ul>\nNota: Non convertirà da numerico a fattore. Quando un numerico viene ricodificato, rimarrà un numerico, quando una variabile fattore viene ricodificata rimarrà un fattore.<br/>\n<b>Pacchetto</b></br>\ncar</br>\n<b>Aiuto</b></br>\nDigita la riga qui sotto nell'editor di sintassi R di BlueSky Statistics</br>\nhelp(recode, package=car)\n"
  }
}