{
  "title": "Analisi di Affidabilità (Omega di McDonald)",
  "navigation": "Omega di McDonald",
  "tvarbox1": "Tutti gli Elementi",
  "help": {
    "title": "Omega di McDonald",
    "r_help": "help(omega, package=psych)",
    "body": "\n            <b>Descrizione</b></br>\nCalcola le stime di omega di McDonald per la saturazione generale e totale dei fattori\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nomega(m,nfactors=3,fm=\"minres\",n.iter=1,p=.05,poly=FALSE,key=NULL,\n    flip=TRUE,digits=2, title=\"Omega\",sl=TRUE,labels=NULL,\nplot=TRUE,n.obs=NA,rotate=\"oblimin\",Phi=NULL,option=\"equal\",covar=FALSE, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nm​: Una matrice di correlazione, o un data.frame/matrice di dati, o (se Phi) è specificato, una matrice di pattern fattoriale obliqua\n</li>\n<li>\nnfactors: Il numero di fattori raggruppati\n</li>\n<li>\nfm​: metodo fattoriale (il predefinito è minres) fm=\"pa\" per assi principali, fm=\"minres\" per una soluzione a residuo minimo (OLS), fm=\"pc\" per componenti principali (vedi nota), o fm=\"ml\" per massima verosimiglianza.\n</li>\n<li>\nn.iter: Quante repliche fare in omega per le stime bootstrap​\n</li>\n<li>\np: probabilità dei confini di conferenza a due code\n</li>\n<li>\ndigits​: se specificato, arrotonda l'output a cifre​\n</li>\n<li>\npoly: la matrice di correlazione dovrebbe essere trovata utilizzando correlazioni polichoriche/tetrachoriche o normali di Pearson\n</li>\n<li>\nkey​: un vettore di +/- 1 per specificare la direzione della valutazione degli elementi. Il predefinito è assumere che tutti gli elementi siano positivamente valutati, ma se alcuni elementi sono valutati in modo inverso, allora key dovrebbe essere specificato.​\n</li>\n</ul>\n<b>Valore</b><br/>\nomega gerarchico: Il coefficiente ω_h<br/>\nomega.lim: Il limite di ω_h man mano che il test diventa infinitamente grande<br/>\nomega totale: Il coefficiente omega_t<br/>\nalpha: α di Cronbach<br/>\nschmid: La matrice fattoriale trasformata di Schmid Leiman e le matrici associate<br/>\nschmid$sl: I caricamenti del fattore g così come i fattori residualizzati<br/>\nschmid$orthog: Soluzione ruotata Varimax dei fattori originali<br/>\nschmid$oblique: I fattori trasformati oblimin o promax<br/>\nschmid$phi: la matrice di correlazione dei fattori obliqui<br/>\nschmid$gloading: I caricamenti sul fattore di ordine superiore, g, dei fattori oblimin<br/>\nkey: Un vettore di -1 o 1 che mostra quale direzione sono stati valutati gli elementi.<br/>\nmodel: un elenco di due elementi, uno adatto da dare alla funzione sem per modelli di equazione strutturale, l'altro, da dare al pacchetto lavaan.<br/>\nsem: L'output da un'analisi sem<br/>\nomega.group: Le statistiche riassuntive per l'omega totale, omega gerarchico (generale) e omega all'interno di ciascun gruppo.<br/>\nscores: Le stime dei punteggi fattoriali sono trovate per la soluzione di Schmid-Leiman. Per ottenere punteggi per il modello gerarchico vedere la nota nell'aiuto dettagliato di R.<br/>\nvarious fit statisticsvarious fit statistics, vedere output<br/>\n<b>Pacchetto</b></br>\npsych​</br>\n<b>Aiuto</b></br>\nPer aiuto dettagliato clicca sull'icona R in alto a destra di questo overlay di dialogo o esegui il seguente comando help(omega, package=psych) creando un blocco di codice R cliccando + nella finestra di output\n\t\t\t"
  }
}