{
  "title": "Costruisci un modello ottimizzato con la validazione incrociata KFold ripetuta",
  "navigation": "Validazione incrociata KFold ripetuta",
  "modelname": "Inserisci il nome per il modello ottimizzato",
  "folds": "Inserisci il numero di pieghe",
  "levelOfInterest": "Quando la variabile da prevedere ha 2 livelli, specifica il livello di interesse. La matrice di confusione e le statistiche correlate vengono visualizzate con il livello di interesse specificato come riferimento",
  "repeats": "Inserisci il numero di ripetizioni",
  "dependent": "Variabile da prevedere",
  "independent": "Variabili indipendenti",
  "label1": "ALCUNI MODELLI NON ACCETTANO VALORI MANCANTI O VARIABILI DIPENDENTI CHE SONO FATTORI. PER GESTIRE I VALORI MANCANTI, VEDI [ VARIABILI > VALORI MANCANTI ] E PER LA CODIFICA DUMMY DELLE VARIABILI FATTORI, VEDI [ VARIABILI > CALCOLA > CODIFICA DUMMY ]. Clicca sull'icona ? in alto a destra della finestra di dialogo per dettagli.",
  "ModelSelection": "Seleziona una categoria di modello e poi il tipo di modello",
  "label2": "Parametri",
  "help": {
    "title": "Costruisci un modello ottimizzato con la validazione incrociata KFold ripetuta",
    "r_help": "help(train, package=caret)",
    "body": "\n<b>Descrizione</b></br>\nLa validazione incrociata KFold ripetuta utilizza le funzioni trainControl e train all'interno del pacchetto caret per creare un modello ottimizzato.<br/>\nUn modello ottimizzato viene costruito campionando i risultati attraverso i parametri di ottimizzazione. I risultati dell'ottimizzazione vengono visualizzati sotto le tabelle in fondo all'output<br/>\nUna volta costruito il modello ottimizzato, facciamo previsioni utilizzando il modello ottimizzato contro il dataset di addestramento (utilizzato per costruire il modello) e visualizziamo la matrice di confusione e le statistiche correlate.<br/>\nNOTA: vedi l'URL su https://www.blueskystatistics.com/Articles.asp?ID=330 per dettagli sui modelli che richiedono variabili dipendenti da codificare in dummy e i requisiti corrispondenti per le variabili dipendenti supportate. Inoltre, alcuni modelli non supportano valori mancanti; se ci sono errori visualizzati durante la costruzione del modello, rimuovi i valori mancanti.<br/>\nIl modello ottimizzato è memorizzato nell'oggetto di classe train con un nome che hai specificato nel controllo della casella di testo.<br/>\nI valori dei parametri selezionati per il modello ottimizzato finale sono visualizzati in fondo all'output.<br/>\nNel caso di predittori con 2 livelli, hai l'opzione di selezionare il livello di riferimento/livello di interesse.<br/>\nLa matrice di confusione e le statistiche correlate vengono create utilizzando il livello di interesse specificato.<br/>\n<code> \ntrain_control <- caret::trainControl(method=\"repeatedcv\", number=inserisci il numero di pieghe, repeats=inserisci il numero di ripetizioni)<br/>\n#Sintassi generale<br/>\ntunedModel <- caret::train(x = dati campionati per addestrare il modello, y = variabile dipendente, trControl = train_control, method = \"il modello da utilizzare\", prob.model = TRUE )<br/>\n#Esempio di sintassi popolata<br/>\ntunedModel <- caret::train(as.data.frame(TrainData), variabileDipendente, trControl = train_control, method = \"adaboost\", preProcess = NULL, prob.model = TRUE )<br/>\n</code>\nGeneriamo una matrice di confusione e statistiche di accuratezza del modello per il modello ottimizzato. Questo viene fatto come segue\n<ul>\n<li>\nGeneriamo valori previsti dal dataset di addestramento chiamando la funzione predict sul modello ottimizzato di classe train (Internamente predict.train è la funzione nel pacchetto caret che R chiama)<br/>\n<code> \nv valoriPrevisti = predict(tunedModel restituito dalla funzione train)<br/>\n</code> <br/>\n</li>\n<li>\nCalcoliamo le statistiche di accuratezza dalla matrice di confusione generata come segue<br/>\n<code> \ncaret::confusionMatrix (previsioni = valoriPrevisti, riferimento = variabile dipendente del modello)<br/>\n</code> \n</li>\n</ul>\nPuoi utilizzare il modello ottimizzato finale per valutare un dataset. Per farlo, segui i passaggi seguenti<br/>\n1.  Vai al dataset che vuoi valutare. Nota: I nomi delle variabili nel dataset da valutare (alias variabili indipendenti) devono corrispondere ai nomi delle variabili utilizzate nel dataset per creare originariamente il modello ottimizzato. In caso contrario, verrà visualizzato un errore. Questo messaggio di errore verrà visualizzato nella sezione dei test diagnostici nella finestra di dialogo di valutazione del modello, vedi punto 2 qui sotto. <br/>\n2.\tApri la finestra di dialogo di valutazione del modello sotto Valutazione del modello>Previsione>Valutazione del modello. <br/>\n3.\tSeleziona un modello che desideri utilizzare per valutare il dataset. Puoi filtrare i modelli che hai costruito per classe. <br/>\n4.\tUna volta selezionato il modello, specifica un prefisso da utilizzare per memorizzare i valori previsti. Puoi opzionalmente salvare gli intervalli di confidenza per le previsioni e generare una matrice di confusione. Devi specificare un prefisso per la variabile che contiene le previsioni/punteggi. Le previsioni e le probabilità previste, dove applicabile, sono memorizzate come nuove variabili alla fine del dataset. Ad esempio, se il prefisso specificato è AA, le previsioni sono memorizzate in una variabile AA_nome variabile dipendente originale_Previsti, le probabilità previste sono memorizzate in una variabile AA_Livello1_ProbabilitàPreviste. <br/>\n5.  Clicca sul pulsante Esegui per valutare il dataset. <br/>\n<b>Pacchetto</b></br>\ncaret</br>\n<b>Aiuto</b></br>\nPer aiuto dettagliato clicca sull'icona R in alto a destra di questa finestra di dialogo o esegui il seguente comando help(train, package ='caret') nella finestra dell'editor R\n"
  }
}