{
  "title": "Ristruttura, da largo a lungo",
  "label2": "Scegli le variabili da ristrutturare oppure scegli alternativamente le variabili da non ristrutturare. In quest'ultimo caso, tutte le variabili rimanenti verranno ristrutturate in colonna(e)",
  "navigation": "Più lungo",
  "label0": "Puoi scegliere di salvare i risultati in un nuovo dataset o sovrascrivere il dataset esistente",
  "label1": "Opzioni",
  "advanced": "Avanzato",
  "New": "Salva i risultati in un nuovo dataset",
  "newdatasetname": "Inserisci un nome per il dataset",
  "Existing": "Sovrascrivi il dataset esistente",
  "label12": "Inserisci il nome della/e variabile/e per la/e nuova/e variabile/e fattore ripetuto",
  "repeatedMeasure": "NOTA: Quando specifichi più nomi di variabili che memorizzano fattori ripetuti, separali con una virgola ad esempio Mese, Giorno. Devi anche cliccare su avanzato per specificare \ncome vengono creati i nomi delle variabili.",
  "repeatedValue": "Nome della variabile per il valore ripetuto ad esempio Conteggio",
  "labelChoice": "Seleziona una delle opzioni qui sotto",
  "subsetvars": "Opzione1: Seleziona variabile/e da ristrutturare in una o più variabile/e",
  "names_sep": "Opzione2: Specifica un carattere o un'espressione regolare per separare i nomi delle colonne per creare valori per i nomi delle variabili. Prende la stessa specifica di separate(), e può essere un vettore numerico (specificando le posizioni su cui interrompere), o una singola stringa (specificando un'espressione regolare su cui separare)",
  "names_pattern": "Opzione1: Un'espressione regolare contenente gruppi di corrispondenza (()). La parte corrispondente dell'espressione regolare tra le () verrà utilizzata per creare nomi di variabili.",
  "dontReshape": "Opzione2: Seleziona variabile/e da non ristrutturare (tutte le variabili rimanenti verranno ristrutturate in colonna/e)",
  "removeNA": "Rimuovi righe in cui il valore ripetuto è NA.",
  "makeString": "Rendi il fattore ripetuto un tipo di stringa R invece di un fattore",
  "label3": "Se vengono create più nuove variabili per fattori ripetuti, le opzioni qui sotto controllano come vengono suddivisi i nomi delle colonne. Seleziona una delle 2 opzioni qui sotto.",
  "help": {
    "title": "Ristruttura (da largo a lungo)",
    "r_help": "help(pivot_longer, package=tidyr)",
    "body": "\n<b>Descrizione</b></br>\nGuarda il video su <a href=\" https://youtu.be/ypLXqmFp3jY\">Ristruttura da largo a lungo</a></br>\nPrende un dataset largo e lo converte in un dataset lungo convertendo le colonne in coppie chiave-valore\nPivot_longer prende più colonne e le riduce in coppie chiave-valore, duplicando tutte le altre colonne secondo necessità. Utilizzi pivot_longer() quando noti di avere colonne che non sono variabili.</br>\nDigita vignette(\"pivot\") nell'editor R per vedere l'aiuto R. Se ci sono più colonne da creare, devi specificare argomenti per specificare come vengono costruiti i nomi delle colonne.</br>\nIn questo caso, clicca su avanzato per inserire un'espressione regolare che specifica come le variabili dovrebbero essere create dai nomi delle colonne.</br>\nNOTA: Quando specifichi più variabili per i fattori ripetuti separali con ,\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \npivot_longer( cols=c(col1, col2...),names_to=\"chiave\",values_to=\"valore\",values_drop_na = TRUE)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\ncols: Colonne da ruotare in formato più lungo.\n</li>\n<li>\nvalues_to: Una stringa che specifica il nome della colonna da creare dai dati memorizzati nei valori delle celle. Se names_to è un carattere contenente il sentinella speciale .value, questo valore verrà ignorato, e il nome della colonna dei valori sarà derivato da parte dei nomi delle colonne esistenti. Se vuoto, tutte le variabili sono selezionate, escludi una variabile y con -y. Quando escludi variabili, tutte le variabili rimanenti vengono ruotate in lungo.\n</li>\n<li>\nvalues_drop_na: Se TRUE, rimuoverà le righe che contengono solo NAs nella colonna value_to. Questo converte effettivamente i valori mancanti espliciti in valori mancanti impliciti, e dovrebbe generalmente essere utilizzato solo quando i valori mancanti nei dati sono stati creati dalla sua struttura.\n</li>\n<li>\nnames_sep: prende la stessa specifica di separate(), e può essere un vettore numerico (specificando le posizioni su cui interrompere), o una singola stringa (specificando un'espressione regolare su cui separare).</br>\nDiciamo che le colonne sono Height_1_1, Height_1_2, Weight_1_1, Weight_1_2, Sagur_1_1, Sagur_2_1 dove il 1° numero è il mese e il 2° la settimana, specificando _ come separatore si creeranno 3 variabili, la prima variabile con valori Height, Weight, Sagur, la seconda con valori 1 e 2, e la 3° con valori 1 e 2.</br>\nDigita help(regex) nell'editor di codice R per ulteriori dettagli\n</li>\n<li>\nnames_pattern: prende la stessa specifica di extract(), un'espressione regolare contenente gruppi di corrispondenza (()).\ntakes the same specification as separate(), and can either be a numeric vector (specifying positions to break on), or a single string (specifying a regular expression to split on).</br>\nDiciamo che le colonne sono Height_33.1_1, Height_44.1_2, Weight_66.1_1, Weight_55.1_2, dove le 2 cifre dopo il 1° underscore devono essere ignorate, la cifra dopo il . è il mese e la cifra dopo l'ultimo _ è la settimana.</br>\nLe espressioni regolari che estraggono i valori delle nuove variabili devono essere in (). L'espressione regolare sarà (.*)_.*.(.*)_(.)</br> \nNota: . in un'espressione regolare significa qualsiasi carattere</br> \n* significa 0 o più, quindi .* significa 0 o più caratteri</br> \nQuindi la stringa può essere interpretata come alla ricerca di un modello di</br> \n(.*) 0 o più caratteri seguiti da</br> \n _ un underscore seguito da</br> \n .*. uno o più caratteri seguiti da . (sfuggendo il . con un  indica che è il carattere stesso seguito da</br> \n.* uno o più caratteri seguiti da</br> \n_ underscore seguito da</br> \n. un singolo carattere</br> \nTutti i modelli tra le () formano valori di ciascuna delle 3 nuove variabili fattore</br> \n</li>\n</ul>\n<b>Valore</b><br/>\nRestituisce il dataset ristrutturato\n<br/>\n<b>Pacchetto</b></br>\ntidyr</br>\n<b>Aiuto</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
  }
}