{
  "title": "Abbinamento del Set di Rischio",
  "navigation": "Abbinamento del Set di Rischio",
  "newdatasetnamelabel": "Nome del dataset per memorizzare i dati abbinati",
  "groupvarlabel": "Variabile evento (1=evento, 0=censura)",
  "timevarlabel": "Variabile temporale",
  "calipervarslabel": "Variabili per l'abbinamento (numeriche)",
  "caliperslabel": "Specifica i calibri in ordine delle variabili di abbinamento separati da virgole, ad esempio 5, 2; specifica 0 per abbinamenti esatti",
  "ratiolabel": "Numero di controlli per caso",
  "repeatcontrolslabel": "Consenti ai controlli di essere abbinati più di una volta",
  "supercontrolslabel": "Non consentire che i casi siano abbinati ad altri casi",
  "help": {
    "title": "Abbinamento del Set di Rischio",
    "body": "\n            Esegue l'abbinamento dei soggetti del set di rischio all'interno di una coorte. Coloro che hanno l'evento di esito (casi) sono abbinati a coloro che non hanno avuto l'evento (controlli) e sono nel set di rischio al momento dell'evento del caso. Questo è un design di caso/controllo nidificato. Le variabili di base conosciute all'ingresso nella coorte vengono utilizzate anche per abbinare casi e controlli.\n\t\t\t<br/><br/>\n\t\t\tLe variabili di base per le quali i valori devono corrispondere esattamente e i valori che corrispondono all'interno dei calibri numerici sono supportati. I controlli vengono selezionati casualmente tra tutti i controlli idonei per ciascun caso.\n\t\t\t<br/><br/>\n\t\t\tIl dataset di output contenente i dati abbinati conterrà le variabili originali, l'indicatore di evento (\"fallito\") e una variabile che identifica il set abbinato (\"match.num\").\n\t\t\t<br/><br/>\n\t\t\tLe osservazioni con valori mancanti per le variabili coinvolte nel processo di abbinamento vengono rimosse prima dell'abbinamento.\n\t\t\t<br/><br/>\n\t\t\tUn'introduzione breve ai design di caso/controllo nidificati può essere trovata in:\n\t\t\tEssebag V, et al. Lo studio caso-controllo nidificato in cardiologia. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>Nome del dataset per memorizzare i dati abbinati:</b>\n\t\t\t<br/>Nome del dataset di output contenente i set di soggetti abbinati.\n\t\t\t<br/><br/>\n\t\t\t<b>Variabile evento (1=evento, 0=censura):</b>\n\t\t\t<br/>Nome della variabile che indica coloro che hanno eventi. Deve essere numerica con 1=evento e 0=censura.\n\t\t\t</br><br/>\n\t\t\t<b>Variabili per l'abbinamento:</b>\n\t\t\t<br/>Specifica le variabili di base per le quali desideri che i set caso/controllo siano abbinati. Queste devono essere numeriche.\n\t\t\t<br/><br/>\n\t\t\t<b>Specifica i calibri in ordine delle variabili di abbinamento separati da virgole:</b>\n\t\t\t<br/>Specifica i valori dei calibri numerici per ciascuna delle variabili, in ordine delle variabili. Gli abbinamenti esatti devono utilizzare un calibro di 0. \n\t\t\tAd esempio, se l'età (in anni) è stata specificata con un calibro di 5, ciò significa che i controlli devono essere entro +/- 5 anni dal loro caso abbinato.\n\t\t\tOgni variabile di abbinamento deve avere un valore di calibro specificato.\n\t\t\t<br/><br/>\n\t\t\t<b>Numero di controlli per caso:</b>\n\t\t\t<br/>Questo è il numero massimo di controlli che saranno abbinati a ciascun caso. Alcuni set abbinati possono avere meno di questo valore se non possono essere identificati abbinamenti idonei.\n            <br/><br/>\n\t\t\t<b>Consenti ai controlli di essere abbinati più di una volta:</b>\n\t\t\t<br/>Specifica se desideri o meno che i controlli possano essere abbinati a più di un caso. Raccomandiamo di selezionare questa opzione per evitare bias.\n            <br/><br/>\n\t\t\t<b>Non consentire che i casi siano abbinati ad altri casi:</b>\n\t\t\t<br/>Specifica se consentire che i casi siano considerati come controlli prima del momento dell'evento del caso. Raccomandiamo di non selezionare questa opzione per evitare bias. Non selezionare questa opzione significa che un caso è nel pool di rischio dei controlli ed è idoneo per essere abbinato a un altro caso, fino al momento del loro evento.\n            <br/><br/>\n            <b>Pacchetti R richiesti:</b> dplyr, tidyr\n"
  }
}