{
  "title": "Aiuto del pacchetto R",
  "navigation": "Aiuto del pacchetto R",
  "packageName": "Seleziona un pacchetto R installato",
  "help": {
    "title": "Aiuto del pacchetto R",
    "r_help": "aiuto()",
    "body": "\n<b>Descrizione</b></br>\naiuto è l'interfaccia principale ai sistemi di aiuto.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \naiuto(argomento, pacchetto = NULL, lib.loc = NULL,\n    verbose = getOption(\"verbose\"),\n    try.all.packages = getOption(\"help.try.all.packages\"),\n    help_type = getOption(\"help_type\"))\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nargomento: di solito, un nome o una stringa di caratteri che specifica l'argomento per il quale si cerca aiuto. Una stringa di caratteri (racchiusa tra virgolette singole o doppie esplicite) è sempre considerata come un nome di argomento. Se il valore di argomento è un vettore di caratteri di lunghezza uno, l'argomento è considerato il valore dell'unico elemento. Altrimenti, l'argomento deve essere un nome o una parola riservata (se sintatticamente valido) o una stringa di caratteri. \n</li>\n<li>\npacchetto: un nome o un vettore di caratteri che fornisce i pacchetti da esaminare per la documentazione, o NULL. Per impostazione predefinita, vengono utilizzati tutti i pacchetti i cui namespace sono caricati. Per evitare che un nome venga decomposto, utilizzare ad esempio (pkg_ref).\n</li>\n<li>\nlib.loc: un vettore di caratteri di nomi di directory delle librerie R, o NULL. Il valore predefinito di NULL corrisponde a tutte le librerie attualmente conosciute. Se viene utilizzato il predefinito, i pacchetti e i namespace caricati vengono cercati prima delle librerie.\n</li>\n<li>\nverbose: logico; se TRUE, viene riportato il nome del file.\n</li>\n<li>\ntry.all.packages: logico; vedere Nota.\n</li>\n<li>\nhelp_type: stringa di caratteri: il tipo di aiuto richiesto. I valori possibili sono \"testo\", \"html\" e \"pdf\". Il maiuscolo è ignorato e sono consentite corrispondenze parziali.\n</li>\n</ul>\n<b>Dettagli</b></br>\nL'aiuto sul pacchetto</br>\n<b>Esempi</b><br/>\n<code> \naiuto(pacchetto = \"splines\")\n</code> <br/>\n<b>Pacchetto</b></br>\nutils</br>\n<b>Aiuto</b></br>\nPer un aiuto dettagliato fare clic sull'icona R nell'angolo in alto a destra di questo overlay di dialogo o eseguire il seguente comando nell'editor di sintassi R aiuto()\n                "
  }
}