{
  "title": "Esempio da Distribuzione Binomiale Negativa",
  "navigation": "Esempio da Distribuzione Binomiale Negativa",
  "entrdsname": "Inserisci il nome del dataset",
  "size": "Numero target di successi",
  "prob": "Probabilità",
  "lblnoofsamples": "Numero di campioni (righe)",
  "lblnoofobsv": "Numero di osservazioni (colonne)",
  "lblseed": "Semenza",
  "lblAddtoDS": "Aggiungi al dataset",
  "chklbl1": "Medie campionarie",
  "chklbl2": "Somme campionarie",
  "chklbl3": "Deviazioni standard campionarie",
  "help": {
    "title": "Esempio da Distribuzione Binomiale Negativa",
    "r_help": "help(rnbinom, package=stats)",
    "body": "\n\n            <b>Descrizione</b>\n            <br/>\n            Densità, funzione di distribuzione, funzione quantile e generazione casuale per la distribuzione binomiale negativa con parametri size e prob.\n            <br/>\n            <b>Utilizzo</b>\n            <br/>\n            <code>\n                dnbinom(x, size, prob, mu, log = FALSE)\n                <br/>\n                pnbinom(q, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qnbinom(p, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rnbinom(n, size, prob, mu)\n                <br/>\n            </code>\n            <br/>\n            <b>Argomenti</b>\n            <br/>\n            <ul>\n                <li>x : vettore di quantili (interi non negativi).</li>\n                \n                \n                <li>q : vettore di quantili.</li>\n                \n                \n                <li>p : vettore di probabilità.</li>\n                \n                \n                <li>n : numero di osservazioni. Se length(n) > 1, la lunghezza è presa come il numero richiesto.</li>\n                \n                \n                <li>size : obiettivo per il numero di prove riuscite, o parametro di dispersione (il parametro di forma della distribuzione gamma di mescolamento). Deve essere strettamente positivo, non è necessario che sia intero.</li>\n                \n                \n                <li>prob : probabilità di successo in ogni prova. 0 < prob <= 1.</li>\n                \n                \n                <li>mu : parametrizzazione alternativa tramite la media: vedere 'Dettagli'.</li>\n                \n                \n                <li>log, log.p : logico; se TRUE, le probabilità p sono date come log(p).</li>\n                \n                \n                <li>lower.tail : logico; se TRUE (predefinito), le probabilità sono P[X ≤ x], altrimenti, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Dettagli</b>\n            <br/>\n            La distribuzione binomiale negativa con size = n e prob = p ha densità\n            <br/>\n            <code>\n                Γ(x+n)/(Γ(n) x!) p^n (1-p)^x\n                per x = 0, 1, 2, …, n > 0 e 0 < p ≤ 1.\n            </code>\n            <br/>\n            Questo rappresenta il numero di fallimenti che si verificano in una sequenza di prove di Bernoulli prima che venga raggiunto un numero target di successi. La media è μ = n(1-p)/p e la varianza n(1-p)/p^2.\n            <br/>\n            Una distribuzione binomiale negativa può anche sorgere come una miscela di distribuzioni di Poisson con media distribuita come una distribuzione gamma (vedere pgamma) con parametro di scala (1 - prob)/prob e parametro di forma size. (Questa definizione consente valori non interi di size.)\n            <br/>\n            Una parametrizzazione alternativa (spesso utilizzata in ecologia) è tramite la media mu (vedere sopra), e size, il parametro di dispersione, dove prob = size/(size+mu). La varianza è mu + mu^2/size in questa parametrizzazione.\n            <br/>\n            Se un elemento di x non è intero, il risultato di dnbinom è zero, con un avviso.\n            Il caso size == 0 è la distribuzione concentrata a zero. Questa è la distribuzione limite per size che si avvicina a zero, anche se mu piuttosto che prob è mantenuto costante. Nota però che la media della distribuzione limite è 0, qualunque sia il valore di mu.\n            <br/>\n            Il quantile è definito come il valore più piccolo x tale che F(x) ≥ p, dove F è la funzione di distribuzione.\n            <br/>\n            <br/><b>Valore</b>\n            <br/>\n            dnbinom fornisce la densità, pnbinom fornisce la funzione di distribuzione, qnbinom fornisce la funzione quantile, e rnbinom genera deviate casuali.\n            <br/>\n            Dimensioni o prob invalidi comporteranno un valore di ritorno NaN, con un avviso.\n            <br/>\n            La lunghezza del risultato è determinata da n per rnbinom, ed è il massimo delle lunghezze degli argomenti numerici per le altre funzioni.\n            <br/>\n            Gli argomenti numerici diversi da n vengono riciclati alla lunghezza del risultato. Solo i primi elementi degli argomenti logici vengono utilizzati.            \n      "
  }
}