{
  "title": "Probabilità di sopravvivenza previste",
  "label100": "Questo dialogo restituisce la probabilità di sopravvivenza prevista in uno o più \ntempi di follow-up specificati. \nDevono essere soddisfatti i seguenti requisiti.\n1. Devi aver costruito un modello di regressione cox su un dataset in cui 1=evento, 0=censura. \n2. Il dataset per il quale desideri generare previsioni deve avere tutte le variabili indipendenti utilizzate per creare \nil modello originale. \n3. La scala temporale utilizzata per il tempo di follow-up deve corrispondere alla scala temporale utilizzata per creare il modello originale. \n4. Se desideri previsioni per una singola osservazione, devi creare un nuovo dataset con quell'osservazione.",
  "navigation": "Scoring Cox",
  "filterModels": "Filtra modelli per classe",
  "modelSelection": "Seleziona un modello per valutare un dataset",
  "label1": "Test diagnostici",
  "followUpTime": "Specifica uno o più tempi di follow-up ad es. 1200, 1250, le probabilità di sopravvivenza previste saranno generate per ciascun tempo di follow-up",
  "levelOfInterest": "Quando la variabile da prevedere ha 2 livelli, specifica il livello di interesse. La matrice di confusione e le statistiche correlate vengono visualizzate con il livello di interesse specificato come riferimento",
  "label12": "Risultati del test: non appena un modello è selezionato, eseguiremo test per vedere se le variabili dipendenti specificate nel modello sono \navailable nel dataset da valutare. I risultati verranno visualizzati qui",
  "label2": "Salva le probabilità di sopravvivenza.",
  "label3": "Le probabilità previste sono memorizzate come nuove variabili con il prefisso sotto aggiunto al nome della variabile evento originale",
  "label4": "**Per le variabili dipendenti con 2 livelli, il 2° livello è trattato come il livello positivo. Vedi Dati > Livelli fattoriali > Riordina livelli manualmente per cambiare l'ordine dei livelli fattoriali e ricostruire il modello.",
  "conflevel": "Salva gli intervalli di confidenza per i valori previsti individuali **(Valido solo per modelli lineari (classe lm))",
  "roctable": "Mostra la tabella ROC (**Solo per variabili dipendenti binarie)",
  "colname": "Specifica il prefisso del nome della colonna",
  "label5": "**Selezionare la casella di controllo sopra comporterà una penalità di prestazioni per dataset di grandi dimensioni.",
  "level": "Specifica il livello di confidenza",
  "confusioncheck": "Genera matrice di confusione",
  "help": {
    "title": "Valuta un dataset utilizzando un modello",
    "r_help": "help(predict, package='stats')",
    "body": "\n    QUANDO SONO SPECIFICATI PIÙ PERIODI TEMPORALI, UNA MATRICE DI CONFUSIONE E UNA CURVA ROC VENGONO GENERATE SOLO PER IL PRIMO PERIODO TEMPORALE\n    <b>Descrizione</b></br>\n    La valutazione del modello fa quanto segue</br>\n    1. Valuta il dataset corrente utilizzando il modello pre-costruito selezionato. Memorizza le previsioni con l'intervallo di confidenza specificato nel dataset corrente utilizzando il prefisso specificato.</br>\n    2. Facoltativamente crea una matrice di confusione e una curva ROC</br>\n    3. Nel caso in cui stai valutando un dataset di addestramento che contiene la variabile dipendente/variabile da prevedere e la variabile dipendente ha 2 livelli, hai la possibilità di selezionare il livello di riferimento/livello di interesse.<br/>\n    4. La matrice di confusione e le statistiche correlate vengono create utilizzando il livello di interesse specificato.<br/>\n    Vedi i dettagli sulla funzione predict e sulla matrice di confusione qui sotto\n    <br/>\n    <br/>\n    <b>Descrizione</b></br>\n    predict è una funzione generica per fare previsioni utilizzando il modello selezionato. \n    <br/>\n    <b>Utilizzo</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argomenti</b><br/>\n    <ul>\n    <li>\n    modelname: un oggetto modello per il quale si desidera la previsione.\n    </li>\n    <li>\n    prefix: stringa di prefisso che verrà utilizzata per creare nuove variabili contenenti le previsioni.\n    </li>\n    <li>\n    datasetname: è il dataset corrente da valutare e salvare le previsioni.\n    </li>\n    </ul>\n    <b>Dettagli</b></br>\n    Memorizza le previsioni con l'intervallo di confidenza specificato nel dataset corrente utilizzando il prefisso specificato.</br>\n    <b>Pacchetto</b></br>\n    stats</br>\n    <b>Aiuto</b></br>\n    Per un aiuto dettagliato clicca sull'icona R in alto a destra di questo overlay di dialogo o esegui il seguente comando help(predict, package ='stats') nella finestra dell'editor R\n    </br>\n    </br>\n    <b>Descrizione</b></br>\n    Crea una matrice di confusione incrociando le classi osservate e previste con le statistiche associate. \n    <br/>\n    <b>Utilizzo</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argomenti</b><br/>\n    <ul>\n    <li>\n    modelname : un oggetto modello per il quale si desidera la matrice di confusione.\n    </li>\n    <li>\n    showCofusionMatrix:  logico, se TRUE la matrice di confusione viene generata (se applicabile), se FALSE, la matrice di confusione non viene generata.\n    </li>\n    <li>\n    predictions : un oggetto restituito come risultato della chiamata a predict().\n    </li>\n    <li>\n    datasetname: è il nome del dataset corrente utilizzando il quale vogliamo fare previsioni.\n    </li>\n    </ul>\n    <b>Dettagli</b></br>\n    Visualizza la matrice di confusione utilizzando la funzione confusionMatrix nel pacchetto caret</br>\n    <b>Pacchetto</b></br>\n    caret</br>\n    <b>Aiuto</b></br>\n    Per un aiuto dettagliato clicca sull'icona R in alto a destra di questo overlay di dialogo o esegui il seguente comando help(confusionMatrix, package ='caret') nella finestra dell'editor R\n                "
  }
}