{
  "title": "SEM",
  "residualCovHeatmap": "Mappa di calore della deviazione tra le matrici di covarianza osservate e quelle implicate dal modello",
  "observedCorr": "Correlazioni osservate",
  "modelImpliedCorr": "Correlazioni implicate dal modello",
  "residualCorr": "Deviazione tra le correlazioni osservate e quelle adattate",
  "residualCorrHeatmap": "Mappa di calore della deviazione tra le matrici di correlazione osservate e quelle implicate dal modello",
  "intercepts1": "Gli intercetti delle variabili osservate",
  "intercepts": "Mostra intercetti",
  "means": "Gli intercetti/medi delle variabili latenti",
  "residuals1": "Le varianze residue delle variabili osservate",
  "residual_covariances": "Le covarianze residue delle variabili osservate",
  "lv_variances": "Le varianze (residue) delle variabili latenti",
  "lv_covariances": "Le covarianze (residue) delle variabili latenti",
  "regressions": "Tutti i coefficienti di regressione nel modello",
  "loadings": "Caricamenti delle variabili osservate sulle rispettive variabili latenti",
  "secOrdFacOptvar": "Fattori di secondo ordine",
  "EqConstraintsOptvar": "Vincoli di uguaglianza",
  "mediationOptvar": "Mediazione",
  "multiGrpOptions": "Opzioni di gruppo multiplo",
  "multiGrpSrc": "Variabili sorgente",
  "multiGrpDependent": "Variabili di raggruppamento",
  "modelname": "Inserisci un nome per il modello",
  "mediationSrcCtrl": "Relazioni sorgente",
  "mediationDestCtrl": "Parametri di mediazione",
  "navigation": "SEM",
  "modelTermsDst": "Relazione",
  "modelTerms": "Predittore",
  "modelTerms1": "Risultato",
  "sem": "Variabili latenti",
  "sem_model_terms": "Parametri strutturali",
  "semSuppCtrl": "Fattori di primo ordine",
  "sem2": "Fattori di secondo ordine",
  "label1": "Seleziona un elemento dalle liste di predittori e risultati e fai clic sul pulsante con una freccia per spostare gli elementi selezionati nella lista delle relazioni",
  "label2": "Seleziona un elemento dalle liste di predittori e risultati e fai clic sul pulsante con una freccia per spostare gli elementi selezionati nella lista delle relazioni",
  "label3": "Informazioni",
  "label4": "Output aggiuntivi",
  "label5": "Covarianze e correlazioni (vedi aiuto)",
  "label6": "R-quadrato",
  "label7": "Salva previsto",
  "label9": "Vincoli",
  "coVarTerms": "1ª variabile/fattore",
  "coVarTerms1": "2ª variabile/fattore",
  "coVarDst": "Covarianze selezionate",
  "optionsCoVarTerms": "Covarianze",
  "parameterizeFormula": "Mostra etichette dei parametri",
  "modelOptions": "Opzioni del modello",
  "method": "Seleziona un metodo e un approccio (se applicabile)",
  "approach": "Approccio di massima verosimiglianza",
  "missing": "Valori mancanti",
  "addFitMeasures": "Misure di adattamento aggiuntive",
  "mardiaSkew": "Asimmetria di Mardia (solo casi completi)",
  "mardiaKurt": "Curtosi di Mardia (solo casi completi)",
  "observed": "Covarianze osservate",
  "modelImplied": "Covarianze implicate dal modello (adattate)",
  "residual": "Deviazione tra covarianze osservate e adattate",
  "r2squareNone": "Nessuno",
  "r2squareEndo": "Endogeno",
  "factorScores": "Punteggi dei fattori (variabili salvate con prefisso FS)",
  "indicators": "Indicatori (variabili salvate con prefisso I)",
  "dependentVars": "Variabili dipendenti (variabili salvate con prefisso DV)",
  "label8": "Indici di modifica",
  "modIndices": "Indici di modifica",
  "highLowIndices": "Nascondi indici bassi",
  "threshold": "Soglia",
  "residuals": "Mostra residui",
  "includeThresholds": "Mostra soglie",
  "edgeLabels": "Seleziona opzioni per le etichette dei bordi",
  "layout": "Opzioni per come i nodi devono essere posizionati",
  "rotate": "Posizione delle variabili esogene quando viene utilizzato il layout ad albero o tree2",
  "abbNodeLabels": "Numero di caratteri per abbreviare le etichette dei nodi",
  "abbEdgeLabels": "Numero di caratteri per abbreviare le etichette dei bordi",
  "label101": "Percorsi",
  "label102": "Layout",
  "label103": "Nodi",
  "semPlotOptions": "Opzioni di tracciamento",
  "parameterOptions": "Opzioni dei parametri",
  "manifestShapes": "Forme manifeste",
  "latentShapes": "Forme latenti",
  "outputOptions": "Opzioni di output",
  "label104": "Soluzioni standardizzate",
  "stdall": "Le stime standardizzate si basano sulle varianze di entrambe le variabili osservate e latenti (continue)",
  "stdlv": "Le stime standardizzate si basano solo sulle varianze delle variabili latenti (continue)",
  "stdnox": "Le stime standardizzate si basano sulle varianze di entrambe le variabili osservate e latenti (continue), ma non sulle varianze delle covariate esogene",
  "label105": "Errori standard",
  "label106": "Impostazioni di bootstrap",
  "automatic": "Automatico",
  "standard": "Standard",
  "robust": "Robusto",
  "pseudoML": "Pseudo ML",
  "bootstrap": "Bootstrap",
  "percentiles": "Percentili",
  "normal": "Normale",
  "adjustedBiasCorrected": "Corretto per bias aggiustato",
  "basic": "di base",
  "bootstratRep": "Ripetizioni di bootstrap",
  "autoComputeCovar": "Calcola automaticamente le covarianze",
  "equalityConstraints1": "Relazioni",
  "sem3": "Vincoli di uguaglianza",
  "help": {
    "title": "SEM",
    "r_help": "help(sem, package=lavaan)",
    "body": "\n<b>Descrizione</b></br>\nLa Modellazione ad Equazioni Strutturali (SEM) utilizza il pacchetto lavaan (0.6.16) per la stima e lavora con la formulazione tradizionale LISREL sem (anziché le formulazioni Bentler-Weeks, RAMpath o LISCOMP). La stima predefinita è la massima verosimiglianza e utilizza NLMINB (quasi-Newton) con l'approccio di verosimiglianza normale (anziché il metodo di verosimiglianza Wishart). Gli errori standard sono basati su matrici di informazione attese (anziché osservate), ma le informazioni osservate, attese e le deviazioni possono essere esaminate utilizzando mappe di calore. Il controllo della normalità (cioè, asimmetria e curtosi di Mardia) è fornito. L'utente può specificare modelli con e senza variabili latenti continue (cioè, modellazione della misurazione) sia a ordini inferiori che superiori, così come modelli strutturali (cioè, modellazione dei percorsi). Sono possibili vincoli di uguaglianza, mediazione e analisi multigruppo. Un'ampia gamma di metodi di stima (ad es., varietà di massima verosimiglianza, minimi quadrati e James-Stein) sono supportati. Numerose statistiche di adattamento sono disponibili su richiesta (ad es., GFI, aGFI, ECVI, ecc.), e un piccolo sottoinsieme (cioè, CFI, TLI, SRMR, RMSEA, AIC, BC) è fornito per impostazione predefinita. Gli intervalli di confidenza utilizzando varie funzioni di bootstrap possono anche essere ottenuti. I diagrammi dei modelli sono prodotti utilizzando semPlot (1.1.6).  \n</br>\n</br>\nQuando fai clic su Covarianze nella finestra di dialogo, vedrai che la casella di controllo, calcola automaticamente le covarianze è selezionata. Puoi eliminare una covarianza calcolata automaticamente selezionando la covarianza e facendo clic sull'icona del cestino. Quando elimini una covarianza, la sopprimiamo nel codice generato. Se desideri annullare la soppressione, devi aggiungerla manualmente di nuovo o eliminare e ricreare la variabile latente o il fattore di ordine superiore che fa parte della covarianza per cui desideri annullare la soppressione.\n</br>\n</br>\nQuando viene selezionata una variabile di raggruppamento (fai clic su Opzioni di gruppo multiplo nella finestra di dialogo), devi selezionare la casella di controllo \"Gli intercetti delle variabili osservate\" e la casella di controllo \"Gli intercetti/medi delle variabili latenti\"\nSelezionare solo la prima casella di controllo ti dà maggiore flessibilità.\n</br>\nLa descrizione delle funzioni di adattamento è riportata di seguito</br>\n\"ML\" massima verosimiglianza</br>\n\"GLS\": minimi quadrati generalizzati. Solo per dati completi.</br>\n\"WLS\": minimi quadrati ponderati (a volte chiamata stima ADF). Solo per dati completi.</br>\n\"DWLS\": minimi quadrati pesati diagonalmente</br>\n\"ULS\": minimi quadrati non ponderati</br>\n\"DLS\": minimi quadrati distribuzionali pesati</br>\n\"PML\": massima verosimiglianza per coppie</br>\nMolti stimatori hanno varianti robuste, il che significa che forniscono errori standard robusti e una statistica di test scalata. Ad esempio, per lo stimatore di massima verosimiglianza, lavaan fornisce le seguenti varianti robuste:</br>\n\"MLM\": stima di massima verosimiglianza con errori standard robusti e una statistica di test scalata di Satorra-Bentler. Solo per dati completi.</br>\n\"MLMVS\": stima di massima verosimiglianza con errori standard robusti e una statistica di test aggiustata per media e varianza (nota come approccio di Satterthwaite). Solo per dati completi.</br>\n\"MLMV\": stima di massima verosimiglianza con errori standard robusti e una statistica di test aggiustata per media e varianza (utilizzando un approccio a scala spostata). Solo per dati completi.</br>\n\"MLF\": per la stima di massima verosimiglianza con errori standard basati sulle derivate di primo ordine e una statistica di test convenzionale. Per dati completi e incompleti.</br>\n\"MLR\": stima di massima verosimiglianza con errori standard robusti (Huber-White) e una statistica di test scalata che è (asintoticamente) uguale alla statistica di test di Yuan-Bentler. Per dati completi e incompleti.</br>\n</br>\nTBD\nGestisci la documentazione dell'etichetta vedi aiuto\nDobbiamo documentare la situazione attorno ai gradi di libertà fondamentalmente quando viene selezionata una variabile di raggruppamento, devi selezionare\nla casella di controllo \"Gli intercetti delle variabili osservate\" e la casella di controllo \"Gli intercetti/medi delle variabili latenti\"\nSelezionare solo la prima casella di controllo ti dà maggiore flessibilità.\n<b>Pacchetto</b></br>\nlavaan;semPlot;semTools</br>\n<b>Aiuto</b></br>\nPer aiuto dettagliato fai clic sull'icona R nell'angolo in alto a destra di questa sovrapposizione della finestra di dialogo o esegui il seguente comando nell'editor di sintassi R</br>\nhelp(sem, package='lavaan')\n\n\n"
  }
}