{
  "title": "Grafici di Shewhart (I-MR)",
  "navigation": "Grafici di Shewhart (I-MR)",
  "variableSelcted2": "Variabile (dati osservati) da graficare",
  "dateVariable": "(Opzionale) Variabile data da mostrare sulle date dell'asse x del grafico",
  "plotTimeSeriesChk": "(Opzionale) Grafica una serie temporale della variabile (dati osservati) - vedere le opzioni di formattazione aggiuntive per date e orari alla fine",
  "dateUnitStr": "(Opzionale) Scegli un'unità di data di raggruppamento (ad es. settimana, trimestre, ecc.) per i valori delle date, altrimenti i valori delle date saranno calcolati automaticamente",
  "dateUnitInteger": "(Opzionale) Un'unità di data di raggruppamento aggiuntiva (ad es. 1 giorno, 2 settimane, 1 trimestre, ecc.) per i valori delle date",
  "printStatChk": "Stampa statistiche oltre ai grafici",
  "printObjectSummaryChk": "Stampa il riepilogo dell'oggetto QCC",
  "printTestSummaryChk": "Stampa il riepilogo dei test per cause speciali",
  "printTestDetailChk": "Stampa i dettagli dei test per cause speciali",
  "markTestNumberChk": "Segna il numero del test sul grafico (solo il primo numero del test sarà contrassegnato se più di un test risulta violato da un punto dati)",
  "ocCurvesChk": "Grafica curve delle caratteristiche operative dove applicabile (deve avere dimensioni del campione uguali)",
  "rowsTobeUsed": "Righe raggruppate da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedAsNewData": "Nuovi dati - righe raggruppate da utilizzare come nuovi dati da graficare (ad es. specificare come 1:25 o 1,4,5,7:12) - nuovi dati da graficare ma non inclusi nei calcoli",
  "additionalPhasesLabel": "Specifica i dati per graficare fasi aggiuntive. Puoi utilizzare il campo 'Righe Raggruppate' sopra come dati della Fase 1. Limitato a un massimo di 10 fasi per essere pratico da graficare su un singolo grafico.",
  "rowsTobeUsedPhase2": "Righe raggruppate della Fase 2 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedPhase3": "Righe raggruppate della Fase 3 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedPhase4": "Righe raggruppate della Fase 4 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedPhase5": "Righe raggruppate della Fase 5 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedPhase6": "Righe raggruppate della Fase 6 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedPhase7": "Righe raggruppate della Fase 7 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedPhase8": "Righe raggruppate della Fase 8 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedPhase9": "Righe raggruppate della Fase 9 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "rowsTobeUsedPhase10": "Righe raggruppate della Fase 10 da utilizzare per il grafico (ad es. specificare come 1:25 o 1,4,5,7:12)",
  "phaseNames": "Specifica i nomi delle fasi (separati da virgola) per un grafico multi-fase - i nomi delle fasi predefiniti sono Fase 1, Fase 2, ...",
  "nsigmas": "Sigma - numero di sigmas da utilizzare per calcolare i limiti di controllo. Viene ignorato quando viene fornito l'argomento confidence.level",
  "confidence_level": "Livello di Confidenza - valore compreso tra 0 e 1 che specifica il livello di confidenza dei limiti di probabilità calcolati",
  "sdWarnLimits": "Aggiungi linee di limite aggiuntive (separate da virgola) sul grafico ai specifici std. deviazioni (ad es. 1.5, 2)",
  "digits": "Cifre - numero di cifre da visualizzare",
  "lower": "LSL - valore numerico del limite di specifica inferiore per tracciare una linea LSL",
  "upper": "USL - valore numerico del limite di specifica superiore per tracciare una linea USL",
  "addlSpecLines": "Aggiungi linee di specifica aggiuntive sul grafico I (separate da virgola ad es. 73.98, 74.01, 74.03)",
  "addlSpecLinesLabel": "Etichetta per le linee di specifica aggiuntive (separate da virgola ad es. Spec 1, Spec 2, Spec 3)",
  "addlSpecLinesMR": "Aggiungi linee di specifica aggiuntive sul grafico MR (separate da virgola ad es. 0.02, 0.04, 0.06)",
  "addlSpecLinesLabelMR": "Etichetta per le linee di specifica aggiuntive (separate da virgola ad es. Spec 1, Spec 2, Spec 3)",
  "I_XbarOne_Stddev": "Grafico I - metodo della deviazione standard da utilizzare",
  "MR_R_Stddev": "Grafico MR - metodo della deviazione standard da utilizzare",
  "performTestLabel": "Esegui i test selezionati per cause speciali",
  "test1Chk": "Esegui test 1",
  "test2Chk": "Esegui test 2",
  "test3Chk": "Esegui test 3",
  "test4Chk": "Esegui test 4",
  "test5Chk": "Esegui test 5",
  "test6Chk": "Esegui test 6",
  "test7Chk": "Esegui test 7",
  "test8Chk": "Esegui test 8",
  "test1": "Un punto più di Kσ dalla linea centrale (predefinito 3)",
  "test2": "K punti di fila sullo stesso lato della linea centrale (predefinito 9)",
  "test3": "K punti di fila, tutti in aumento o tutti in diminuzione (predefinito 6)",
  "test4": "K punti di fila, alternando su e giù (predefinito 14)",
  "test5": "K su K+1 punti più di 2σ dalla linea centrale stesso lato (predefinito 2 su 2+1)",
  "test6": "K su K+1 punti più di 1σ dalla linea centrale stesso lato (predefinito 4 su 4+1)",
  "test7": "K punti di fila entro 1σ dalla linea centrale su entrambi i lati (predefinito 15)",
  "test8": "K punti di fila più di 1σ dalla linea centrale su entrambi i lati (predefinito 8)",
  "sigmaSymbol": "Se il simbolo sigma 'σ' non viene stampato correttamente nell'output, specifica un carattere o una stringa ad es. s o sigma al posto del simbolo σ",
  "dateAxisFormat": "Scegli un formato per il testo del valore della data",
  "timeAxisFormat": "Scegli un formato per il testo del valore del tempo",
  "axisTickmarksCount": "Quanti valori (approssimativamente) dell'asse (tickmarks) visualizzare (predefinito 10)",
  "angleXaxis_text": "Angolo per inclinare i valori del testo dell'asse x (0 per nessuna inclinazione)",
  "chart_title": "Inserisci un titolo",
  "x_title": "Etichetta asse X",
  "y_title": "Etichetta asse Y",
  "supressSampleSizeInfoChk": "Sopprimi le informazioni sulla dimensione del campione nel titolo del grafico",
  "plotPhases": "Grafica fasi",
  "plotTests": "Test per cause speciali",
  "addRefLines": "Aggiungi linee di riferimento",
  "help": {
    "title": "Grafici di Shewhart (I-MR)",
    "r_help": "help(qcc, package = qcc)",
    "body": "\n\t\t\t\t<b>Descrizione</b></br>\n\t\t\t\tFunzione qcc per eseguire il controllo statistico della qualità e per tracciare i grafici di Shewhart\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPer l'aiuto dettagliato - usa R help(qcc, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPer ulteriore aiuto con i metodi di deviazione standard - usa R help(sd.xbar.one, package = qcc) e help(sd.R, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPer provare questo, puoi caricare il dataset chiamato pistonrings dal pacchetto qcc con il menu Carica Dataset selezionando il pacchetto qcc e poi selezionando il dataset pistonrings\n\t\t\t\t<br/>\n\t\t\t\tScegli il diametro per variabile (osservata..), clicca su esegui\n\t\t\t\t<br/>\n\t\t\t\tInoltre, digita 1:20 nelle righe raggruppate da utilizzare, clicca su esegui \n\t\t\t\t<br/>\n\t\t\t\tPer tracciare un grafico con fasi multiple\n\t\t\t\t<br/>\n\t\t\t\tDigita 25:30 nelle righe raggruppate della Fase 2\n\t\t\t\t<br/>\n\t\t\t\tDigita 31:38 nelle righe raggruppate della Fase 3\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSegui il tutorial qcc su https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
  }
}