{
  "title": "Abbinamento dei soggetti",
  "navigation": "Abbinamento dei soggetti",
  "newdatasetnamelabel": "Nome del dataset per memorizzare i dati abbinati",
  "groupvarlabel": "Variabile caso/controllo (controllo=valore inferiore, caso=valore superiore)",
  "notelabel": "Nota: Devi specificare almeno una variabile per le variabili esatte o di caliper",
  "exactvarslabel": "Variabili per abbinamento esatto",
  "calipervarslabel": "Variabili per abbinamento di caliper",
  "caliperslabel": "Specifica i caliper in ordine delle variabili di caliper separati da virgole, ad es. 5, 2",
  "idvarlabel": "Variabile ID soggetto",
  "ratiolabel": "Numero di controlli per caso",
  "help": {
    "title": "Abbinamento dei soggetti",
    "r_help": "help(matchit, package = 'MatchIt')",
    "body": "\n            Esegue l'abbinamento dei soggetti con il vicino più vicino dove un insieme di casi è abbinato a 1 o più controlli. Questo è appropriato per studi caso/controllo e studi di coorte abbinati.\n\t\t\t<br/><br/>\n\t\t\tLe variabili per le quali i valori devono corrispondere esattamente e i valori che corrispondono all'interno di caliper numerici sono supportati.\n\t\t\tL'abbinamento viene effettuato senza sostituzione (ogni soggetto può essere abbinato solo una volta) e i controlli tra i controlli potenziali saranno selezionati secondo l'ordine dei dati per ogni caso.\n\t\t\t<br/><br/>\n\t\t\tIl dataset di output conterrà i dati originali e due variabili aggiuntive: 1) subclass: una variabile che identifica l'insieme abbinato, e 2) weights: una variabile di peso del caso abbinato che può essere utilizzata nell'analisi successiva, se desiderato.\n\t\t\t<br/><br/>\n\t\t\t<b>Nome del dataset per memorizzare i dati abbinati:</b>\n\t\t\t<br/>Nome del dataset di output contenente gli insiemi di soggetti abbinati.\n\t\t\t<br/><br/>\n\t\t\t<b>Variabile caso/controllo (controllo=valore inferiore, caso=valore superiore):</b>\n\t\t\t<br/>Nome della variabile che indica casi e controlli. Può essere numerica, fattoriale o carattere.  \n\t\t\tSe è una variabile numerica, deve essere codificata come 0=controllo, 1=casi. Se è una variabile fattoriale, il livello ordinato inferiore sarà i controlli e il livello ordinato superiore sarà i casi.  \n\t\t\tSe è una variabile carattere, il valore ordinato inferiore (in ordine alfabetico) sarà i controlli, e il valore ordinato superiore (in ordine alfabetico) sarà i casi.\n\t\t\tQuindi, per essere più sicuri, raccomandiamo di codificare come 0=controllo, 1=casi.\n\t\t\t</br><br/>\n\t\t\t<b>Variabili per abbinamento esatto:</b>\n\t\t\t<br/>Specifica le variabili per le quali desideri che gli insiemi caso/controllo siano abbinati esattamente.  \n\t\t\tQuesto significa che i casi e i controlli in un insieme abbinato hanno esattamente gli stessi valori per queste variabili. Queste possono essere variabili carattere, data, numeriche, fattoriali o ordinali.\n\t\t\t<br/><br/>\n\t\t\t<b>Variabili per abbinamento di caliper:</b>\n\t\t\t<br/>Specifica le variabili per le quali desideri che gli insiemi caso/controllo siano abbinati su valori di caliper numerici. I controlli saranno all'interno di una larghezza di caliper specificata per ciascuna di queste variabili.\n\t\t\tQueste possono essere variabili numeriche o di data. Ogni variabile di caliper deve avere un valore di caliper specificato.\n\t\t\t<br/><br/>\n\t\t\t<b>Specifica i caliper in ordine delle variabili di caliper separati da virgole:</b>\n\t\t\t<br/>Specifica i valori di caliper numerici per ciascuna delle variabili di caliper, in ordine delle variabili di caliper.  \n\t\t\tAd esempio, se l'età (in anni) è stata specificata con un caliper di 5, significa che i controlli devono essere entro +/- 5 anni dal loro caso abbinato.\n\t\t\tOgni variabile di caliper deve avere un valore di caliper specificato. Se non ci sono variabili di caliper, questo campo deve essere vuoto.\n\t\t\t<br/><br/>\n\t\t\t<b>Numero di controlli per caso:</b>\n\t\t\t<br/>Questo è il numero massimo di controlli che saranno abbinati a ciascun caso. Alcuni insiemi abbinati possono avere meno di questo valore se non possono essere identificati abbinamenti adatti.\n            <br/><br/>\n            <b>Pacchetti R richiesti:</b> dplyr, tidyr, MatchIt\n"
  }
}