{
  "title": "Tabella, Base",
  "navigation": "Tabella, Base",
  "sumvarslabel": "Variabili da Riassumere",
  "bygroupvarlabel": "Gruppi da Confrontare (opzionale)",
  "stratavarlabel": "Strati (opzionale)",
  "tabletitlelabel": "Titolo della Tabella",
  "totalcolchkboxlabel": "Includi colonna totale",
  "groupvarchkboxlabel": "Includi nome della variabile di gruppo",
  "digitslabel": "Cifre Dopo la Virgola",
  "contdigitslabel": "Valori Continui",
  "pctdigitslabel": "Percentuali",
  "pvaluedigitslabel": "P-Values",
  "simplifylabel": "Semplifica i Riassunti delle Variabili Multi-Riga in una Riga (se possibile)",
  "numericsimplifylabel": "Variabili Numeric",
  "categorysimplifylabel": "Variabili Categoriali",
  "ordinalsimplifylabel": "Variabili Ordinali",
  "datesimplifylabel": "Variabili Data",
  "labelsimplifylabel": "Usa l'Ultimo Livello nell'Etichetta delle Variabili Categoriali",
  "conflevellabel": "Livello di Confidenza",
  "ciFootNote": "Nota a piè di pagina sul Livello di Confidenza",
  "optvarStatistical": "Opzioni di Test Statistico",
  "optvarNumerical": "Opzioni Statistiche Numeriche",
  "optvarCategorical": "Opzioni Statistiche Categoriali",
  "optvarDate": "Opzioni Statistiche per le Date",
  "stattestschkboxlabel": "Test Statistici",
  "numtestlabel": "Test Numerici",
  "anovaoptlabel": "ANOVA",
  "kwoptlabel": "Kruskal-Wallis",
  "medoptlabel": "Test della Mediana",
  "cattestlabel": "Test Categoriali Nominali",
  "chisqoptlabel": "Chi-quadro di Pearson",
  "fisheroptlabel": "Esatto di Fisher",
  "simchkboxlabel": "Simula p-value per Pearson e Fisher",
  "simnumlabel": "Numero di Simulazioni",
  "ordtestlabel": "Test Categoriali Ordinali",
  "trendoptlabel": "Tendenza",
  "footnotechkboxlabel": "Nota a piè di pagina sui Nomi dei Test",
  "sampsizelabel": "Dimensione del Campione",
  "meanlabel": "Media",
  "quantileslabel": "Quantili",
  "otherlabel": "Altro",
  "nmissanylabel": "Numero di Mancanti, se presenti",
  "nmissalwayslabel": "Numero di Mancanti, sempre",
  "meansdlabel": "Media (SD)",
  "meancilabel": "Media (CI)",
  "meanselabel": "Media (SE)",
  "gmeanlabel": "Media Geometrica",
  "gmeansdlabel": "Media Geometrica (SD)",
  "gmeancilabel": "Media Geometrica (CI)",
  "trimmeancilabel": "Media Trimmata (CI)",
  "trimpctlabel": "Specifica Percentuale Media Trimmata",
  "medianlabel": "Mediana",
  "medianq1q3label": "Mediana (25° %-ile, 75° %-ile)",
  "q1q3label": "(25° %-ile, 75° %-ile)",
  "iqrlabel": "Intervallo Interquartile",
  "medianrangelabel": "Mediana (Intervallo)",
  "medianmadlabel": "Mediana (Deviazione Assoluta Mediana)",
  "rangelabel": "Intervallo",
  "minlabel": "Minimo",
  "maxlabel": "Massimo",
  "pct1label": "1° %-ile (CI)",
  "pct5label": "5° %-ile (CI)",
  "pct10label": "10° %-ile (CI)",
  "pct25label": "25° %-ile (CI)",
  "pct33label": "33 1/3 %-ile (CI)",
  "pct50label": "Mediana (CI)",
  "pct66label": "66 2/3 %-ile (CI)",
  "pct75label": "75° %-ile (CI)",
  "pct90label": "90° %-ile (CI)",
  "pct95label": "95° %-ile (CI)",
  "pct99label": "99° %-ile (CI)",
  "custquantlabel": "Percentuale Personalizzata (CI)",
  "custquantvaluelabel": "Specifica %-ile",
  "sumlabel": "Somma",
  "sdlabel": "SD",
  "varlabel": "Varianza",
  "gsdlabel": "SD Media Geometrica",
  "cvlabel": "Coefficiente di Variazione",
  "skewnesslabel": "Asimmetria",
  "kurtosislabel": "Curtosi",
  "freqlabel": "Frequenza",
  "freqtotallabel": "Frequenza/Totale",
  "freqpctlabel": "Frequenza (%)",
  "propcilabel": "Proporzione (CI)",
  "help": {
    "title": "Tabella, Base",
    "r_help": "help(tableby, package ='arsenal')",
    "body": "\nQuesto crea una tabella di statistiche riassuntive con opzioni per specificare gruppi da confrontare e una variabile di stratificazione per effettuare i confronti all'interno.  Una colonna per ogni gruppo \nvariabile categoria sarà creata.  Le categorie della variabile di stratificazione formeranno righe aggiuntive per la tabella.  Varie statistiche riassuntive e test statistici possono essere \nspecificati.\n<br/><br/>\n<b>Variabili da Riassumere:</b> Variabili per le quali saranno calcolate statistiche riassuntive.  Le variabili possono essere numeriche, fattori nominali, fattori ordinati o date.  Le date di qualsiasi classe \nverranno convertite nella classe Data solo per scopi di riassunto.  Il tuo dataset originale rimarrà invariato.  Questo significa anche che le date riassunte saranno accurate solo fino al giorno.\n<br/><br/>\n<b>Gruppi da Confrontare (opzionale):</b> Variabile che definisce le categorie da confrontare\n<br/><br/>\n<b>Strati (opzionale):</b> Variabile che definisce le categorie all'interno delle quali verranno effettuati i confronti\n<br/><br/>\n<b>Titolo della Tabella:</b> specifica il titolo della tabella\n<br/><br/>\n<b>Includi colonna totale:</b> se includere o meno una colonna totale nella tabella\n<br/><br/>\n<b>Includi nome della variabile di gruppo:</b> se includere o meno il nome della variabile di gruppo nella tabella\n<br/><br/>\n<b>Cifre Dopo la Virgola:</b> specifica quante cifre visualizzare dopo il punto decimale per valori continui, percentuali e p-value\n<br/><br/>\n<b>Semplifica i Riassunti delle Variabili Multi-Riga in una Riga (se possibile):</b> Per variabili categoriali a due categorie (fattore/ordinali) o riassunti singoli di variabili numeriche o di data, \npotrai ridurre le righe per avere tutti i nomi delle variabili e le statistiche in una sola riga.  I riassunti per l'ultima categoria di ogni variabile categoriale saranno mostrati. \nQualsiasi variabile per la quale non è possibile ridurre prenderà più righe.  Attivare/disattivare questa opzione può essere fatto per ogni tipo di variabile separatamente.\n<br/><br/>\n<b>Usa l'Ultimo Livello nell'Etichetta delle Variabili Categoriali:</b> Per tabelle semplificate, questo include l'ultimo livello di variabili fattore/ordinali nell'etichetta della riga.\n<br/><br/>\n<b>Livello di Confidenza:</b> Questo imposta il livello di confidenza degli intervalli di confidenza.\n<br/><br/>\n<b>Opzioni di Test Statistico</b>\n<br/><br/>\n<b>Test Statistici:</b> Se desideri o meno test statistici che confrontano i gruppi e quali test utilizzare.  Tutte le variabili numeriche (valori continui e date) utilizzeranno \nil test specificato nella sezione Test Numerici.  Tutti i fattori nominali utilizzeranno il test specificato nella sezione Test Categoriali Nominali.  Tutti i fattori ordinali utilizzeranno il \ntest specificato nella sezione Test Categoriali Ordinali.  Le Simulazioni di Pearson e Fisher forniscono la possibilità di ottenere p-value simulati per i test chi-quadro di Pearson e \nper i test Esatti di Fisher.  Questa procedura crea simulazioni Monte Carlo il numero specificato di volte (Numero di Simulazioni).  Questo può essere utile nei casi in cui i calcoli standard, \nsoprattutto per il test Esatto di Fisher, risultano in errori di memoria del computer.\n<br/><br/>\n<b>Nota a piè di pagina sui Nomi dei Test:</b> se includere o meno note a piè di pagina sui p-value che elencano i test statistici effettuati per ogni variabile\n<br/><br/>\n<b>Opzioni Statistiche Numeriche:</b>\n<br/>statistiche che saranno mostrate per le variabili numeriche\n<br/><br/>\n<b>Opzioni Statistiche Categoriali:</b> \n<br/>\nstatistiche che saranno mostrate sia per fattori nominali che ordinati\n<br/><br/>\n<b>Statistiche per le Date:</b>\n<br/>statistiche che saranno mostrate per le variabili data\n<br/><br/>\n<b>Nota:</b> Se desideri riassumere una variabile di un tipo specifico, è consigliabile selezionare almeno una statistica in quella categoria che non sia \"Numero Mancanti, se presenti\".  Se \"Numero Mancanti, se presenti\" è l'unica opzione selezionata e nessuna variabile ha un valore mancante, allora si verificherà un errore. \n<br/><br/>\n<b>Pacchetti R Richiesti:</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
  }
}