{
  "title": "Tabella, Avanzata",
  "navigation": "Tabella, Avanzata",
  "notelabel": "NOTA: Deve essere specificata almeno una variabile in almeno uno dei seguenti: Test ANOVA, Test di Kruskal-Wallis, Test della Mediana, Test Chi-Quadrato di Pearson, Test Esatto di Fisher, Test di Tendenza Ordinale, o Nessun Test",
  "anovavarslabel": "Variabili per il Test ANOVA",
  "kwvarslabel": "Variabili per il Test di Kruskal-Wallis",
  "medvarslabel": "Variabili per il Test della Mediana",
  "chisqvarslabel": "Variabili per il Test Chi-Quadrato di Pearson",
  "fishervarslabel": "Variabili per il Test Esatto di Fisher",
  "ordvarslabel": "Variabili per il Test di Tendenza Ordinale",
  "notestvarslabel": "Variabili per Nessun Test",
  "bygroupvarlabel": "Gruppi da Confrontare",
  "stratavarlabel": "Strati (opzionale)",
  "tabletitlelabel": "Titolo della Tabella",
  "totalcolchkboxlabel": "Includi colonna totale",
  "groupvarchkboxlabel": "Includi nome della variabile di gruppo",
  "digitslabel": "Cifre Dopo la Virgola",
  "contdigitslabel": "Valori Continui",
  "pctdigitslabel": "Percentuali",
  "pvaluedigitslabel": "P-Values",
  "simplifylabel": "Semplifica Riepiloghi di Variabili Multi-Riga in Una Riga (se possibile)",
  "numericsimplifylabel": "Variabili Numeric",
  "categorysimplifylabel": "Variabili Categoriali",
  "ordinalsimplifylabel": "Variabili Ordinali",
  "datesimplifylabel": "Variabili Data",
  "labelsimplifylabel": "Usa l'Ultimo Livello nell'Etichetta delle Variabili Categoriali",
  "conflevellabel": "Livello di Confidenza",
  "optvarStatistical": "Opzioni di Test Statistico",
  "optvarNumerical": "Opzioni Statistiche Numeriche",
  "optvarCategorical": "Opzioni Statistiche Categoriali",
  "optvarDate": "Opzioni Statistiche per le Date",
  "simchkboxlabel": "Simula p-value per Pearson e Fisher",
  "simnumlabel": "Numero di Simulazioni",
  "footnotechkboxlabel": "Nota a piè di pagina sui Nomi dei Test",
  "sampsizelabel": "Dimensione del Campione",
  "meanlabel": "Media",
  "quantileslabel": "Quantili",
  "otherlabel": "Altro",
  "nmissanylabel": "Numero di Mancanti, se presenti",
  "nmissalwayslabel": "Numero di Mancanti, sempre",
  "meansdlabel": "Media (SD)",
  "meancilabel": "Media (CI)",
  "meanselabel": "Media (SE)",
  "gmeanlabel": "Media Geometrica",
  "gmeansdlabel": "Media Geometrica (SD)",
  "gmeancilabel": "Media Geometrica (CI)",
  "trimmeancilabel": "Media Trimmata (CI)",
  "trimpctlabel": "Specifica Percentuale Media Trimmata",
  "medianlabel": "Mediana",
  "medianq1q3label": "Mediana (25° %-ile, 75° %-ile)",
  "q1q3label": "(25° %-ile, 75° %-ile)",
  "iqrlabel": "Intervallo Interquartile",
  "medianrangelabel": "Mediana (Intervallo)",
  "medianmadlabel": "Mediana (Deviazione Assoluta dalla Mediana)",
  "rangelabel": "Intervallo",
  "minlabel": "Minimo",
  "maxlabel": "Massimo",
  "pct1label": "1° %-ile (CI)",
  "pct5label": "5° %-ile (CI)",
  "pct10label": "10° %-ile (CI)",
  "pct25label": "25° %-ile (CI)",
  "pct33label": "33 1/3 %-ile (CI)",
  "pct50label": "Mediana (CI)",
  "pct66label": "66 2/3 %-ile (CI)",
  "pct75label": "75° %-ile (CI)",
  "pct90label": "90° %-ile (CI)",
  "pct95label": "95° %-ile (CI)",
  "pct99label": "99° %-ile (CI)",
  "custquantlabel": "Percentuale Personalizzata (CI)",
  "custquantvaluelabel": "Specifica %-ile",
  "skewnesslabel": "Asimmetria",
  "kurtosislabel": "Curtosi",
  "sumlabel": "Somma",
  "sdlabel": "SD",
  "varlabel": "Varianza",
  "gsdlabel": "SD Media Geometrica",
  "cvlabel": "Coefficiente di Variazione",
  "freqlabel": "Frequenza",
  "freqtotallabel": "Frequenza/Totale",
  "freqpctlabel": "Frequenza (%)",
  "propcilabel": "Proporzione (CI)",
  "ciFootNote": "Nota a piè di pagina sul Livello di Confidenza",
  "help": {
    "title": "Tabella, Avanzata",
    "r_help": "help(tableby, package ='arsenal')",
    "body": "\nQuesto crea una tabella di statistiche riassuntive all'interno dei gruppi da confrontare e una variabile di stratificazione per effettuare i confronti.  Verrà creata una colonna per ciascun gruppo \nvariabile categoria.  Le categorie della variabile di stratificazione formeranno righe aggiuntive per la tabella.  Possono essere specificate varie statistiche riassuntive e test statistici.\n<br/><br/>\nNota: Le date di qualsiasi classe verranno convertite nella classe Data solo per scopi di riassunto.  Il tuo dataset originale rimarrà invariato.  Questo significa anche che le date riassuntive saranno accurate solo fino al giorno.\n<br/><br/>\n<b>Gruppi da Confrontare:</b> Variabile che definisce le categorie da confrontare\n<br/><br/>\n<b>Variabili per il Test ANOVA:</b> Specifica variabili numeriche o di data per i confronti di gruppo utilizzando il test di Analisi della Varianza (ANOVA)\n<br/><br/>\n<b>Variabili per il Test di Kruskal-Wallis:</b> Specifica variabili numeriche, di data o fattori ordinali per i confronti di gruppo utilizzando il test di Kruskal-Wallis\n<br/><br/>\n<b>Variabili per il Test della Mediana:</b> Specifica variabili numeriche o di data per i confronti di gruppo utilizzando un test delle mediane\n<br/><br/>\n<b>Variabili per il Test Chi-Quadrato di Pearson:</b> Specifica variabili fattoriali nominali o ordinali per i confronti di gruppo utilizzando il test Chi-Quadrato di Pearson\n<br/><br/>\n<b>Variabili per il Test Esatto di Fisher:</b> Specifica variabili fattoriali nominali o ordinali per i confronti di gruppo utilizzando il test Esatto di Fisher\n<br/><br/>\n<b>Variabili per il Test di Tendenza Ordinale:</b> Specifica variabili fattoriali nominali o ordinali per i confronti di gruppo utilizzando un test di tendenza.  Per due gruppi, questo è essenzialmente il test di tendenza di Cochran-Armitage.\n<br/><br/>\n<b>Variabili per Nessun Test:</b> Specifica variabili che desideri riassumere solo all'interno dei gruppi.  Non verranno calcolati test statistici per queste variabili.\n<br/><br/>\nNota: Devi specificare almeno una variabile da riassumere affinché venga prodotta una tabella.\n<br/><br/>\n<b>Strati (opzionale):</b> Variabile che definisce le categorie all'interno delle quali verranno effettuati i confronti\n<br/><br/>\n<b>Titolo della Tabella:</b> specifica il titolo della tabella\n<br/><br/>\n<b>Includi colonna totale:</b> se includere o meno una colonna totale nella tabella\n<br/><br/>\n<b>Includi nome della variabile di gruppo:</b> se includere o meno il nome della variabile di gruppo nella tabella\n<br/><br/>\n<b>Cifre Dopo la Virgola:</b> specifica quante cifre visualizzare dopo il punto decimale per valori continui, percentuali e p-value\n<br/><br/>\n<b>Semplifica Riepiloghi di Variabili Multi-Riga in Una Riga (se possibile):</b> Per variabili categoriali a due categorie (fattore/ordinali) o riepiloghi singoli di variabili numeriche o di data, \npotrai ridurre le righe in modo che tutti i nomi delle variabili e le statistiche appaiano in una sola riga.  I riepiloghi per l'ultima categoria per ciascuna variabile categoriale verranno mostrati. \nQualsiasi variabile per la quale non è possibile ridurre prenderà più righe.  Attivare/disattivare questa opzione può essere fatto per ciascun tipo di variabile separatamente.\n<br/><br/>\n<b>Usa l'Ultimo Livello nell'Etichetta delle Variabili Categoriali:</b> Per tabelle semplificate, questo include l'ultimo livello delle variabili fattoriali/ordinali nell'etichetta della riga.\n<br/><br/>\n<b>Livello di Confidenza:</b> Questo imposta il livello di confidenza degli intervalli di confidenza.\n<br/><br/>\n<b>Opzioni di Test Statistico</b>\n<br/><br/>\n<b>Test Statistici:</b> Le simulazioni di Pearson e Fisher forniscono la possibilità di ottenere p-value simulati per i test chi-quadrato di Pearson e \nper i test Esatti di Fisher.  Questa procedura crea simulazioni Monte Carlo il numero specificato di volte (Numero di Simulazioni).  Questo può essere utile nei casi in cui i calcoli standard, \nsoprattutto per il test Esatto di Fisher, risultano in errori di memoria del computer.\n<br/><br/>\n<b>Nota a piè di pagina sui Nomi dei Test:</b> se includere o meno note a piè di pagina sui p-value che elencano i test statistici effettuati per ciascuna variabile\n<br/><br/>\n<b>Opzioni Statistiche Numeriche:</b>\n<br/>statistiche che verranno mostrate per le variabili numeriche\n<br/><br/>\n<b>Opzioni Statistiche Categoriali:</b> \n<br/>statistiche che verranno mostrate sia per fattori nominali che ordinati\n<br/><br/>\n<b>Statistiche per le Date:</b>\n<br/>statistiche che verranno mostrate per le variabili di data\n<br/><br/>\n<b>Nota:</b> Se desideri riassumere una variabile di un tipo specifico, è consigliabile selezionare almeno una statistica in quella categoria che non sia \"Numero Mancante, se presente\".  Se \"Numero Mancante, se presente\" è l'unica opzione selezionata e nessuna variabile ha un valore mancante, allora si verificherà un errore. \n<br/><br/>\n<b>Pacchetti R Richiesti:</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
  }
}