{
  "title": "Quantili Uniformi",
  "navigation": "Quantili Uniformi",
  "prob": "Inserisci le probabilità separate da una virgola. Esempio: 0.3,0.2,0.5",
  "min": "Minimo",
  "max": "Massimo",
  "labelSig": "Livello di significatività",
  "lowtail": "Coda inferiore",
  "uptail": "Coda superiore",
  "help": {
    "title": "Quantili Uniformi",
    "r_help": "help(qunif, package=stats)",
    "body": "\n            ​​\n            <b>Descrizione</b>\n            <br/>\n            Queste funzioni forniscono informazioni sulla distribuzione uniforme nell'intervallo da min a max. dunif fornisce la densità, punif fornisce la funzione di distribuzione, qunif fornisce la funzione quantile e runif genera deviazioni casuali.\n            <br/>\n            <b>Utilizzo</b>\n            <br/>\n            <code>\n                dunif(x, min = 0, max = 1, log = FALSE)\n                <br/>\n                punif(q, min = 0, max = 1, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qunif(p, min = 0, max = 1, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                runif(n, min = 0, max = 1)\n                <br/>\n            </code>\n            <br/>\n            <b>Argomenti</b>\n            <br/>\n            <ul>\n                <li>x, q : vettore di quantili.</li>\n                \n                \n                <li>p : vettore di probabilità.</li>\n                \n                \n                <li>n : numero di osservazioni. Se la lunghezza(n) > 1, la lunghezza è presa come quella richiesta.</li>\n                \n                \n                <li>min, max : limiti inferiori e superiori della distribuzione. Devono essere finiti.</li>\n                \n                \n                <li>log, log.p : logico; se TRUE, le probabilità p sono date come log(p).</li>\n                \n                \n                <li>lower.tail : logico; se TRUE (predefinito), le probabilità sono P[X ≤ x], altrimenti, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Dettagli</b>\n            <br/>\n            Se min o max non sono specificati, assumono i valori predefiniti di 0 e 1 rispettivamente.\n            <br/>\n            La distribuzione uniforme ha densità\n            <br/>\n            <code>f(x) = 1/(max-min)</code>\n            <br/>\n            per min ≤ x ≤ max.\n            <br/>\n            Nel caso di u := min == max, si assume il caso limite di X == u, sebbene non ci sia densità in quel caso e dunif restituirà NaN (la condizione di errore).\n            <br/>\n            runif non genererà né i valori estremi a meno che max = min o max-min sia piccolo rispetto a min, e in particolare non per gli argomenti predefiniti.\n            <br/>\n            <br/><b>Valore</b>\n            <br/>\n            dunif fornisce la densità, punif fornisce la funzione di distribuzione, qunif fornisce la funzione quantile e runif genera deviazioni casuali.\n            <br/>\n            La lunghezza del risultato è determinata da n per runif, ed è il massimo delle lunghezze degli argomenti numerici per le altre funzioni.\n            <br/>\n            Gli argomenti numerici diversi da n vengono riciclati alla lunghezza del risultato. Solo i primi elementi degli argomenti logici vengono utilizzati.\n            <br/>\n            <br/><b>Nota</b>\n            <br/>\n            Le caratteristiche dell'output dei generatori di numeri pseudo-casuali (come precisione e periodicità) variano ampiamente. Vedi .Random.seed per ulteriori informazioni sugli algoritmi di generazione di numeri casuali di R.            \n      "
  }
}