{
  "title": "Test di Varianza, F-test",
  "navigation": "Test di Varianza, due campioni",
  "tvarbox1": "Variabile di risposta",
  "tvarbox2": "Variabile fattore, con solo due livelli",
  "label1": "Ipotesi alternativa",
  "test1": "Differenza != 1",
  "test2": "Differenza > 1",
  "test3": "Differenza < 1",
  "txtbox1": "Livello di confidenza",
  "help": {
    "title": "Test di Varianza, F-test",
    "r_help": "help(var.test, package=stats)",
    "body": "\n                <b>Descrizione</b></br>\n                Esegue un test F per confrontare le varianze di due campioni provenienti da popolazioni normali.\n                <br/>\n                <b>Utilizzo</b>\n                <br/>\n                <code> \n                var.test(x, ...)</br>\n                ## Metodo S3 predefinito:</br>\n                var.test(x, y, ratio = 1,\n                         alternative = c(\"two.sided\", \"less\", \"greater\"),\n                         conf.level = 0.95, ...)</br>\n                ## Metodo S3 per la classe 'formula'</br>\n                var.test(formula, data, subset, na.action, ...)\n                </code> <br/>\n                <b>Argomenti</b><br/>\n                <ul>\n                <li>\n                x, y: vettori numerici di valori dei dati, o oggetti di modelli lineari adattati (che ereditano dalla classe \"lm\").\n                </li>\n                <li>\n                ratio: il rapporto ipotizzato delle varianze della popolazione di x e y.\n                </li>\n                <li>\n                alternative: una stringa di caratteri che specifica l'ipotesi alternativa, deve essere una delle \"two.sided\" (predefinito), \"greater\" o \"less\". Puoi specificare solo la lettera iniziale.\n                </li>\n                <li>\n                conf.level: livello di confidenza per l'intervallo di confidenza restituito.\n                </li>\n                <li>\n                formula: una formula della forma lhs ~ rhs dove lhs è una variabile numerica che fornisce i valori dei dati e rhs è un fattore con due livelli che fornisce i gruppi corrispondenti.\n                </li>\n                <li>\n                data: una matrice opzionale o un data frame (o simile: vedi model.frame) contenente le variabili nella formula formula. Per impostazione predefinita, le variabili vengono prese dall'ambiente(formula).\n                </li>\n                <li>\n                subset: un vettore opzionale che specifica un sottoinsieme di osservazioni da utilizzare.\n                </li>\n                <li>\n                na.action: una funzione che indica cosa dovrebbe accadere quando i dati contengono NAs. Per impostazione predefinita è getOption(\"na.action\").\n                </li>\n                <li>\n                ...: ulteriori argomenti da passare a o da metodi.\n                </li>\n                </ul>\n                <b>Dettagli</b></br>\n                L'ipotesi nulla è che il rapporto delle varianze delle popolazioni da cui sono stati estratti x e y, o nei dati a cui sono stati adattati i modelli lineari x e y, sia uguale a ratio.</br>\n                <b>Valore</b><br/>\n                Un elenco con classe \"htest\" contenente i seguenti componenti:\n                statistic: il valore della statistica del test F.\n                parameter: i gradi di libertà della distribuzione F della statistica del test.\n                p.value: il valore p del test.\n                conf.int: un intervallo di confidenza per il rapporto delle varianze della popolazione.\n                estimate: il rapporto delle varianze campionarie di x e y.\n                null.value: il rapporto delle varianze della popolazione sotto l'ipotesi nulla.\n                alternative: una stringa di caratteri che descrive l'ipotesi alternativa.\n                method: la stringa di caratteri \"Test F per confrontare due varianze\".\n                data.name: una stringa di caratteri che fornisce i nomi dei dati.\n                <b>Esempi</b><br/>\n                <code>\n                Dataframe <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))<br/>\n                Result_Variance_Test = var.test( Age ~Gender,alternative='two.sided',conf.level=0.95,data=Dataframe )\n                </code> <br/>\n                <b>Pacchetto</b></br>\n                stats</br>\n                <b>Aiuto</b></br>\n                help(var.test, package=stats)\n    "
  }
}