{
  "title": "Fattori di Inflazione della Varianza",
  "navigation": "VIF",
  "modelselector1": "Seleziona un modello di una delle seguenti classi (classe tra parentesi) Modello lineare (lm), Modelli lineari generalizzati (glm), Regressione logistica ordinata o Probit (polr), Modelli log-lineari multinomiali (multinom), Sopravvivenza (coxph)",
  "help": {
    "title": "Fattori di Inflazione della Varianza",
    "r_help": "help(vif, package='car')",
    "body": "\n                <b>Descrizione</b></br>\nCalcola i fattori di inflazione della varianza e i fattori di inflazione della varianza generalizzati per modelli lineari, modelli lineari generalizzati e altri modelli.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code> \nvif(mod, ...)\n## Metodo S3 predefinito:\nvif(mod, ...)\n## Metodo S3 per la classe 'merMod'\nvif(mod, ...)\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nmod: per il metodo predefinito, un oggetto che risponde a coef, vcov e model.matrix, come un oggetto lm o glm.\n</li>\n<li>\n... non utilizzato.\n</li>\n</ul>\n<b>Dettagli</b></br>\nSe tutti i termini in un modello lineare non pesato hanno 1 df, allora vengono calcolati i normali fattori di inflazione della varianza.</br>\nSe uno qualsiasi dei termini in un modello lineare non pesato ha più di 1 df, allora vengono calcolati i fattori di inflazione della varianza generalizzati (Fox e Monette, 1992). Questi sono interpretabili come l'inflazione della dimensione dell'ellisse di confidenza o ellissoide per i coefficienti del termine in confronto a ciò che si otterrebbe per dati ortogonali.</br>\nI vifs generalizzati sono invarianti rispetto alla codifica dei termini nel modello (finché il sottospazio delle colonne della matrice del modello relative a ciascun termine è invariato). Per regolare la dimensione dell'ellissoide di confidenza, la funzione stampa anche GVIF^[1/(2*df)] dove df è il numero di gradi di libertà associato al termine.</br>\nAttraverso una ulteriore generalizzazione, l'implementazione qui è applicabile anche ad altri tipi di modelli, in particolare modelli lineari pesati, modelli lineari generalizzati e modelli a effetti misti.</br>\n<b>Valore</b><br/>\nUn vettore di vifs, o una matrice contenente una riga per ciascun termine nel modello, e colonne per il GVIF, df e GVIF^[1/(2*df)].<br/>\n<b>Esempi</b><br/>\n<code> \n## Un esempio ridicolo...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>Pacchetto</b></br>\ncar</br>\n<b>Aiuto</b></br>\nPer aiuto dettagliato clicca sull'icona R nell'angolo in alto a destra di questo overlay di dialogo o esegui il seguente comando nell'editor di sintassi R help(vif, package=\"car\")\n                "
  }
}