{
  "title": "Test di Wilcoxon, campioni indipendenti",
  "navigation": "Test di Wilcoxon, Campioni Indipendenti",
  "tvarbox1": "Variabile di Risposta (uno)",
  "tvarbox2": "Fattore (uno) con solo due livelli",
  "label1": "Ipotesi Alternativa",
  "twosided": "Gruppo1 - Gruppo2 != mu",
  "greater": "Gruppo1 - Gruppo2 > mu",
  "less": "Gruppo1 - Gruppo2 < mu",
  "label2": "Metodo di Test",
  "default": "Predefinito",
  "exact": "Esatto",
  "normal": "Approssimazione Normale",
  "contingency": "Approssimazione Normale (correzione di continuità)",
  "textbox1": "Intervallo di confidenza",
  "textbox2": "Ipotesi nulla (mu)",
  "help": {
    "title": "Test di Wilcoxon, campioni indipendenti",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>Descrizione</b></br>\nEsegue test di Wilcoxon su uno e due campioni su vettori di dati; quest'ultimo è noto anche come test di 'Mann-Whitney'.\n<br/>\n<b>Utilizzo</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Metodo S3 predefinito:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## Metodo S3 per classe 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Argomenti</b><br/>\n<ul>\n<li>\nx: vettore numerico di valori di dati. I valori non finiti (ad es., infiniti o mancanti) saranno omessi.\n</li>\n<li>\ny: un vettore numerico opzionale di valori di dati: come per x, i valori non finiti saranno omessi.\n</li>\n<li>\nalternative: una stringa carattere che specifica l'ipotesi alternativa, deve essere una delle \"two.sided\" (predefinito), \"greater\" o \"less\". Puoi specificare solo la lettera iniziale.\n</li>\n<li>\nmu: un numero che specifica un parametro opzionale utilizzato per formare l'ipotesi nulla. Vedi 'Dettagli'.\n</li>\n<li>\npaired: un logico che indica se si desidera un test abbinato.\n</li>\n<li>\nexact: un logico che indica se deve essere calcolato un p-value esatto.\n</li>\n<li>\ncorrect: un logico che indica se applicare la correzione di continuità nell'approssimazione normale per il p-value.\n</li>\n<li>\nconf.int: un logico che indica se deve essere calcolato un intervallo di confidenza.\n</li>\n<li>\nconf.level: livello di confidenza dell'intervallo.\n</li>\n<li>\nformula: una formula della forma lhs ~ rhs dove lhs è una variabile numerica che fornisce i valori dei dati e rhs è un fattore con due livelli che fornisce i gruppi corrispondenti.\n</li>\n<li>\ndata: una matrice o un data frame opzionale (o simile: vedi model.frame) contenente le variabili nella formula formula. Per impostazione predefinita, le variabili vengono prese dall'ambiente(formula).\n</li>\n<li>\nsubset: un vettore opzionale che specifica un sottoinsieme di osservazioni da utilizzare.\n</li>\n<li>\nna.action: una funzione che indica cosa dovrebbe accadere quando i dati contengono NAs. Predefinito a getOption(\"na.action\").\n</li>\n<li>\n...: ulteriori argomenti da passare a o da metodi.\n</li>\n</ul>\n<b>Dettagli</b></br>\nL'interfaccia della formula è applicabile solo per i test a 2 campioni.</br>\nSe viene fornito solo x, o se sia x che y sono forniti e paired è TRUE, viene eseguito un test di rango firmato di Wilcoxon dell'ipotesi nulla che la distribuzione di x (nel caso di un campione) o di x - y (nel caso di due campioni abbinati) sia simmetrica rispetto a mu.</br>\nAltrimenti, se sia x che y sono forniti e paired è FALSE, viene eseguito un test di somma di rango di Wilcoxon (equivalente al test di Mann-Whitney: vedi la Nota). In questo caso, l'ipotesi nulla è che le distribuzioni di x e y differiscano per uno spostamento di posizione di mu e l'alternativa è che differiscano per un altro spostamento di posizione (e l'alternativa unilaterale \"greater\" è che x sia spostato a destra di y).</br>\nPer impostazione predefinita (se exact non è specificato), viene calcolato un p-value esatto se i campioni contengono meno di 50 valori finiti e non ci sono legami. Altrimenti, viene utilizzata un'approssimazione normale.</br>\nFacoltativamente (se l'argomento conf.int è vero), viene calcolato un intervallo di confidenza non parametrico e un estimatore per la pseudomediana (caso di un campione) o per la differenza dei parametri di posizione x-y. (La pseudomediana di una distribuzione F è la mediana della distribuzione di (u+v)/2, dove u e v sono indipendenti, ciascuno con distribuzione F. Se F è simmetrica, allora la pseudomediana e la mediana coincidono. Vedi Hollander & Wolfe (1973), pagina 34.) Nota che nel caso di due campioni l'estimatore per la differenza nei parametri di posizione non stima la differenza nelle mediane (una comune misconcezione) ma piuttosto la mediana della differenza tra un campione da x e un campione da y.</br>\nSe sono disponibili p-value esatti, un intervallo di confidenza esatto è ottenuto dall'algoritmo descritto in Bauer (1972), e viene impiegato l'estimatore di Hodges-Lehmann. Altrimenti, l'intervallo di confidenza e la stima puntuale restituiti si basano su approssimazioni normali. Queste sono corrette per continuità per l'intervallo ma non per la stima (poiché la correzione dipende dall'alternativa).</br>\nCon campioni piccoli potrebbe non essere possibile raggiungere coperture di intervallo di confidenza molto elevate. Se ciò accade, verrà fornito un avviso e un intervallo con copertura inferiore sarà sostituito.</br>\n<b>Valore</b><br/>\nUna lista con classe \"htest\" contenente i seguenti componenti:\nstatistic: il valore della statistica del test con un nome che la descrive.</br>\nparameter: il/i parametro/i per la distribuzione esatta della statistica del test.</br>\np.value: il p-value per il test.</br>\nnull.value: il parametro di posizione mu.</br>\nalternative: una stringa carattere che descrive l'ipotesi alternativa.</br>\nmethod: il tipo di test applicato.</br>\ndata.name: una stringa carattere che fornisce i nomi dei dati.</br>\nconf.int: un intervallo di confidenza per il parametro di posizione. (Presente solo se l'argomento conf.int = TRUE.)</br>\nestimate: un'estimazione del parametro di posizione. (Presente solo se l'argomento conf.int = TRUE.)</br>\n<b>Pacchetto</b></br>\nstats</br>\n<b>Aiuto</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}