{
  "title": "ANOVA, unidimensionnelle avec blocs",
  "navigation": "ANOVA, 1 voie avec blocs",
  "tvarbox1": "Variable de réponse (une)",
  "tvarbox2": "Effet fixe",
  "blockVar": "Variable(s) de blocage",
  "chk1": "Histogramme des résidus",
  "chk2": "Analyse post-hoc",
  "help": {
    "title": "ANOVA, unidimensionnelle avec blocs",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>Description</b></br>\nTables ANOVA pour divers modèles statistiques​\nCalcule des tables d'analyse de variance de type-II ou type-III pour des objets de modèle produits par lm, glm, multinom (dans le package nnet), polr (dans le package MASS), coxph (dans le package survival), coxme (dans le package coxme), svyglm (dans le package survey), rlm (dans le package MASS), lmer dans le package lme4, lme dans le package nlme, et (par la méthode par défaut) pour la plupart des modèles avec un prédicteur linéaire et des coefficients asymptotiquement normaux (voir les détails ci-dessous). Pour les modèles linéaires, des tests F sont calculés ; pour les modèles linéaires généralisés, des tests du rapport de vraisemblance, des tests du chi carré de Wald, ou des tests F sont calculés ; pour les modèles logit multinomiaux et logit à cotes proportionnelles, des tests du rapport de vraisemblance sont calculés. Diverses statistiques de test sont fournies pour les modèles linéaires multivariés produits par lm ou manova. Des tests du rapport de vraisemblance partiels ou des tests de Wald sont fournis pour les modèles de Cox. Des tests du chi carré de Wald sont fournis pour les effets fixes dans les modèles mixtes linéaires et linéaires généralisés. Des tests du chi carré de Wald ou des tests F sont fournis dans le cas par défaut.​\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nmod: lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm, ou autre objet de modèle approprié.​\n</li>\n<li>\ntype: type de test, \"II\", \"III\", 2, ou 3.​\n</li>\n</ul>\n<b>Détails</b></br>\nLes désignations \"type-II\" et \"type-III\" sont empruntées à SAS, mais les définitions utilisées ici ne correspondent pas précisément à celles employées par SAS. Les tests de type-II sont calculés selon le principe de marginalité, testant chaque terme après tous les autres, sauf en ignorant les parents de plus haut ordre du terme ; les tests dits de type-III violent la marginalité, testant chaque terme dans le modèle après tous les autres. Cette définition des tests de type-II correspond aux tests produits par SAS pour les modèles d'analyse de variance, où tous les prédicteurs sont des facteurs, mais pas plus généralement (c'est-à-dire, lorsque des prédicteurs quantitatifs sont présents). Soyez très prudent dans la formulation du modèle pour les tests de type-III, sinon les hypothèses testées n'auront pas de sens.​</br>\nTels qu'ils sont mis en œuvre ici, les tests de Wald de type-II sont une généralisation des hypothèses linéaires utilisées pour générer ces tests dans les modèles linéaires.​</br>\nPour les tests pour les modèles linéaires, les modèles linéaires multivariés, et les tests de Wald pour les modèles linéaires généralisés, les modèles de Cox, les modèles mixtes, les modèles linéaires généralisés ajustés aux données d'enquête, et dans le cas par défaut, Anova trouve les statistiques de test sans réajuster le modèle. La méthode svyglm appelle simplement la méthode par défaut et peut donc prendre les mêmes arguments.​</br>\n<b>Valeur</b><br/>\nUn objet de classe \"anova\", ou \"Anova.mlm\", qui est généralement imprimé. Pour les objets de classe \"Anova.mlm\", il existe également une méthode de résumé, qui fournit beaucoup plus de détails que la méthode d'impression sur le MANOVA, y compris des tests F univariés traditionnels avec des corrections de Greenhouse-Geisser et Huynh-Feldt.​​</br>\n<b>Package</b></br>\nAnova</br>\n<b>Aide</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>Description</b></br>\nTests de séparation des moyennes post-hoc. Pour effectuer des tests de séparation des moyennes post-hoc pour chaque variable de facteur d'effet principal, nous utiliserons le package emmeans. Le modèle linéaire considéré est appelé modèle, créé par la fonction lm ci-dessus.  \n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>Package</b></br>\nFSA;car;emmeans;ggplot2;multcomp</br>\n<b>Aide</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
  }
}