{
  "title": "ANOVA & Test du Rapport de Vraisemblance",
  "navigation": "ANOVA & Test du Rapport de Vraisemblance",
  "label1": "L'ANOVA est effectuée pour des modèles avec les classes suivantes (classes R entre parenthèses) Modèles linéaires (lm), Modèles linéaires généralisés (glm), Modèle log-linéaire binomial négatif (negbin), Modèle linéaire utilisant les moindres carrés généralisés (gls), Modèle de régression de survie (survreg), Modèle de risque proportionnel (coxph), Régression Loess (loess)",
  "label2": "**REMARQUE : Le test de vraisemblance n'est pas pris en charge pour les modèles créés via l'Optimisation de Modèle (classe train),",
  "modelselector1": "Sélectionner un modèle",
  "help": {
    "title": "ANOVA & Test du Rapport de Vraisemblance",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>Description</b></br>\nTables ANOVA : Calcule les tables d'analyse de variance et effectue des tests de rapport de vraisemblance pour un objet de modèle ajusté. Pour les modèles à effets mixtes, la table de type ANOVA pour les effets aléatoires est affichée. \n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject : un objet contenant les résultats retournés par une fonction d'ajustement de modèle (par exemple, lm ou glm).\n</li>\n</ul>\n<b>Valeur</b><br/>\nCette fonction (générique) retourne un objet de classe anova. Ces objets représentent des tables d'analyse de variance et d'analyse de déviance. Lorsqu'un seul argument est donné, il produit une table qui teste si les termes du modèle sont significatifs. Lorsqu'une séquence d'objets est donnée, anova teste les modèles les uns contre les autres dans l'ordre spécifié.<br/>\nLa méthode d'impression pour les objets anova imprime des tables sous une forme « jolie ».<br/>\n<b>Avertissement</b><br/>\nLa comparaison entre deux modèles ou plus ne sera valide que s'ils sont ajustés sur le même ensemble de données. Cela peut poser problème s'il y a des valeurs manquantes et que l'action par défaut de R est na.action = na.omit.<br/>\n<b>Paquet</b></br>\nstats</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R help(anova,package='stats')</br></br>\n<b>Description</b></br>\nTest du Rapport de Vraisemblance de Modèles Imbriqués : lrtest est une fonction générique pour effectuer des tests de rapport de vraisemblance. La méthode par défaut peut être utilisée pour comparer des modèles linéaires (généralisés) imbriqués (voir les détails ci-dessous).\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Méthode par défaut S3 :<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Méthode S3 pour la classe 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject : un objet. Voir ci-dessous pour les détails.\n</li>\n<li>\n... : spécifications supplémentaires d'objets passées aux méthodes. Voir ci-dessous pour les détails.\n</li>\n<li>\nname : une fonction pour extraire un nom/description approprié d'un objet de modèle ajusté. Par défaut, le nom est interrogé en appelant formula.\n</li>\n<li>\ndata : un cadre de données contenant les variables dans le modèle.\n</li>\n</ul>\n<b>Détails</b></br>\nlrtest est destiné à être une fonction générique pour les comparaisons de modèles via des tests de rapport de vraisemblance asymptotiques. La méthode par défaut compare consécutivement l'objet de modèle ajusté avec les modèles passés dans .... Au lieu de passer les objets de modèle ajustés dans ..., plusieurs autres spécifications sont possibles. Le mécanisme de mise à jour est le même que pour waldtest : les modèles dans ... peuvent être spécifiés comme des entiers, des caractères (tous deux pour les termes qui devraient être éliminés du modèle précédent), des formules de mise à jour ou des objets de modèle ajustés. Sauf pour le dernier cas, l'existence d'une méthode de mise à jour est supposée. Voir waldtest pour les détails.<br/>\nEnsuite, un test de rapport de vraisemblance asymptotique pour chaque deux modèles consécutifs est effectué : Deux fois la différence des log-vraisemblances (telles que dérivées par les méthodes logLik) est comparée à une distribution Chi-carré.<br/>\nLa méthode \"formula\" ajuste d'abord un lm puis appelle la méthode par défaut.<br/>\n<b>Valeur</b><br/>\nUn objet de classe \"anova\" qui contient la log-vraisemblance, les degrés de liberté, la différence des degrés de liberté, la statistique du test de rapport de vraisemblance Chi-carré et la valeur p correspondante.\n<b>Exemples</b><br/>\n<code> \n## avec des données de Greene (1993) :<br/>\n## charger les données et calculer les décalages<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## diverses spécifications équivalentes du test LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>Description</b></br>\nTableau de type ANOVA pour les Effets Aléatoires : Calcule un tableau de type ANOVA avec des tests des termes d'effets aléatoires dans le modèle. Chaque terme d'effet aléatoire est réduit ou supprimé et des tests de rapport de vraisemblance des réductions de modèle sont présentés sous une forme similaire à celle de drop1. rand est un alias pour ranova.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nmodel : un modèle à effets mixtes linéaire ajusté avec lmer() (héritant de la classe lmerMod).\n</li>\n<li>\nreduce.terms : si TRUE (par défaut) les termes d'effets aléatoires sont réduits (si possible). Si FALSE, les termes d'effets aléatoires sont simplement supprimés.\n</li>\n</ul>\n<b>Détails</b></br>\nSi le modèle est ajusté avec REML, les tests sont des tests de rapport de vraisemblance REML.<br/>\nUn terme d'effet aléatoire de la forme (f1 + f2 | gr) est réduit à des termes de la forme (f2 | gr) et (f1 | gr) et ces modèles réduits sont comparés au modèle original. Si reduce.terms est FALSE (f1 + f2 | gr) est supprimé à la place.<br/>\nUn terme d'effet aléatoire de la forme (f1 | gr) est réduit à (1 | gr) (à moins que reduce.terms soit FALSE).<br/>\nUn terme d'effet aléatoire de la forme (1 | gr) n'est pas réduit mais simplement supprimé.<br/>\nUn terme d'effet aléatoire de la forme (0 + f1 | gr) ou (-1 + f1 | gr) est réduit (si reduce.terms = TRUE) à (1 | gr).<br/>\nUn terme d'effet aléatoire de la forme (1 | gr1/gr2) est automatiquement développé en deux termes : (1 | gr2:gr1) et (1 | gr1) en utilisant findbars.<br/>\nDans cette exposition, il est indifférent que f1 et f2 soient des facteurs ou des variables continues.<br/>\n<b>Valeur</b><br/>\nUn tableau de type ANOVA avec des suppressions de termes uniques d'effets aléatoires héritant de la classe anova et un data.frame avec les colonnes :</br>\nnpar : nombre de paramètres du modèle.</br>\nlogLik : la log-vraisemblance pour le modèle. Notez que c'est la logLik REML si le modèle est ajusté avec REML.</br>\nAIC : l'AIC pour le modèle évalué comme -2*(logLik - npar). Plus petit est mieux.</br>\nLRT : la statistique du test de rapport de vraisemblance ; deux fois la différence de log-vraisemblance, qui est asymptotiquement distribuée selon le chi-carré.</br>\nDf : degrés de liberté pour le test de rapport de vraisemblance : la différence dans le nombre de paramètres du modèle.</br>\nPr(>Chisq) : la valeur p.</br>\n<b>Avertissement</b></br>\nDans certains cas, des tests de modèles non imbriqués peuvent être générés. Un exemple est lorsque (0 + poly(x, 2) | gr) est réduit (le défaut) à (1 | gr). À notre connaissance, les comparaisons de modèles non imbriqués ne sont générées que dans des cas qui sont de toute façon des absurdités statistiques (comme dans cet exemple où l'intercept aléatoire est supprimé).</br>\nRemarque : Notez qu'ANOVA peut être utilisé pour comparer deux modèles et sera souvent capable de produire les mêmes tests que ranova. Cependant, ce n'est pas toujours le cas comme illustré dans les exemples.</br>\n<b>Exemples</b><br/>\n<code> \n# Tester la réduction de (Days | Subject) à (1 | Subject) :<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # test de 2 df<br/>\n# Ce test peut également être réalisé avec anova() :<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# Illustrer l'argument reduce.test :<br/>\n# Tester la suppression de (Days | Subject) :<br/>\nranova(fm1, reduce.terms = FALSE) # test de 3 df<br/>\n# La statistique du test de rapport de vraisemblance est dans ce cas :<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() n'est pas toujours capable d'effectuer les mêmes tests que ranova(),<br/>\n# par exemple :<br/>\nanova(fm1, fm3, refit=FALSE) # compare REML avec ML et ne devrait pas être utilisé<br/>\nanova(fm1, fm3, refit=TRUE) # est un test des ajustements ML et n'est pas ce que nous recherchons<br/>\n# Notez également que le fit lmer doit venir en premier - pas un fit lm :<br/>\n# anova(fm3, fm1) # ne fonctionne pas et donne une erreur<br/>\n# ranova() peut ne pas générer tous les tests pertinents :<br/>\n# Pour le modèle suivant, ranova() indique que nous ne devrions pas réduire<br/>\n# (TVset | Assessor) :<br/>\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Assessor), data=TVbo)<br/>\nranova(fm)<br/>\n# Cependant, un modèle plus approprié est :<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Assessor), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm et fm2 ont essentiellement le même ajustement aux données mais fm utilise 5 paramètres de plus que fm.<br/>\n</code> <br/>\n<b>Paquet</b></br>\nlmerTest</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R help(ranova, package ='lmerTest')\n                "
  }
}