{
  "title": "Graphique à barres",
  "navigation": "Graphique à barres",
  "optionsLabels": "Options pour les étiquettes",
  "suppressLabels": "Supprimer toutes les étiquettes pour les comptes et pourcentages",
  "suppressThreshold": "Supprimer les étiquettes pour les comptes et pourcentages en dessous du seuil spécifié",
  "label1": "Cliquez sur l'onglet ci-dessous pour sélectionner le compte ou la moyenne. Lorsque le compte est sélectionné, une variable Y est optionnelle. Lorsque le compte est sélectionné et qu'aucune variable Y n'est spécifiée, les comptes de la variable X sont affichés. Lorsque le compte est spécifié et qu'une variable Y est spécifiée, les valeurs de la variable Y sont additionnées. Lorsque la moyenne est sélectionnée, vous devez sélectionner une variable Y et une variable X. Les moyennes sont calculées pour la ou les variables Y.",
  "x": "Variable X",
  "y": "Variable(s) Y, spécifiez une variable numérique",
  "fill": "Spécifiez une variable factorielle pour remplir les barres.",
  "dropna": "Supprimer les valeurs manquantes",
    "bottomlbl": "Sélectionner un diagramme à barres ",
    "meanlbl": "Moyenne",
    "countlbl": " Compte",  
  "fill1": "Sélectionnez une couleur pour les barres. Remarque : Ceci est ignoré lorsqu'une variable pour remplir les barres est spécifiée",
  "barType": "Type de graphique à barres",
  "stackedBar": "Graphique à barres empilées",
  "sideBySide": "Afficher les groupes côte à côte",
  "fillPercent": "Remplir les barres",
  "errorBarOptions": "Barres d'erreur",
  "noErrBars": "Pas de barres d'erreur",
  "stderr": "Erreurs standards",
  "stddev": "Écart type",
  "cilevel": "Spécifiez le niveau de confiance :",
  "confidenceInterval": "Niveau de confiance :",
  "alpha": "Opacité (0-1)",
  "flipBox": "Inverser l'axe",
  "specify_a_title": "Entrez un titre",
  "x_title": "Étiquette de l'axe X",
  "y_title": "Étiquette de l'axe Y",
  "hide": "Afficher seulement le haut des barres d'erreur (doit régler l'opacité à 1)",
  "Facetrow": "Ligne de facette",
  "Facetcolumn": "Colonne de facette",
  "Facetwrap": "Enveloppe de facette",
  "Facetscale": "Échelle de facette",
  "relFreq": "Fréquences relatives",
  "facets_lbl" : "Facettes",
  "help": {
    "title": "Aide sur le graphique à barres",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Un graphique à barres est un graphique qui présente des données groupées avec des barres rectangulaires dont les longueurs sont proportionnelles aux valeurs qu'elles représentent. Les barres peuvent être tracées verticalement ou horizontalement. Les barres peuvent être regroupées par une variable factorielle optionnelle. Les groupes peuvent être empilés sur une seule barre ou affichés côte à côte. Des facettes peuvent être créées en spécifiant une variable factorielle. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y.\n        Vous pouvez créer un graphique à barres pour une seule variable factorielle, les barres représenteront les comptes de chaque niveau de la variable factorielle. Ici, la variable factorielle sera sur l'axe x, voir l'exemple ci-dessous. Lorsque la case à cocher des fréquences relatives est sélectionnée, nous montrons la fréquence relative au lieu des comptes sur l'axe y.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=1) +\n         labs(x =\"année\",y =\"Compte\",title= \"Graphique à barres pour l'axe X : année, axe Y : Compte\")\n        </code>\n        <br />\n        Vous pouvez créer un graphique à barres en plaçant une variable d'échelle/numerique sur l'axe y, et en remplissant les barres par une variable factorielle. La barre sera remplie en additionnant les valeurs de la variable y pour chaque niveau de la variable factorielle, voir l'exemple ci-dessous\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=1,stat=\"identity\") +\n         labs(y =\"poids\",fill =\"origine\",title= \"Graphique à barres pour l'axe X :, axe Y : poids, Remplissage : origine\")\n        </code>\n        <br />\n        Vous pouvez spécifier une variable x, une variable y et un remplissage. La barre est remplie par la somme des valeurs de la variable y pour chaque niveau de la variable x, groupée par le niveau de la variable spécifiée dans le remplissage.\n        Lorsque vous spécifiez plusieurs variables x, nous créons un graphique à barres séparé pour chaque variable x. \n        <br />\n        Utilisation :\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origine\",y = \"Compte\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Le jeu de données par défaut​\n        </li>\n        <li>\n        aes():    Générer des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géométries.​\n        </li>\n        <li>\n        x: Une variable factorielle/catégorique. La longueur de la barre correspond aux comptes de chaque niveau de la variable factorielle.​\n        </li>\n        <li>\n        fill: Une variable factorielle/catégorique optionnelle pour regrouper les comptes des niveaux dans x : (voir ci-dessus)​\n        </li>\n        <li>\n        geom_bar(): Crée le graphique à barres, position =”stack” empile les groupes sur une seule barre, position =”dodge” empile les groupes côte à côte, position =\"fill\" remplit la barre avec un pourcentage de chaque niveau de regroupement.​\n        </li>\n        <li>\n        Labs(): Change les étiquettes des axes et les titres de légende (c'est optionnel)​\n        </li>\n        <li>\n        facet_grid(): Dispose les panneaux dans une grille (c'est optionnel)​\n        </li>\n        <li>\n        theme_calc(): Spécifie le thème du calculateur (c'est optionnel)​\n        </li>\n        <li>\n        coord_flip(): Inverser l'axe (c'est optionnel)​\n        </li>\n        <li>\n        alpha: Contrôle l'opacité, prend des valeurs entre 0-1. 1 signifie pas d'opacité.\n        </li>\n        </ul>\n        Package: ggplot2,ggthemes​\n        <br />\n        Autre : Cliquez sur le bouton Aide R pour obtenir une aide R détaillée. Vous pouvez également entrer help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n        "
  }
}