{
  "title": "BIC",
  "navigation": "BIC",
  "modelselector1": "Sélectionnez un modèle parmi les classes suivantes (classe entre parenthèses) Modèle linéaire (lm) Modèles linéaires généralisés (glm) Régression logistique ordonnée ou Probit (polr) Modèles log-linéaires multinomiaux (multinom)",
  "help": {
    "title": "BIC",
    "r_help": "help(BIC,package='stats')",
    "body": "\n                <b>Description</b></br>\nFonction générique calculant le critère d'information d'Akaike pour un ou plusieurs objets de modèle ajustés pour lesquels une valeur de log-vraisemblance peut être obtenue, selon la formule -2*log-vraisemblance + k*npar, où npar représente le nombre de paramètres dans le modèle ajusté, et k = 2 pour le AIC habituel, ou k = log(n) (n étant le nombre d'observations) pour le BIC ou SBC (critère bayésien de Schwarz).\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nAIC(object, ..., k = 2)\nBIC(object, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject: un objet de modèle ajusté pour lequel il existe une méthode logLik pour extraire la log-vraisemblance correspondante, ou un objet héritant de la classe logLik.\n</li>\n<li>\n... éventuellement plus d'objets de modèle ajustés.\n</li>\n<li>\nk: numérique, la pénalité par paramètre à utiliser ; la valeur par défaut k = 2 est le AIC classique.\n</li>\n</ul>\n<b>Détails</b></br>\nLors de la comparaison de modèles ajustés par maximum de vraisemblance aux mêmes données, plus l'AIC ou le BIC est petit, meilleur est l'ajustement.\nLa théorie de l'AIC exige que la log-vraisemblance ait été maximisée : bien que l'AIC puisse être calculé pour des modèles non ajustés par maximum de vraisemblance, leurs valeurs AIC ne doivent pas être comparées.</br>\nDes exemples de modèles non « ajustés aux mêmes données » sont ceux où la réponse est transformée (les modèles de durée de vie accélérée sont ajustés aux log-temps) et où des tableaux de contingence ont été utilisés pour résumer les données.</br>\nCe sont des fonctions génériques (avec des génériques S4 définis dans le package stats4) : cependant, des méthodes doivent être définies pour la fonction de log-vraisemblance logLik plutôt que pour ces fonctions : l'action de leurs méthodes par défaut est d'appeler logLik sur tous les objets fournis et d'assembler les résultats. Notez que dans plusieurs cas courants, logLik ne retourne pas la valeur à la MLE : consultez sa page d'aide.</br>\nLa log-vraisemblance et donc l'AIC/BIC ne sont définis qu'à une constante additive près. Différentes constantes ont été conventionnellement utilisées à des fins différentes et donc extractAIC et AIC peuvent donner des valeurs différentes (et le font pour des modèles de classe \"lm\" : consultez l'aide pour extractAIC). Une attention particulière est nécessaire lors de la comparaison des ajustements de différentes classes (avec, par exemple, une comparaison d'un GLM de Poisson et de gamma étant sans signification puisque l'un a une réponse discrète, l'autre continue).</br>\nLe BIC est défini comme AIC(object, ..., k = log(nobs(object))). Cela nécessite que le nombre d'observations soit connu : la méthode par défaut cherche d'abord un attribut \"nobs\" sur la valeur de retour de la méthode logLik, puis essaie le générique nobs, et si aucun des deux ne réussit, retourne BIC comme NA.</br>\n<b>Valeur</b><br/>\nSi un seul objet est fourni, une valeur numérique avec l'AIC (ou BIC, ou ..., selon k) correspondant.\nSi plusieurs objets sont fournis, un data.frame avec des lignes correspondant aux objets et des colonnes représentant le nombre de paramètres dans le modèle (df) et l'AIC ou BIC.<br/>\n<b>Exemples</b><br/>\n<code> \nlm1 <- lm(Fertility ~ . , data = swiss)</br>\nAIC(lm1)</br>\nstopifnot(all.equal(AIC(lm1),<br/>\n                    AIC(logLik(lm1))))<br/>\nBIC(lm1)</br>\nlm2 <- update(lm1, . ~ . -Examination)</br>\nAIC(lm1, lm2)</br>\nBIC(lm1, lm2)</br>\n</code> <br/>\n<b>Package</b></br>\nstats</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette fenêtre de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R help(BIC,package='stats')\n                "
  }
}