{
  "title": "Risques Concurrentiels, un groupe",
  "navigation": "Risques Concurrentiels, un groupe",
  "timevar": "Temps jusqu'à l'événement ou censure",
  "eventvar": "Événements (0 = censure, 1 = événement 1, 2 = événement 2, ...)",
  "eventnum": "Code d'Événement",
  "singleeventchkbox": "Tracer pour un Événement Unique",
  "printallest": "Tableau d'Estimation Incluant Tous les Temps",
  "printspecest": "Tableau d'Estimation pour des Temps Spécifiques",
  "spectimes": "Spécifiez les temps comme time1, time2, time3, etc. ou comme seq(1,5,by=1)",
  "styleoptions": "Options de Style",
  "axisoptions": "Options d'Axe",
  "label12": "Cliquez sur le bouton ? en haut à droite de la boîte de dialogue pour des détails sur les ensembles de données d'exemple et le format de données pris en charge.",
  "titleboxall": "Titre du Graphique (graphique de tous les événements)",
  "titleboxsingle": "Titre du Graphique (graphique d'un événement unique)",
  "plottitlesizelabel": "Taille du Titre du Graphique (5-50)",
  "themedropdown": "Thème du Graphique",
  "label1": "Légende (graphique de tous les événements)",
  "legendpos": "Position",
  "legendtitle": "Titre",
  "eventlabels": "Étiquettes d'Événements (spécifiez les étiquettes séparées par des virgules dans l'ordre des codes d'événements : par ex. 'Événement 1', 'Événement 2', etc ; pas de code de censure)",
  "legendfontsize": "Taille des Étiquettes de Légende (5-50)",
  "label2": "Nombre à Risque",
  "natriskchkbox": "Inclure le Nombre à Risque",
  "risktableprop": "Hauteur du Tableau de Risque (0-1)",
  "risktablevaluesize": "Taille des Valeurs du Tableau de Risque (1-15)",
  "risktabletitlesize": "Taille du Titre du Tableau de Risque (5-50)",
  "risktableaxislabelsize": "Taille des Étiquettes d'Axe du Tableau de Risque (5-50)",
  "risktableticklabelsize": "Taille des Étiquettes de Tick du Tableau de Risque (5-50)",
  "risktableclean": "Supprimer les Axes et les Grilles du Tableau de Risque",
  "label3": "Options de Ligne",
  "linesize": "Taille (0-5)",
  "colorpalette": "Palette de Couleurs (graphique de tous les événements)",
  "linecolor": "Couleur (graphique d'un événement unique)",
  "label4": "Intervalle de Confiance",
  "cichkbox": "inclure IC à 95%",
  "labelblank": "",
  "cistyle": "Style",
  "citransparency": "Transparence (0-1)",
  "censorchkbox": "Inclure les Temps Censurés",
  "label5": "Axe d'Incidence",
  "incaxislabelall": "Étiquette (graphique de tous les événements)",
  "incaxislabelsingle": "Étiquette (graphique d'un événement unique)",
  "label6": "Échelle",
  "defbutton": "proportion",
  "pctbutton": "pourcentage",
  "label7": "Limites d'Axe et Incréments de Marque de Tick (0-1)",
  "incaxismin": "Minimum",
  "incaxismax": "Maximum",
  "incaxisinc": "Incrément",
  "label8": "Axe Temporel",
  "timeaxislabel": "Étiquette",
  "label9": "Limites d'Axe et Incréments de Marque de Tick",
  "timeaxismin": "Minimum",
  "timeaxismax": "Maximum",
  "timeaxisinc": "Incrément",
  "label10": "Remarque : Le maximum peut être spécifié sans que l'incrément soit spécifié. L'incrément ne peut pas être spécifié sans que le maximum soit spécifié.",
  "axislabelsize": "Taille de l'Étiquette d'Axe (5-50)",
  "ticklabelsize": "Taille de l'Étiquette de Marque de Tick d'Axe (5-50)",
  "help": {
    "title": "Risques Concurrentiels, Un Groupe",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n\t\t\tVoir l'ensemble de données d'exemple dans le répertoire d'installation, l'emplacement par défaut est à la lettre de lecteur:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\melanoma_upd.RData. La variable temps doit être saisie comme le temps jusqu'à l'événement ou la censure et la variable décès doit être saisie comme les Événements.<br/>\t\t\t\n            Cet ensemble de données est une version mise à jour de l'ensemble de données sur le mélanome dans le package MASS.\n            <br/>\n            <br/>\n            Un risque concurrent est un événement dont l'occurrence empêche l'occurrence de l'événement principal d'intérêt. Faire une analyse standard de Kaplan-Meier dans de tels cas est biaisé et surestime le risque d'événement. Cette boîte de dialogue est utilisée pour estimer le risque cumulatif d'avoir l'événement principal après le début du suivi pour cet événement (ou temps zéro), lorsque un ou plusieurs risques concurrents sont présents. La somme des incidences cumulatives pour chaque événement est égale à l'incidence cumulative pour tout événement. Les sujets doivent être à risque pour tous les événements à partir du temps zéro. Des graphiques d'incidence cumulée pour tous les événements (courbes séparées pour chaque événement sur le même graphique), et éventuellement pour un événement spécifique par lui-même, sont fournis. \n            <br/>\n            Une introduction au sujet des risques concurrents peut être trouvée dans \"Introduction à l'Analyse des Données de Survie en Présence de Risques Concurrents\" par Peter Austin, et al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Temps jusqu'à l'événement ou censure :</b> Pour chaque sujet, la durée jusqu'au premier événement, si un événement s'est produit, ou dernier suivi pour les événements, si aucun événement ne s'est produit.\n            <br/><br/>\n            <b>Événements :</b> Indicateur numérique de quel événement s'est produit (1=événement 1, 2=événement 2, etc.) ou quand aucun événement ne s'est produit (0=censure) pour chaque sujet\n            <br/><br/>\n            <b>Tracer pour un Événement Unique :</b> Si vous souhaitez tracer l'incidence cumulée pour un événement spécifique par lui-même. Le <b>Code d'Événement</b> correspond à l'événement qui sera tracé.\n            <br/><br/>\n            <b>Tableau d'Estimation Incluant Tous les Temps :</b> Option d'inclure un tableau listant les probabilités d'incidence cumulée et les intervalles de confiance à 95% pour chaque temps observé dans l'ensemble de données\n            <br/>\n            <br/>\n\t\t\t<b>Tableau d'Estimation pour des Temps Spécifiques :</b> Option d'inclure un tableau qui a les probabilités d'estimation de survie pour un ensemble de temps sélectionnés par l'utilisateur.\n\t\t\t<br/><br/>\n\t\t\t<b>Spécifiez les temps comme time1, time2, time3, etc. ou comme seq(1,5,by=1) :</b> Ce sont les temps spécifiques qui seront inclus dans le tableau pour des temps spécifiques. Ils peuvent être spécifiés individuellement avec des virgules, ou comme une séquence de valeurs uniformément espacées.\n\t\t\t<br/><br/>\n            Les tableaux sont sortis avec la taille de l'échantillon, le nombre de sujets avec chaque événement, le temps moyen restreint dans l'état, et le temps médian de suivi. Le temps médian de suivi est calculé en utilisant l'estimateur de Kaplan-Meier inverse, qui traite les véritables événements comme des observations censurées et les véritables observations censurées comme des événements. Ainsi, l'\"événement\" dans cet estimateur est \"suivre les sujets aussi longtemps que l'étude pourrait\".\n            <br/>\n            Un tableau d'estimations d'incidence cumulée est fourni à chaque temps observé dans l'ensemble de données, avec des intervalles de confiance à 95%. \n            <br/>\n            <br/>\n            <b>Packages R Requis :</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n            <br/>\n            <br/>\n            <br/>\n            <b>Options de Style</b>\n            <br/>\n            <br/>\n            <b>Titre du Graphique (graphique de tous les événements) :</b> Titre du graphique affichant tous les événements ; supprimez tout le texte pour pas de titre\n            <br/><br/>\n            <b>Titre du Graphique (graphique d'un événement unique) :</b> Titre du graphique affichant l'événement unique sélectionné ; supprimez tout le texte pour pas de titre\n\t\t\t<br/><br/>\n\t\t\t<b>Taille du Titre du Graphique :</b> Taille des titres du graphique.\n\t\t\t<br/><br/>\n            <b>Thème du Graphique :</b> Style général du graphique\n            <br/><br/>\n            <b>Options de Légende :</b>\n            <br/>\n            L'option <b>Position</b> contrôle l'emplacement de la légende (haut, bas, gauche, droite). Le <b>Titre</b> est le titre de la légende. Pour supprimer le titre, retirez tout le texte de la zone de texte. <b>Étiquettes d'Événements</b> sont utilisées pour montrer le texte pour chaque code d'événement numérique au lieu des codes. Si vous spécifiez des étiquettes, tous les événements doivent être étiquetés.\n\t\t\tL'option <b>Taille des Étiquettes de Légende</b> contrôle la taille de tout le texte contenu dans la légende.\n            <br/>\n            <br/>\n            <b>Nombre à Risque :</b>\n\t\t\t<br/>\n\t\t\tOptionnellement, inclure un tableau pour le nombre de sujets encore à risque au fil du temps en bas des graphiques. Le <b>Hauteur du Tableau de Risque</b> contrôle la proportion de la zone de traçage que le tableau occupera.\n\t\t\tLa <b>Taille des Valeurs du Tableau de Risque</b> contrôle la taille des nombres à risque. La <b>Taille du Titre du Tableau de Risque</b> contrôle la taille du titre pour le tableau du nombre à risque.\n\t\t\tLa <b>Taille de l'Étiquette d'Axe du Tableau de Risque</b> contrôle la taille des étiquettes d'axe. \n\t\t\tLa <b>Taille de l'Étiquette de Tick du Tableau de Risque</b> contrôle la taille des étiquettes de marque de tick. S'il est souhaité de supprimer tous les axes et les lignes de grille \n\t\t\tdu tableau du nombre à risque, l'option <b>Supprimer les Axes et les Grilles du Tableau de Risque</b> peut être cochée. Cela n'inclura que les nombres à risque dans le tableau.           \n            <br/><br/>\n            <b>Options de Ligne :</b>\n            <br/>\n            <b>Taille</b> contrôle l'épaisseur. Les options <b>Couleur</b> contrôlent la palette de couleurs utilisée pour les lignes dans le graphique de tous les événements et la couleur de la ligne dans le graphique d'un événement unique. Des schémas de couleurs imitant les revues scientifiques sont également fournis. On peut optionnellement inclure un intervalle de confiance à 95% pour les estimations dans un format <b>ribbon</b> (zone ombragée) ou <b>step</b> (ligne). <b>Transparence</b> contrôle à quel point le ruban est sombre et est ignoré lorsque l'option étape est sélectionnée.\n\t\t\t<br/><br/>\n\t\t\t<b>Inclure les Temps Censurés :</b> Les temps censurés (lorsque les sujets ne sont plus à risque pour les événements) peuvent être inclus comme un tapis près de l'axe temporel des deux graphiques. Cela est plus utile dans des ensembles de données plus petits ou dans des cas de petits nombres de sujets censurés.\n            <br/><br/><br/>\n\t\t\t<b>Options d'Axe</b>\n            <br/>\n            <br/>\n            L'option <b>Étiquette</b> spécifie le texte d'étiquette pour l'axe. Les <b>Limites d'Axe</b> spécifient les valeurs minimales et maximales de l'axe. L'option <b>Incréments de Marque de Tick</b> contrôle l'espacement des marques de tick sur l'axe. Les incréments sur l'axe temporel contrôlent également les temps pour le tableau optionnel du nombre à risque.\n            <br/>\n            L'option <b>Échelle</b> de l'axe d'incidence spécifie si vous souhaitez que les estimations soient sur une échelle de proportion (0-1) ou de pourcentage (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Taille de l'Étiquette d'Axe :</b>  Cela contrôle la taille des étiquettes d'axe d'incidence et de temps.\n\t\t\t<br/><br/>\n\t\t\t<b>Taille de l'Étiquette de Marque de Tick d'Axe :</b>  Cela contrôle la taille des étiquettes de marque de tick d'axe d'incidence et de temps.\t\t\t\t\n      "
  }
}