{
  "title": "Convertir les variables de caractères en date et heure",
  "navigation": "Caractère en date et heure",
  "label1": "Sélectionnez un suffixe ou un préfixe pour les variables converties",
  "suffix": "Suffixe",
  "prefix": "Préfixe",
  "prefixOrSuffix": "Entrez un préfixe ou un suffixe",
  "Destination": "Sélectionnez les variables de caractères à convertir en date",
  "DateFormat": "Sélectionnez le format de la chaîne de caractères",
  "TimeZone": "Sélectionnez un fuseau horaire (par défaut - rien sélectionné est le fuseau horaire local de l'ordinateur)",
  "advanced_lbl" : "Avancé",
  "help": {
    "title": "Convertir les caractères en date",
    "r_help": "help(strptime, package=\"base\")",
    "body": "\n<b>Description</b></br>\nConvertit un caractère en date (classe POSIXct). Vous devez spécifier le format de la date stockée dans une chaîne de caractères.\nLa fonction ci-dessus appelle en interne strptime dans le package de base. Nous avons étendu strftime pour prendre en charge plusieurs variables.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nBSkystrptime <-function (varNames = \"\", dateFormat = \"\", timezone = \"\", prefixOrSuffix = \"suffix\", \n    prefixOrSuffixValue = \"\", data = \"\") \n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndata: Le nom du jeu de données sous forme de chaîne de caractères.\n</li>\n<li>\nvarNames: Les noms des variables de classe caractère qui doivent être converties en date (classe POSIXct)\n</li>\n<li>\ndateFormat: Une chaîne de caractères. La valeur par défaut pour les méthodes de format est \"%Y-%m-%d %H:%M:%S\" si un élément a un composant temporel qui n'est pas minuit, et \"%Y-%m-%d\" sinon. Si options(\"digits.secs\") est défini, jusqu'au nombre spécifié de chiffres sera imprimé pour les secondes\n</li>\n<li>\ntimezone: Une chaîne de caractères spécifiant le fuseau horaire à utiliser pour la conversion. Spécifique au système (voir as.POSIXlt), mais \"\" est le fuseau horaire actuel, et \"GMT\" est UTC. Les valeurs invalides sont le plus souvent traitées comme UTC, sur certaines plateformes avec un avertissement.\n</li>\n<li>\nprefixOrSuffix: Spécifiez un préfixe ou un suffixe pour les variables converties de classe POSIXct. Prend soit c(\"prefix\") soit c(\"suffix\"). Les nouvelles variables créées avec ce préfixe/suffixe au nom de la variable d'origine. \n</li>\n<li>\nprefixOrSuffixValue = Un vecteur de caractères qui spécifie le nom du préfixe ou du suffixe à utiliser.\n</li>\n</ul>\n<b>Package</b></br>\nbase</br>\n<b>Aide</b></br>\nhelp(strptime)\n"
  }
}