{
  "title": "Cox, Stratifié",
  "navigation": "Cox, Stratifié",
  "modelname": "Entrez le nom du modèle",
  "timevar": "Temps jusqu'à l'événement ou censure",
  "eventvar": "Événements (1 = événement 1, 0 = censure)",
  "modelterms": "Constructeur d'expression de modèle pour les variables indépendantes",
  "stratavarslabel": "Variables de stratification",
  "weightvar": "Poids (facultatif)",
  "tiemethod": "Méthode de temps lié",
  "diagnosticsbox": "Diagnostics du modèle",
  "help": {
    "title": "Cox, Stratifié",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n            Ajuste un modèle de risques proportionnels de Cox stratifié pour des données de temps jusqu'à l'événement avec des observations censurées. C'est un modèle de Cox qui permet une fonction de risque de base distincte pour chaque niveau de strata. Les statistiques d'ajustement du modèle, les estimations des paramètres et les rapports de risque sont fournis. Les options disponibles incluent la méthode de temps lié et les diagnostics du modèle. Le modèle est ajusté à l'aide de la fonction coxph dans le package survival. \n            <br/>\n            <br/>\n            <b>Temps jusqu'à l'événement ou censure :</b> Temps jusqu'à l'événement pour ceux qui subissent l'événement ou temps jusqu'à la dernière visite pour ceux qui ne subissent pas l'événement\n            <br/><br/>\n            <b>Événements (1=événement, 0=censure) :</b> Indicateur numérique d'événement ; 1=événement, 0=censure\n            <br/><br/>\n            <b>Constructeur de formule :</b> Construisez des termes à inclure dans le modèle. Les facteurs, chaînes et variables logiques seront codés en variables fictives. Les boutons fournis vous permettent de \n\t\t\tspecifier les effets principaux, les effets factoriels complets (effets principaux et toutes les interactions avec les variables impliquées), les polynômes, des interactions spécifiques, et de supprimer des termes \n\t\t\tde la liste. Les interactions avec les variables de stratification sont autorisées.\n            <br/><br/>\n\t\t\t<b>Variables de stratification :</b> Spécifiez une ou plusieurs variables de stratification. Celles-ci peuvent être des variables numériques, des facteurs, des facteurs ordonnés ou des variables de caractères. Les strata \n\t\t\tdivisent les sujets en groupes distincts où chaque groupe a une fonction de risque de base distincte. Si plusieurs variables de stratification sont données, une fonction de risque de base distincte est utilisée pour chaque combinaison de niveaux de variables de stratification.\n\t\t\t<br/><br/>\n            <b>Poids :</b> Variable numérique pour les poids d'observation. Utile dans les situations où chaque enregistrement ne doit pas être compté comme une seule observation. \n            <br/>\n            <br/>\n            <b>Packages requis :</b> survival, broom, survminer\n            <br/>\n            <br/>\n            Cliquez sur le bouton Aide R pour obtenir une aide détaillée sur la fonction coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Options</b>\n            <br/>\n            <br/>\n            <b>Méthode de temps lié :</b>\n            <br/>\n            Méthode de rupture des temps observés liés. Efron est généralement le meilleur choix lorsqu'il n'y a pas beaucoup de temps liés. La méthode exacte peut être bénéfique s'il y a beaucoup de temps liés, comme dans des situations de temps discret, mais peut prendre un peu plus de temps pour que le modèle soit ajusté. \n            <br/>\n            <br/>\n            <b>Diagnostics du modèle :</b>\n            <br/>\n            Si sélectionné, des tests et des graphiques de risques proportionnels seront fournis, en plus d'un graphique des résidus de Martingale.\n      "
  }
}