{
  "title": "Créer un design de paramètres intérieur-extérieur de style Taguchi",
  "navigation": "Créer un design de paramètres Taguchi",
  "datasetname": "Nom du design",
  "inner": "Design intérieur (doit déjà avoir été randomisé)",
  "outer": "Design extérieur",
  "lbl1": "Direction - Générer le design au format long ou large",
  "directionLongrad": "Format long",
  "directionWiderad": "Format large",
  "responses": "Laissez-le vide ou spécifiez un ou plusieurs noms de réponse (séparés par des virgules sans guillemets ni espaces entre les noms)",
  "help": {
    "title": "Créer un design de paramètres intérieur-extérieur de style Taguchi",
    "r_help": "help(param.design, package = DoE.base)",
    "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tLa fonction param.design génère des designs de paramètres de style Taguchi. Elle crée des designs de paramètres pour des enquêtes signal-bruit avec des matrices intérieures et extérieures et facilite leur formatage et l'agrégation des données. L'expérience croise les facteurs de contrôle dans la « matrice intérieure » avec les facteurs de bruit dans la « matrice extérieure ».\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPour l'aide détaillée - utilisez R help(param.design, package = DoE.base)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPour essayer cela, vous pouvez utiliser le fichier de jeu de données d'exemple appelé factor_grid_twolevel_screen_Design.xlsx. Ouvrez le fichier dans la grille de données avec le menu d'ouverture de fichier\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t1. Créez un design factoriel complet avec le nom de design FFinnerRandom avec les facteurs sélectionnés - AirVolume, Valve, Barrel et Angle et cochez la case \"Randomiser la génération du design\"\n\t\t\t\t<br/>\n\t\t\t\t2. Créez un design de matrice orthogonale avec le nom de design FFouter avec les facteurs sélectionnés - WadType, Voltage, BallType\n\t\t\t\t<br/>\n\t\t\t\t3. Créez un design Taguchi (ce dialogue/UI) et sélectionnez les designs FFinnerRandom et FFouter déjà créés à l'étape 1 et à l'étape 2\n\t\t\t\t<br/>\n\t\t\t\t\n\t\t\t"
  }
}