{
  "title": "Tableau croisé",
  "navigation": "Tableau croisé",
  "label6": "Lorsque plusieurs variables de ligne et de colonne sont spécifiées, nous générons un tableau croisé séparé pour chaque paire de variables de ligne et de colonne.",
  "rowlabel": "Variable de ligne",
  "collabel": "Variable de colonne",
  "layerlabel": "Variable(s) de couche",
  "weightlabel": "Poids (un)",
  "label1": "Statistiques",
  "chisqlabel": "Chisq",
  "chisqNoContCorrection": "Pas de correction de continuité pour le test du Chi-carré",
  "chisqContCorrection": "Appliquer la correction de continuité pour le test du Chi-carré (s'applique à un tableau 2 par 2)",
  "chisqSimulatePValues": "Calculer les p-values en utilisant la simulation de Monte Carlo",
  "chisqNoOfReplicates": "Nombre de réplicats utilisés dans le test de Monte Carlo",
  "mcnemar": "McNemar",
  "mcnemarContCorrection": "Appliquer la correction de continuité pour le test de McNemar (s'applique à un tableau 2 par 2)",
  "fisher": "Fisher",
  "fisherSimulatePValues": "Calculer les p-values en utilisant la simulation de Monte Carlo",
  "fisherNoOfReplicates": "Nombre de réplicats utilisés dans le test de Monte Carlo",
  "fishersAlternative": "Hypothèse alternative pour le test exact de Fisher",
  "label2": "Résidus",
  "unstandardized": "Non standardisé",
  "standardized": "Standardisé",
  "adjusted": "Ajusté",
  "label3": "Pourcentages",
  "rowpercent": "Ligne",
  "colpercent": "Colonne",
  "label4": "Comptes",
  "expected": "Attendu",
  "label5": "Format de sortie",
  "longTbl": "Tableau de style liste (Contrainte de largeur de tableau lorsque de nombreux niveaux)",
  "help": {
    "title": "Tableau croisé",
    "r_help": "help(CrossTable, package=gmodels)",
    "body": "\n            <b>Description</b></br>\nCrée un tableau croisé avec des variables de ligne, de colonne et de couche. Lorsque plusieurs variables de ligne et de colonne sont spécifiées, nous générons un tableau croisé séparé pour chaque paire de variables de ligne et de colonne. De plus, les éléments suivants sont affichés<br/>\nComptes attendus<br/>\nPourcentages de ligne et de colonne<br/>\nRésidus non standardisés, standardisés et ajustés<br/>\nChisq avec rapport de cotes, statistiques de McNemar et de Fisher<br/>\nREMARQUE : Nous supprimons automatiquement toutes les lignes où chaque compte est 0. Cela peut avoir un impact sur la façon dont les tests de Chisq, McNemar et Fisher sont exécutés. Par exemple, vous pouvez vous attendre à 3 lignes et 2 colonnes car la variable de ligne a 3 niveaux et la variable de colonne 2 niveaux. Cependant, comme un niveau de ligne a tous les comptes à 0, vous obtenez un tableau 2*2. Bien que la simulation de Monte Carlo avec le test de Fisher fonctionne sur un tableau 3*2, elle ne s'applique pas à un tableau 2*2 et le test normal de Fisher est exécuté. \n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nBSkyCrossTable(x,y,layers, weight, datasetname, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE,long_table = FALSE )\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: variable de ligne\n</li>\n<li>\ny: variable de colonne\n</li>\n<li>\nlayers: une ou plusieurs variables pour les couches\n</li>\n<li>\nweights: une variable numérique contenant les poids de fréquence\n</li>\n<li>\ndatasetname: Nom du jeu de données à partir duquel x,y et layers (variables) sont choisis\n</li>\n<li>\nchisq:  si TRUE génère un tableau du chi-carré\n</li>\n<li>\nprop.r: Les pourcentages de ligne sont produits si cela est TRUE\n</li>\n<li>\nprop.c: Les pourcentages de colonne sont générés si cela est TRUE\n</li>\n<li>\nresid: si TRUE, les résidus non standardisés sont générés\n</li>\n<li>\nsresid: si TRUE, les résidus standardisés sont générés\n</li>\n<li>\nexpected: Les comptes attendus sont générés si cela est TRUE\n</li>\n<li>\nasresid:  si TRUE, les résidus ajustés sont générés\n</li>\n<li>\nlong_table: L'option de tableau long est introduite pour accueillir l'analyse effectuée sur un grand nombre de variables. Choisir le format long contrôle la largeur du tableau de sortie, ce qui facilite la visualisation des résultats sans avoir à faire défiler vers la droite dans la fenêtre de sortie. \n</li>\n</ul>\n<b>valeur</b></br>\nUne liste avec les résultats\n<br/>\n<b>Exemple</b></br>\n<code> \nBSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>\nlayers=c('type'),datasetname='Dataset2',<br/>\nchisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>\nresid=FALSE,sresid=FALSE,expected=FALSE,<br/>\nasresid=FALSE)</br>\nBSkyFormat(BSky_Multiway_Cross_Tab)</br>\n</code> <br/>\n<b>Package</b></br>\ngmodels</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette fenêtre contextuelle ou exécutez la commande suivante help(CrossTable, package=gmodels) en créant un bloc de code R en cliquant + dans la fenêtre de sortie  \n    "
  }
}