{
    "title": "Tableau croisé",
    "navigation": "Tableau croisé",
    "label6": "Lorsque plusieurs variables de ligne et de colonne sont spécifiées, nous générons un tableau croisé distinct pour chaque paire de variables de ligne et de colonne.",
    "rowlabel": "Variable de ligne",
    "collabel": "Variable de colonne",
    "layerlabel": "Variable(s) de couche",
    "weightlabel": "Poids (un)",
    "label1": "Statistiques",
    "chisqlabel": "Chi-carré",
    "chisqNoContCorrection": "Pas de correction de continuité pour le test du Chi-carré",
    "chisqContCorrection": "Appliquer une correction de continuité pour le test du Chi-carré (S'applique à un tableau 2x2)",
    "chisqSimulatePValues": "Calculer les valeurs p en utilisant une simulation Monte Carlo",
    "chisqNoOfReplicates": "Nombre de réplicats utilisés dans le test Monte Carlo",
    "mcnemar": "McNemar",
    "mcnemarContCorrection": "Appliquer une correction de continuité pour le test de McNemar (S'applique à un tableau 2x2)",
    "fisher": "Fisher",
    "fisherSimulatePValues": "Calculer les valeurs p en utilisant une simulation Monte Carlo",
    "fisherNoOfReplicates": "Nombre de réplicats utilisés dans le test Monte Carlo",
    "fishersAlternative": "Hypothèse alternative pour le test exact de Fisher",
    "label2": "Résidus",
    "unstandardized": "Non standardisé",
    "standardized": "Standardisé",
    "adjusted": "Ajusté",
    "label3": "Pourcentages",
    "rowpercent": "Ligne",
    "colpercent": "Colonne",
    "label4": "Effectifs",
    "expected": "Attendu",
    "label5": "Format de sortie",
    "longTbl": "Tableau au format liste (Restreindre la largeur du tableau en cas de nombreux niveaux)",
	    "help": {
        "title": "Tableau croisé",
        "r_help": "help(CrossTable, package=gmodels)",
	"body":"<b>Description</b></br>
Crée une table croisée avec des variables de ligne, de colonne et de couche. Lorsque plusieurs variables de ligne et de colonne sont spécifiées, nous générons une table croisée séparée pour chaque paire de variables de ligne et de colonne. De plus, les éléments suivants sont affichés:<br/>
Comptes attendus<br/>
Pourcentages de ligne et de colonne<br/>
Résidus non standardisés, standardisés et ajustés<br/>
Chi-deux avec rapport de cotes, statistiques de McNemar et Fisher<br/>
NOTE: Nous supprimons automatiquement toutes les lignes où tous les comptes sont 0. Cela peut influencer la manière dont les tests Chi-deux, McNemar et Fisher sont exécutés. Par exemple, vous pouvez vous attendre à 3 lignes et 2 colonnes, car la variable de ligne a 3 niveaux et la variable de colonne a 2 niveaux. Cependant, si un niveau de ligne a tous les comptes à 0, vous obtenez une table 2*2. Alors que la simulation de Monte Carlo avec le test de Fisher fonctionne sur une table 3*2, elle ne s'applique pas à une table 2*2 et le test normal de Fisher est exécuté. 
<br/>
<b>Utilisation</b>
<br/>
<code> 
BSkyCrossTable(x,y,couches, poids, nom_dataset, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE, long_table = FALSE )
</code> <br/>
<b>Arguments</b><br/>
<ul>
<li>
x: variable de ligne
</li>
<li>
y: variable de colonne
</li>
<li>
couches: une ou plusieurs variables pour les couches
</li>
<li>
poids: une variable numérique contenant les poids de fréquence
</li>
<li>
nom_dataset: Nom du jeu de données à partir duquel x, y et les couches (variables) sont choisis
</li>
<li>
chisq: Si TRUE, génère la table Chi-deux
</li>
<li>
prop.r: Si TRUE, génère les pourcentages de ligne
</li>
<li>
prop.c: Si TRUE, génère les pourcentages de colonne
</li>
<li>
resid: Si TRUE, génère les résidus non standardisés
</li>
<li>
sresid: Si TRUE, génère les résidus standardisés
</li>
<li>
expected: Si TRUE, génère les comptes attendus
</li>
<li>
asresid: Si TRUE, génère les résidus ajustés
</li>
<li>
long_table: L'option de table longue a été introduite pour gérer l'analyse effectuée sur un grand nombre de variables. Choisir le format long contrôle la largeur de la table de sortie, facilitant la visualisation des résultats sans avoir à faire défiler la fenêtre de sortie.
</li>
</ul>
<b>Résultat</b></br>
Une liste avec les résultats
<br/>
<b>Exemple</b></br>
<code> 
BSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>
couches=c('type'),nom_dataset='Dataset2',<br/>
chisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>
resid=FALSE,sresid=FALSE,expected=FALSE,<br/>
asresid=FALSE)</br>
BSkyFormat(BSky_Multiway_Cross_Tab)</br>
</code> <br/>
<b>Package</b></br>
gmodels</br>
<b>Aide</b></br>
Pour de l'aide détaillée, cliquez sur l'icône R en haut à droite de cette fenêtre de dialogue ou exécutez la commande suivante: help(CrossTable, package=gmodels) en créant un bloc de code R en cliquant sur + dans la fenêtre de sortie.
"
		}
}
