{
  "title": "Liste de Crosstab",
  "navigation": "Liste de Crosstab",
  "destvarslabel": "Variables pour le Tableau",
  "missinglabel": "Valeurs Manquantes",
  "removelabel": "Supprimer",
  "showexcludelabel": "Afficher et Exclure des Pourcentages",
  "includelabel": "Afficher et Inclure dans les Pourcentages",
  "sparseoptlabel": "Inclure les Combinaisons avec 0 Comptes",
  "toplistoptlabel": "Afficher les N Valeurs les Plus Fréquemment Observées",
  "topnumlabel": "N",
  "help": {
    "title": "Liste de Crosstab",
    "r_help": "help(freqlist, package ='arsenal')",
    "body": "\nCela crée des tableaux de fréquence sous forme de liste pour des combinaisons d'une ou plusieurs variables. Chaque combinaison de valeurs à travers toutes les variables spécifiées sera tabulée, \navec leurs fréquences observées. Les variables spécifiées peuvent être de n'importe quelle classe, y compris des variables numériques et continues. Bien que cela puisse être utilisé pour des fréquences et \npourcentages résumés, un usage majeur est de vérifier les données pour des incohérences. Il faut faire attention au nombre de variables à croiser et au nombre de possibilités qui peuvent en résulter, car \ncertains tableaux peuvent prendre plus de temps à produire. \n<br/><br/>\n<b>Variables pour le Tableau :</b>  <br/>Variables à inclure dans le tableau, qui peuvent être de n'importe quelle classe. Le tableau sera trié selon l'ordre des variables dans cette liste.  \nCela signifie que si les variables A et B sont dans l'ordre spécifié, alors le tableau sera trié par niveaux de A, puis niveaux de B dans A.\n<br/><br/>\n<b>Valeurs Manquantes</b>\n<br/>\n<ul>\n\t<li><b>Supprimer :</b>  Les combinaisons de valeurs de variable qui ont des NA seront exclues du tableau.</li>\n\t<li><b>Afficher et Exclure des Pourcentages :</b>  Les combinaisons de valeurs de variable qui ont des NA seront incluses dans le tableau, mais ne seront pas incluses dans les calculs de pourcentage.</li>\n\t<li><b>Afficher et Inclure dans les Pourcentages :</b>  Les combinaisons de valeurs de variable qui ont des NA seront incluses dans le tableau et seront incluses dans les calculs de pourcentage.</li> \n</ul>\n<br/><br/>\n<b>Inclure les Combinaisons avec 0 Comptes :</b>  <br/>S'il faut inclure des combinaisons de valeurs de variable qui n'existent pas dans l'ensemble de données. Par exemple, si les variables A et B ont toutes deux des valeurs observées de 1, 2 et 3, mais que la combinaison (A, B) (1, 3) n'est pas observée dans les données, cette option inclurait une ligne pour la combinaison (1, 3) avec une fréquence de 0.\n<br/><br/>\n<b>Afficher les N Valeurs les Plus Fréquemment Observées :</b>  <br/>Si coché, cela créerait un tableau séparé avec les N combinaisons de variables les plus fréquentes.\n<ul>\n\t<li><b>N :</b> Combien de combinaisons de variables afficher pour le tableau des N.</li>\n</ul>\n<b>Packages R Requis :</b> arsenal\n\t\t\t"
  }
}