{
  "title": "Test Diagnostique",
  "navigation": "Test Diagnostique",
  "outvar": "Variable de Résultat (1=positif, 0=négatif):",
  "testvar": "Variable de Test (1=positif, 0=négatif):",
  "cilevel": "Niveau de Confiance:",
  "help": {
    "title": "Test Diagnostique",
    "r_help": "help(epi.tests,package=epiR)",
    "body": "\n<b>Description</b></br>\nCela calcule diverses mesures appropriées dans les études de tests diagnostiques pour un test binaire par rapport à un résultat binaire de référence pour détecter une \"maladie\".<br/>\nVariable de Résultat : Variable contenant les valeurs pour le standard de référence. Cela doit être une variable numérique codée comme 1 = \"maladie\" positive et 0 = \"maladie\" négative, puisque les calculs dépendent de cet ordre.<br/>\nVariable de Test : Variable contenant les valeurs pour le test en question. Cela doit être une variable numérique codée comme 1 = \"maladie\" positive et 0 = \"maladie\" négative, puisque les calculs dépendent de cet ordre.<br/>\nNiveau de Confiance : Niveau d'intervalle de confiance souhaité<br/>\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nepi.tests(dat, conf.level = 0.95)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndat : Un objet de classe table contenant les fréquences individuelles créées en tabulant la variable de résultat et la variable de test. La Variable de Résultat contient les valeurs pour le standard de référence. Cela doit être une variable numérique codée comme 1 = \"maladie\" positive et 0 = \"maladie\" négative, puisque les calculs dépendent de cet ordre. La variable de test contient les valeurs pour le test en question. Cela doit être une variable numérique codée comme 1 = \"maladie\" positive et 0 = \"maladie\" négative, puisque les calculs dépendent de cet ordre.\n</li>\n<li>\nNiveau de Confiance : Niveau d'intervalle de confiance souhaité\n</li>\n</ul>\n<b>Détails</b></br>\nDes limites de confiance binomiales exactes sont calculées pour la sensibilité du test, la spécificité, et la valeur prédictive positive et négative (voir Collett 1999 pour plus de détails).</br>\nLes intervalles de confiance pour les rapports de vraisemblance positifs et négatifs sont basés sur des formules fournies par Simel et al. (1991).</br>\nLa précision diagnostique est définie comme la proportion de tous les tests qui donnent un résultat correct. Le rapport de cotes diagnostique est défini comme étant combien plus probable le test fera un bon diagnostic qu'un diagnostic incorrect chez les patients atteints de la maladie (Scott et al. 2008). Le nombre nécessaire pour diagnostiquer est défini comme le nombre de patients qui doivent être testés pour donner un test positif correct. L'indice de Youden est la différence entre le taux de vrais positifs et le taux de faux positifs. L'indice de Youden varie de -1 à +1 avec des valeurs plus proches de 1 si la sensibilité et la spécificité sont élevées (c'est-à-dire proches de 1).</br>\n<b>Valeur</b></br>\nVoir l'aide détaillée ci-dessous pour accéder à l'aide R qui décrira les valeurs retournées</br>\n<b>Paquet</b></br>\nepiR;DescTools</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette fenêtre de dialogue ou exécutez la commande suivante help(epi.tests,package=epiR) en créant un bloc de code R en cliquant + dans la fenêtre de sortie\n\t\t\t"
  }
}