{
  "title": "Ajustement des distributions univariées aux données non censurées (avec P-value)",
  "navigation": "Ajustement de la distribution P-value",
  "variableSelcted": "Sélectionnez une variable contenant la distribution",
  "label1": "Soyez conscient que le test d'ajustement pour les distributions prend généralement plus de temps à compléter",
  "label2": "Test d'ajustement pour diverses distributions",
  "normDistChk": "Normal",
  "weibullDistChk": "Weibull",
  "lnormDistChk": "Log Normal",
  "poissonDistChk": "Poisson",
  "expDistChk": "Exponential",
  "gammaDistChk": "Gamma",
  "nbinomDistChk": "Binomial Négatif",
  "geomDistChk": "Géométrique",
  "betaDistChk": "Bêta",
  "unifDistChk": "Uniforme",
  "logisDistChk": "Logistique",
  "cauchyDistChk": "Cauchy",
  "method": "Méthode d'ajustement",
  "gof": "Qualité de l'ajustement (gof) - requis uniquement lorsque la méthode 'mge' d'ajustement est choisie ci-dessus",
  "shoChiqTestChk": "Afficher les résultats du test du Chi-carré pour la distribution continue",
  "showCompareTablesOnlyChk": "Afficher uniquement les tableaux et graphiques de comparaison des distributions. Vous devez décocher cela si vous sélectionnez une seule distribution",
  "bootstrapIter": "La méthode bootstrap est utilisée pour améliorer la précision de la p.value. L'itération par défaut est de 600. Plus d'itérations peuvent améliorer la précision mais prendront plus de temps à calculer",
  "help": {
    "title": "Ajustement des distributions univariées aux données non censurées",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tAjustement des distributions univariées aux données non censurées par maximum de vraisemblance (mle), égalisation des moments (mme), égalisation des quantiles (qme) ou maximisation de l'estimation de la qualité de l'ajustement (mge) qui est également connu sous le nom de minimisation de l'estimation de la distance.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPour l'aide détaillée - utilisez R help(fitdist, package = fitdistrplus) et help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLes quatre méthodes d'ajustement possibles sont décrites ci-dessous:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLorsque la méthode=\"mle\" (par défaut)\n\t\t\t\tL'estimation par maximum de vraisemblance consiste à maximiser le log-vraisemblance. Une optimisation numérique est effectuée dans mledist via optim pour trouver les meilleures valeurs (voir mledist pour plus de détails).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLorsque la méthode=\"mme\"\n\t\t\t\tL'estimation par égalisation des moments consiste à égaliser les moments théoriques et empiriques. Les valeurs estimées des paramètres de distribution sont calculées par une formule analytique pour les distributions suivantes : \"norm\", \"lnorm\", \"pois\", \"exp\", \"gamma\", \"nbinom\", \"geom\", \"beta\", \"unif\" et \"logis\". Sinon, les moments théoriques et empiriques sont égalisés numériquement, par minimisation de la somme des différences au carré entre les moments observés et théoriques. Dans ce dernier cas, des arguments supplémentaires sont nécessaires dans l'appel à fitdist : order et memp (voir mmedist pour plus de détails).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLorsque la méthode = \"qme\"\n\t\t\t\tL'estimation par égalisation des quantiles consiste à égaliser les quantiles théoriques et empiriques. Une optimisation numérique est effectuée dans qmedist via optim pour minimiser la somme des différences au carré entre les quantiles observés et théoriques. L'utilisation de cette méthode nécessite un argument supplémentaire probs, défini comme le vecteur numérique des probabilités pour lesquelles le(s) quantile(s) doit(vent) être égalisé(s) (voir qmedist pour plus de détails).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLorsque la méthode = \"mge\"\n\t\t\t\tL'estimation par maximum de la qualité de l'ajustement consiste à maximiser une statistique de qualité de l'ajustement. Une optimisation numérique est effectuée dans mgedist via optim pour minimiser la distance de qualité de l'ajustement. L'utilisation de cette méthode nécessite un argument supplémentaire gof codant pour la distance de qualité de l'ajustement choisie. On peut utiliser la distance classique de Cramer-von Mises (\"CvM\"), la distance classique de Kolmogorov-Smirnov (\"KS\"), la distance classique d'Anderson-Darling (\"AD\") qui donne plus de poids aux queues de la distribution, ou l'une des variantes de cette dernière distance proposée par Luceno (2006) (voir mgedist pour plus de détails). Cette méthode n'est pas adaptée aux distributions discrètes.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLorsque la méthode = \"mse\"\n\t\t\t\tL'estimation par maximum de la qualité de l'ajustement consiste à maximiser l'espacement logarithmique moyen. Une optimisation numérique est effectuée dans msedist via optim.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa convergence est \n\t\t\t\tun code entier pour la convergence de optim/constrOptim défini comme ci-dessous ou défini par l'utilisateur dans la fonction d'optimisation fournie par l'utilisateur. 0 indique une convergence réussie. 1 indique que la limite d'itération de optim a été atteinte. 10 indique une dégénérescence du simplexe de Nealder-Mead. 100 indique que optim a rencontré une erreur interne.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLes statistiques de qualité de l'ajustement sont calculées par gofstat(). La statistique du Chi-carré est calculée en utilisant des cellules définies par l'argument chisqbreaks ou des cellules définies automatiquement à partir des données, afin d'atteindre à peu près le même nombre d'observations par cellule, à peu près égal à l'argument meancount, ou légèrement plus s'il y a des égalités. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPour les distributions continues, les statistiques de Kolmogorov-Smirnov, Cramer-von Mises et Anderson-Darling sont également calculées, comme défini par Stephens (1986).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLes statistiques importantes sont les statistiques de Cramer-von Mises, d'Anderson-Darling et de Kolmogorov pour les distributions continues et les statistiques du Chi-carré pour les distributions discrètes (\"binom\", \"nbinom\", \"geom\", \"hyper\" et \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Pour un bon aperçu de l'ajustement des distributions, voir https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Pour un bon aperçu de l'ajustement des distributions, voir https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}