{
  "title": "Graphique Forestier",
  "navigation": "Graphique Forestier",
  "modelselectorlabel": "Sélectionner le Nom du Modèle",
  "plotvarslabel": "Variables à Tracer (aucune spécifiée trace toutes les variables)",
  "varlabelslabel": "Étiquettes de Variables (spécifiez comme varname='étiquette' séparées par des virgules, par ex. age='Âge en années', bmi='Indice de Masse Corporelle'); peut utiliser \\n pour des sauts de ligne dans une étiquette",
  "notelabel": "REMARQUE : Changer les étiquettes nécessite un nouveau ajustement du modèle, donc de grandes données pourraient prendre du temps",
  "label3": "REMARQUE : LES MODÈLES CONSTRUITS À L'AIDE DE L'AJUSTEMENT DU MODÈLE (ENTRAÎNER) NE SONT PAS SOUTENUS",
  "estimateoptlabel": "Options d'Estimation",
  "estimatelabellabel": "Étiquette",
  "exponentiatelabel": "Forcer l'Exponentiation de l'Estimation du Paramètre",
  "linecolorlabel": "Couleur de la Ligne",
  "pointshapelabel": "Forme des Points",
  "pointsizelabel": "Taille des Points (0-10 mm)",
  "styleoptlabel": "Options de Style",
  "factorseplinelabel": "Noms des Facteurs sur des Lignes Séparées",
  "plotbandslabel": "Bandes de Tracé",
  "textsizelabel": "Taille du Texte (1-10 mm)",
  "estticklabelsizelabel": "Taille de l'Étiquette de Marque de Tique d'Estimation (1-50)",
  "help": {
    "title": "Graphique Forestier",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nCela crée un graphique des coefficients du modèle, ou des coefficients exponentiés, à partir d'un modèle de régression. Chaque variable est tracée dans sa propre ligne avec des totaux, des estimations de paramètres, \nintervalles de confiance à 95 % et valeurs p. Les variables peuvent être étiquetées pour permettre une meilleure présentation. Actuellement, les modèles de classe lm (modèles linéaires), glm (modèles linéaires généralisés, \nqui incluent logistique et Poisson), coxph (risques proportionnels de Cox) et rq (régression quantile) sont pris en charge.\n<br/><br/>\n<b>Sélectionner le Nom du Modèle :</b> Choisissez le nom du modèle tel que spécifié lors de l'ajustement du modèle. C'est un champ requis.\n<br/><br/>\n<b>Variables à Tracer :</b> Si vous avez accès aux données qui ont créé le modèle, vous pouvez spécifier un sous-ensemble des variables dans le modèle à inclure dans le graphique. Si aucune variable \n n'est spécifiée, cela par défaut à toutes les variables incluses.\n<br/><br/>\n<b>Étiquettes de Variables :</b> Spécifiez de meilleures étiquettes à utiliser au lieu des noms de variables. Si une variable n'est pas étiquetée, le nom de la variable ou l'étiquette de variable existante utilisée lors de \nl'ajustement du modèle (si elle existe) sera tracée. Celles-ci doivent être spécifiées dans un format variablename=\"étiquette\", séparées par des virgules. Notez qu'inclure \\n dans une étiquette forcera\nun saut de ligne dans l'étiquette. Cela signifie que vous pouvez spécifier des étiquettes multi-lignes et pourrait être avantageux pour de longues étiquettes, car de longues étiquettes laissées sur une seule ligne laissent moins d'espace pour les estimations. Faire \nun résumé du modèle avec Évaluation du Modèle -> Résumer -> Résumer un Modèle imprimera les variables du modèle utilisées au cas où vous n'auriez pas accès à l'ensemble de données. REMARQUE : Il y a un \nbug actuel dans le package forestmodel R qui n'utilise pas les étiquettes de variables pour les facteurs dans les modèles de Cox - le développeur du package a été informé. Une alternative jusqu'à ce que le package soit \n corrigé est de réajuster le modèle avec des variables codées par des indicateurs au lieu de facteurs.\n<br/><br/><br/>\n<b>Options d'Estimation :</b>\n<br/><br/>\n<b>Étiquette :</b> Étiquette optionnelle pour la colonne d'estimation dans le graphique. La régression logistique et les modèles de Cox seront automatiquement détectés et les estimations étiquetées comme \"Rapport de Cotes\" et \n\"Rapport de Risque\", respectivement. D'autres modèles utiliseront le défaut de \"Estimation\" si vous ne spécifiez rien.\n<br/><br/>   \n<b>Forcer l'Exponentiation de l'Estimation du Paramètre :</b> Choisissez ceci pour forcer les valeurs de exp(coefficient) à être affichées, c'est-à-dire 2.718 élevé à la puissance du coefficient. Les \ncoefficients exponentiés sont couramment utilisés dans les modèles de risques proportionnels de Cox (pour les rapports de risque), la régression logistique (pour les rapports de cotes), les modèles log-binomiaux (pour les risques relatifs), et la régression de Poisson \n(pour les rapports de taux). Par défaut, la régression logistique et les modèles de Cox seront automatiquement détectés et exp(coefficient) sera utilisé.\n<br/><br/>\n<b>Couleur de la Ligne :</b> Couleur de la ligne pour les intervalles de confiance.\n<br/><br/>\n<b>Forme des Points :</b> La forme des points pour les estimations de paramètres dans le graphique.\n<br/><br/>\n<b>Taille des Points (0-10 mm) :</b> La taille des points, en millimètres, pour les estimations de paramètres dans le graphique. 0 mm supprimerait les points. La taille par défaut est de 4 mm.\n<br/><br/><br/>\n<b>Options de Style :</b>\n<br/><br/>\n<b>Noms des Facteurs sur des Lignes Séparées :</b> Choisissez ceci pour afficher les noms des variables factorielles sur une ligne séparée des niveaux du facteur.\n<br/><br/>\n<b>Bandes de Tracé :</b> Choisissez ceci pour afficher des régions ombragées alternées pour chaque ligne du graphique.\n<br/><br/>\n<b>Taille du Texte (1-10 mm) :</b> Taille du texte, en millimètres, dans le graphique. La taille par défaut est de 4 mm.\n<br/><br/>\nRemarque : Si vous souhaitez changer la taille globale du graphique, la taille du graphique peut être définie à l'aide du bouton Thèmes dans le menu à trois points.\n<br/><br/>\n<b>Taille de l'Étiquette de Marque de Tique d'Estimation (1-50) :</b> Taille des étiquettes de marque de tique pour l'axe d'estimation.\n<br/><br/>\n<b>Packages R Requis :</b> forestmodel, arsenal, survival, quantreg, insight\n"
  }
}