{
  "title": "Test de Friedman",
  "navigation": "Test de Friedman",
  "tvarbox1": "Variables de réponse, 2 ou plus",
  "help": {
    "title": "Test de Friedman",
    "r_help": "help(friedman.test, package=stats)",
    "body": "\n<b>Description</b></br>\nEffectue un test de somme de rang de Friedman avec des données bloquées non répliquées.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## Méthode S3 par défaut :\nfriedman.test(y, groups, blocks, ...)\n## Méthode S3 pour la classe 'formula'\nfriedman.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ny : soit un vecteur numérique de valeurs de données, soit une matrice de données.\n</li>\n<li>\ngroups : un vecteur donnant le groupe pour les éléments correspondants de y si c'est un vecteur ; ignoré si y est une matrice. S'il n'est pas un objet facteur, il est converti en un.\n</li>\n<li>\nblocks : un vecteur donnant le bloc pour les éléments correspondants de y si c'est un vecteur ; ignoré si y est une matrice. S'il n'est pas un objet facteur, il est converti en un.\n</li>\n<li>\nformula : une formule de la forme a ~ b | c, où a, b et c donnent les valeurs de données et les groupes et blocs correspondants, respectivement.\n</li>\n<li>\ndata : une matrice ou un cadre de données (ou similaire : voir model.frame) contenant les variables dans la formule. Par défaut, les variables sont prises de l'environnement(formula).\n</li>\n<li>\nsubset : un vecteur optionnel spécifiant un sous-ensemble d'observations à utiliser.\n</li>\n<li>\nna.action : une fonction qui indique ce qui doit se passer lorsque les données contiennent des NA. Par défaut, cela correspond à getOption(\"na.action\").\n</li>\n<li>\n... : d'autres arguments à passer aux méthodes ou à partir des méthodes.\n</li>\n</ul>\n<b>Détails</b></br>\nfriedman.test peut être utilisé pour analyser des conceptions de blocs complets non répliqués (c'est-à-dire qu'il y a exactement une observation dans y pour chaque combinaison de niveaux de groupes et de blocs) où l'hypothèse de normalité peut être violée.</br>\nL'hypothèse nulle est qu'à part un effet des blocs, le paramètre de localisation de y est le même dans chacun des groupes.\nSi y est une matrice, les groupes et les blocs sont obtenus à partir des indices de colonnes et de lignes, respectivement. Les NA ne sont pas autorisés dans les groupes ou les blocs ; si y contient des NA, les blocs correspondants sont supprimés.</br>\n<b>Valeur</b><br/>\nUne liste avec la classe \"htest\" contenant les composants suivants :<br/>\nstatistic : la valeur de la statistique du chi carré de Friedman.<br/>\nparameter : les degrés de liberté de la distribution du chi carré approximatif de la statistique de test.<br/>\np.value : la valeur p du test.<br/>\nmethod : la chaîne de caractères \"Test de somme de rang de Friedman\".<br/>\ndata.name : une chaîne de caractères donnant les noms des données.​<br/>\n<b>Exemples</b><br/>\n<code> \nDataframe <- data.frame(Expenses=c(20,23,19,25,26), Sales=c(48,50,55,51,49), Gender=c('m','f','f','m','m'), Deptt=c('Comptabilité', 'RH', 'Ventes','Marketing','TI'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Sales,Expenses)))<br/>\nResult_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>Package</b></br>\nstats</br>\n<b>Aide</b></br>\nhelp(friedman.test, package=stats)\n"
  }
}