{
  "title": "Rapports de vraisemblance et tracés de bêtas",
  "navigation": "Rapports de vraisemblance et tracés de bêtas",
  "label1": "Sélectionnez un modèle (les modèles de classe Rm, dRm et eRm sont pris en charge)",
  "label1b": "Si aucun modèle n'est disponible, vous devez d'abord créer un modèle en sélectionnant Ajustement de modèle -> IRT -> Modèle de Rasch simple et choisir l'estimation CML",
  "modelselector1": "Sélectionnez un modèle",
  "spcr": "Critères de séparation",
  "destination": "Sélectionnez les variables pour tracer les bêtas",
  "help": {
    "title": "Rapports de vraisemblance et tracés de bêtas",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>Description</b></br>\n                Ce test LR est basé sur la séparation des sous-groupes de sujets.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \n## Méthode S3 pour la classe 'Rm'\n<br/>\nLRtest(object, splitcr = \"median\", se = TRUE)\n<br/>\n## Méthode S3 pour la classe 'LR'\n<br/>\nplotGOF(x, beta.subset = \"all\", main = \"Vérification graphique du modèle\", xlab, ylab,\n    tlab = \"élément\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject: Objet de la classe \"Rm\".\n</li>\n<li>\nsplitcr: Critère de séparation pour la séparation des scores bruts des sujets. \"all.r\" correspond à une séparation complète des scores bruts, \"median\" utilise la médiane comme critère de séparation, \"mean\" effectue une séparation par la moyenne. Optionnellement, splitcr peut également être un vecteur qui assigne chaque personne à un certain sous-groupe (par exemple, suivant un critère externe). Ce vecteur peut être numérique, caractère ou un facteur.\n</li>\n<li>\nse: contrôle le calcul des erreurs standards dans les sous-modèles (par défaut : TRUE)\n</li>\n<li>\nx: Objet de la classe \"LR\". Utilisé également pour visualiser l'ajustement des éléments individuels.\n</li>\n<li>\nbeta.subset: Si \"all\", tous les éléments sont tracés. Sinon, un vecteur de sous-ensemble numérique peut être spécifié.\n</li>\n<li>\ntlab: Spécification des étiquettes d'éléments : \"item\" imprime les noms des éléments, \"number\" donne des entiers correspondant à l'ordre des paramètres bêta, si \"none\" aucune étiquette n'est imprimée. \"identify\" permet un étiquetage interactif. Initialement, aucune étiquette n'est imprimée, après avoir cliqué près d'un point d'élément, l'étiquette correspondante est ajoutée. Le processus d'identification est terminé en cliquant sur le deuxième bouton et en sélectionnant 'Stop' dans le menu, ou depuis le menu 'Stop' sur la fenêtre graphique. Pour plus d'informations et le fonctionnement de base, voir identify.\n</li>\n<li>\nconf: pour tracer des ellipses de confiance pour les paramètres des éléments. Si conf = NULL (par défaut), aucune ellipse n'est tracée. Sinon, conf doit être spécifié comme une liste avec des éléments optionnels : gamma, est le niveau de confiance (numérique), col et lty, couleur et type de ligne (voir par), qui (vecteur d'index numérique) spécifie pour quels éléments les ellipses sont tracées (doit être un sous-ensemble de beta.subset), et ia, logique, si les ellipses doivent être tracées de manière interactive (cf., tlab = \"identify\" ci-dessus). Pour des détails sur le comportement par défaut, si conf est spécifié comme une liste vide, voir Détails et Exemples ci-dessous. Pour utiliser conf, l'objet LR x doit être généré en utilisant l'option se = TRUE dans LRtest(). Voir help(MLoef) pour plus de détails.\n</li>\n</ul>\n<b>Détails</b></br>\nSi l'ensemble de données contient des valeurs manquantes et que la moyenne ou la médiane est spécifiée comme critère de séparation, les moyennes ou les médianes sont calculées pour chaque sous-groupe de valeurs manquantes et utilisées en conséquence pour la séparation des scores bruts.\n<br/>\nLors de l'utilisation de la sélection interactive pour l'étiquetage de points uniques (tlab = \"identify\" et le traçage d'ellipses de confiance à certains points (ia = TRUE), tous les points tracés sont d'abord étiquetés, puis toutes les ellipses sont générées. Les deux processus d'identification peuvent être terminés en cliquant sur le deuxième bouton de la souris et en sélectionnant 'Stop' dans le menu, ou depuis le menu 'Stop' sur la fenêtre graphique.\n<br/>\nEn utilisant la spécification qui permet de tracer sélectivement des ellipses pour certains éléments uniquement, par exemple, which = 1:3 trace des ellipses pour les éléments 1 à 3 (tant qu'ils sont inclus dans beta.subset). Le comportement par défaut est de tracer des ellipses pour tous les éléments. L'élément col dans la liste conf peut être soit une spécification de couleur unique telle que \"bleu\" ou un vecteur avec des spécifications de couleur pour tous les éléments. La longueur doit être la même que le nombre d'ellipses à tracer. Pour la spécification de couleur, une palette peut être configurée en utilisant des palettes standard (par exemple, arc-en-ciel) ou des palettes du package colorspace ou RColorBrewer. Un exemple est donné ci-dessous.\n<br/>\nLes méthodes summary et print sont disponibles pour les objets de la classe LR.\n<br/><br/>\n<b>Valeur</b><br/>\nLRtest retourne un objet de la classe LR contenant :\n<br/><br/>\nLR: valeur LR.\n<br/>\ndf: Degrés de liberté de la statistique de test.\n<br/>\nChisq: valeur du chi carré avec df correspondant.\n<br/>\n<br/>\n<b>Package</b></br>\neRm\n<br/><br/>\n<b>Aide</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}