{
  "title": "Régression Linéaire",
  "navigation": "Linéaire, avancé",
  "modelname": "Entrez le nom du modèle",
  "dependent": "Variable dépendante",
  "independent": "Variable(s) indépendante(s)",
  "unusualObservations": "Ajustement et diagnostics pour des observations inhabituelles",
  "generateplotchk": "Tracer les résidus vs ajustés, Q-Q normal, échelle-localisation et résidus vs levier",
  "weights": "Spécifiez une variable avec des poids",
  "help": {
    "title": "Régression Linéaire, constructeur de formule",
    "r_help": "help(lm, package ='stats')",
    "body": "\n            <b>Description</b></br>\nConstruit un modèle de régression linéaire en créant une formule à l'aide du constructeur de formule. Appelle en interne la fonction lm dans le package stats. Renvoie un objet appelé BSkyLinearRegression qui est un objet de la classe lm. Affiche un résumé du modèle, un tableau des coefficients, un tableau Anova et un tableau des sommes des carrés et trace les résidus suivants vs. ajustés, Q-Q normal, quantiles théoriques, résidus vs. levier. \n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nLinearRegModel1 <- lm(depVar~indepVars, dataset)​<br/>\n# Résumer le modèle<br/>\nsummary(LinearRegModel1)<br/>\n# Afficher le tableau Anova<br/>\nanova(LinearRegModel1)<br/>\n# Tracer les résidus vs. ajustés, Q-Q normal, échelle-localisation, résidus vs. levier<br/>\nplot(LinearRegModel1)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndepVar: Nom de la variable dépendante. Si nous avons un ensemble de données voitures, avec une variable mpg que nous voulons prédire mpg (la variable dépendante est mpg) entrez mpg​\n</li>\n<li>\nindepVars: Noms de la variable dépendante. Si nous avons un ensemble de données voitures, avec la variable dépendante puissance, taille du moteur, entrez puissance+taille du moteur. Les variables catégorielles sont automatiquement codées en variables fictives.​\n</li>\n<li>\ndataset: Nom du dataframe. Lorsque vous ouvrez des cadres de données ou des ensembles de données par exemple csv, fichiers Excel, fichiers SAS dans BlueSky Statistics, ils sont nommés Dataset1, Dataset2, Dataset3 donc entrez Dataset1\n</li>\n</ul>\n<b>Package</b></br>\nstats</br>\n<b>Aide</b></br>\nhelp(lm, package ='stats')\n\t\t\t"
  }
}