{
  "title": "Logit multinomial",
  "navigation": "Logit multinomial",
  "modelname": "Entrez le nom du modèle",
  "dependent": "Variable dépendante",
  "independent": "Variable(s) indépendante(s)",
  "generateplotchk": "Tracer les résidus vs ajustés, Q-Q normal, échelle-localisation et résidus vs levier",
  "destination2": "Spécifiez une variable avec des poids",
  "help": {
    "title": "Logit multinomial",
    "r_help": "help(multinom, package=nnet)",
    "body": "\n            <b>Description</b></br>\n            Ajuste des modèles log-linéaires multinomiaux via des réseaux de neurones.\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            multinom(formula, data, weights, subset, na.action,<br/>\n                     contrasts = NULL, Hess = FALSE, summ = 0, censored = FALSE,<br/>\n                     model = FALSE, ...)<br/>\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            formula: une expression de formule comme pour les modèles de régression, de la forme réponse ~ prédicteurs. La réponse doit être un facteur ou une matrice avec K colonnes, qui sera interprétée comme des comptes pour chacune des K classes. Un modèle log-linéaire est ajusté, avec des coefficients nuls pour la première classe. Un offset peut être inclus : il doit s'agir d'une matrice numérique avec K colonnes si la réponse est soit une matrice avec K colonnes soit un facteur avec K >= 2 classes, ou d'un vecteur numérique pour un facteur de réponse avec 2 niveaux. Voir la documentation de formula() pour d'autres détails.\n            </li>\n            <li>\n            data: un cadre de données optionnel dans lequel interpréter les variables apparaissant dans la formule.\n            </li>\n            <li>\n            weights: poids de cas optionnels lors de l'ajustement.\n            </li>\n            <li>\n            subset: expression indiquant quel sous-ensemble des lignes des données doit être utilisé dans l'ajustement. Toutes les observations sont incluses par défaut.\n            </li>\n            <li>\n            na.action: une fonction pour filtrer les données manquantes.\n            </li>\n            <li>\n            contrasts: une liste de contrastes à utiliser pour certains ou tous les facteurs apparaissant comme variables dans la formule du modèle.\n            </li>\n            <li>\n            Hess: logique pour savoir si le Hessien (la matrice d'information observée/attendue) doit être retourné.\n            </li>\n            <li>\n            summ: entier ; si non nul, résume en supprimant les lignes dupliquées et ajuste les poids. Les méthodes 1 et 2 diffèrent en vitesse (2 utilise C) ; la méthode 3 combine également les lignes avec le même X et des Y différents, ce qui change la référence pour la déviance.\n            </li>\n            <li>\n            censored: Si Y est une matrice avec K colonnes, interprétez les entrées comme un pour les classes possibles, zéro pour les classes impossibles, plutôt que comme des comptes.\n            </li>\n            <li>\n            model: logique. Si vrai, le cadre du modèle est enregistré comme composant modèle de l'objet retourné.\n            </li>\n            <li>\n            ... arguments supplémentaires pour nnet\n            </li>\n            </ul>\n            <b>Détails</b></br>\n            multinom appelle nnet. Les variables à droite de la formule doivent être à peu près mises à l'échelle à [0,1] ou l'ajustement sera lent ou peut ne pas converger du tout.</br>\n            <b>Valeur</b><br/>\n            Un objet nnet avec des composants supplémentaires :<br/>\n            <li>\n            déviance : la déviance résiduelle, comparée au modèle saturé complet (qui explique exactement les observations individuelles). De plus, moins deux fois la log-vraisemblance.\n            </li>\n            <li>\n            edf : le nombre (effectif) de degrés de liberté utilisés par le modèle\n            </li>\n            <li>\n            AIC : l'AIC pour cet ajustement.\n            </li>\n            <li>\n            Hessien : (si Hess est vrai).\n            </li>\n            <li>\n            modèle : (si le modèle est vrai).\n            </li>\n            <b>Exemples</b><br/>\n            <code> \n            options(contrasts = c(\"contr.treatment\", \"contr.poly\"))<br/>\n            library(MASS)<br/>\n            example(birthwt)<br/>\n            (bwt.mu <- multinom(low ~ ., bwt))<br/>\n            </code>\n            <b>Paquet</b></br>\n            nnet</br>\n            <b>Aide</b></br>\n            Pour une aide détaillée, cliquez sur l'icône R en haut à droite de cette fenêtre de dialogue ou exécutez la commande suivante help(multinom, package=nnet) en créant un bloc de code R en cliquant + dans la fenêtre de sortie\n           "
  }
}