{
    "title": "Régression Paramétrique de Survie",
    "navigation": "Régression Paramétrique de Survie",
    "modelname": "Entrez le nom du modèle",
    "timevar": "Temps jusqu'à l'événement ou la censure",
    "eventvar": "Événement (1 ou plus = événement, 0 ou moins = censure)",
    "destvars": "Variables indépendantes",
    "weightvar": "Poids (optionnel)",
    "rmstChk": "Calculer le temps moyen de survie restreint (RMST)",
    "rmstSEChk": "Calculer l'erreur standard pour le RMST à l'aide du bootstrap (remarque : cela peut prendre un certain temps)",
    "bootIter": "Itérations de Bootstrap",
    "HazardRatioChk": "Calculer les ratios de risque",
    "labelSurvival": "Type de graphique de survie",
    "survivalradioCI": "Survie avec intervalle de confiance",
    "survivalradio": "Survie",
    "survivalradioKMCI": "Survie avec superposition Kaplan-Meier (non paramétrique) et intervalle de confiance",
    "survivalradioKM": "Survie avec superposition Kaplan-Meier (non paramétrique)",
    "labelFailure": "Type de graphique de défaillance cumulative",
    "inciradioCI": "Défaillance cumulative avec intervalle de confiance",
    "inciradio": "Défaillance cumulative",
    "inciradioKMCI": "Défaillance cumulative avec superposition Kaplan-Meier (non paramétrique) et intervalle de confiance",
    "inciradioKM": "Défaillance cumulative avec superposition Kaplan-Meier (non paramétrique)",
    "spectimes": "Calculer la probabilité de survie - spécifiez les temps comme time1, time2, time3, etc. ou comme seq (1,5,by=1)",
    "specprobs": "Calculer le temps de survie jusqu'à l'événement - spécifiez le quantile (probabilité) comme 0.25, 0.50, 0.60, 0.75, etc. ou comme seq (0.2,0.9,by=0.1)",
    "coVarValues": "Si laissé vide, les valeurs moyennes des variables indépendantes (covariables) seront utilisées. Sinon, spécifiez des valeurs séparées par des virgules à utiliser pour estimer les probabilités et tracer les graphiques",
    "labelDistribution": "Sélectionnez une fonction de distribution qui s'adapte le mieux aux données",
    "selectDistFuncWeibullRad": "Weibull",
    "selectDistFuncExpRad": "Exponentielle",
    "selectDistFuncGammaRad": "Gamma",
    "selectDistFuncLnormalRad": "Log-normale",
    "selectDistFuncPoissonRad": "Poisson",
    "selectDistFuncNBinomRad": "Binomiale négative",
    "selectDistFuncGeomRad": "Géométrique",
    "selectDistFuncBetaRad": "Bêta",
    "selectDistFuncUnifRad": "Uniforme",
    "selectDistFuncLogisRad": "Logistique",
    "selectDistFuncLogLogisRad": "Log-logistique",
    "selectDistFuncCauchyRad": "Cauchy",
    "selectDistFuncNormRad": "Normale",
    "confidenceInterval": "Intervalles de confiance pour les estimations de vraisemblance maximale",
    "help": {
        "title": "Régression Paramétrique de Survie",
        "r_help": "help(flexsurvreg, package = 'flexsurv')",
        "body": "\n\t\t\tConsultez l'ensemble de données d'exemple dans le répertoire d'installation, l'emplacement par défaut est dans le lecteur:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. La variable Followup_time doit être entrée comme le temps jusqu'à l'événement ou la censure et la variable Event doit être entrée comme l'événement (1 = événement, 0 = censure).<br/>\n            <br/>\n            <br/>\n\t\t\tLes ensembles de données d'exemple sont lung, manufacturing_data et bulb reliability <br/><br/>\t\t\n            <b>Estimation des paramètres de régression de survie paramétrique et graphiques avec superposition des courbes de survie Kaplan-Meier (modèle nul/intercept uniquement)</b>\n            <br/>\n            <br/>\n            Ces outils permettent d'estimer le risque cumulé de ne pas avoir un événement (ou inversement, d'avoir un événement) sur une certaine durée après le début du suivi pour cet événement (ou temps zéro). Les sujets doivent être à risque pour l'événement à partir du temps zéro.\n            <br/>\n            <br/>\n            <b>Temps :</b> Durée jusqu'à un événement ou dernier suivi pour cet événement si l'événement ne s'est pas produit, pour chaque sujet\n            <br/><br/>\n            <b>Événement :</b> Indicateur numérique indiquant si l'événement s'est produit (1=événement, 0=censure) pour chaque sujet\n            <br/><br/>\n            <b>Type de graphique :</b> Représenter la probabilité de ne pas avoir l'événement (survie) ou d'avoir l'événement (défaillance)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Tableau des estimations pour des temps ou probabilités spécifiques :</b> Option pour inclure un tableau contenant les probabilités d'estimation de survie pour un ensemble de temps sélectionnés par l'utilisateur.\n\t\t\t<br/><br/>\n\t\t\t<b>Spécifiez les temps comme time1, time2, time3, etc. ou comme seq(1,5,by=1) :</b> Ce sont les temps spécifiques qui seront inclus dans le tableau pour des temps spécifiques. Ils peuvent être spécifiés individuellement avec des virgules ou comme une séquence de valeurs régulièrement espacées.\n\t\t\t<br/><br/>\n            Les tableaux affichent la taille de l'échantillon, le nombre de sujets ayant l'événement, le temps médian de survie (si défini), le temps moyen de survie restreint et le temps médian de suivi. Le temps médian de suivi est calculé à l'aide de l'estimateur Kaplan-Meier inversé, qui traite les événements réels comme des observations censurées et les observations censurées réelles comme des événements. Ainsi, l'\"événement\" dans cet estimateur est \"suivre les sujets aussi longtemps que possible pendant l'étude\".\n            <br/>\n            Un tableau des estimations de survie paramétrique et d'événements pour la distribution choisie est fourni à chaque temps observé dans l'ensemble de données, avec des intervalles de confiance donnés.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Options de style</b>\n            <br/>\n            <br/>\n            <b>Titre du graphique :</b> Titre du graphique ; supprimer tout texte pour aucun titre\n            <br/><br/>\n\t\t\t<b>Taille du titre du graphique :</b> Taille du titre du graphique.\n\t\t\t<br/><br/>\n            <b>Thème du graphique :</b> Style général du graphique\n            <br/><br/>\n            <b>Inclure le nombre à risque :</b> Optionnellement, inclure un tableau pour le nombre de sujets toujours à risque au fil du temps en bas du graphique. <b>Position du tableau de risque</b> spécifie si vous voulez que le tableau soit en dehors des axes ou à l'intérieur des axes. La <b>hauteur du tableau de risque</b> contrôle la proportion de la zone de tracé occupée par le tableau. Cette option est ignorée lorsque la position du tableau de risque est à l'intérieur des axes. \n\t\t\tLa <b>taille des valeurs du tableau de risque</b> contrôle la taille des nombres à risque. La <b>taille du titre du tableau de risque</b> contrôle la taille du titre du tableau du nombre à risque.\n\t\t\tLa <b>taille des étiquettes d'axe du tableau de risque</b> contrôle la taille des étiquettes des axes.\n\t\t\tLa <b>taille des étiquettes des graduations du tableau de risque</b> contrôle la taille des étiquettes des graduations pour les temps dans le tableau du nombre à risque. Si vous souhaitez supprimer tous les axes et les lignes de la grille \n\t\t\tdu tableau de risque, l'option <b>Supprimer les axes et les lignes de la grille du tableau de risque</b> peut être cochée. Cela inclura uniquement les nombres à risque dans le tableau.\n            <br/>\n            <br/>\n            <b>Options de ligne :</b>\n            <b>Taille</b> contrôle l'épaisseur des lignes de survie et des intervalles de confiance, et <b>Type</b> contrôle le style des lignes (pointillées, pleines, etc.). Le choix des couleurs des lignes de survie permet de sélectionner des couleurs spécifiques pour les lignes de survie correspondant à chaque niveau d'une variable catégorielle. Vous pouvez sélectionner un ensemble de couleurs prédéfinies dans l'option. La transparence (ou opacité) des lignes peut être ajustée via l'option <b>Alpha</b>.\n            <br/>\n..."
    }
}
