{
  "title": "Diagramme circulaire",
  "suppressLabels": "Supprimer toutes les étiquettes pour les comptes et les pourcentages",
  "optionsLabels": "Options pour les étiquettes",
  "suppressThreshold": "Supprimer les étiquettes pour les comptes et pourcentages inférieurs au pourcentage seuil spécifié",
  "radius": "Spécifiez un rayon pour afficher les étiquettes (augmenter le rayon déplace les étiquettes vers l'extérieur)",
  "radiusNote": "Remarque : L'option ci-dessus ne s'applique pas lorsque l'option d'affichage des cercles concentriques est sélectionnée.",
  "navigation": "Diagramme circulaire",
  "concentricCircles": "Afficher des cercles concentriques (s'applique uniquement lorsque la variable de l'axe X est spécifiée)",
  "x": "Axe X, spécifiez les variables de facteur",
  "y": "Variable Y, spécifiez une variable numérique",
  "fill": "Remplissage, spécifiez une variable de facteur",
  "alpha": "Opacité (0-1)",
  "width": "Largeur",
  "rdgrp1": "Proportions de remplissage",
  "flip": "Inverser l'axe",
  "barcolor": "Couleur de la barre (Après la sélection de la couleur, cliquez en dehors du contrôle pour appliquer)",
  "specify_a_title": "Entrez un titre",
  "x_title": "Étiquette de l'axe X",
  "y_title": "Étiquette de l'axe Y",
  "Facetrow": "Ligne de facette",
  "Facetcolumn": "Colonne de facette",
  "Facetwrap": "Enveloppe de facette",
  "Facetscale": "Échelle de facette",
  "help": {
    "title": "Diagramme circulaire",
    "r_help": "help(coord_polar, package='ggplot2')",
    "body": "\n            <b>Description</b></br>\n            Un diagramme circulaire (ou un graphique circulaire) est un graphique statistique circulaire, qui est divisé en tranches pour illustrer la proportion numérique. Dans un diagramme circulaire, la longueur de l'arc de chaque tranche (et par conséquent son angle central et sa surface) est proportionnelle à la quantité qu'elle représente. La quantité peut être représentée comme un compte ou un pourcentage.\n            Les facettes peuvent être créées en spécifiant une variable de facteur. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y.</br>\n            Lorsque vous spécifiez plusieurs variables x, nous créons un diagramme circulaire séparé pour chaque variable x. </br>\n            Le rayon vous permet de contrôler le placement des étiquettes. Un rayon de 1 place les étiquettes au centre du diagramme, un rayon de 1,6 place les étiquettes à l'extérieur du diagramme.</br>\n            Le cercle extérieur gris clair représente le compte ou le total. Voir le texte en bas du diagramme circulaire pour plus de détails.\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code>\n            #Vous pouvez créer un diagramme circulaire pour une seule variable de facteur, les diagrammes représenteront les comptes de chaque niveau du facteur. Ici, la variable de facteur correspondra au remplissage<br/>\n            ggplot(data=penguins, aes(x='', fill=species )) +\n\tgeom_bar( alpha=1,width=1,) +\n\tcoord_polar(\"y\") +\n\tlabs(  title= \"Diagramme circulaire avec remplissage : espèce\") +\n\tylab(\"\") + \n\txlab(\"Compte\")</br></br>\n            #Vous pouvez créer un diagramme circulaire en spécifiant une variable de scale/numeric comme variable y, et en remplissant les tranches du diagramme par une variable de facteur. Les diagrammes sont remplis en additionnant les valeurs de la variable y pour chaque niveau de la variable de facteur, voir l'exemple ci-dessous<br/>\n            ggplot(data = penguins, aes(x = \"\", y = bill_length_mm, fill = species)) + geom_bar(alpha = 1,\n                width = 0.9, stat = \"identity\") + coord_polar(\"y\") </br></br>\n    #Vous pouvez spécifier une variable x, une variable y et un remplissage. Les tranches sont créées pour chaque niveau de la variable x et remplies par la somme des valeurs de la variable y pour chaque niveau de la variable spécifiée dans le remplissage.<br/>\n    ggplot(data = penguins, aes(x = island, y = bill_length_mm, fill = species)) + geom_bar(alpha = 1,\n        width = 0.9, stat = \"identity\")<br/><br/>\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data: Le jeu de données par défaut​\n            </li>\n            <li>\n            aes():    Générer des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géométries.​\n            </li>\n            <li>\n            x: (Optionnel) Une variable de facteur/catégorique. La longueur de la barre correspond aux comptes de chaque niveau de la variable de facteur.​\n            </li>\n            <li>\n            Y: (Optionnel) une variable numérique\n            </li>\n            <li>\n            fill: (Optionnel) Une variable de facteur/catégorique optionnelle pour regrouper les comptes des niveaux dans x : (voir ci-dessus)​\n            </li>\n            <li>\n            geom_bar(): Crée le graphique à barres, position =\"fill\" remplit la barre avec un pourcentage de chaque niveau de regroupement.​\n            </li>\n            <li>\n            Coor_polar(): Le système de coordonnées polaires est le plus couramment utilisé pour les diagrammes circulaires, qui sont un graphique à barres empilées en coordonnées polaires.\n            </li>\n            <li>\n            Labs(): Changez les étiquettes des axes et les titres de légende (c'est optionnel)​\n            </li>\n            <li>\n            facet_grid(): Disposez les panneaux dans une grille (c'est optionnel)​\n            </li>\n            <li>\n            theme_calc(): Spécifie le thème du calculateur (c'est optionnel)​\n            </li>\n            <li>\n            coord_flip(): Inverser l'axe (c'est optionnel)​\n            </li>\n            <li>\n            alpha: Contrôle l'opacité, prend des valeurs entre 0-1. 1 signifie aucune opacité.\n            </li>\n            </ul>\n            <b>Package</b></br>\n            ggplot2;ggthemes;</br>\n            <b>Aide</b></br>\n            help(coord_polar, package=ggplot2)</br>\n            Autre : Cliquez sur le bouton Aide R pour obtenir une aide détaillée sur R. Vous pouvez également entrer help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​            \n    "
  }
}