{
  "title": "Tracer la carte Personne-Objet",
  "navigation": "Tracer la carte Personne-Objet",
  "label1": "Sélectionnez un modèle (les modèles de classe Rm et dRm sont pris en charge)",
  "label1b": "Si aucun modèle n'est disponible, vous devez d'abord créer un modèle en sélectionnant Ajustement du modèle -> IRT",
  "modelselector1": "Sélectionnez un modèle",
  "range1": "Plage pour l'axe X",
  "help": {
    "title": "Tracer la carte Personne-Objet",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>Description</b></br>\n                Une carte personne-objet affiche la localisation des paramètres d'objet (et de seuil) ainsi que la distribution des paramètres de personne le long de la dimension latente. Les cartes personne-objet sont utiles pour comparer la plage et la position de la distribution de mesure des objets (panneau inférieur) à la plage et à la position de la distribution de mesure des personnes (panneau supérieur). Les objets devraient idéalement être situés le long de l'échelle entière pour mesurer de manière significative l'« aptitude » de toutes les personnes.\n\n                <br/><br/>\n                <b>Utilisation</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"Carte Personne-Objet\", latdim = \"Dimension Latente\",\n                pplabel = \"Distribution\nDes\nParamètres\nDes Personnes\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>Arguments</b>\n                <br/>  \n                object: Objet de classe Rm ou dRm\n                <br/>\n                item.subset: Sous-ensemble d'objets à tracer. Soit un vecteur numérique indiquant la colonne dans X ou un vecteur de caractères indiquant le nom de la colonne. Si \"all\", tous les objets sont tracés. Le nombre d'objets à tracer doit être > 1.\n                <br/>\n                sorted: Si TRUE, les objets sont triés par ordre croissant selon leur localisation sur la dimension latente.   \n                <br/>\n                main: Titre principal du tracé.\n                <br/>\n                latdim: Étiquette de l'axe des x, c'est-à-dire la dimension latente.\n                <br/>\n                pplabel: Titre pour le panneau supérieur affichant la distribution des paramètres de personne\n                <br/>\n                cex.gen: cex en tant que paramètre graphique spécifie une valeur numérique donnant le montant par lequel le texte et les symboles de tracé doivent être agrandis par rapport à la valeur par défaut. Ici, cex.gen s'applique à toutes les étiquettes de texte. La valeur par défaut est 0.7.\n                <br/>\n                xrange: Plage pour l'axe des x\n                <br/>\n                warn.ord: Si TRUE (la valeur par défaut), des astérisques sont affichés dans la marge droite du panneau inférieur pour indiquer les emplacements de seuil non ordonnés pour les objets polytomiques.\n                <br/>\n                warn.ord.colour: Les emplacements de seuil non ordonnés pour les objets polytomiques sont colorés avec cette couleur pour les rendre plus visibles. Cela est particulièrement utile lorsqu'il y a de nombreux objets afin que le tracé soit assez dense. La valeur par défaut est \"noir\", de sorte qu'aucune distinction n'est faite.\n                <br/>   \n                irug: Si TRUE (la valeur par défaut), tous les seuils sont tracés en dessous de la distribution des personnes pour indiquer où les objets inclus sont les plus informatifs.                \n                <br/>\n                pp: Si non-NULL, cela contient les données de paramètres de personne de l'objet de données, évitant ainsi la nécessité de les recalculer.\n                <br/><br/>\n\n                <b>Packages</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>Aide</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}