{
  "title": "Graphiques P-P",
  "navigation": "P-P",
  "alpha": "Opacité (0-1)",
  "x": "Axe X, spécifiez une ou plusieurs variables numériques",
  "y": "Forme, spécifiez une variable factorielle",
  "color": "Couleur, spécifiez une variable factorielle",
  "referenceline": "Ligne de référence",
  "band": "Afficher les bandes",
  "detrend": "Détrendre",
  "flip": "Inverser l'axe",
  "distribution": "Sélectionnez une distribution",
  "x_title": "Étiquette de l'axe X",
  "y_title": "Étiquette de l'axe Y",
  "label1": "Paramètres de distribution, par exemple pour une distribution normale, les paramètres de distribution pourraient être moyenne=2, écart-type=2 donc entrez moyenne=2, écart-type=2. Pour une distribution exponentielle, les paramètres pourraient être taux=2, donc entrez taux=2.",
  "dparams": "Entrez éventuellement les paramètres de distribution",
  "specify_a_title": "Entrez un titre",
  "Facetrow": "Ligne de facette",
  "Facetcolumn": "Colonne de facette",
  "Facetwrap": "Enveloppe de facette",
  "Facetscale": "Échelle de facette",
  "facets_lbl" : "Facettes",
  "help": {
    "title": "Graphiques P-P",
    "r_help": "help(stat_pp_point,package='qqplotr')",
    "body": "\n            <b>Description</b></br>\n            Un graphique P–P (graphique de probabilité–probabilité ou graphique de pourcentage–pourcentage ou graphique de valeur P) est un graphique de probabilité pour évaluer à quel point deux ensembles de données s'accordent, qui trace les deux fonctions de distribution cumulative l'une par rapport à l'autre. Par défaut, nous comparons la distribution cumulative de la variable sélectionnée par rapport à la distribution normale, cependant, vous pouvez comparer avec plusieurs autres distributions, y compris beta, cauchy, chisq, exp, f, gamma... Vous pouvez également spécifier les paramètres de distribution associés à la distribution avec laquelle vous comparez. Cliquez sur le bouton d'options dans la boîte de dialogue principale pour sélectionner une distribution et spécifier les paramètres de distribution. Vous pouvez sélectionner une variable factorielle pour regrouper la variable sélectionnée. Dans ce cas, un graphique P-P séparé est tracé pour chaque groupe.\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            ggplot(data = datasetname,mapping= aes(sample = var1 ,shape = var2 ))  +stat_pp_band() + stat_pp_line() + stat_pp_point()  +labs(x = \"Points de probabilité\",y = \"Probabilité cumulative\",title =paste(\"Graphique PP pour la variable \",var1,sep=''))+facet_grid(var3 ~.)\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data: Le jeu de données par défaut​\n            </li>\n            <li>\n            aes(): Générer des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géométries.​\n            </li>\n            <li>\n            sample: la variable numérique pour tracer le graphique P-P\n            </li>\n            <li>\n            stat_pp_point: Trace les probabilités cumulatives par rapport aux points de probabilité. La fonction de probabilité cumulative est construite avec les données d'échantillon, puis évaluée à chaque point de probabilité.\n            </li>\n            <li>\n            stat_pp_line: Trace une ligne d'identité de référence (x=y).\n            </li>\n            <li>\n            stat_pp_band: Trace des bandes de confiance. Pour l'instant, seule la version bootstrap (\"boot\") est disponible.\n            </li>\n            <li>\n            shape: Une variable factorielle optionnelle qui regroupe les valeurs assignées à l'échantillon. Un graphique P-P séparé est créé pour chaque groupe déterminé par les niveaux de la variable factorielle​. Chaque groupe est indiqué par une forme différente\n            </li>\n            <li>\n            Labs(): Modifier les étiquettes des axes et les titres de légende (C'est optionnel)​\n            </li>\n            <li>\n            facet_grid(): Disposer les panneaux dans une grille (C'est optionnel)​. Voir help(facet_grid) pour plus de détails.\n            </li>\n            <li>  ​\n            coord_flip(): Inverser l'axe (C'est optionnel)​\n            </li>\n            </ul>\n            <b>Package</b></br>\n            ggplot2;ggthemes;qqplotr;</br>\n            <b>Aide</b></br>\n            help(stat_pp_point, package='qqplotr')</br>\n            Autre: Cliquez sur le bouton Aide R pour obtenir une aide détaillée sur R. Vous pouvez également entrer help(labs), help(stat_pp_point), help(aes), help(facet_grid), help(coord_flip)</br>​\n            https://cran.r-project.org/web/packages/qqplotr/vignettes/introduction.html\n        "
  }
}