{
  "title": "Taille d'échantillon, Précision du Kappa de Cohen",
  "navigation": "Kappa de Cohen",
  "howtouse": "Spécifiez soit la taille de l'échantillon, soit la largeur de l'intervalle de confiance et l'autre sera calculé",
  "n": "Taille d'échantillon",
  "width": "Largeur de l'intervalle de confiance",
  "kappa": "Kappa (0-1)",
  "conflevel": "Niveau de confiance (0-1)",
  "raters": "Nombre d'évaluateurs (2-6)",
  "categories": "Nombre de catégories (2-5)",
  "props": "Proportions dans chaque catégorie ; séparez par des virgules, par exemple .3, .7 ; doit correspondre au nombre de catégories et totaliser 1",
  "help": {
    "title": "Taille d'échantillon, Précision du Kappa de Cohen",
    "r_help": "help(prec_kappa, package ='presize')",
    "body": "\nCeci est une évaluation de la taille d'échantillon pour le kappa de Cohen basé sur la largeur de l'intervalle de confiance. Il calcule la taille de l'échantillon ou la largeur de l'intervalle de confiance lorsque l'utilisateur \nspécifie l'autre.\n<br/><br/>\n<b>Taille d'échantillon :</b> Spécifiez le nombre de sujets dans l'étude\n<br/><br/>\n<b>Largeur de l'intervalle de confiance :</b> Spécifiez la largeur de l'intervalle de confiance souhaitée. La largeur d'un intervalle de confiance est une mesure de la précision d'une estimation et est la limite supérieure moins la limite inférieure.\n<br/><br/>\n<b>Kappa :</b> Spécifiez la valeur kappa attendue\n<br/><br/>\n<b>Niveau de confiance :</b> Spécifiez le niveau souhaité de l'intervalle de confiance\n<br/><br/>\n<b>Nombre d'évaluateurs :</b> Spécifiez le nombre d'évaluateurs qui fourniront des valeurs pour chaque sujet.\n<br/><br/>\n<b>Nombre de catégories :</b> Spécifiez le nombre de catégories dans la variable de résultat\n<br/><br/>\n<b>Proportions dans chaque catégorie :</b> Spécifiez la proportion attendue de sujets dans chaque catégorie, séparées par des virgules. Notez que le nombre de valeurs spécifiées doit correspondre au\nnombre de catégories spécifiées et totaliser 1.\n<br/><br/>\n<b>Packages R requis :</b> presize\n\t\t\t"
  }
}