{
  "title": "Taille d'échantillon, précision d'un rapport de risque",
  "navigation": "Rapport de risque",
  "howtouse": "Spécifiez soit la taille de l'échantillon, soit la largeur de l'intervalle de confiance et l'autre sera calculé",
  "n1": "Taille de l'échantillon du groupe 1",
  "width": "Largeur de l'intervalle de confiance",
  "ratio": "Rapport de la taille de l'échantillon du groupe 2 à celle du groupe 1",
  "prop1": "Proportion de résultats du groupe 1",
  "prop2": "Proportion de résultats du groupe 2",
  "conflevel": "Niveau de confiance (0-1)",
  "method": "Méthode de l'intervalle de confiance",
  "help": {
    "title": "Taille d'échantillon, précision d'un rapport de risque",
    "r_help": "help(prec_riskratio, package ='presize')",
    "body": "\nCeci est une évaluation de la taille de l'échantillon pour un rapport de proportions (rapport de risque / risque relatif) basé sur la largeur de l'intervalle de confiance. Il calcule la taille de l'échantillon ou la largeur de l'intervalle de confiance lorsque l'utilisateur \nspécifie l'autre.\n<br/><br/>\n<b>Taille de l'échantillon du groupe 1 :</b> Spécifiez le nombre de sujets dans le groupe 1\n<br/><br/>\n<b>Largeur de l'intervalle de confiance :</b> Spécifiez la largeur de l'intervalle de confiance souhaitée. La largeur d'un intervalle de confiance est une mesure de la précision d'une estimation et est la borne supérieure moins la borne inférieure.\n<br/><br/>\n<b>Rapport de la taille de l'échantillon du groupe 2 à celle du groupe 1 :</b> Spécifiez le rapport de la taille de l'échantillon du groupe 2 à celle du groupe 1. Une valeur de 1 signifie des tailles d'échantillon égales.\n<br/><br/>\n<b>Proportion de résultats du groupe 1 :</b> Spécifiez la proportion de sujets dans le groupe 1 ayant le résultat 'positif'\n<br/><br/>\n<b>Proportion de résultats du groupe 2 :</b> Spécifiez la proportion de sujets dans le groupe 2 ayant le résultat 'positif'\n<br/><br/>\nNotez que le rapport de risque sera calculé comme la proportion dans le groupe 1 divisée par la proportion dans le groupe 2.\n<br/><br/>\n<b>Niveau de confiance :</b> Spécifiez le niveau souhaité de l'intervalle de confiance\n<br/><br/>\n<b>Méthode de l'intervalle de confiance :</b> Spécifiez le type d'intervalle de confiance à utiliser. Koopman (koopman) fournit un intervalle de confiance asymptotique qui est toujours cohérent \navec le test du chi carré de Pearson. C'est l'intervalle recommandé (Fagerland et al.). Katz (katz) utilise une transformation logarithmique pour calculer l'intervalle de confiance. L'IC ne peut pas \nêtre calculé si l'une des proportions est zéro. Si les deux proportions sont 1, l'estimation de l'erreur standard devient zéro, ce qui entraîne un IC de [1, 1].\n<br/><br/>\n<b>Packages R requis :</b> presize\n\t\t\t"
  }
}