{
  "title": "Test de proportion d'échantillon unique",
  "navigation": "Échantillon unique",
  "tvarbox1": "Numérique ou facteur avec 2 niveaux/valeurs uniquement",
  "label1": "Hypothèse alternative",
  "test1": "Proportion != Proportion hypothétique",
  "test2": "Proportion > Proportion hypothétique",
  "test3": "Proportion < Proportion hypothétique",
  "txtbox1": "Niveau de confiance",
  "txtbox2": "Hypothèse nulle (Proportion hypothétique dans la plage 0-1)",
  "chkbox1": "Avec correction de continuité",
  "dataInCols": "Une ou plusieurs variables contiennent des échantillons",
  "summarized": "Données résumées",
  "noOfEvents": "Nombre d'événements",
  "noOfTrials": "Nombre d'essais",
  "method": "Sélectionner la méthode",
  "help": {
    "title": "Test de proportion d'échantillon unique",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>Description</b></br>\nprop.test peut être utilisé pour tester l'hypothèse nulle selon laquelle les proportions (probabilités de succès) dans plusieurs groupes sont les mêmes, ou qu'elles égalent certaines valeurs données.<br/>\nLorsque la méthode = \"Exact\", un test exact d'une hypothèse nulle simple concernant la probabilité de succès dans une expérience de Bernoulli.<br/>\nLorsque la méthode =\"Approximation normale\", la distribution normale est utilisée comme approximation pour la distribution binomiale (lorsque la taille de l'échantillon est suffisamment grande)<br/>\n<code> \nBSky_Single_Sample_Proportion_Test = stats::binom.test( x =5, n =20 , alternative='two.sided', p=0.5, conf.level=0.95)\n</code> <br/>\n<code> \nBSky_Single_Sample_Proportion_Test = BSkyNormalApprox( x =6, n =26 , alternative='two.sided', p=0.5, conf.level=0.95)\n</code> <br/>\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: un vecteur de comptes de succès, un tableau unidimensionnel avec deux entrées, ou un tableau (ou matrice) à deux dimensions avec 2 colonnes, donnant les comptes de succès et d'échecs, respectivement.\n</li>\n<li>\nn: un vecteur de comptes d'essais ; ignoré si x est une matrice ou un tableau.\n</li>\n<li>\np: un vecteur de probabilités de succès. La longueur de p doit être la même que le nombre de groupes spécifiés par x, et ses éléments doivent être supérieurs à 0 et inférieurs à 1.\n</li>\n<li>\nalternative: une chaîne de caractères spécifiant l'hypothèse alternative, doit être l'un de \"two.sided\" (par défaut), \"greater\" ou \"less\". Vous pouvez spécifier juste la lettre initiale. Utilisé uniquement pour tester l'hypothèse nulle selon laquelle une proportion unique est égale à une valeur donnée, ou que deux proportions sont égales ; ignoré sinon.\n</li>\n<li>\nconf.level: niveau de confiance de l'intervalle de confiance retourné. Doit être un nombre unique entre 0 et 1. Utilisé uniquement lors du test de l'hypothèse nulle selon laquelle une proportion unique est égale à une valeur donnée, ou que deux proportions sont égales ; ignoré sinon.\n</li>\n<li>\ncorrect: un indicateur logique indiquant si la correction de continuité de Yates doit être appliquée lorsque cela est possible.\n</li>\n</ul>\n<b>Détails</b></br>\nSeuls les groupes avec des nombres finis de succès et d'échecs sont utilisés. Les comptes de succès et d'échecs doivent être non négatifs et donc pas supérieurs aux nombres correspondants d'essais qui doivent être positifs. Tous les comptes finis doivent être des entiers.</br>\nSi p est NULL et qu'il y a plus d'un groupe, l'hypothèse nulle testée est que les proportions dans chaque groupe sont les mêmes. S'il y a deux groupes, les alternatives sont que la probabilité de succès dans le premier groupe est inférieure, pas égale, ou supérieure à la probabilité de succès dans le deuxième groupe, comme spécifié par l'alternative. Un intervalle de confiance pour la différence de proportions avec un niveau de confiance tel que spécifié par conf.level et limité à [-1,1] est retourné. La correction de continuité n'est utilisée que si elle ne dépasse pas la différence des proportions d'échantillon en valeur absolue. Sinon, s'il y a plus de 2 groupes, l'alternative est toujours \"two.sided\", l'intervalle de confiance retourné est NULL, et la correction de continuité n'est jamais utilisée.</br>\nS'il n'y a qu'un seul groupe, alors l'hypothèse nulle testée est que la probabilité sous-jacente de succès est p, ou .5 si p n'est pas donné. L'alternative est que la probabilité de succès est inférieure, pas égale, ou supérieure à p ou 0.5, respectivement, comme spécifié par l'alternative. Un intervalle de confiance pour la proportion sous-jacente avec un niveau de confiance tel que spécifié par conf.level et limité à [0,1] est retourné. La correction de continuité n'est utilisée que si elle ne dépasse pas la différence entre les proportions d'échantillon et nulle en valeur absolue. L'intervalle de confiance est calculé en inversant le test de score.</br>\nEnfin, si p est donné et qu'il y a plus de 2 groupes, l'hypothèse nulle testée est que les probabilités sous-jacentes de succès sont celles données par p. L'alternative est toujours \"two.sided\", l'intervalle de confiance retourné est NULL, et la correction de continuité n'est jamais utilisée.</br>\n<b>Valeur</b><br/>\nUne liste avec la classe \"htest\" contenant les composants suivants :</br>\nstatistic: la valeur de la statistique de test du chi carré de Pearson.</br>\nparameter: les degrés de liberté de la distribution du chi carré approximatif de la statistique de test.</br>\np.value: la valeur p du test.</br>\nestimate: un vecteur avec les proportions d'échantillon x/n.</br>\nconf.int: un intervalle de confiance pour la vraie proportion s'il y a un groupe, ou pour la différence de proportions s'il y a 2 groupes et que p n'est pas donné, ou NULL sinon. Dans les cas où il n'est pas NULL, l'intervalle de confiance retourné a un niveau de confiance asymptotique tel que spécifié par conf.level, et est approprié à l'hypothèse alternative spécifiée.</br>\nnull.value: la valeur de p si spécifiée par l'hypothèse nulle, ou NULL sinon.</br>\nalternative: une chaîne de caractères décrivant l'alternative.</br>\nmethod: une chaîne de caractères indiquant la méthode utilisée, et si la correction de continuité de Yates a été appliquée.</br>\ndata.name: une chaîne de caractères donnant les noms des données.</br>\n<b>Paquet</b></br>\nstats</br>\n<b>Aide</b></br>\naide(prop.test, package ='stats')\n"
  }
}