{
  "title": "Division Aléatoire",
  "navigation": "Division Aléatoire",
  "traindataset": "Entrez le nom du jeu de données d'entraînement",
  "testdataset": "Entrez le nom du jeu de données de test",
  "split": "Entrez le pourcentage de division",
  "replace": "L'échantillonnage doit-il se faire avec remplacement",
  "seed": "Définir la graine",
  "dependent": "Variable à partir de laquelle construire des échantillons stratifiés",
  "help": {
    "title": "Division Aléatoire",
    "r_help": "help(sample, package=\"base\")",
    "body": "\n<b>Description</b></br>\nsample prend un échantillon de la taille spécifiée à partir des éléments de x en utilisant soit avec soit sans remplacement.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nsample(x, size, replace = FALSE, prob = NULL)\nsample.int(n, size = n, replace = FALSE, prob = NULL)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx : Soit un vecteur d'un ou plusieurs éléments à partir desquels choisir, soit un entier positif. Voir 'Détails.'\n</li>\n<li>\nn : un nombre positif, le nombre d'éléments à choisir. Voir 'Détails.'\n</li>\n<li>\nsize : un entier non négatif donnant le nombre d'éléments à choisir.\n</li>\n<li>\nreplace : L'échantillonnage doit-il se faire avec remplacement ?\n</li>\n<li>\nprob : Un vecteur de poids de probabilité pour obtenir les éléments du vecteur échantillonné.\n</li>\n</ul>\n<b>Détails</b></br>\nSi x a une longueur de 1, est numérique (au sens de is.numeric) et x >= 1, l'échantillonnage via sample se fait à partir de 1:x. Notez que cette fonctionnalité pratique peut entraîner un comportement indésirable lorsque x a une longueur variable dans des appels tels que sample(x). Voir les exemples.<br/>\nSinon, x peut être n'importe quel objet R pour lequel la longueur et le sous-ensemencement par des entiers ont du sens : les méthodes S3 ou S4 pour ces opérations seront dispatchées comme approprié.<br/>\nPour sample, la valeur par défaut pour size est le nombre d'éléments inféré du premier argument, de sorte que sample(x) génère une permutation aléatoire des éléments de x (ou 1:x).<br/>\nIl est permis de demander des échantillons de taille = 0 avec n = 0 ou un x de longueur zéro, mais sinon n > 0 ou une longueur(x) positive est requise.<br/>\nLes valeurs numériques positives non entières de n ou x seront tronquées à l'entier le plus petit suivant, qui ne doit pas être supérieur à .Machine$integer.max.<br/>\nL'argument prob optionnel peut être utilisé pour donner un vecteur de poids pour obtenir les éléments du vecteur échantillonné. Ils ne doivent pas nécessairement s'additionner à un, mais ils doivent être non négatifs et pas tous nuls. Si replace est vrai, la méthode d'alias de Walker (Ripley, 1987) est utilisée lorsque plus de 200 valeurs raisonnablement probables sont présentes : cela donne des résultats incompatibles avec ceux de R < 2.2.0.<br/>\nSi replace est faux, ces probabilités sont appliquées séquentiellement, c'est-à-dire que la probabilité de choisir l'élément suivant est proportionnelle aux poids parmi les éléments restants. Le nombre de poids non nuls doit être d'au moins size dans ce cas.<br/>\nsample.int est une interface brute dans laquelle n et size doivent être fournis en tant qu'entiers.<br/>\nÀ partir de R 3.0.0, n peut être plus grand que le plus grand entier de type entier, jusqu'à l'entier le plus grand représentable en type double. Seul l'échantillonnage uniforme est pris en charge. Deux nombres aléatoires sont utilisés pour garantir un échantillonnage uniforme d'entiers grands.<br/>\n<b>Package</b></br>\nbase\n<b>Aide</b></br>\nhelp(sample, package=\"base\")\n"
  }
}