{
  "title": "Analyse de Fiabilité (Oméga de McDonald)",
  "navigation": "Oméga de McDonald",
  "tvarbox1": "Tous les éléments",
  "help": {
    "title": "Oméga de McDonald",
    "r_help": "help(omega, package=psych)",
    "body": "\n            <b>Description</b></br>\nCalculez les estimations d'oméga de McDonald pour la saturation des facteurs généraux et totaux\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nomega(m,nfactors=3,fm=\"minres\",n.iter=1,p=.05,poly=FALSE,key=NULL,\n    flip=TRUE,digits=2, title=\"Oméga\",sl=TRUE,labels=NULL,\nplot=TRUE,n.obs=NA,rotate=\"oblimin\",Phi=NULL,option=\"equal\",covar=FALSE, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nm​: Une matrice de corrélation, ou un data.frame/matrice de données, ou (si Phi) est spécifié, une matrice de modèle de facteur oblique\n</li>\n<li>\nnfactors: Le nombre de facteurs groupés\n</li>\n<li>\nfm​: méthode de facteur (la valeur par défaut est minres) fm=\"pa\" pour les axes principaux, fm=\"minres\" pour une solution résiduelle minimale (OLS), fm=\"pc\" pour les composants principaux (voir note), ou fm=\"ml\" pour la vraisemblance maximale.\n</li>\n<li>\nn.iter: Combien de répliques faire dans oméga pour les estimations bootstrap​\n</li>\n<li>\np: probabilité des limites de conférence à deux queues\n</li>\n<li>\ndigits​: si spécifié, arrondir la sortie à des chiffres​\n</li>\n<li>\npoly: la matrice de corrélation doit-elle être trouvée en utilisant des corrélations polychorique/tétrachorique ou normales de Pearson\n</li>\n<li>\nkey​: un vecteur de +/- 1 pour spécifier la direction de la notation des éléments. La valeur par défaut est de supposer que tous les éléments sont positivement notés, mais si certains éléments sont notés à l'envers, alors key doit être spécifié.​\n</li>\n</ul>\n<b>Valeur</b><br/>\nomega hiérarchique: Le coefficient ω_h<br/>\nomega.lim: La limite de ω_h à mesure que le test devient infiniment grand<br/>\nomega total: Le coefficient omega_t<br/>\nalpha: α de Cronbach<br/>\nschmid: La matrice de facteur transformée de Schmid Leiman et les matrices associées<br/>\nschmid$sl: Les charges du facteur g ainsi que les facteurs résiduels<br/>\nschmid$orthog: Solution de facteurs d'origine rotée Varimax<br/>\nschmid$oblique: Les facteurs transformés oblimin ou promax<br/>\nschmid$phi: la matrice de corrélation des facteurs obliques<br/>\nschmid$gloading: Les charges sur le facteur d'ordre supérieur, g, des facteurs oblimin<br/>\nkey: Un vecteur de -1 ou 1 montrant dans quelle direction les éléments ont été notés.<br/>\nmodel: une liste de deux éléments, l'un adapté à donner à la fonction sem pour les modèles d'équations structurelles, l'autre, à donner au package lavaan.<br/>\nsem: La sortie d'une analyse sem<br/>\nomega.group: Les statistiques résumées pour l'oméga total, l'oméga hiérarchique (général) et l'oméga au sein de chaque groupe.<br/>\nscores: Les estimations de score de facteur sont trouvées pour la solution Schmid-Leiman. Pour obtenir des scores pour le modèle hiérarchique, voir la note dans l'aide détaillée de R.<br/>\nstatistiques d'ajustement diverses, voir la sortie<br/>\n<b>Package</b></br>\npsych​</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante help(omega, package=psych) en créant un bloc de code R en cliquant + dans la fenêtre de sortie\n\t\t\t"
  }
}