{
    "title": "Réorganiser, de large à long",
    "label2": "Choisissez les variables à réorganiser ou, alternativement, les variables à ne pas réorganiser. Dans ce dernier cas, toutes les variables restantes seront réorganisées en colonne(s).",
    "navigation": "Allonger",
    "label0": "Vous pouvez choisir d'enregistrer les résultats dans un nouveau jeu de données ou d'écraser le jeu de données existant.",
    "label1": "Options",
    "advanced": "Avancé",
    "New": "Enregistrer les résultats dans un nouveau jeu de données",
    "newdatasetname": "Entrez un nom de jeu de données",
    "Existing": "Écraser le jeu de données existant",
    "label12": "Entrez le(s) nom(s) de variable pour la/les nouvelle(s) variable(s) de facteur répétée(s)",
    "repeatedMeasure": "REMARQUE : Lorsque vous spécifiez plusieurs noms de variables qui stockent des facteurs répétés, séparez-les par des virgules, par exemple Mois, Jour. Vous devez également cliquer sur avancé pour spécifier la manière dont les noms de variables sont créés.",
    "repeatedValue": "Nom de la variable pour la valeur répétée, par exemple Nombre",
    "labelChoice": "Sélectionnez l'une des options ci-dessous",
    "subsetvars": "Option1 : Sélectionnez la/les variable(s) à réorganiser en une ou plusieurs variable(s)",
    "names_sep": "Option2 : Spécifiez un caractère ou une expression régulière pour diviser les noms de colonnes afin de créer des valeurs pour les noms de variables. Prend la même spécification que separate() et peut être un vecteur numérique (spécifiant les positions de séparation) ou une chaîne unique (spécifiant une expression régulière pour la séparation).",
    "names_pattern": "Option1 : Une expression régulière contenant des groupes de correspondance (()). La partie correspondante de l'expression régulière entre les () sera utilisée pour créer les noms de variables.",
    "dontReshape": "Option2 : Sélectionnez la/les variable(s) à ne pas réorganiser (toutes les variables restantes seront réorganisées en colonne(s))",
    "removeNA": "Supprimer les lignes où la valeur répétée est NA.",
    "makeString": "Convertir le facteur répété en type chaîne R au lieu d'un facteur",
    "label3": "S'il y a plusieurs nouvelles variables créées pour les facteurs répétés, les options ci-dessous contrôlent comment les noms de colonnes sont divisés. Sélectionnez une des 2 options ci-dessous.",
    "help": {
        "title": "Réorganiser (de large à long)",
        "r_help": "help(pivot_longer, package=tidyr)",
        "body": "\n<b>Description</b></br>\nVoir la vidéo sur <a href=\"https://youtu.be/ypLXqmFp3jY\">Réorganiser de large à long</a></br>\nPrend un jeu de données en format large et le convertit en un format long en transformant les colonnes en paires clé-valeur.\nPivot_longer prend plusieurs colonnes et les regroupe en paires clé-valeur, dupliquant toutes les autres colonnes si nécessaire. Utilisez pivot_longer() lorsque vous remarquez que vous avez des colonnes qui ne sont pas des variables.\nTapez vignette(\"pivot\") dans l'éditeur R pour voir l'aide R. Si plusieurs colonnes doivent être créées, vous devez spécifier les arguments pour déterminer comment les noms de colonnes sont construits.\nDans ce cas, cliquez sur avancé pour entrer une expression régulière qui spécifie comment les variables doivent être créées à partir des noms de colonnes.\nREMARQUE : Lors de la spécification de plusieurs variables pour le(s) facteur(s) répété(s), séparez-les par des virgules\n<br/>\n<b>Usage</b>\n<br/>\n<code>\npivot_longer(cols=c(col1, col2...),names_to=\"key\",values_to=\"value\",values_drop_na = TRUE)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ncols : Colonnes à pivoter en format long.\n</li>\n<li>\nvalues_to : Une chaîne spécifiant le nom de la colonne à créer à partir des données stockées dans les valeurs de cellule. Si names_to est une chaîne contenant la sentinelle spéciale .value, cette valeur sera ignorée, et le nom de la colonne de valeur sera dérivé d'une partie des noms de colonnes existants. Si vide, toutes les variables sont sélectionnées, exclure une variable y avec -y. Lors de l'exclusion de variables, toutes les autres variables restantes sont pivotées vers le format long.\n</li>\n<li>\nvalues_drop_na : Si TRUE, supprime les lignes contenant uniquement des NA dans la colonne value_to. Cela convertit effectivement les valeurs manquantes explicites en valeurs manquantes implicites, et doit généralement être utilisé uniquement lorsque les valeurs manquantes dans les données ont été créées par sa structure.\n</li>\n<li>\nnames_sep : prend la même spécification que separate(), et peut être un vecteur numérique (spécifiant les positions de séparation), ou une chaîne unique (spécifiant une expression régulière pour la séparation).</br>\nPar exemple, si les colonnes sont Hauteur_1_1, Hauteur_1_2, Poids_1_1, Poids_1_2, Sagur_1_1, Sagur_2_1 où le 1er nombre est le mois et le 2ème la semaine, spécifier _ comme séparateur créera 3 variables, la première avec les valeurs Hauteur, Poids, Sagur, la deuxième avec les valeurs 1 et 2, et la troisième avec les valeurs 1 et 2.</br>\nTapez help(regex) dans l'éditeur de code R pour plus de détails\n</li>\n<li>\nnames_pattern : prend la même spécification que extract(), une expression régulière contenant des groupes de correspondance (()).\nPrend la même spécification que separate(), et peut être un vecteur numérique (spécifiant les positions de séparation), ou une chaîne unique (spécifiant une expression régulière pour la séparation).</br>\nPar exemple, si les colonnes sont Hauteur_33.1_1, Hauteur_44.1_2, Poids_66.1_1, Poids_55.1_2, où les 2 chiffres après le 1er underscore sont à ignorer, le chiffre après le . est le mois et le chiffre après le dernier _ est la semaine.</br>\nLes expressions régulières qui extraient les valeurs des nouvelles variables doivent être entre (). L'expression régulière sera (.*)_.*.(.*)_(.)</br>\nRemarque : . dans une expression régulière signifie tout caractère</br>\n* signifie 0 ou plus, donc .* signifie 0 ou plus de caractères</br>\nAinsi, la chaîne peut être interprétée comme recherchant un modèle de</br>\n(.*) 0 ou plus de caractères suivis de</br>\n_ un underscore suivi de</br>\n.*. un ou plusieurs caractères suivis de . (échappement du . avec un  pour indiquer qu'il s'agit du caractère lui-même suivi de</br>\n.* un ou plusieurs caractères suivis de</br>\n_ underscore suivi de</br>\n. un seul caractère</br>\nTous les motifs entre les () forment les valeurs de chacune des 3 nouvelles variables de facteur</br>\n</li>\n</ul>\n<b>Valeur</b><br/>\nRenvoie le jeu de données réorganisé\n<br/>\n<b>Package</b></br>\ntidyr</br>\n<b>Aide</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
    }
}
