{
  "title": "Appariement par ensembles de risque",
  "navigation": "Appariement par ensembles de risque",
  "newdatasetnamelabel": "Nom du jeu de données pour stocker les données appariées",
  "groupvarlabel": "Variable d'événement (1=événement, 0=censure)",
  "timevarlabel": "Variable temporelle",
  "calipervarslabel": "Variables pour l'appariement (numériques)",
  "caliperslabel": "Spécifiez les calipers dans l'ordre des variables d'appariement séparées par des virgules, par exemple 5, 2 ; spécifiez 0 pour des appariements exacts",
  "ratiolabel": "Nombre de contrôles par cas",
  "repeatcontrolslabel": "Autoriser les contrôles à être appariés plus d'une fois",
  "supercontrolslabel": "Ne pas autoriser les cas à être appariés à d'autres cas",
  "help": {
    "title": "Appariement par ensembles de risque",
    "body": "\n            Effectue l'appariement de sujets par ensembles de risque au sein d'une cohorte. Ceux ayant l'événement de résultat (cas) sont appariés à ceux qui n'ont pas eu l'événement (contrôles) et qui sont dans l'ensemble de risque au moment de l'événement du cas. Il s'agit d'un design de cas/témoins imbriqué. Les variables de base connues à l'entrée de la cohorte sont également utilisées pour apparier les cas et les contrôles.\n\t\t\t<br/><br/>\n\t\t\tLes variables de base pour lesquelles les valeurs doivent correspondre exactement et les valeurs correspondant à l'intérieur des calipers numériques sont prises en charge. Les contrôles sont sélectionnés au hasard parmi tous les contrôles éligibles pour chaque cas.\n\t\t\t<br/><br/>\n\t\t\tLe jeu de données de sortie contenant les données appariées contiendra les variables d'origine, l'indicateur d'événement (\"échoué\") et une variable identifiant l'ensemble apparié (\"match.num\").\n\t\t\t<br/><br/>\n\t\t\tLes observations avec des valeurs manquantes pour les variables impliquées dans le processus d'appariement sont supprimées avant l'appariement.\n\t\t\t<br/><br/>\n\t\t\tUne brève introduction aux designs de cas/témoins imbriqués peut être trouvée dans :\n\t\t\tEssebag V, et al. L'étude de cas-témoins imbriquée en cardiologie. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>Nom du jeu de données pour stocker les données appariées :</b>\n\t\t\t<br/>Nom du jeu de données de sortie contenant les ensembles de sujets appariés.\n\t\t\t<br/><br/>\n\t\t\t<b>Variable d'événement (1=événement, 0=censure) :</b>\n\t\t\t<br/>Nom de la variable indiquant ceux ayant des événements. Doit être numérique avec 1=événement et 0=censure.\n\t\t\t</br><br/>\n\t\t\t<b>Variables pour l'appariement :</b>\n\t\t\t<br/>Spécifiez les variables de base pour lesquelles vous souhaitez que les ensembles cas/témoins soient appariés. Celles-ci doivent être numériques.\n\t\t\t<br/><br/>\n\t\t\t<b>Spécifiez les calipers dans l'ordre des variables d'appariement séparées par des virgules :</b>\n\t\t\t<br/>Spécifiez les valeurs de caliper numériques pour chacune des variables, dans l'ordre des variables. Les appariements exacts doivent utiliser un caliper de 0. \n\t\t\tPar exemple, si l'âge (en années) était spécifié avec un caliper de 5, cela signifie que les contrôles doivent être dans un intervalle de +/- 5 ans de leur cas apparié.\n\t\t\tChaque variable d'appariement doit avoir une valeur de caliper spécifiée.\n\t\t\t<br/><br/>\n\t\t\t<b>Nombre de contrôles par cas :</b>\n\t\t\t<br/>C'est le nombre maximum de contrôles qui seront appariés à chaque cas. Certains ensembles appariés peuvent avoir moins que cette valeur si des appariements appropriés ne peuvent pas être identifiés.\n            <br/><br/>\n\t\t\t<b>Autoriser les contrôles à être appariés plus d'une fois :</b>\n\t\t\t<br/>Spécifiez si vous souhaitez ou non que les contrôles puissent potentiellement être appariés à plus d'un cas. Nous recommandons de sélectionner cette option pour éviter les biais.\n            <br/><br/>\n\t\t\t<b>Ne pas autoriser les cas à être appariés à d'autres cas :</b>\n\t\t\t<br/>Spécifiez s'il faut autoriser les cas à être considérés comme des contrôles avant le moment de l'événement du cas. Nous recommandons de ne pas sélectionner cette option pour éviter les biais. Ne pas sélectionner cette option signifie qu'un cas est dans le pool de risque des contrôles, et éligible pour être apparié à un autre cas, jusqu'à leur moment d'événement.\n            <br/><br/>\n            <b>Packages R requis :</b> dplyr, tidyr\n"
  }
}