{
  "title": "Échantillon de la distribution binomiale négative",
  "navigation": "Échantillon de la distribution binomiale négative",
  "entrdsname": "Entrez le nom du jeu de données",
  "size": "Nombre cible de succès",
  "prob": "Probabilité",
  "lblnoofsamples": "Nombre d'échantillons (lignes)",
  "lblnoofobsv": "Nombre d'observations (colonnes)",
  "lblseed": "Graine",
  "lblAddtoDS": "Ajouter au jeu de données",
  "chklbl1": "Moyennes d'échantillon",
  "chklbl2": "Sommes d'échantillon",
  "chklbl3": "Écarts-types d'échantillon",
  "help": {
    "title": "Échantillon de la distribution binomiale négative",
    "r_help": "help(rnbinom, package=stats)",
    "body": "\n\n            <b>Description</b>\n            <br/>\n            Densité, fonction de distribution, fonction quantile et génération aléatoire pour la distribution binomiale négative avec les paramètres taille et prob.\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code>\n                dnbinom(x, size, prob, mu, log = FALSE)\n                <br/>\n                pnbinom(q, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qnbinom(p, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rnbinom(n, size, prob, mu)\n                <br/>\n            </code>\n            <br/>\n            <b>Arguments</b>\n            <br/>\n            <ul>\n                <li>x : vecteur de quantiles (entiers non négatifs).</li>\n                \n                \n                <li>q : vecteur de quantiles.</li>\n                \n                \n                <li>p : vecteur de probabilités.</li>\n                \n                \n                <li>n : nombre d'observations. Si length(n) > 1, la longueur est prise comme le nombre requis.</li>\n                \n                \n                <li>size : cible pour le nombre d'essais réussis, ou paramètre de dispersion (le paramètre de forme de la distribution gamma de mélange). Doit être strictement positif, ne doit pas nécessairement être un entier.</li>\n                \n                \n                <li>prob : probabilité de succès à chaque essai. 0 < prob <= 1.</li>\n                \n                \n                <li>mu : paramétrisation alternative via la moyenne : voir 'Détails'.</li>\n                \n                \n                <li>log, log.p : logique ; si TRUE, les probabilités p sont données sous forme de log(p).</li>\n                \n                \n                <li>lower.tail : logique ; si TRUE (par défaut), les probabilités sont P[X ≤ x], sinon, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Détails</b>\n            <br/>\n            La distribution binomiale négative avec size = n et prob = p a une densité\n            <br/>\n            <code>\n                Γ(x+n)/(Γ(n) x!) p^n (1-p)^x\n                pour x = 0, 1, 2, …, n > 0 et 0 < p ≤ 1.\n            </code>\n            <br/>\n            Cela représente le nombre d'échecs qui se produisent dans une séquence d'essais de Bernoulli avant qu'un nombre cible de succès ne soit atteint. La moyenne est μ = n(1-p)/p et la variance n(1-p)/p^2.\n            <br/>\n            Une distribution binomiale négative peut également résulter d'un mélange de distributions de Poisson avec une moyenne distribuée comme une distribution gamma (voir pgamma) avec un paramètre d'échelle (1 - prob)/prob et un paramètre de forme size. (Cette définition permet des valeurs non entières de size.)\n            <br/>\n            Une paramétrisation alternative (souvent utilisée en écologie) est par la moyenne mu (voir ci-dessus), et size, le paramètre de dispersion, où prob = size/(size+mu). La variance est mu + mu^2/size dans cette paramétrisation.\n            <br/>\n            Si un élément de x n'est pas entier, le résultat de dnbinom est zéro, avec un avertissement.\n            Le cas size == 0 est la distribution concentrée à zéro. C'est la distribution limite pour size approchant zéro, même si mu plutôt que prob est maintenu constant. Notez cependant que la moyenne de la distribution limite est 0, quelle que soit la valeur de mu.\n            <br/>\n            Le quantile est défini comme la plus petite valeur x telle que F(x) ≥ p, où F est la fonction de distribution.\n            <br/>\n            <br/><b>Valeur</b>\n            <br/>\n            dnbinom donne la densité, pnbinom donne la fonction de distribution, qnbinom donne la fonction quantile, et rnbinom génère des déviations aléatoires.\n            <br/>\n            Une taille ou une probabilité invalide entraînera une valeur de retour NaN, avec un avertissement.\n            <br/>\n            La longueur du résultat est déterminée par n pour rnbinom, et est le maximum des longueurs des arguments numériques pour les autres fonctions.\n            <br/>\n            Les arguments numériques autres que n sont recyclés à la longueur du résultat. Seuls les premiers éléments des arguments logiques sont utilisés.            \n      "
  }
}