{
  "title": "SEM",
  "residualCovHeatmap": "Carte thermique de la déviation entre les matrices de covariance observées et implicites du modèle",
  "observedCorr": "Corrélations observées",
  "modelImpliedCorr": "Corrélations implicites du modèle",
  "residualCorr": "Déviation entre les corrélations observées et ajustées",
  "residualCorrHeatmap": "Carte thermique de la déviation entre les matrices de corrélations observées et implicites du modèle",
  "intercepts1": "Les intercepts des variables observées",
  "intercepts": "Afficher les intercepts",
  "means": "Les intercepts/moyennes des variables latentes",
  "residuals1": "Les variances résiduelles des variables observées",
  "residual_covariances": "Les covariances résiduelles des variables observées",
  "lv_variances": "Les variances (résiduelles) des variables latentes",
  "lv_covariances": "Les covariances (résiduelles) des variables latentes",
  "regressions": "Tous les coefficients de régression dans le modèle",
  "loadings": "Charges des variables observées sur leurs variables latentes respectives",
  "secOrdFacOptvar" : "Facteurs de deuxième ordre",
  "EqConstraintsOptvar" : "Contraintes d'égalité",  
  "mediationOptvar" : "Médiation",  
  "multiGrpOptions": "Options de groupe multiple",
  "multiGrpSrc": "Variables sources",
  "multiGrpDependent": "Variables de regroupement",
  "modelname": "Entrez un nom pour le modèle",
  "mediationSrcCtrl": "Relations sources",
  "mediationDestCtrl": "Paramètres de médiation",
  "navigation": "SEM",
  "modelTermsDst": "Relation",
  "modelTerms": "Prédicteur",
  "modelTerms1": "Résultat",
  "sem": "Variables latentes",
  "sem_model_terms": "Paramètres structurels",
  "semSuppCtrl": "Facteurs d'ordre un",
  "sem2": "Facteurs d'ordre deux",
  "label1": "Sélectionnez un élément dans les listes de prédicteur et de résultat et cliquez sur le bouton avec une flèche pour déplacer les éléments sélectionnés vers la liste des relations",
  "label2": "Sélectionnez un élément dans les listes de prédicteur et de résultat et cliquez sur le bouton avec une flèche pour déplacer les éléments sélectionnés vers la liste des relations",
  "label3": "Information",
  "label4": "Sorties supplémentaires",
  "label5": "Covariances et corrélations (voir aide)",
  "label6": "R-carré",
  "label7": "Enregistrer prédit",
  "label9": "Contraintes",
  "coVarTerms": "1ère variable/facteur",
  "coVarTerms1": "2ème variable/facteur",
  "coVarDst": "Covariances sélectionnées",
  "optionsCoVarTerms": "Covariances",
  "parameterizeFormula": "Afficher les étiquettes de paramètres",
  "modelOptions": "Options du modèle",
  "method": "Sélectionnez une méthode et une approche (le cas échéant)",
  "approach": "Approche de vraisemblance ML",
  "missing": "Valeurs manquantes",
  "addFitMeasures": "Mesures d'ajustement supplémentaires",
  "mardiaSkew": "Asymétrie de Mardia (uniquement pour les cas complets)",
  "mardiaKurt": "Kurtosis de Mardia (uniquement pour les cas complets)",
  "observed": "Covariances observées",
  "modelImplied": "Covariances implicites du modèle (ajustées)",
  "residual": "Déviation entre les covariances observées et ajustées",
  "r2squareNone": "Aucun",
  "r2squareEndo": "Endogène",
  "factorScores": "Scores de facteur (variables enregistrées avec le préfixe FS)",
  "indicators": "Indicateurs (variables enregistrées avec le préfixe I)",
  "dependentVars": "Variables dépendantes (variables enregistrées avec le préfixe DV)",
  "label8": "Indices de modification",
  "modIndices": "Indices de modification",
  "highLowIndices": "Masquer les indices faibles",
  "threshold": "Seuil",
  "residuals": "Afficher les résidus",
  "includeThresholds": "Afficher les seuils",
  "edgeLabels": "Sélectionnez les options pour les étiquettes de bord",
  "layout": "Options pour la disposition des nœuds",
  "rotate": "Position des variables exogènes lorsque la disposition arbre ou arbre2 est utilisée",
  "abbNodeLabels": "Nombre de caractères pour abréger les étiquettes de nœuds",
  "abbEdgeLabels": "Nombre de caractères pour abréger les étiquettes de bord",
  "label101": "Chemins",
  "label102": "Disposition",
  "label103": "Nœuds",
  "semPlotOptions": "Options de tracé",
  "parameterOptions": "Options de paramètres",
  "manifestShapes": "Formes manifestes",
  "latentShapes": "Formes latentes",
  "outputOptions": "Options de sortie",
  "label104": "Solutions standardisées",
  "stdall": "Les estimations standardisées sont basées sur les variances des variables observées et latentes (continues)",
  "stdlv": "Les estimations standardisées sont basées uniquement sur les variances des variables latentes (continues)",
  "stdnox": "Les estimations standardisées sont basées sur les variances des variables observées et latentes (continues), mais pas sur les variances des covariables exogènes",
  "label105": "Erreurs standards",
  "label106": "Paramètres de bootstrap",
  "automatic": "Automatique",
  "standard": "Standard",
  "robust": "Robuste",
  "pseudoML": "Pseudo ML",
  "bootstrap": "Bootstrap",
  "percentiles": "Percentiles",
  "normal": "Normal",
  "adjustedBiasCorrected": "Corrigé pour biais ajusté",
  "basic": "de base",
  "bootstratRep": "Répétitions de bootstrap",
  "autoComputeCovar": "Calculer automatiquement les covariances",
  "equalityConstraints1": "Relations",
  "sem3": "Contraintes d'égalité",
  "help": {
    "title": "SEM",
    "r_help": "aide(sem, package=lavaan)",
    "body": "\n<b>Description</b></br>\nLa modélisation par équations structurelles (SEM) utilise le package lavaan (0.6.16) pour l'estimation et fonctionne avec la formulation traditionnelle LISREL sem (plutôt que les formulations Bentler-Weeks, RAMpath ou LISCOMP). L'estimation par défaut est la vraisemblance maximale et utilise NLMINB (quasi-Newton) avec l'approche de vraisemblance normale (plutôt que la méthode de vraisemblance Wishart). Les erreurs standards sont basées sur les matrices d'information attendues (plutôt que sur les observées), mais les observées, attendues et les déviations peuvent être examinées à l'aide de cartes thermiques. Le dépistage de normalité (c'est-à-dire l'asymétrie et la kurtosis de Mardia) est fourni. L'utilisateur peut spécifier des modèles avec et sans variables latentes continues (c'est-à-dire modélisation de mesure) à la fois d'ordres inférieurs et supérieurs, ainsi que des modèles structurels (c'est-à-dire modélisation de chemin). Les contraintes d'égalité, la médiation et l'analyse multigroupe sont possibles. Une multitude de méthodes d'estimation (par exemple, variétés de vraisemblance maximale, moindres carrés et James-Stein) sont prises en charge. De nombreuses statistiques d'ajustement sont disponibles sur demande (par exemple, GFI, aGFI, ECVI, etc.), et un petit sous-ensemble (c'est-à-dire CFI, TLI, SRMR, RMSEA, AIC, BC) est fourni par défaut. Des intervalles de confiance utilisant diverses fonctions de bootstrap peuvent également être obtenus. Des diagrammes de modèles sont produits à l'aide de semPlot (1.1.6).  \n</br>\n</br>\nLorsque vous cliquez sur Covariances dans la boîte de dialogue, vous verrez que la case à cocher, calculer automatiquement les covariances est cochée. Vous pouvez supprimer une covariance calculée automatiquement en sélectionnant la covariance et en cliquant sur l'icône de poubelle. Lorsque vous supprimez une covariance, nous la supprimons dans le code généré. Si vous souhaitez annuler la suppression, vous devez l'ajouter manuellement à nouveau ou supprimer et recréer la variable latente ou le facteur d'ordre supérieur qui fait partie de la covariance pour laquelle vous souhaitez annuler la suppression.\n</br>\n</br>\nLorsqu'une variable de regroupement est sélectionnée (cliquez sur Options de groupe multiple dans la boîte de dialogue), vous devez sélectionner la case à cocher \"Les intercepts des variables observées\" et la case à cocher \"Les intercepts/moyennes des variables latentes\"\nIl suffit de cocher la 1ère case pour vous donner plus de flexibilité.\n</br>\nDescription des fonctions d'ajustement ci-dessous</br>\n\"ML\" vraisemblance maximale</br>\n\"GLS\": moindres carrés généralisés. Pour les données complètes uniquement.</br>\n\"WLS\": moindres carrés pondérés (parfois appelés estimation ADF). Pour les données complètes uniquement.</br>\n\"DWLS\": moindres carrés pondérés diagonalement</br>\n\"ULS\": moindres carrés non pondérés</br>\n\"DLS\": moindres carrés distribués</br>\n\"PML\": vraisemblance maximale par paires</br>\nDe nombreux estimateurs ont des variantes robustes, ce qui signifie qu'ils fournissent des erreurs standards robustes et une statistique de test mise à l'échelle. Par exemple, pour l'estimateur de vraisemblance maximale, lavaan fournit les variantes robustes suivantes :</br>\n\"MLM\": estimation de vraisemblance maximale avec erreurs standards robustes et une statistique de test mise à l'échelle de Satorra-Bentler. Pour les données complètes uniquement.</br>\n\"MLMVS\": estimation de vraisemblance maximale avec erreurs standards robustes et une statistique de test ajustée pour la moyenne et la variance (également connue sous le nom d'approche Satterthwaite). Pour les données complètes uniquement.</br>\n\"MLMV\": estimation de vraisemblance maximale avec erreurs standards robustes et une statistique de test ajustée pour la moyenne et la variance (utilisant une approche décalée). Pour les données complètes uniquement.</br>\n\"MLF\": pour l'estimation de vraisemblance maximale avec des erreurs standards basées sur les dérivées d'ordre un, et une statistique de test conventionnelle. Pour les données complètes et incomplètes.</br>\n\"MLR\": estimation de vraisemblance maximale avec erreurs standards robustes (Huber-White) et une statistique de test mise à l'échelle qui est (asymptotiquement) égale à la statistique de test de Yuan-Bentler. Pour les données complètes et incomplètes.</br>\n</br>\nÀ déterminer\nGérer la documentation de l'étiquette voir aide\nNous devons documenter la situation autour des degrés de liberté, en gros, lorsqu'une variable de regroupement est sélectionnée, vous devez sélectionner\nla case à cocher \"Les intercepts des variables observées\" et la case à cocher \"Les intercepts/moyennes des variables latentes\"\nIl suffit de cocher la 1ère case pour vous donner plus de flexibilité.\n<b>Package</b></br>\nlavaan;semPlot;semTools</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de boîte de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R</br>\naide(sem, package='lavaan')\n\n\n"
  }
}