{
  "title": "Correspondance de Sujets",
  "navigation": "Correspondance de Sujets",
  "newdatasetnamelabel": "Nom du jeu de données pour stocker les données appariées",
  "groupvarlabel": "Variable cas/témoin (témoin=valeur inférieure, cas=valeur supérieure)",
  "notelabel": "Remarque : Vous devez spécifier au moins une variable pour les variables exactes ou de caliper",
  "exactvarslabel": "Variables pour correspondance exacte",
  "calipervarslabel": "Variables pour correspondance de caliper",
  "caliperslabel": "Spécifiez les calipers dans l'ordre des variables de caliper séparées par des virgules, par ex. 5, 2",
  "idvarlabel": "Variable ID Sujet",
  "ratiolabel": "Nombre de témoins par cas",
  "help": {
    "title": "Correspondance de Sujets",
    "r_help": "help(matchit, package = 'MatchIt')",
    "body": "\n            Effectue une correspondance de sujets par voisinage le plus proche où un ensemble de cas est apparié à 1 ou plusieurs témoins. Cela est approprié pour les études cas/témoins et les études de cohortes appariées.\n\t\t\t<br/><br/>\n\t\t\tLes variables pour lesquelles les valeurs doivent correspondre exactement et les valeurs correspondant dans des calipers numériques sont prises en charge.\n\t\t\tLa correspondance se fait sans remplacement (chaque sujet ne peut être apparié qu'une seule fois) et les témoins parmi les témoins potentiels seront sélectionnés selon l'ordre des données pour chaque cas.\n\t\t\t<br/><br/>\n\t\t\tLe jeu de données de sortie contiendra les données originales et deux variables supplémentaires : 1) sous-classe : une variable identifiant l'ensemble apparié, et 2) poids : une variable de poids de cas appariés qui peut être utilisée dans l'analyse ultérieure, si désiré.\n\t\t\t<br/><br/>\n\t\t\t<b>Nom du jeu de données pour stocker les données appariées :</b>\n\t\t\t<br/>Nom du jeu de données de sortie contenant les ensembles de sujets appariés.\n\t\t\t<br/><br/>\n\t\t\t<b>Variable cas/témoin (témoin=valeur inférieure, cas=valeur supérieure) :</b>\n\t\t\t<br/>Nom de la variable indiquant les cas et les témoins. Peut être numérique, facteur ou caractère.  \n\t\t\tSi une variable numérique, cela doit être codé comme 0=témoin, 1=cas. Si une variable facteur, le niveau de commande inférieur sera les témoins et le niveau de commande supérieur sera les cas.  \n\t\t\tSi une variable caractère, la valeur de commande inférieure (par ordre alphabétique) sera les témoins, et la valeur de commande supérieure (par ordre alphabétique) sera les cas.\n\t\t\tDonc, pour être plus sûr, nous recommandons de coder comme 0=témoin, 1=cas.\n\t\t\t</br><br/>\n\t\t\t<b>Variables pour correspondance exacte :</b>\n\t\t\t<br/>Spécifiez les variables pour lesquelles vous souhaitez que les ensembles cas/témoins soient exactement appariés.  \n\t\t\tCela signifie que les cas et les témoins dans un ensemble apparié ont exactement les mêmes valeurs pour ces variables. Celles-ci peuvent être des caractères, des dates, des numériques, des facteurs ou des variables ordinales.\n\t\t\t<br/><br/>\n\t\t\t<b>Variables pour correspondance de caliper :</b>\n\t\t\t<br/>Spécifiez les variables pour lesquelles vous souhaitez que les ensembles cas/témoins soient appariés sur des valeurs de caliper numériques. Les témoins seront dans une largeur de caliper spécifiée pour chacune de ces variables.\n\t\t\tCelles-ci peuvent être des variables numériques ou de date. Chaque variable de caliper doit avoir une valeur de caliper spécifiée.\n\t\t\t<br/><br/>\n\t\t\t<b>Spécifiez les calipers dans l'ordre des variables de caliper séparées par des virgules :</b>\n\t\t\t<br/>Spécifiez les valeurs de caliper numériques pour chacune des variables de caliper, dans l'ordre des variables de caliper.  \n\t\t\tPar exemple, si l'âge (en années) était spécifié avec un caliper de 5, cela signifie que les témoins doivent être dans un intervalle de +/- 5 ans de leur cas apparié.\n\t\t\tChaque variable de caliper doit avoir une valeur de caliper spécifiée. S'il n'y a pas de variables de caliper, ce champ doit être vide.\n\t\t\t<br/><br/>\n\t\t\t<b>Nombre de témoins par cas :</b>\n\t\t\t<br/>C'est le nombre maximum de témoins qui seront appariés à chaque cas. Certains ensembles appariés peuvent avoir moins que cette valeur si des appariements appropriés ne peuvent pas être identifiés.\n            <br/><br/>\n            <b>Packages R requis :</b> dplyr, tidyr, MatchIt\n"
  }
}