{
  "title": "Table, Avancée",
  "navigation": "Table, Avancée",
  "notelabel": "REMARQUE : Au moins une variable doit être spécifiée dans au moins l'un des éléments ci-dessous : Test ANOVA, Test de Kruskal-Wallis, Test de Médiane, Test du Chi-Carré de Pearson, Test Exact de Fisher, Test de Tendance Ordinale, ou Aucun Test",
  "anovavarslabel": "Variables pour le Test ANOVA",
  "kwvarslabel": "Variables pour le Test de Kruskal-Wallis",
  "medvarslabel": "Variables pour le Test de Médiane",
  "chisqvarslabel": "Variables pour le Test du Chi-Carré de Pearson",
  "fishervarslabel": "Variables pour le Test Exact de Fisher",
  "ordvarslabel": "Variables pour le Test de Tendance Ordinale",
  "notestvarslabel": "Variables pour Aucun Test",
  "bygroupvarlabel": "Groupes à Comparer",
  "stratavarlabel": "Strates (optionnel)",
  "tabletitlelabel": "Titre du Tableau",
  "totalcolchkboxlabel": "Inclure la colonne totale",
  "groupvarchkboxlabel": "Inclure le nom de la variable de groupe",
  "digitslabel": "Chiffres Après la Virgule",
  "contdigitslabel": "Valeurs Continues",
  "pctdigitslabel": "Pourcentages",
  "pvaluedigitslabel": "P-Values",
  "simplifylabel": "Simplifier les Résumés de Variables Multi-Lignes en Une Ligne (si possible)",
  "numericsimplifylabel": "Variables Numériques",
  "categorysimplifylabel": "Variables Catégorielles",
  "ordinalsimplifylabel": "Variables Ordinales",
  "datesimplifylabel": "Variables de Date",
  "labelsimplifylabel": "Utiliser le Dernier Niveau dans l'Étiquette des Variables Catégorielles",
  "conflevellabel": "Niveau de Confiance",
  "simchkboxlabel": "Simuler les p-values pour Pearson et Fisher",
  "simnumlabel": "Nombre de Simulations",
  "footnotechkboxlabel": "Note de Bas de Page sur les Noms des Tests",
  "sampsizelabel": "Taille de l'Échantillon",
  "meanlabel": "Moyenne",
  "quantileslabel": "Quantiles",
  "otherlabel": "Autre",
  "nmissanylabel": "Nombre Manquant, le cas échéant",
  "nmissalwayslabel": "Nombre Manquant, toujours",
  "meansdlabel": "Moyenne (SD)",
  "meancilabel": "Moyenne (CI)",
  "meanselabel": "Moyenne (SE)",
  "gmeanlabel": "Moyenne Géométrique",
  "gmeansdlabel": "Moyenne Géométrique (SD)",
  "gmeancilabel": "Moyenne Géométrique (CI)",
  "trimmeancilabel": "Moyenne Élaguée (CI)",
  "trimpctlabel": "Spécifier le Pourcentage de Moyenne Élaguée",
  "medianlabel": "Médiane",
  "medianq1q3label": "Médiane (25e %-ile, 75e %-ile)",
  "q1q3label": "(25e %-ile, 75e %-ile)",
  "iqrlabel": "Plage Interquartile",
  "medianrangelabel": "Médiane (Plage)",
  "medianmadlabel": "Médiane (Écart Absolu Médian)",
  "rangelabel": "Plage",
  "minlabel": "Minimum",
  "maxlabel": "Maximum",
  "pct1label": "1er %-ile (CI)",
  "pct5label": "5e %-ile (CI)",
  "pct10label": "10e %-ile (CI)",
  "pct25label": "25e %-ile (CI)",
  "pct33label": "33 1/3 %-ile (CI)",
  "pct50label": "Médiane (CI)",
  "pct66label": "66 2/3 %-ile (CI)",
  "pct75label": "75e %-ile (CI)",
  "pct90label": "90e %-ile (CI)",
  "pct95label": "95e %-ile (CI)",
  "pct99label": "99e %-ile (CI)",
  "custquantlabel": "Custom %-ile (CI)",
  "custquantvaluelabel": "Spécifier %-ile",
  "skewnesslabel": "Asymétrie",
  "kurtosislabel": "Kurtosis",
  "sumlabel": "Somme",
  "sdlabel": "SD",
  "varlabel": "Variance",
  "gsdlabel": "SD de la Moyenne Géométrique",
  "cvlabel": "Coefficient de Variation",
  "freqlabel": "Fréquence",
  "freqtotallabel": "Fréquence/Total",
  "freqpctlabel": "Fréquence (%)",
  "propcilabel": "Proportion (CI)",
  "ciFootNote": "Note de Bas de Page sur le Niveau de Confiance",
  "help": {
    "title": "Table, Avancée",
    "r_help": "help(tableby, package ='arsenal')",
    "body": "\nCela crée un tableau de statistiques descriptives au sein des groupes à comparer et une variable de stratification pour effectuer les comparaisons. Une colonne pour chaque catégorie de variable de groupe sera créée. Les catégories de la variable de stratification formeront des lignes supplémentaires pour le tableau. Diverses statistiques descriptives et tests statistiques peuvent être spécifiés.\n<br/><br/>\nRemarque : Les dates de toute classe seront converties en classe Date uniquement à des fins de résumé. Votre ensemble de données d'origine restera inchangé. Cela signifie également que les dates résumées seront précises au jour près uniquement.\n<br/><br/>\n<b>Groupes à Comparer :</b> Variable qui définit les catégories à comparer\n<br/><br/>\n<b>Variables pour le Test ANOVA :</b> Spécifiez des variables numériques ou de date pour les comparaisons de groupes en utilisant le test d'Analyse de Variance (ANOVA)\n<br/><br/>\n<b>Variables pour le Test de Kruskal-Wallis :</b> Spécifiez des variables numériques, de date ou des facteurs ordinales pour les comparaisons de groupes en utilisant le test de Kruskal-Wallis\n<br/><br/>\n<b>Variables pour le Test de Médiane :</b> Spécifiez des variables numériques ou de date pour les comparaisons de groupes en utilisant un test de médianes\n<br/><br/>\n<b>Variables pour le Test du Chi-Carré de Pearson :</b> Spécifiez des variables nominales ou ordinales pour les comparaisons de groupes en utilisant le test du Chi-Carré de Pearson\n<br/><br/>\n<b>Variables pour le Test Exact de Fisher :</b> Spécifiez des variables nominales ou ordinales pour les comparaisons de groupes en utilisant le test Exact de Fisher\n<br/><br/>\n<b>Variables pour le Test de Tendance Ordinale :</b> Spécifiez des variables nominales ou ordinales pour les comparaisons de groupes en utilisant un test de tendance. Pour deux groupes, cela correspond essentiellement au test de tendance de Cochran-Armitage.\n<br/><br/>\n<b>Variables pour Aucun Test :</b> Spécifiez des variables que vous souhaitez résumer uniquement au sein des groupes. Aucun test statistique ne sera calculé pour ces variables.\n<br/><br/>\nRemarque : Vous devez spécifier au moins une variable à résumer pour qu'un tableau soit produit.\n<br/><br/>\n<b>Strates (optionnel) :</b> Variable qui définit les catégories au sein desquelles les comparaisons seront effectuées\n<br/><br/>\n<b>Titre du Tableau :</b> spécifiez le titre du tableau\n<br/><br/>\n<b>Inclure la colonne totale :</b> si une colonne totale est incluse dans le tableau ou non\n<br/><br/>\n<b>Inclure le nom de la variable de groupe :</b> si le nom de la variable de groupe doit être inclus dans le tableau ou non\n<br/><br/>\n<b>Chiffres Après la Virgule :</b> spécifiez combien de chiffres afficher après la virgule pour les valeurs continues, les pourcentages et les p-values\n<br/><br/>\n<b>Simplifier les Résumés de Variables Multi-Lignes en Une Ligne (si possible) :</b> Pour les variables catégorielles à deux catégories (facteur/ordinal) ou les résumés uniques de variables numériques ou de date, vous pouvez réduire les lignes pour que tous les noms de variables et statistiques apparaissent dans une seule ligne. Les résumés pour la dernière catégorie de chaque variable catégorielle seront affichés. Toute variable pour laquelle le regroupement n'est pas possible occupera plusieurs lignes. Activer/désactiver cette option peut être fait pour chaque type de variable séparément.\n<br/><br/>\n<b>Utiliser le Dernier Niveau dans l'Étiquette des Variables Catégorielles :</b> Pour des tableaux simplifiés, cela inclut le dernier niveau des variables factorielles/ordinales dans l'étiquette de ligne.\n<br/><br/>\n<b>Niveau de Confiance :</b> Cela définit le niveau de confiance des intervalles de confiance.\n<br/><br/>\n<b>Options de Test Statistique</b>\n<br/><br/>\n<b>Tests Statistiques :</b> Les Simulations de Pearson et Fisher offrent la possibilité d'obtenir des p-values simulées pour les tests du chi-carré de Pearson et les tests Exact de Fisher. Cette procédure crée des simulations de Monte Carlo le nombre de fois spécifié (Nombre de Simulations). Cela peut être utile dans les cas où les calculs standards, en particulier pour le test Exact de Fisher, entraînent des erreurs de mémoire de l'ordinateur.\n<br/><br/>\n<b>Note de Bas de Page sur les Noms des Tests :</b> si oui ou non inclure des notes de bas de page sur les p-values listant les tests statistiques effectués pour chaque variable\n<br/><br/>\n<b>Options de Statistiques Numériques :</b>\n<br/>statistiques qui seront affichées pour les variables numériques\n<br/><br/>\n<b>Options de Statistiques Catégorielles :</b> \n<br/>statistiques qui seront affichées pour les facteurs nominaux et ordonnés\n<br/><br/>\n<b>Statistiques de Date :</b>\n<br/>statistiques qui seront affichées pour les variables de date\n<br/><br/>\n<b>Remarque :</b> Si vous souhaitez résumer une variable d'un type spécifique, il est recommandé de sélectionner au moins une statistique dans cette catégorie qui n'est pas \"Nombre Manquant, le cas échéant\". Si \"Nombre Manquant, le cas échéant\" est la seule option sélectionnée et qu'aucune variable n'a de valeur manquante, alors une erreur se produira. \n<br/><br/>\n<b>Packages R Requis :</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
  }
}