{
  "title": "Graphique en ligne avec deux axes Y",
  "navigation": "Deux axes Y",
  "x": "Axe X",
  "y": "Axe Y1, spécifiez une variable numérique",
  "y2": "Axe Y2, spécifiez une variable numérique",
  "y1_sf": "Facteur d'échelle Y1",
  "y2_sf": "Facteur d'échelle Y2",
  "help": {
    "title": "Graphique en ligne",
    "r_help": "help(geom_line, package=ggplot2)",
    "body": "\n            <b>Description</b></br>\n            Crée un graphique en ligne (connecté par ordre) ou un graphique en escalier ou ordonne le graphique en ligne par occurrence des points dans le jeu de données. Cliquez sur l'onglet correspondant au type de graphique en ligne que vous souhaitez.</br>\n            Graphique en ligne (connecté par ordre) : Un graphique en ligne trace une ligne à travers des points définis par les coordonnées x et y et les connecte dans l'ordre des variables sur l'axe x. Lorsqu'une couleur est définie comme une variable facteur, les points sont regroupés par couleur et une ligne séparée est générée pour chaque groupe de couleur. Des facettes peuvent être créées en option en spécifiant une variable facteur. Vous pouvez également spécifier des thèmes en option, et spécifier un titre et des étiquettes pour les axes x et y​</br>\n            Graphique en escalier : Un graphique en ligne trace une ligne à travers des points définis par les coordonnées x et y et crée un graphique en escalier, mettant en évidence exactement quand les changements se produisent. Lorsqu'une couleur est définie comme une variable facteur, les points sont regroupés par couleur et une ligne séparée est générée pour chaque groupe de couleur. Des facettes peuvent être créées en option en spécifiant une variable facteur. Vous pouvez également spécifier des thèmes en option, et spécifier un titre et des étiquettes pour les axes x et y​</br>\n            Ordonné par occurrence : Un graphique en ligne trace une ligne à travers des points définis par les coordonnées x et y et les connecte dans l'ordre dans lequel les variables apparaissent dans le jeu de données. Lorsqu'une couleur est définie comme une variable facteur, les points sont regroupés par couleur et une ligne séparée est générée pour chaque groupe de couleur. Des facettes peuvent être créées en option en spécifiant une variable facteur. Vous pouvez également spécifier des thèmes en option, et spécifier un titre et des étiquettes pour les axes x et y​.</br>\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            #Graphique en ligne<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_line( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Graphique en ligne pour ...\")<br/>\n            #Graphique en escalier<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_step( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Graphique en ligne pour ...\")<br/>\n            #Ordonné par occurrence<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_path( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Graphique en ligne pour ...\")\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data: Le jeu de données par défaut​\n            </li>\n            <li>\n            aes(): Générer des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géométries.​\n            </li>\n            <li>\n            x: Une variable numérique ou facteur\n            </li>\n            <li>\n            y: la variable numérique/échelle pour laquelle les points sont tracés sur l'axe y​\n            </li>\n            <li>\n            color: une variable facteur optionnelle pour regrouper les points (par couleur)​\n            </li>\n            <li>\n            labs(): Changer les étiquettes des axes et les titres de légende (c'est optionnel)​\n            </li>\n            <li>\n            facet_grid(): Disposer les panneaux dans une grille (c'est optionnel)​\n            </li>\n            <li>\n            theme_calc(): Spécifie le thème du calculateur (c'est optionnel)​\n            </li>\n            <li>\n            geom_line(): Connecter les observations ordonnées par valeur x, voir x:​\n            </li>\n            <li>\n            coord_flip(): Inverser l'axe (c'est optionnel)​\n            </li>\n            </ul>\n            <b>Package</b></br>\n            ggplot2;ggthemes;</br>\n            <b>Aide</b></br>\n            #Graphique en ligne\n            help(geom_line, package='ggplot2')\n            #Graphique en ligne escalier\n            help(geom_step, package=ggplot2)\n            #Ordre des variables\n            help(geom_path, package='ggplot2')\n            Autre : Cliquez sur le bouton Aide R pour obtenir une aide détaillée sur R. Vous pouvez également entrer help(labs), help(geom_line), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​            \n    "
  }
}