{
  "title": "t-test, Échantillons appariés",
  "navigation": "t-test, Échantillons appariés",
  "tvarbox1": "Première variable numérique",
  "tvarbox3": "Deuxième variable numérique",
  "label1": "Hypothèse alternative",
  "test1": "Différence != mu",
  "test2": "Différence > mu",
  "test3": "Différence < mu",
  "chkbox1": "Assumer une variance égale",
  "txtbox2": "Hypothèse nulle (mu)",
  "txtbox1": "Niveau de confiance",
  "cohensdNoCorrection": "d de Cohen",
  "hedgesgNoCorrection": "g de Hedges",
  "glassdNoCorrection": "delta de Glass",
  "hedgesgCorrect": "g de Hedges avec correction de biais",
  "glassdCorrect": "delta de Glass avec correction de biais",
  "effectsizes": "Tailles d'effet",
  "showEffectSizes": "Afficher les tailles d'effet",
  "cohensdCorrect": "d de Cohen avec correction de biais",
  "label3": "Options pour d de Cohen",
  "label4": "Options pour g de Hedges",
  "label5": "Options pour delta de Glass",
  "help": {
    "title": "t-test, échantillons indépendants",
    "r_help": "help(t.test, package ='stats')",
    "body": "\n<b>Description</b></br>\nEffectue des tests t sur un ou deux échantillons sur des vecteurs de données.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nt.test(x, ...)<br/>\n## Méthode S3 par défaut:<br/>\nt.test(x, y = NULL,\n        alternative = c(\"two.sided\", \"less\", \"greater\"),\n        mu = 0, paired = FALSE, var.equal = FALSE,\n        conf.level = 0.95, ...)<br/>\n## Méthode S3 pour la classe 'formula'<br/>\nt.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: un vecteur numérique (non vide) de valeurs de données.\n</li>\n<li>\ny: un vecteur numérique (non vide) de valeurs de données, optionnel.\n</li>\n<li>\nalternative: une chaîne de caractères spécifiant l'hypothèse alternative, doit être l'une de \"two.sided\" (par défaut), \"greater\" ou \"less\". Vous pouvez spécifier juste la lettre initiale.\n</li>\n<li>\nmu: un nombre indiquant la vraie valeur de la moyenne (ou la différence des moyennes si vous effectuez un test à deux échantillons).\n</li>\n<li>\npaired: un booléen indiquant si vous souhaitez un test t apparié.\n</li>\n<li>\nvar.equal: Une variable booléenne indiquant s'il faut traiter les deux variances comme étant égales. Si TRUE, alors la variance combinée est utilisée pour estimer la variance sinon l'approximation de Welch (ou Satterthwaite) aux degrés de liberté est utilisée.\n</li>\n<li>\nconf.level: niveau de confiance de l'intervalle.\n</li>\n<li>\nformula: une formule de la forme lhs ~ rhs où lhs est une variable numérique donnant les valeurs de données et rhs un facteur avec deux niveaux donnant les groupes correspondants.\n</li>\n<li>\ndata: une matrice ou un cadre de données (ou similaire : voir model.frame) contenant les variables dans la formule. Par défaut, les variables sont prises de l'environnement(formula).\n</li>\n<li>\nsubset: un vecteur optionnel spécifiant un sous-ensemble d'observations à utiliser.\n</li>\n<li>\nna.action: une fonction qui indique ce qui doit se passer lorsque les données contiennent des NAs. Par défaut, cela utilise getOption(\"na.action\").\n</li>\n<li>\n...: d'autres arguments à passer aux méthodes.\n</li>\n</ul>\n<b>Détails</b></br>\nL'interface de formule n'est applicable que pour les tests à 2 échantillons.</br>\nalternative = \"greater\" est l'alternative que x a une moyenne plus grande que y.</br>\nSi paired est TRUE, alors x et y doivent être spécifiés et ils doivent avoir la même longueur. Les valeurs manquantes sont silencieusement supprimées (en paires si paired est TRUE). Si var.equal est TRUE, alors l'estimation combinée de la variance est utilisée. Par défaut, si var.equal est FALSE, alors la variance est estimée séparément pour les deux groupes et la modification de Welch aux degrés de liberté est utilisée.</br>\nSi les données d'entrée sont effectivement constantes (comparées à la plus grande des deux moyennes), une erreur est générée.</br>\n<b>Valeur</b><br/>\nUne liste avec la classe \"htest\" contenant les composants suivants:<br/>\nstatistic: la valeur de la statistique t.<br/>\nparameter: les degrés de liberté pour la statistique t.<br/>\np.value: la valeur p pour le test.<br/>\nconf.int: un intervalle de confiance pour la moyenne approprié à l'hypothèse alternative spécifiée.<br/>\nestimate: la moyenne estimée ou la différence des moyennes selon qu'il s'agisse d'un test à un échantillon ou à deux échantillons.<br/>\nnull.value: la valeur hypothétique spécifiée de la moyenne ou de la différence de moyennes selon qu'il s'agisse d'un test à un échantillon ou à deux échantillons.<br/>\nalternative: une chaîne de caractères décrivant l'hypothèse alternative.<br/>\nmethod: une chaîne de caractères indiquant quel type de test t a été effectué.<br/>\ndata.name: une chaîne de caractères donnant le(s) nom(s) des données.<br/>\n<b>Package</b></br>\nstats</br>\n<b>Aide</b></br>\nhelp(t.test, package ='stats')\n"
  }
}