{
  "title": "ANOVA y Prueba de Razón de Verosimilitud",
  "navigation": "ANOVA y Razón de Verosimilitud",
  "label1": "ANOVA se realiza para modelos con las siguientes clases (clases R entre paréntesis) Modelos lineales (lm), Modelos lineales generalizados (glm), Modelo lineal logarítmico binomial negativo (negbin), Modelo lineal utilizando mínimos cuadrados generalizados (gls), Modelo de regresión de supervivencia (survreg), Modelo de riesgo proporcional (coxph), Regresión Loess (loess)",
  "label2": "**NOTA: La prueba de verosimilitud no es compatible con modelos creados a través de Ajuste de Modelos (clase train),",
  "modelselector1": "Seleccionar un modelo",
  "help": {
    "title": "ANOVA y Prueba de Razón de Verosimilitud",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>Descripción</b></br>\nLas Tablas ANOVA: Calcula tablas de análisis de varianza y realiza pruebas de razón de verosimilitud para un objeto de modelo ajustado. Para modelos de efectos mixtos, se muestra la tabla similar a ANOVA para efectos aleatorios. \n<br/>\n<b>Uso</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: un objeto que contiene los resultados devueltos por una función de ajuste de modelo (por ejemplo, lm o glm).\n</li>\n</ul>\n<b>Valor</b><br/>\nEsta función (genérica) devuelve un objeto de clase anova. Estos objetos representan tablas de análisis de varianza y análisis de desviación. Cuando se le da un solo argumento, produce una tabla que prueba si los términos del modelo son significativos. Cuando se le da una secuencia de objetos, anova prueba los modelos entre sí en el orden especificado.<br/>\nEl método de impresión para objetos anova imprime tablas en una forma 'bonita'.<br/>\n<b>Advertencia</b><br/>\nLa comparación entre dos o más modelos solo será válida si se ajustan al mismo conjunto de datos. Esto puede ser un problema si hay valores faltantes y se utiliza la acción predeterminada de R na.action = na.omit.<br/>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el icono de R en la parte superior derecha de este diálogo o ejecute el siguiente comando en el editor de sintaxis de R help(anova,package='stats')</br></br>\n<b>Descripción</b></br>\nPrueba de Razón de Verosimilitud de Modelos Anidados: lrtest es una función genérica para llevar a cabo pruebas de razón de verosimilitud. El método predeterminado se puede emplear para comparar modelos lineales (generalizados) anidados (ver detalles a continuación).\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Método S3 predeterminado:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Método S3 para la clase 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: un objeto. Ver detalles a continuación.\n</li>\n<li>\n...: especificaciones adicionales de objetos pasadas a métodos. Ver detalles a continuación.\n</li>\n<li>\nname: una función para extraer un nombre/descripción adecuado de un objeto de modelo ajustado. Por defecto, el nombre se consulta llamando a formula.\n</li>\n<li>\ndata: un marco de datos que contiene las variables en el modelo.\n</li>\n</ul>\n<b>Detalles</b></br>\nlrtest está destinado a ser una función genérica para comparaciones de modelos a través de pruebas de razón de verosimilitud asintóticas. El método predeterminado compara consecutivamente el objeto de modelo ajustado con los modelos pasados en .... En lugar de pasar los objetos de modelo ajustados en ..., varias otras especificaciones son posibles. El mecanismo de actualización es el mismo que para waldtest: los modelos en ... pueden especificarse como enteros, caracteres (ambos para términos que deben eliminarse del modelo anterior), fórmulas de actualización u objetos de modelo ajustados. Excepto por el último caso, se asume la existencia de un método de actualización. Ver waldtest para más detalles.<br/>\nPosteriormente, se lleva a cabo una prueba de razón de verosimilitud asintótica para cada dos modelos consecutivos: Dos veces la diferencia en log-verosimilitudes (como se deriva por los métodos logLik) se compara con una distribución Chi-cuadrado.<br/>\nEl método \"formula\" ajusta primero un lm y luego llama al método predeterminado.<br/>\n<b>Valor</b><br/>\nUn objeto de clase \"anova\" que contiene la log-verosimilitud, grados de libertad, la diferencia en grados de libertad, estadístico de razón de verosimilitud Chi-cuadrado y el valor p correspondiente.\n<b>Ejemplos</b><br/>\n<code> \n## con datos de Greene (1993):<br/>\n## cargar datos y calcular rezagos<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## varias especificaciones equivalentes de la prueba LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>Descripción</b></br>\nTabla Similar a ANOVA para Efectos Aleatorios: Calcule una tabla similar a ANOVA con pruebas de términos de efectos aleatorios en el modelo. Cada término de efecto aleatorio se reduce o elimina y se presentan pruebas de razón de verosimilitud de reducciones de modelo en una forma similar a la de drop1. rand es un alias para ranova.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmodel: un modelo de efectos mixtos lineales ajustado con lmer() (heredando de la clase lmerMod).\n</li>\n<li>\nreduce.terms: si es TRUE (predeterminado) los términos de efecto aleatorio se reducen (si es posible). Si es FALSE, los términos de efecto aleatorio simplemente se eliminan.\n</li>\n</ul>\n<b>Detalles</b></br>\nSi el modelo se ajusta con REML, las pruebas son pruebas de razón de verosimilitud REML.<br/>\nUn término de efecto aleatorio de la forma (f1 + f2 | gr) se reduce a términos de la forma (f2 | gr) y (f1 | gr) y estos modelos reducidos se comparan con el modelo original. Si reduce.terms es FALSE (f1 + f2 | gr) se elimina en su lugar.<br/>\nUn término de efecto aleatorio de la forma (f1 | gr) se reduce a (1 | gr) (a menos que reduce.terms sea FALSE).<br/>\nUn término de efecto aleatorio de la forma (1 | gr) no se reduce, sino que simplemente se elimina.<br/>\nUn término de efecto aleatorio de la forma (0 + f1 | gr) o (-1 + f1 | gr) se reduce (si reduce.terms = TRUE) a (1 | gr).<br/>\nUn término de efecto aleatorio de la forma (1 | gr1/gr2) se expande automáticamente a dos términos: (1 | gr2:gr1) y (1 | gr1) utilizando findbars.<br/>\nEn esta exposición, no importa si f1 y f2 son factores o variables continuas.<br/>\n<b>Valor</b><br/>\nUna tabla similar a ANOVA con eliminaciones de términos individuales de efectos aleatorios que heredan de la clase anova y un data.frame con las columnas:</br>\nnpar: número de parámetros del modelo.</br>\nlogLik: la log-verosimilitud para el modelo. Tenga en cuenta que esta es la logLik REML si el modelo se ajusta con REML.</br>\nAIC: el AIC para el modelo evaluado como -2*(logLik - npar). Más pequeño es mejor.</br>\nLRT: el estadístico de prueba de razón de verosimilitud; dos veces la diferencia en log-verosimilitud, que se distribuye asintóticamente como chi-cuadrado.</br>\nDf: grados de libertad para la prueba de razón de verosimilitud: la diferencia en el número de parámetros del modelo.</br>\nPr(>Chisq) :el valor p.</br>\n<b>Advertencia</b></br>\nEn ciertos casos, se pueden generar pruebas de modelos no anidados. Un ejemplo es cuando (0 + poly(x, 2) | gr) se reduce (el predeterminado) a (1 | gr). A nuestro mejor conocimiento, las comparaciones de modelos no anidados solo se generan en casos que son estadísticamente sin sentido de todos modos (como en este ejemplo donde se suprime la intersección aleatoria).</br>\nNota: Tenga en cuenta que anova se puede usar para comparar dos modelos y a menudo podrá producir las mismas pruebas que ranova. Sin embargo, esto no siempre es el caso, como se ilustra en los ejemplos.</br>\n<b>Ejemplos</b><br/>\n<code> \n# Prueba de reducción de (Días | Sujeto) a (1 | Sujeto):<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # prueba de 2 df<br/>\n# Esta prueba también se puede lograr con anova():<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# Ilustrar el argumento reduce.test:<br/>\n# Prueba de eliminación de (Días | Sujeto):<br/>\nranova(fm1, reduce.terms = FALSE) # prueba de 3 df<br/>\n# El estadístico de prueba de razón de verosimilitud en este caso:<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() no siempre puede realizar las mismas pruebas que ranova(),<br/>\n# por ejemplo:<br/>\nanova(fm1, fm3, refit=FALSE) # compara REML con ML y no debe usarse<br/>\nanova(fm1, fm3, refit=TRUE) # es una prueba de ajustes de ML y no lo que buscamos<br/>\n# También tenga en cuenta que el ajuste de lmer debe venir primero - no un ajuste de lm:<br/>\n# anova(fm3, fm1) # no funciona y da un error<br/>\n# ranova() puede no generar todas las pruebas relevantes:<br/>\n# Para el siguiente modelo, ranova() indica que no debemos reducir<br/>\n# (TVset | Evaluador):\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Assessor), data=TVbo)<br/>\nranova(fm)<br/>\n# Sin embargo, un modelo más apropiado es:<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Assessor), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm y fm2 tienen esencialmente el mismo ajuste a los datos, pero fm utiliza 5 parámetros más que fm.<br/>\n</code> <br/>\n<b>Paquete</b></br>\nlmerTest</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el icono de R en la parte superior derecha de este diálogo o ejecute el siguiente comando en el editor de sintaxis de R help(ranova, package ='lmerTest')\n                "
  }
}