{
  "title": "ANOVA, N vías",
  "modelname": "Ingrese un nombre para el modelo",
  "label3": "Tamaño del efecto",
  "confInterval": "Intervalo de confianza para tamaños de efecto",
  "effectsizes": "Seleccione medida de tamaño del efecto",
  "navigation": "ANOVA, N vías",
  "target": "Variable objetivo (numérica/escala)",
  "dest": "Especifique un máximo de 2 variables de factor",
  "options": "Opciones",
  "type": "Seleccione tipo I/II/III Sumas de cuadrados",
  "levene": "Prueba de Levene para homogeneidad de varianzas",
  "label1": "Post-hoc",
  "combon": "Comparar medias usando:",
  "adjust": "Método para ajustar valores p",
  "compactly": "Comparando medias de manera compacta",
  "alpha": "Ingrese un valor de alfa:",
  "label2": "Gráficas",
  "label4": "Gráficas",
  "diag": "Gráficas diagnósticas",
  "plot1": "Graficar todas las comparaciones",
  "horizontalAxis": "Líneas separadas",
  "separateLines": "Eje horizontal",
  "separatePlots": "Gráficas separadas",
  "labelSaveResiduals": "Guardar estadísticas del modelo en el conjunto de datos",
  "residuals": "Los residuos se guardan con un nombre de variable residuos con un prefijo opcional",
  "stuResiduals": "Los residuos studentizados se guardan con un nombre de variable resStudentized con un prefijo opcional",
  "fittedVals": "Los valores ajustados se guardan con un nombre de variable ajustados con un prefijo opcional",
  "prefixForSavedStatistics": "Opcionalmente ingrese un prefijo para los valores guardados anteriores, el prefijo se agrega al nombre(s) de variable(s) anteriores",
  "help": {
    "title": "ANOVA, N vías",
    "r_help": "help(aov, package='stats')",
    "body": "\nNOTA:</br>\n1. Para obtener todas las medias marginales y post-hocs, necesita construir una fórmula con los efectos principales y todos los términos de interacción en el modelo.</br> \nAsí que si está intentando analizar una interacción de 3 vías, necesita especificar</br>\nA + B + C + A:B + B:C + A:C + A:B:C</br>\nSi en cambio especifica A*B*C, obtendrá la tabla ANOVA completa, NO obtendrá las medias marginales estimadas y post-hocs para todas las interacciones.</br>\n2. Las medias marginales estimadas Y POST-HOC se calculan para todos los efectos principales y las INTERACCIONES ESPECIFICADAS</br>\n<b>Descripción</b></br>\nAjusta un modelo de análisis de varianza, muestra la suma de cuadrados tipo I, II, III, muestra medias marginales y contrastes (usando medias marginales).</br> \nOpcionalmente realiza la prueba de Levene para homogeneidad de varianza entre grupos y grafica gráficos.</br>\nLa prueba de Levene se ejecuta para todos los efectos principales</br></br>\nConstruye y resume un modelo anova usando la fórmula especificada usando la función aov</br>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nhelp(aov, package='stats')</br></br>\nMuestra la tabla Anova con suma de cuadrados tipo I/II/III</br>\nUsa la función Anova en el paquete car para suma de cuadrados tipo II, III, función anova en el paquete stats para tipo I. Al calcular la suma de cuadrados tipo III, se establecen contrastes apropiados (contr.sum) para variables de factor.</br>\n<b>Paquete</b></br>\ncar</br>\n<b>Ayuda</b></br>\nhelp(Anova, package='car')</br></br>\nMuestra medias marginales estimadas</br>\n<b>Paquete</b></br>\nemmeans</br>\n<b>Ayuda</b></br>\nhelp(emmeans, package='car')</br></br>\nCalcula la prueba de Levene para homogeneidad de varianza entre grupos. \n<b>Paquete</b></br>\ncar</br>\n<b>Ayuda</b></br>\nhelp(leveneTest, package='car')\n"
  }
}