{
  "title": "ANOVA, un camino con bloques",
  "navigation": "ANOVA, 1 camino con bloques",
  "tvarbox1": "Variable de respuesta (una)",
  "tvarbox2": "Efecto fijo",
  "blockVar": "Variable(s) de bloqueo",
  "chk1": "Histograma de residuos",
  "chk2": "Análisis post-hoc",
  "help": {
    "title": "ANOVA, un camino con bloques",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>Descripción</b></br>\nTablas de Anova para varios modelos estadísticos​\nCalcula tablas de análisis de varianza tipo-II o tipo-III para objetos de modelo producidos por lm, glm, multinom (en el paquete nnet), polr (en el paquete MASS), coxph (en el paquete survival), coxme (en el paquete coxme), svyglm (en el paquete survey), rlm (en el paquete MASS), lmer en el paquete lme4, lme en el paquete nlme, y (por el método predeterminado) para la mayoría de los modelos con un predictor lineal y coeficientes asintóticamente normales (ver detalles a continuación). Para modelos lineales, se calculan pruebas F; para modelos lineales generalizados, se calculan chi-cuadrado de razón de verosimilitud, chi-cuadrado de Wald o pruebas F; para modelos logit multinomial y logit de probabilidades proporcionales, se calculan pruebas de razón de verosimilitud. Se proporcionan varias estadísticas de prueba para modelos lineales multivariantes producidos por lm o manova. Se proporcionan pruebas de razón de verosimilitud parcial o pruebas de Wald para modelos de Cox. Se proporcionan pruebas chi-cuadrado de Wald para efectos fijos en modelos mixtos lineales y lineales generalizados. Se proporcionan pruebas chi-cuadrado de Wald o pruebas F en el caso predeterminado.​\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmod: lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm, u otro objeto de modelo adecuado.​\n</li>\n<li>\ntype: tipo de prueba, \"II\", \"III\", 2, o 3.​\n</li>\n</ul>\n<b>Detalles</b></br>\nLas designaciones \"tipo-II\" y \"tipo-III\" se toman de SAS, pero las definiciones utilizadas aquí no corresponden precisamente a las empleadas por SAS. Las pruebas tipo-II se calculan de acuerdo con el principio de marginalidad, probando cada término después de todos los demás, excepto ignorando los parientes de orden superior del término; las llamadas pruebas tipo-III violan la marginalidad, probando cada término en el modelo después de todos los demás. Esta definición de pruebas tipo-II corresponde a las pruebas producidas por SAS para modelos de análisis de varianza, donde todos los predictores son factores, pero no más generalmente (es decir, cuando hay predictores cuantitativos). Tenga mucho cuidado al formular el modelo para pruebas tipo-III, o las hipótesis probadas no tendrán sentido.​</br>\nComo se implementa aquí, las pruebas de Wald tipo-II son una generalización de las hipótesis lineales utilizadas para generar estas pruebas en modelos lineales.​</br>\nPara pruebas para modelos lineales, modelos lineales multivariantes y pruebas de Wald para modelos lineales generalizados, modelos de Cox, modelos mixtos, modelos lineales generalizados ajustados a datos de encuestas, y en el caso predeterminado, Anova encuentra las estadísticas de prueba sin volver a ajustar el modelo. El método svyglm simplemente llama al método predeterminado y, por lo tanto, puede tomar los mismos argumentos.​</br>\n<b>Valor</b><br/>\nUn objeto de clase \"anova\", o \"Anova.mlm\", que generalmente se imprime. Para objetos de clase \"Anova.mlm\", también hay un método de resumen, que proporciona mucho más detalle que el método de impresión sobre el MANOVA, incluidos los tradicionales F-tests univariantes de modelos mixtos con correcciones de Greenhouse-Geisser y Huynh-Feldt.​​</br>\n<b>Paquete</b></br>\nAnova</br>\n<b>Ayuda</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>Descripción</b></br>\nPruebas de separación de medias post-hoc. Para realizar pruebas de separación de medias post-hoc para cada variable de factor de efecto principal, utilizaremos el paquete emmeans. El modelo lineal en consideración se llama modelo, creado con la función lm anterior.  \n<br/>\n<b>Uso</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>Paquete</b></br>\nFSA;car;emmeans;ggplot2;multcomp</br>\n<b>Ayuda</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
  }
}