{
  "title": "ARIMA Automatizado",
  "navigation": "ARIMA Automatizado",
  "destination": "Variable a predecir",
  "firstObservation": "Tiempo de la primera observación e.g.1: ingrese 1961,1 para enero de 1961 e.g.2: ingrese 1961,3 para el 3er trimestre de 1961, e.g.3: ingrese 1 para una serie continua",
  "frequency": "Número de observaciones por unidad de tiempo e.g.1: ingrese 12 para una observación por cada mes de un año, e.g. 2: ingrese 4 para una observación por trimestre, e.g. 3: ingrese 1 para una serie continua.",
  "criteria": "Criterios del modelo",
  "label1": "Gráficas",
  "plotSeries": "Graficar series",
  "yaxisLabel": "Etiqueta del eje Y",
  "mainTitle": "Título principal",
  "label2": "Opciones para valores ajustados",
  "saveFitted": "Guardar valores ajustados",
  "fittedValsDatasetName": "Especificar el nombre del conjunto de datos para almacenar valores ajustados",
  "oriVsFitted": "Graficar original vs. Ajustado",
  "plotResiduals": "Graficar residuos",
  "label3": "Predecir usando el modelo",
  "predict": "Hacer predicciones usando el modelo",
  "periodToPredict": "Especificar el número de intervalos a predecir",
  "confInterval": "Especificar el intervalo de confianza en porcentajes e.g. 95 para 95%",
  "savePredictedVals": "Guardar valores predichos",
  "predictedValsDatasetName": "Especificar el nombre del conjunto de datos para almacenar valores predichos",
  "plotPredicted": "Graficar valores predichos",
  "correlogram": "Generar correlograma",
  "maxlag": "Ingrese el máximo rezago",
  "Boxtest": "Prueba de Ljung-Box",
  "help": {
    "title": "ARIMA Automatizado",
    "r_help": "help(auto.arima, package=forecast)",
    "body": "\n            <b>Descripción</b></br>\nDevuelve el mejor modelo ARIMA de acuerdo a AIC, AICc o BIC. La función realiza una búsqueda sobre posibles modelos dentro de las restricciones de orden proporcionadas. Llama internamente a auto.arima en el paquete forecast\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nBSkyRes <-BSkyAutoArima (vars, start, frequency, main , ylab, ic, plotSeries=TRUE, plotResiduals=FALSE, predict=FALSE, savePredictedVals=FALSE, plotPredictedValues=FALSE, correlogram=FALSE, dataset)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nvars: variables seleccionadas para construir un modelo arima automático.\n</li>\n<li>\nstart: El tiempo de la primera observación debe ingresarse en el formato año,mes o año,trimestre e.g.( si sus datos están organizados en meses el 1992,1 para enero de 1992 o si sus datos están organizados en trimestres entonces 1992,1 se refiere al primer trimestre de 1992.\n</li>\n<li>\nfrequency: Número de observaciones en unidad de tiempo. Ejemplo: para mensual hay 12 observaciones en un año. Para trimestral hay 4 observaciones en un año.\n</li>\n<li>\nic: Criterio de información que se utilizará en la selección del modelo. Debe ser uno de \"aic\", \"aicc\" o \"bic\"\n</li>\n<li>\nplotSeries: si es VERDADERO se generará también un gráfico de series temporales.\n</li>\n<li>\nplotResiduals: si es VERDADERO también se graficarán los residuos.\n</li>\n<li>\npredict: si es VERDADERO también se generarán valores predichos.\n</li>\n<li>\nsavePredictedVals: los valores predichos se guardarán.\n</li>\n<li>\nPlotPredictedValues: los valores predichos también se graficarán.\n</li>\n<li>\ncorrelogram: si es VERDADERO se generará un correlograma.\n</li>\n<li>\nmain: título principal del gráfico\n</li>\n<li>\nylab: título para el eje y\n</li>\n<li>\ndataset: el nombre del conjunto de datos del cual se han seleccionado las vars.\n</li>\n</ul>\n<b>Detalles</b></br>\nLos argumentos predeterminados están diseñados para una estimación rápida de modelos para muchas series temporales. Si está analizando solo una serie temporal, y puede permitirse tomar un poco más de tiempo, se recomienda que establezca stepwise=FALSE y approximation=FALSE.</br>\nLa selección no paso a paso puede ser lenta, especialmente para datos estacionales. El algoritmo paso a paso descrito en Hyndman & Khandakar (2008) se utiliza excepto que el método predeterminado para seleccionar diferencias estacionales ahora se basa en una estimación de la fuerza estacional (Wang, Smith & Hyndman, 2006) en lugar de la prueba de Canova-Hansen. También hay algunas otras variaciones menores en el algoritmo descrito en Hyndman y Khandakar (2008).</br>\n<b>Valor</b><br/>\nUna lista de clase \"Arima\" con componentes:<br/>\ncoef: un vector de coeficientes AR, MA y de regresión, que se pueden extraer mediante el método coef.<br/>\nsigma2: el MLE de la varianza de las innovaciones.<br/>\nvar.coef: la matriz de varianza estimada de los coeficientes coef, que se puede extraer mediante el método vcov.<br/>\nloglik: la log-verosimilitud maximizada (de los datos diferenciados), o la aproximación a ella utilizada.<br/>\narma: Una forma compacta de la especificación, como un vector que da el número de coeficientes AR, MA, AR estacional y MA estacional, más el período y el número de diferencias no estacionales y estacionales.<br/>\naic: el valor AIC correspondiente a la log-verosimilitud. Solo válido para ajustes de método = \"ML\".<br/>\nresiduals: las innovaciones ajustadas.<br/>\nseries: el nombre de la serie x.<br/>\ncode: el valor de convergencia devuelto por optim.<br/>\nn.cond\t:el número de observaciones iniciales no utilizadas en el ajuste.<br/>\nnobs: el número de observaciones \"utilizadas\" para el ajuste, que también se puede extraer a través de nobs() y se utiliza por BIC.<br/>\nmodel: Una lista que representa el Filtro de Kalman utilizado en el ajuste. Ver KalmanLike.<br/>\n<b>Paquete</b></br>\nforecast</br>\n<b>Ayuda</b></br>\nPara ayuda detallada haga clic en el ícono de R en la parte superior derecha de este diálogo o ejecute el siguiente comando en el editor de sintaxis de R help(auto.arima, package=forecast)\n\t\t\t"
  }
}