{
  "title": "Gráfico de Barras",
  "navigation": "Gráfico de Barras",
  "optionsLabels": "Opciones para etiquetas",
  "suppressLabels": "Suprimir todas las etiquetas para conteos y porcentajes",
  "suppressThreshold": "Suprimir etiquetas para conteos y porcentajes por debajo del porcentaje umbral especificado",
  "label1": "Haga clic en la pestaña a continuación para seleccionar conteo o media. Cuando se selecciona conteo, una variable Y es opcional. Cuando se selecciona conteo y NO se especifica una variable Y, se muestran los conteos de la variable X. Cuando se especifica conteo y se especifica una variable Y, los valores de la variable Y se suman. Cuando se selecciona media, debe seleccionar una variable Y y una variable X. Se calculan las medias para la(s) variable(s) Y.",
  "x": "Variable X",
  "y": "Variable(s) Y, especifique una variable numérica",
  "fill": "Especifique una variable de factor para llenar las barras.",
  "dropna": "Eliminar valores faltantes",
    "bottomlbl": "Seleccionar gráfico de barras ",
    "meanlbl": "Media",
    "countlbl": " Recuento",  
  "fill1": "Seleccione un color para las barras. Nota: Esto se ignora cuando se especifica una variable para llenar las barras.",
  "barType": "Tipo de gráfico de barras",
  "stackedBar": "Gráfico de barras apiladas",
  "sideBySide": "Mostrar grupos uno al lado del otro",
  "fillPercent": "Llenar barras",
  "errorBarOptions": "Barras de error",
  "noErrBars": "Sin barras de error",
  "stderr": "Errores estándar",
  "stddev": "Desviación estándar",
  "cilevel": "Especifique el nivel de confianza:",
  "confidenceInterval": "Nivel de confianza:",
  "alpha": "Opacidad (0-1)",
  "flipBox": "Invertir Eje",
  "specify_a_title": "Ingrese un título",
  "x_title": "Etiqueta del Eje X",
  "y_title": "Etiqueta del Eje Y",
  "hide": "Mostrar solo la parte superior de las barras de error (debe establecer la opacidad en 1)",
  "Facetrow": "Fila de Facetas",
  "Facetcolumn": "Columna de Facetas",
  "Facetwrap": "Envolver Facetas",
  "Facetscale": "Escala de Facetas",
  "relFreq": "Frecuencias relativas",
  "facets_lbl" : "Facets",
  "help": {
    "title": "Ayuda del Gráfico de Barras",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Un gráfico de barras es un gráfico que presenta datos agrupados con barras rectangulares cuya longitud es proporcional a los valores que representan. Las barras pueden ser trazadas vertical u horizontalmente. Las barras pueden ser agrupadas por una variable de factor opcional. Los grupos pueden ser apilados en una sola barra o mostrados uno al lado del otro. Las facetas pueden ser creadas opcionalmente especificando una variable de factor. También puede especificar temas, y especificar un título y etiquetas para los ejes x e y.\n        Puede crear un gráfico de barras para una sola variable de factor, las barras representarán los conteos de cada nivel de la variable de factor. Aquí la variable de factor estará en el eje x, vea el ejemplo a continuación. Cuando se selecciona la casilla de frecuencias relativas, mostramos la frecuencia relativa en lugar de los conteos en el eje y.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=1) +\n         labs(x =\"year\",y =\"Count\",title= \"Gráfico de barras para Eje X: year,Eje Y: Count\")\n        </code>\n        <br />\n        Puede crear un gráfico de barras colocando una variable de escala/númerica en el eje y, y llenando las barras con una variable de factor. La barra se llenará sumando los valores de la variable y para cada nivel de la variable de factor, vea el ejemplo a continuación\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=1,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"Gráfico de barras para Eje X:,Eje Y: weight,Llenar: origin\")\n        </code>\n        <br />\n        Puede especificar una variable x, una variable y y llenar. La barra se llena con la suma de los valores de la variable y para cada nivel de la variable x, agrupada por el nivel de la variable especificada en el llenado.\n        Cuando especifica múltiples variables x, creamos un gráfico de barras separado para cada variable x. \n        <br />\n        Uso:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: El conjunto de datos predeterminado​\n        </li>\n        <li>\n        aes():    Genera mapeos estéticos que describen cómo las variables en los datos se mapean a propiedades visuales (estéticas) de los geoms.​\n        </li>\n        <li>\n        x: Una variable de factor/categórica. La longitud de la barra corresponde a los conteos de cada nivel de la variable de factor.​\n        </li>\n        <li>\n        fill: Una variable de factor/categórica opcional para agrupar los conteos de los niveles en x: (ver arriba)​\n        </li>\n        <li>\n        geom_bar(): Crea el gráfico de barras, position =”stack” apila los grupos en una sola barra, position =”dodge” apila los grupos uno al lado del otro, position =\"fill\" llena la barra con un porcentaje de cada nivel de agrupamiento.​\n        </li>\n        <li>\n        Labs(): Cambia las etiquetas de los ejes y los títulos de la leyenda (esto es opcional)​\n        </li>\n        <li>\n        facet_grid(): Organiza paneles en una cuadrícula (esto es opcional)​\n        </li>\n        <li>\n        theme_calc(): Especifica el tema de la calculadora (esto es opcional)​\n        </li>\n        <li>\n        coord_flip(): Invierte el eje (esto es opcional)​\n        </li>\n        <li>\n        alpha: Controla la opacidad, toma valores entre 0-1. 1 significa sin opacidad.\n        </li>\n        </ul>\n        Paquete: ggplot2,ggthemes​\n        <br />\n        Otro: Haga clic en el botón de Ayuda de R para obtener ayuda detallada de R. También puede ingresar help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n        "
  }
}