{
  "title": "Prueba de Bartlett",
  "navigation": "Prueba de Bartlett",
  "tvarbox1": "Variable de respuesta",
  "tvarbox2": "Variables numéricas o factores",
  "help": {
    "title": "Prueba de Bartlett",
    "r_help": "help(bartlett.test, package=stats)",
    "body": "\n<b>Descripción</b></br>\nRealiza la prueba de Bartlett de la hipótesis nula de que las varianzas en cada uno de los grupos (muestras) son las mismas.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nbartlett.test(x, ...)</br>\n## Método S3 por defecto:</br>\nbartlett.test(x, g, ...)</br>\n## Método S3 para la clase 'formula'</br>\nbartlett.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nArgumentos\nx: un vector numérico de valores de datos, o una lista de vectores de datos numéricos que representan las respectivas muestras, o objetos de modelos lineales ajustados (heredando de la clase \"lm\").\n</li>\n<li>\ng: un vector u objeto de factor que da el grupo para los elementos correspondientes de x. Ignorado si x es una lista.\n</li>\n<li>\nformula: una fórmula de la forma lhs ~ rhs donde lhs da los valores de los datos y rhs los grupos correspondientes.\n</li>\n<li>\ndata: una matriz opcional o marco de datos (o similar: ver model.frame) que contiene las variables en la fórmula formula. Por defecto, las variables se toman del entorno(formula).\n</li>\n<li>\nsubset: un vector opcional que especifica un subconjunto de observaciones a utilizar.\n</li>\n<li>\nna.action: una función que indica qué debería suceder cuando los datos contienen NAs. Por defecto, se utiliza getOption(\"na.action\").\n</li>\n<li>\n...: argumentos adicionales que se pasarán a o desde métodos.\n</li>\n</ul>\n<b>Detalles</b></br>\nSi x es una lista, sus elementos se toman como las muestras o modelos lineales ajustados a comparar para la homogeneidad de varianzas. En este caso, los elementos deben ser todos vectores de datos numéricos o objetos de modelos lineales ajustados, g es ignorado, y se puede simplemente usar bartlett.test(x) para realizar la prueba. Si las muestras aún no están contenidas en una lista, use bartlett.test(list(x, ...)).</br>\nDe lo contrario, x debe ser un vector de datos numéricos, y g debe ser un vector u objeto de factor de la misma longitud que x que da el grupo para los elementos correspondientes de x.</br>\n<b>Valor</b><br/>\nUna lista de clase \"htest\" que contiene los siguientes componentes:<br/>\nstatistic: estadístico de la prueba K-cuadrado de Bartlett.<br/>\nparameter: los grados de libertad de la distribución chi-cuadrado aproximada del estadístico de la prueba.<br/>\np.value: el valor p de la prueba.<br/>\nmethod: la cadena de caracteres \"Prueba de Bartlett de homogeneidad de varianzas\".<br/>\ndata.name: una cadena de caracteres que da los nombres de los datos.<br/>\n<b>Ejemplos</b><br/>\n<code> \nDataset <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))\nResult_Bartlett_Test = bartlett.test(sales ~ interaction(Dataset$Gender),data=Dataset)\n</code> <br/>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nhelp(bartlett.test, package=stats)\n"
  }
}