{
  "title": "Diagrama de Caja",
  "dropna": "Eliminar valores faltantes",
  "navigation": "Diagrama de Caja",
  "x": "Variable X, especificar una variable de factor",
  "y": "Variable(s) Y, especificar una(s) variable(s) numérica(s)",
  "fill": "Relleno, especificar una variable de factor",
  "dataPoints": "Selecciona una opción para trazar puntos de datos",
  "alpha": "Opacidad (0-1)",
  "flip": "Invertir eje",
  "notch": "Muesca",
  "outliers": "Mostrar valores atípicos (en rojo)",
  "specify_a_title": "Ingresa un título",
  "x_title": "Etiqueta del Eje X",
  "y_title": "Etiqueta del Eje Y",
  "barcolor": "Selecciona un color para las líneas alrededor de las cajas (Después de seleccionar el color, haz clic fuera del control para aplicar)",
  "Facetrow": "Fila de Facetas",
  "Facetcolumn": "Columna de Facetas",
  "Facetwrap": "Envolver Facetas",
  "Facetscale": "Escala de Facetas",
  "help": {
    "title": "Diagrama de Caja",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descripción</b></br>\n        En estadísticas descriptivas, un diagrama de caja o boxplot es una forma conveniente de representar gráficamente grupos de datos numéricos a través de sus cuartiles. Los diagramas de caja también pueden tener líneas que se extienden verticalmente desde las cajas (bigotes) que indican la variabilidad fuera de los cuartiles superior e inferior, de ahí los términos diagrama de caja y bigote. Los valores atípicos pueden ser representados como puntos individuales. Los diagramas de caja y bigote son uniformes en su uso de la caja: la parte inferior y superior de la caja son siempre el primer y tercer cuartil, y la banda dentro de la caja es siempre el segundo cuartil (la mediana). El bigote superior se extiende desde la bisagra hasta el valor más alto que está dentro de 1.5 * IQR de la bisagra, donde IQR es el rango intercuartílico, o distancia entre el primer y tercer cuartil. El bigote inferior se extiende desde la bisagra hasta el valor más bajo dentro de 1.5 * IQR de la bisagra. Los datos más allá del final de los bigotes son valores atípicos y se representan como puntos (como lo especifica Tukey).​</br>\n        Las facetas pueden ser creadas opcionalmente especificando una variable de factor. También puedes especificar temas opcionalmente, y especificar un título y etiquetas para los ejes x e y​</br>\n        Cuando seleccionas la opción de trazar los puntos de datos, lo hacemos usando geom_dotplot</br>\n        Por defecto, los valores atípicos se muestran con puntos negros, cuando seleccionas la opción de mostrar valores atípicos (en rojo) a través de la casilla de verificación, los valores atípicos se hacen más prominentes.\n        <br/>\n        <b>Uso</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumentos</b><br/>\n        <ul>\n        <li>\n        data: El conjunto de datos predeterminado​\n        </li>\n        <li>\n        x: Una variable de factor/categórica que define el agrupamiento de la variable y​\n        </li>\n        <li>\n        y: Una variable numérica para la cual se calcula el diagrama de caja​\n        </li>\n        <li>\n        fill: Una variable de factor/categórica opcional para agrupar aún más los grupos existentes. Cada subgrupo se mostrará en un color distinto.​\n        </li>\n        <li>\n        aes():    Genera mapeos estéticos que describen cómo las variables en los datos se mapean a propiedades visuales (estéticas) de los geoms.​\n        </li>\n        <li>\n        geom_boxplot():Crea el diagrama de caja. Las \"bisagras\" superior e inferior corresponden a los primeros y terceros cuartiles (los percentiles 25 y 75).​\n        </li>\n        <li>\n        geom_dotplot: Representa los puntos de datos\n        </li>\n        <li>\n        Labs(): Cambia las etiquetas de los ejes y los títulos de la leyenda (esto es opcional)​\n        </li>\n        <li>\n        facet_grid(): Organiza paneles en una cuadrícula (esto es opcional)​\n        </li>\n        <li>\n        theme_calc(): Especifica el tema de la calculadora (esto es opcional)​\n        </li>\n        <li>\n        coord_flip(): Invertir eje (esto es opcional)​\n        </li>\n        <li>\n        notch: Los diagramas de caja con muesca aplican una \"muesca\" o estrechamiento de la caja alrededor de la mediana. Las muescas son útiles para ofrecer una guía aproximada sobre la significancia de la diferencia de medianas; si las muescas de dos cajas no se superponen, esto ofrece evidencia de una diferencia estadísticamente significativa entre las medianas. En un diagrama de caja con muesca, las muescas se extienden 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n        <b>Paquete</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Ayuda</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Haz clic en el botón de Ayuda de R para obtener ayuda detallada de R. También puedes ingresar help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}