{
  "title": "Riesgos Competitivos, comparar grupos",
  "navigation": "Riesgos Competitivos, comparar grupos",
  "timevar": "Tiempo hasta el evento o censura",
  "eventvar": "Eventos (0 = censura, 1 = evento 1, 2 = evento 2, ...)",
  "groupvarlabel": "Grupo",
  "eventnum": "Código de Evento",
  "singleeventchkbox": "Graficar para un Solo Evento",
  "printallest": "Tabla de Estimaciones Incluyendo Todos los Tiempos",
  "printspecest": "Tabla de Estimaciones para Tiempos Específicos",
  "spectimes": "Especificar tiempos como time1, time2, time3, etc. o como seq(1,5,by=1)",
  "styleoptions": "Opciones de Estilo",
  "axisoptions": "Opciones de Eje",
  "titleboxall": "Título del Gráfico (todos los gráficos de eventos)",
  "titleboxsingle": "Título del Gráfico (gráfico de un solo evento)",
  "plottitlesizelabel": "Tamaño del Título del Gráfico (5-50)",
  "themedropdown": "Tema del Gráfico",
  "label1": "Leyenda",
  "legendpos": "Posición",
  "keywidthlabel": "Ancho de la Clave (cm; gráfico combinado solo)",
  "legendeventslabel": "Eventos",
  "legendtitle": "Título",
  "eventlabels": "Etiquetas (especificar etiquetas separadas por comas en orden de códigos de evento: p.ej. 'Evento 1', 'Evento 2', etc; no código de censura)",
  "legendgroupslabel": "Grupos",
  "grouplabels": "Etiquetas (especificar etiquetas separadas por comas en orden de grupos: p.ej. 'Grupo 1', 'Grupo 2', etc.)",
  "legendfontsize": "Tamaño de Etiquetas de Leyenda (5-50)",
  "wraplabelfontsize": "Tamaño de Etiqueta de Evento para Gráfico por Evento (5-50)",
  "label2": "Número en Riesgo",
  "natriskchkbox": "Incluir Número en Riesgo",
  "risktableprop": "Altura de la Tabla de Riesgo (0-1)",
  "risktablevaluesize": "Tamaño de Valor de Tabla de Riesgo (1-15)",
  "risktabletitlesize": "Tamaño del Título de la Tabla de Riesgo (5-50)",
  "risktableaxislabelsize": "Tamaño de Etiqueta de Eje de Tabla de Riesgo (5-50)",
  "risktableticklabelsize": "Tamaño de Etiqueta de Marca de Eje de Tabla de Riesgo (5-50)",
  "risktableclean": "Eliminar Ejes y Líneas de Cuadrícula de la Tabla de Riesgo",
  "label3": "Opciones de Línea",
  "linesize": "Tamaño (0-5)",
  "colorpalette": "Paleta de Colores",
  "label4": "Intervalo de Confianza",
  "cichkbox": "Incluir IC del 95%",
  "labelblank": "",
  "cistyle": "Estilo",
  "citransparency": "Transparencia (0-1)",
  "censorlabel": "Tiempos Censurados",
  "censorchkbox": "Incluir Tiempos Censurados",
  "censorsize": "Tamaño (0-10)",
  "pvaluelabel": "Valor P (gráfico de un solo evento solo)",
  "pvaluechkbox": "Incluir valor p",
  "pvaluelocationx": "Ubicación en el Eje X (Tiempo)",
  "pvaluelocationy": "Ubicación en el Eje Y (Probabilidad)",
  "pvaluesize": "Tamaño (1-20)",
  "pvalueaccuracy": "Precisión (0-1)",
  "label5": "Eje de Incidencia",
  "incaxislabelall": "Etiqueta (todos los gráficos de eventos)",
  "incaxislabelsingle": "Etiqueta (gráfico de un solo evento)",
  "label6": "Escala",
  "defbutton": "proporción",
  "pctbutton": "porcentaje",
  "label7": "Límites de Eje y Incrementos de Marca de Ticks (0-1)",
  "incaxismin": "Mínimo",
  "incaxismax": "Máximo",
  "incaxisinc": "Incremento",
  "label8": "Eje de Tiempo",
  "timeaxislabel": "Etiqueta",
  "label9": "Límites de Eje y Incrementos de Marca de Ticks",
  "timeaxismin": "Mínimo",
  "timeaxismax": "Máximo",
  "timeaxisinc": "Incremento",
  "label10": "Nota: El máximo puede especificarse sin que se especifique el incremento. El incremento no puede especificarse sin que se especifique el máximo.",
  "axislabelsize": "Tamaño de Etiqueta de Eje (5-50)",
  "ticklabelsize": "Tamaño de Etiqueta de Marca de Eje (5-50)",
  "help": {
    "title": "Riesgos Competitivos, Comparar Grupos",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n            <br/>\n            Un riesgo competitivo es un evento cuya ocurrencia impide la ocurrencia del evento primario de interés. Hacer un análisis estándar de Kaplan-Meier en tales casos es sesgado y sobreestima el riesgo de evento. Este diálogo se utiliza para estimar el riesgo acumulativo de tener el evento primario después del inicio del seguimiento para ese evento (o tiempo cero), cuando uno o más riesgos competitivos están presentes. La suma de las incidencias acumulativas para cada evento es igual a la incidencia acumulativa para cualquier evento. Los sujetos deben estar en riesgo para todos los eventos comenzando en el tiempo cero. Se proporcionan gráficos de incidencia acumulativa para todos los eventos (curvas separadas para cada evento en el mismo gráfico), y opcionalmente para un evento específico por sí solo. \n            <br/>\n            Se puede encontrar una introducción al tema de riesgos competitivos en \"Introducción al Análisis de Datos de Supervivencia en Presencia de Riesgos Competitivos\" por Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Tiempo hasta el evento o censura:</b> Para cada sujeto, la duración hasta el primer evento, si ocurrió un evento, o el último seguimiento para eventos, si no ocurrieron eventos.\n            <br/><br/>\n            <b>Eventos:</b> Indicador numérico de qué evento ocurrió (1=evento 1, 2=evento 2, etc.) o cuando no ocurrieron eventos (0=censura) para cada sujeto\n            <br/><br/>\n            <b>Graficar para un Solo Evento:</b> Si desea graficar la incidencia acumulativa para un evento específico por sí solo. El <b>Código de Evento</b> corresponde al evento que se graficará.\n            <br/><br/>\n            <b>Tabla de Estimaciones Incluyendo Todos los Tiempos:</b> Opción para incluir una tabla que enumere las probabilidades de incidencia acumulativa y los intervalos de confianza del 95% para cada tiempo observado en el conjunto de datos\n            <br/>\n            <br/>\n\t\t\t<b>Tabla de Estimaciones para Tiempos Específicos:</b> Opción para incluir una tabla que tenga las probabilidades de incidencia acumulativa para un conjunto de tiempos seleccionados por el usuario.\n\t\t\t<br/><br/>\n\t\t\t<b>Especificar tiempos como time1, time2, time3, etc. o como seq(1,5,by=1):</b> Estos son los tiempos específicos que se incluirán en la tabla para tiempos específicos. Pueden especificarse individualmente con comas, o como una secuencia de valores espaciados uniformemente.\n\t\t\t<br/><br/>\t\t\t\n            Las tablas se generan con el tamaño de muestra, el número de sujetos con cada evento, el tiempo medio restringido en estado y el tiempo medio de seguimiento. El tiempo medio de seguimiento se calcula utilizando el estimador de Kaplan-Meier inverso, que trata los eventos verdaderos como observaciones censuradas y las observaciones censuradas verdaderas como eventos. Así, el \"evento\" en este estimador es \"seguir a los sujetos durante tanto tiempo como el estudio pudiera\".\n            <br/>\n            Se proporciona una tabla de estimaciones de incidencia acumulativa en cada tiempo observado en el conjunto de datos, con intervalos de confianza del 95%. \n            <br/>\n            <br/>\n            <b>Paquetes R Requeridos:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>Opciones de Estilo</b>\n            <br/>\n            <br/>\n            <b>Título del Gráfico (todos los gráficos de eventos):</b> Título de los gráficos que muestran todos los eventos; elimine todo el texto para no tener título\n            <br/><br/>\n            <b>Título del Gráfico (gráfico de un solo evento):</b> Título del gráfico que muestra el evento único seleccionado; elimine todo el texto para no tener título\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño del Título del Gráfico:</b> Tamaño de los títulos del gráfico.\n\t\t\t<br/><br/>\n            <b>Tema del Gráfico:</b> Estilo general del gráfico\n            <br/><br/>\n            <b>Opciones de Leyenda:</b>\n            <br/>\n            La opción <b>Posición</b> controla la ubicación de la leyenda (superior, inferior, izquierda, derecha). <b>Ancho de Clave</b> se utiliza para cambiar el ancho de las claves de la leyenda en el gráfico que combina todos los eventos y todos los grupos. Esto se puede usar para hacer que los tipos de línea sean más legibles en la leyenda.\n\t\t\t<b>Título de Evento</b> es el título para la parte de la leyenda que delimita los eventos. <b>Título de Grupo</b> es el título para la parte de la leyenda que delimita los grupos. Elimine el texto si no se desea título. <b>Etiquetas de Evento</b> se utilizan para mostrar texto para cada código de evento numérico en lugar de los códigos. <b>Etiquetas de Grupo</b> se utilizan para cambiar el texto para los grupos. Si especifica alguna etiqueta, todas las etiquetas deben especificarse.\n\t\t\tLa opción <b>Tamaño de Etiquetas de Leyenda</b> controla el tamaño de todo el texto contenido en la leyenda.\n\t\t\tLa opción <b>Tamaño de Etiqueta de Evento para Gráfico por Evento</b> controla el tamaño del texto del nombre del evento en el gráfico que se organiza por tipo de evento.\n            <br/>\n            <br/>\n            <b>Número en Riesgo:</b>\n\t\t\t<br/>\n\t\t\tOpcionalmente, incluya una tabla para el número de sujetos que aún están en riesgo a lo largo del tiempo en la parte inferior de los gráficos. Esto no se proporciona para el gráfico que se organiza por evento por razones de espacio y legibilidad. La <b>Altura de la Tabla de Riesgo</b> controla la proporción del área de graficación que ocupará la tabla.\n\t\t\tEl <b>Tamaño de Valor de Tabla de Riesgo</b> controla el tamaño de los números en riesgo. El <b>Tamaño de Título de Tabla de Riesgo</b> controla el tamaño del título para la tabla de número en riesgo.\n\t\t\tEl <b>Tamaño de Etiqueta de Eje de Tabla de Riesgo</b> controla el tamaño de las etiquetas de los ejes. \n\t\t\tLa <b>Tamaño de Etiqueta de Marca de Eje de Tabla de Riesgo</b> controla el tamaño de las etiquetas de marcas de ticks. Si se desea eliminar todos los ejes y líneas de cuadrícula \n\t\t\tde la tabla de número en riesgo, se puede marcar la opción <b>Eliminar Ejes y Líneas de Cuadrícula de la Tabla de Riesgo</b>. Esto solo incluirá los números en riesgo en la tabla.           \n            <br/><br/>\n            <b>Opciones de Línea:</b>\n            <br/>\n            <b>Tamaño</b> controla el grosor. La opción <b>Paleta de Colores</b> controla la paleta de colores utilizada para las líneas en todos los gráficos. También se proporcionan esquemas de color que imitan revistas científicas. Se puede incluir opcionalmente un intervalo de confianza del 95% para las estimaciones en formato de <b>ribbon</b> (área sombreada) o <b>step</b> (línea). <b>Transparencia</b> controla cuán oscura es la cinta y se ignora cuando se selecciona la opción de paso.\n\t\t\t<br/><br/>\n\t\t\t<b>Incluir Tiempos Censurados:</b> Los tiempos censurados (cuando los sujetos ya no están en riesgo para los eventos) pueden incluirse como signos más en las líneas. Esto es más útil en conjuntos de datos más pequeños o en casos de menor número de sujetos censurados. No se proporcionan en el gráfico que superpone todos los eventos y grupos por razones de legibilidad.\n\t\t\t<b>Tamaño</b> controla el tamaño de los signos más de tiempo censurado.\n\t\t\t<br/><br/>\n\t\t\t<b>Incluir valor p</b> se puede usar para incluir el valor p de la prueba de Gray para el evento seleccionado en el gráfico de un solo evento. <b>Ubicación en el Eje X (Tiempo)</b> y <b>Ubicación en el Eje Y (Probabilidad)</b> proporcionan las coordenadas (X, Y) del valor p en el gráfico.\n\t\t\t<b>Tamaño</b> controla el tamaño del valor p en el gráfico. <b>Precisión</b> controla la precisión del valor p. Por ejemplo, el valor predeterminado de 0.0001 mostraría valores p no menores que 0.0001. Cualquier valor p menor que 0.0001 se mostraría como \"p<0.0001\". \n            <br/><br/><br/>\n\t\t\t<b>Opciones de Eje</b>\n            <br/>\n            <br/>\n            Las opciones <b>Etiqueta</b> especifican la etiqueta de texto para el eje. Los <b>Límites de Eje</b> especifican los valores mínimo y máximo del eje. La opción <b>Incrementos de Marca de Ticks</b> controla el espaciado de las marcas de ticks en el eje. Los incrementos en el eje de tiempo también controlan los tiempos para la tabla opcional de número en riesgo.\n            <br/>\n            La opción <b>Escala</b> del eje de incidencia especifica si desea que las estimaciones estén en una escala de proporción (0-1) o porcentaje (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño de Etiqueta de Eje:</b>  Esto controla el tamaño de las etiquetas de eje de incidencia y tiempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño de Etiqueta de Marca de Ticks de Eje:</b>  Esto controla el tamaño de las etiquetas de marca de ticks de eje de incidencia y tiempo."
  }
}