{
  "title": "Gráfico Coxcomb",
  "navigation": "Coxcomb",
  "x": "Variable(s) del eje X, especificar variable(s) de factor",
  "y": "Variable Y, especificar una variable numérica",
  "fill": "Relleno, especificar una variable de factor",
  "alpha": "Opacidad (0-1)",
  "width": "Ancho",
  "rdgrp1": "Proporciones de relleno",
  "flip": "Invertir eje",
  "barcolor": "Color de la barra (Después de seleccionar el color, haga clic fuera del control para aplicar)",
  "specify_a_title": "Ingrese un título",
  "x_title": "Etiqueta del eje X",
  "y_title": "Etiqueta del eje Y",
  "Facetrow": "Fila de facetas",
  "Facetcolumn": "Columna de facetas",
  "Facetwrap": "Envoltura de facetas",
  "Facetscale": "Escala de facetas",
  "help": {
    "title": "Gráfico Coxcomb",
    "r_help": "help(coord_polar, package='ggplot2')",
    "body": "\n            <b>Descripción</b></br>\nUn gráfico Coxcomb/Bulls Eye (o un gráfico circular) es un gráfico estadístico circular, que se divide en rebanadas/círculos concéntricos para ilustrar proporciones numéricas. En un gráfico Coxcomb/Bulls Eye, la longitud de ancho de cada círculo concéntrico (y, por lo tanto, su área) es proporcional a la cantidad que representa. La cantidad puede representarse como un conteo o porcentaje.</br>​\nLas facetas se pueden crear opcionalmente especificando una variable de factor. También puede especificar temas opcionalmente, y especificar un título y etiquetas para los ejes x e y.</br>\nCuando especifica múltiples variables x, creamos un Coxcomb/Bulls Eye separado para cada variable x.</br>\n<b>Uso</b>\n<br/>\n<code>\n#Puede crear un gráfico Bulls Eye para una sola variable de factor, se creará un círculo concéntrico para cada nivel de la variable de factor. El ancho del círculo concéntrico es proporcional a los conteos de cada nivel del nivel de factor. Aquí la variable de factor corresponderá al relleno como se indica a continuación<br/>\n#penguins es un conjunto de datos en el paquete equatiomatic R\nggplot(data=penguins,aes(x ='',fill=species)) +​\n                 geom_bar(alpha=1,width =0.9) +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"Conteo\",fill =\"var1\",title= \"Gráfico Bulls Eye con Relleno: especie\")​</br></br>\n#Puede crear un gráfico Bulls Eye especificando una variable de escala/númerica como la variable y y una variable de factor que sirve como relleno. Aquí se crea un círculo concéntrico para cada nivel de la variable de factor de relleno. El ancho del círculo concéntrico es proporcional a la suma de los valores y en cada nivel del nivel de factor. Aquí la variable de factor corresponderá al relleno como se indica a continuación<br/>\nggplot(data=penguins,aes(x ='', y = bill_length_mm, fill = species)) +​\n                 geom_bar(alpha=1,width =0.9,stat=\"identity\") +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"var1\",fill =\"var2\",title= \"Gráfico Bulls Eye con Estética X:, Estética Y: var1, Relleno: var2\") </br></br>\n\n#Puede crear un gráfico Coxcomb especificando una variable x. Las rebanadas se crean para cada nivel de la variable x, el radio de cada rebanada es proporcional al conteo<br/>\n    ggplot(data=penguins, aes(x=island, )) +\n        geom_bar( alpha=1,width=1,) +\n        coord_polar(\"x\") +\n        labs(x=\"island\",  title= \"Gráfico Coxcomb con Estética X: island\") +\n        xlab(\"island\") + ylab(\"Conteo\")</br></br>\n\n#Puede generar un gráfico Coxcomb especificando una variable X y un relleno. Las rebanadas se crean para cada nivel de la variable x. Cada rebanada se llena con el conteo de los casos en cada nivel de la variable de relleno especificada.\nggplot(data=penguins, aes(x=island,fill=species )) +\n\tgeom_bar( alpha=1, width=1) +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\",  title= \"Gráfico Coxcomb con Estética X: island relleno: species\") +\n\txlab(\"island\") + ylab(\"Conteo\")</br></br>\n\n\n#Puede crear un gráfico Coxcomb especificando una variable x, una variable y y un relleno. Las rebanadas se crean para cada nivel de la variable x y se llenan con la suma de los valores de la variable y para cada nivel de la variable especificada en el relleno. Las rebanadas se dividen por niveles de la variable de relleno. El área ocupada por cada nivel de la variable de relleno dentro de la rebanada es proporcional a la suma de los conteos de la variable y que coinciden con la rebanada y la variable de relleno.<br/>\nggplot(data=penguins, aes(x=island,y=bill_depth_mm,fill=species )) +\n\tgeom_bar( alpha=1,width=1,stat = \"identity\") +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\", y=\"bill_depth_mm\", title= \"Gráfico Coxcomb con Estética X: island Estética Y: bill_depth_mm relleno: species\") +\n\txlab(\"island\") + ylab(\"bill_depth_mm\")</br></br>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ndata: El conjunto de datos predeterminado​\n</li>\n<li>\naes(): Genera mapeos estéticos que describen cómo las variables en los datos se asignan a propiedades visuales (estéticas) de los geoms.​\n</li>\n<li>\nx: (Opcional) Una variable de factor/categórica. La longitud de la barra corresponde a los conteos de cada nivel de la variable de factor.​\n</li>\n<li>\nY: (Opcional) una variable numérica\n</li>\n<li>\nfill: (Opcional) Una variable de factor/categórica opcional para agrupar los conteos de los niveles en x: (ver arriba)​\n</li>\n<li>\ngeom_bar(): Crea el gráfico de barras, position =\"fill\" llena la barra con un porcentaje de cada nivel de agrupamiento.​\n</li>\n<li>\nCoor_polar(): El sistema de coordenadas polares se utiliza comúnmente para gráficos de pastel, que son un gráfico de barras apiladas en coordenadas polares.\n</li>\n<li>\nLabs(): Cambia las etiquetas de los ejes y los títulos de la leyenda (esto es opcional)​\n</li>\n<li>\nfacet_grid(): Organiza paneles en una cuadrícula (esto es opcional)​\n</li>\n<li>\ntheme_calc(): Especifica el tema de la calculadora (esto es opcional)​\n</li>\n<li>\ncoord_flip(): Invertir eje (esto es opcional)​\n</li>\n<li>\nalpha: Controla la opacidad, toma valores entre 0-1. 1 significa sin opacidad.\n</li>\n</ul>\n<b>Paquete</b></br>\nggplot2;ggthemes;</br>\n<b>Ayuda</b></br>\nhelp(coord_polar, package=ggplot2)</br>\nOtro: Haga clic en el botón de ayuda de R para obtener ayuda detallada de R. También puede ingresar help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n    "
  }
}