{
  "title": "Cox, Fine-Gray",
  "navigation": "Cox, Fine-Gray",
  "modelname": "Ingrese el nombre del modelo",
  "timevar": "Tiempo hasta el evento o censura",
  "eventvar": "Eventos (0 = censura, 1 = evento 1, 2 = evento 2, ...)",
  "eventcodelabel": "Código de Evento",
  "modelterms": "Constructor de expresión del modelo para variables independientes",
  "stratavarslabel": "Variables de Estratificación (opcional)",
  "weightvar": "Pesos (opcional)",
  "tiemethod": "Método de Tiempo Empatado",
  "diagnosticsbox": "Diagnósticos del Modelo",
  "martminlabel": "Valor Mínimo del Eje de Residuales de Martingale del Modelo Nulo (-Inf a 1)",
  "anovachkboxlabel": "Análisis de Desviación (Tipo II)",
  "help": {
    "title": "Cox, Fine-Gray",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nAjusta un modelo de riesgos proporcionales de Fine-Gray para datos de tiempo hasta el evento con observaciones censuradas cuando están presentes riesgos competitivos. Los modelos de Fine-Gray modelan el efecto de \nlas covariables sobre la función de incidencia acumulativa. Una alternativa es modelar el efecto de las covariables sobre el riesgo específico de causa, para lo cual se pueden usar modelos de regresión de Cox estándar. \nUna introducción al tema de riesgos competitivos se puede encontrar en \"Introducción al Análisis de Datos de Supervivencia en Presencia de Riesgos Competitivos\" por Peter Austin, \net. al., Circulation, 2016; 133:601-609. \n<br/><br/>\nSe proporcionan estadísticas de ajuste del modelo, estimaciones de parámetros y razones de riesgo. Las opciones disponibles incluyen el método de tiempo empatado y diagnósticos del modelo. El modelo se ajusta utilizando las \nfinegray y coxph funciones en el paquete de supervivencia.\n<br/><br/>\n<b>Ingrese el nombre del modelo:</b> Especifique el nombre del modelo donde se almacenarán los resultados.\n<br/><br/>\n<b>Tiempo hasta el evento o censura:</b> Tiempo hasta el primer evento para aquellos que experimentan un evento o tiempo hasta el último seguimiento para aquellos que no experimentan ningún evento.\n<br/><br/>\n<b>Eventos (0 = censura, 1 = evento 1, 2 = evento 2, ...):</b> Indicador numérico de evento; 0=censura, 1=evento 1, 2=evento 2, etc.\n<br/><br/>\n<b>Código de Evento:</b> Seleccione el evento de interés que desea modelar. Puede ser seleccionado o escrito.\n<br/><br/>\n<b>Constructor de Fórmulas:</b> Construya términos para incluir en el modelo. Los factores, cadenas y variables lógicas serán codificados como variables ficticias. Los botones proporcionados le permiten especificar efectos principales, efectos factoriales completos (efectos principales y todas las interacciones con las variables involucradas), polinomios, interacciones específicas y eliminar términos de la lista. Se permiten interacciones \ncon variables de estratificación.\n<br/><br/>\n<b>Variables de Estratificación:</b> Especifique una o más variables de estratificación. Estas pueden ser variables numéricas, factores, factores ordenados o variables de carácter. Los estratos dividen a los \nsujetos en grupos separados, donde cada grupo tiene una función de riesgo base distinta. Si se proporcionan múltiples variables de estratificación, se utiliza una función de riesgo base \nseparada para cada combinación de niveles de variables de estratificación.\n<br/><br/>\n<b>Pesos:</b> Variable numérica para pesos de observación. Útil en situaciones donde cada registro no debe contarse como una observación.\n<br/><br/>\n<b>Método de Tiempo Empatado:</b> Método para romper tiempos observados empatados. Efron suele ser la mejor opción cuando no hay muchos tiempos empatados.\n<br/><br/>\n<b>Diagnósticos del Modelo:</b> Si se selecciona, se evaluará la proporcionalidad de riesgos y la forma funcional de las covariables, incluidos los gráficos relevantes. \nSi hay variables de estratificación o predictores no numéricos, no se producirán gráficos de forma funcional. \nEl <b>Valor Mínimo del Eje de Residuales de Martingale del Modelo Nulo</b> puede necesitar ser cambiado para ver todos los residuales de Martingale.\n<br/><br/>\n<b>Análisis de Desviación (Tipo II):</b> Si se selecciona, se proporcionarán pruebas de variables completas (incluidas pruebas de múltiples grados de libertad para covariables de múltiples categorías). Se utilizan pruebas de Wald.\n<br/><br/>\n<b>Paquetes R requeridos:</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nHaga clic en el botón de Ayuda de R para obtener ayuda detallada sobre la función coxph. Vaya a Ayuda-> Ayuda de Función R para obtener más información sobre la función finegray, que crea el \ndataset necesario.\n"
  }
}