{
  "title": "Cox, Estratificado",
  "navigation": "Cox, Estratificado",
  "modelname": "Ingrese el nombre del modelo",
  "timevar": "Tiempo hasta el evento o censura",
  "eventvar": "Eventos (1 = evento 1, 0 = censura)",
  "modelterms": "Constructor de expresión del modelo para variables independientes",
  "stratavarslabel": "Variables de Estratificación",
  "weightvar": "Pesos (opcional)",
  "tiemethod": "Método de Tiempo Empatado",
  "diagnosticsbox": "Diagnósticos del Modelo",
  "help": {
    "title": "Cox, Estratificado",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n            Ajusta un modelo de riesgos proporcionales de Cox estratificado para datos de tiempo hasta el evento con observaciones censuradas. Este es un modelo de Cox que permite una función de riesgo base separada para cada nivel de estrato. Se proporcionan estadísticas de ajuste del modelo, estimaciones de parámetros y razones de riesgo. Las opciones disponibles incluyen el método de tiempo empatado y diagnósticos del modelo. El modelo se ajusta utilizando la función coxph en el paquete survival. \n            <br/>\n            <br/>\n            <b>Tiempo hasta el evento o censura:</b> Tiempo hasta el evento para aquellos que experimentan el evento o tiempo hasta el último seguimiento para aquellos que no experimentan el evento\n            <br/><br/>\n            <b>Eventos (1=evento, 0=censura):</b> Indicador numérico de evento; 1=evento, 0=censura\n            <br/><br/>\n            <b>Constructor de Fórmulas:</b> Construya términos para incluir en el modelo. Los factores, cadenas y variables lógicas se codificarán como variables ficticias. Los botones proporcionados le permiten especificar efectos principales, efectos factoriales completos (efectos principales y todas las interacciones con las variables involucradas), polinomios, interacciones específicas y eliminar términos de la lista. Se permiten interacciones con variables de estratificación.\n            <br/><br/>\n\t\t\t<b>Variables de Estratificación:</b> Especifique una o más variables de estratificación. Estas pueden ser variables numéricas, factores, factores ordenados o variables de carácter. Los estratos dividen a los sujetos en grupos separados, donde cada grupo tiene una función de riesgo base distinta. Si se proporcionan múltiples variables de estratificación, se utiliza una función de riesgo base separada para cada combinación de niveles de variables de estratificación.\n\t\t\t<br/><br/>\n            <b>Pesos:</b> Variable numérica para pesos de observación. Útil en situaciones donde cada registro no debe contarse como una observación.\n            <br/>\n            <br/>\n            <b>Paquetes requeridos:</b> survival, broom, survminer\n            <br/>\n            <br/>\n            Haga clic en el botón de Ayuda de R para obtener ayuda detallada sobre la función coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opciones</b>\n            <br/>\n            <br/>\n            <b>Método de Tiempo Empatado:</b>\n            <br/>\n            Método para romper los tiempos observados empatados. Efron suele ser la mejor opción cuando no hay muchos tiempos empatados. El método exacto puede ser beneficioso si hay muchos tiempos empatados, como en situaciones de tiempo discreto, pero puede tardar un poco más en ajustarse el modelo. \n            <br/>\n            <br/>\n            <b>Diagnósticos del Modelo:</b>\n            <br/>\n            Si se selecciona, se proporcionarán pruebas y gráficos de riesgos proporcionales, además de un gráfico de residuos de Martingale.\n"
  }
}