{
  "title": "Cox, covariables binarias dependientes del tiempo",
  "navigation": "Cox, covariables binarias dependientes del tiempo",
  "modelname": "Ingrese el nombre del modelo",
  "timevar": "Tiempo hasta el evento o censura",
  "eventvar": "Eventos (1 = evento 1, 0 = censura)",
  "modelterms": "Constructor de expresión del modelo para variables independientes",
  "switchtimeslabel": "Variables de tiempo de exposición para covariables dependientes del tiempo",
  "tdprefixlabel": "Prefijo para covariables dependientes del tiempo",
  "subjectidlabel": "Identificador del sujeto",
  "weightvar": "Pesos (opcional)",
  "tiemethod": "Método de Tiempo Empatado",
  "forestplotbox": "Gráfico de Bosque",
  "diagnosticsbox": "Diagnósticos del Modelo",
  "martscalebox": "Valor Mínimo del Eje de Residuales de Martingale del Modelo Nulo (-Inf a 1):",
  "devbox": "Análisis de Desviación (Tipo II)",
  "devtype": "Estadístico de Prueba",
  "startstopboxlabel": "Mostrar conjunto de datos de tiempo (inicio, parada)",
  "startstopnamelabel": "Nombre del conjunto de datos",
  "help": {
    "title": "Cox, covariables binarias dependientes del tiempo",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nAjusta un modelo de riesgos proporcionales de Cox para datos de tiempo hasta el evento con observaciones censuradas que incluye una o más covariables de \"exposición\" dependientes del tiempo. Este tipo de \ncovariable es aquella donde la ocurrencia de un \"sí\" puede suceder después del inicio del seguimiento y una vez que ocurre ese \"sí\" permanece como \"sí\" durante la duración del seguimiento. Un ejemplo \nsería el rechazo de un injerto post-trasplante (es decir, antes de que ocurra el rechazo, el paciente no ha estado \"expuesto\"; después de que ocurre el rechazo, el paciente ha estado \"expuesto\").  \nTratar tal covariable como conocida al inicio del seguimiento es una forma de mirar hacia el futuro y conduce a estimaciones sesgadas (también conocido como \"sesgo de tiempo inmortal\").\n<br/><br/>\nSe proporcionan estadísticas de ajuste del modelo, estimaciones de parámetros y razones de riesgo. Las opciones disponibles incluyen el método de tiempo empatado, gráficos de bosque, diagnósticos del modelo y la capacidad \nde ver el conjunto de datos del proceso de conteo subyacente que se crea. Se proporciona una tabla que describe el proceso de conteo como un chequeo de que estos datos se están creando \napropiadamente.\n<br/><br/>  \nResúmenes de datos del proceso de conteo:\n<br/>\n<b>temprano:</b> tiempo cuando el predictor cambia antes de que comience el tiempo de seguimiento<br/>\n<b>tarde:</b> tiempo cuando el predictor cambia después de que termina el seguimiento<br/>\n<b>dentro:</b> tiempo cuando el predictor cambia dentro del período de seguimiento<br/>\n<b>liderando:</b> tiempo cuando el predictor cambia al inicio del seguimiento<br/>\n<b>retrasando:</b> tiempo cuando el predictor cambia al final del seguimiento<br/>\n<b>límite:</b> tiempo cuando el predictor cambia ya sea al inicio o al final del seguimiento\n<br/><br/>\nPara más información sobre esta tabla, consulte el documento sobre covariables dependientes del tiempo en <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>.  \n<br/><br/>\nEl modelo se ajusta utilizando la función coxph en el paquete survival.\n<br/><br/>\n<b>Ingrese el nombre del modelo:</b> Nombre donde se almacenarán los resultados del modelo\n<br/><br/>\n<b>Tiempo hasta el evento o censura:</b> Tiempo hasta el evento de resultado para aquellos que experimentan el evento o tiempo hasta el último seguimiento para aquellos que no experimentan el evento de resultado\n<br/><br/>\n<b>Eventos (1=evento, 0=censura):</b> Indicador numérico de evento; 1=evento, 0=censura\n<br/><br/>\n<b>Constructor de Fórmulas:</b> Construir términos para incluir en el modelo. Los factores, cadenas y variables lógicas serán codificados como variables ficticias. Los botones proporcionados le permiten especificar efectos principales, efectos factoriales completos (efectos principales y todas las interacciones con las variables involucradas), polinomios, interacciones específicas y eliminar términos de la lista.\n<br/><br/>\n<b>Variables de tiempo de exposición para covariables dependientes del tiempo:</b> Variables numéricas que almacenan el tiempo cuando el sujeto fue \"expuesto\" por primera vez. Esto debe estar en la misma escala de tiempo que \nla variable de Tiempo. Los valores faltantes deben usarse para sujetos que nunca fueron expuestos. Cada variable especificada aquí creará una covariable dependiente del tiempo separada. Un \ntiempo especificado asume que un sujeto no está expuesto antes de este tiempo y está expuesto después de este tiempo (es decir, cuando el predictor cambia de \"no\" a \"sí\"). Especificar solo valores positivos significa \nque los sujetos no están expuestos durante algún tiempo después de que comienza el seguimiento. Especificar algunos tiempos positivos y negativos indica que algunos sujetos fueron expuestos después y algunos antes \ndel inicio del seguimiento, respectivamente. Si sabe que un sujeto fue expuesto antes del tiempo de inicio del seguimiento, pero no sabe exactamente cuándo, entonces puede usar cualquier tiempo negativo \ny el modelo tratará correctamente a ese sujeto como expuesto durante todo su tiempo de seguimiento. Si los sujetos están expuestos después del seguimiento, entonces se les trata correctamente como no \nestando expuestos durante todo su tiempo de seguimiento.\n<br/><br/>\n<b>Prefijo para covariables dependientes del tiempo:</b> Prefijo deseado que se utilizará para cada covariable dependiente del tiempo especificada en el campo <b>Variables de tiempo de exposición</b>. El nombre de \ncada covariable dependiente del tiempo comenzará con este prefijo.\n<br/><br/>\n<b>Identificador del sujeto:</b> La variable que almacena el identificador del sujeto. Esto es necesario para fines de creación del conjunto de datos del proceso de conteo subyacente.\n<br/><br/>\n<b>Pesos:</b> Variable numérica para pesos de observación. Útil en situaciones donde cada registro no debe contarse como una observación.\n<br/><br/>\n<b>Opciones:</b>\n<br/><br/>\n<b>Método de Tiempo Empatado:</b> Método para romper tiempos observados empatados. Efron suele ser la mejor opción cuando no hay muchos tiempos empatados. El método exacto puede ser beneficioso si \nhay muchos tiempos empatados, como en situaciones de tiempo discreto, pero puede tardar un poco más en ajustarse el modelo.\n<br/><br/>\n<b>Gráfico de Bosque:</b> creará un gráfico de bosque de razones de riesgo e intervalos de confianza\n<br/><br/>\n<b>Mostrar Conjunto de Datos (inicio, parada):</b> Mostrará el conjunto de datos del proceso de conteo subyacente utilizado en los cálculos. Esto divide el tiempo de seguimiento de cada sujeto en partes, dependiendo \nde cuándo la covariable dependiente del tiempo debe cambiar de valores.\n<br/><br/>\n<b>Diagnósticos del Modelo:</b> Si se selecciona, se proporcionarán pruebas y gráficos de riesgos proporcionales, además de evaluaciones de la forma funcional para cada covariable en el modelo.  \nLa opción de valor mínimo del eje de residuales de Martingale del modelo nulo puede necesitar ser cambiada para que todos los residuales aparezcan en el gráfico. Para obtener evaluaciones de forma funcional, debe \nespecificar solo predictores numéricos y no tener datos faltantes. Ver Variables > Valores Faltantes > Eliminar NAs.\n<br/><br/>\n<b>Análisis de Desviación (Tipo II):</b> Prueba global de cada predictor en el modelo. Se proporcionarán pruebas de múltiples grados de libertad para efectos con más de 2 niveles.  \nSe pueden obtener pruebas de Wald y de razón de verosimilitud, siendo las pruebas de razón de verosimilitud las que tienen mejores propiedades en muestras pequeñas.           \n<br/><br/>\n<b>Paquetes requeridos:</b> survival, broom, survminer, car\n"
  }
}