{
  "help": {
    "title": "Tabla de Contingencia",
    "r_help": "help(CrossTable, package=gmodels)",
    "body": "\n            <b>Descripción</b></br>\nCrea una tabla de contingencia con variables de fila, columna y capa. Cuando se especifican múltiples variables de fila y columna, generamos una tabla cruzada separada para cada par de variables de fila y columna. Además, se muestran lo siguiente<br/>\nCuentas esperadas<br/>\nPorcentajes de fila y columna<br/>\nResiduos no estandarizados, estandarizados y ajustados<br/>\nChisq con razón de probabilidades, estadísticas de McNemar y Fisher<br/>\nNOTA: Eliminamos automáticamente todas las filas donde cada cuenta es 0. Esto puede afectar cómo se ejecutan las pruebas de Chisq, McNemar y Fisher. Por ejemplo, puede esperar 3 filas y 2 columnas ya que la variable de fila tiene 3 niveles y la variable de columna 2 niveles. Sin embargo, como un nivel de fila tiene todas las cuentas en 0, obtiene una tabla de 2*2. Mientras que la simulación de Monte Carlo con la prueba de Fisher se ejecuta en una tabla de 3*2, no se aplica a una tabla de 2*2 y se ejecuta la prueba normal de Fisher. \n<br/>\n<b>Uso</b>\n<br/>\n<code> \nBSkyCrossTable(x,y,layers, weight, datasetname, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE,long_table = FALSE )\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: variable de fila\n</li>\n<li>\ny: variable de columna\n</li>\n<li>\nlayers: una o más variables para capas\n</li>\n<li>\nweights: una variable numérica que contiene los pesos de frecuencia\n</li>\n<li>\ndatasetname: Nombre del conjunto de datos del cual se eligen x,y y layers (variables)\n</li>\n<li>\nchisq:  si es TRUE genera tabla de chi-cuadrado\n</li>\n<li>\nprop.r: Se producen porcentajes de fila si esto es TRUE\n</li>\n<li>\nprop.c: Se generan porcentajes de columna si esto es TRUE\n</li>\n<li>\nresid: si es TRUE, se generan residuos no estandarizados\n</li>\n<li>\nsresid: si es TRUE, se generan residuos estandarizados\n</li>\n<li>\nexpected: Se generan cuentas esperadas si esto es TRUE\n</li>\n<li>\nasresid:  si es TRUE, se generan residuos ajustados\n</li>\n<li>\nlong_table: La opción de tabla larga se introduce para acomodar análisis realizados en un gran número de variables. Elegir el formato largo controla el ancho de la tabla de salida, facilitando la visualización de resultados sin tener que desplazarse hacia la derecha en la ventana de salida. \n</li>\n</ul>\n<b>valor</b></br>\nUna lista con los resultados\n<br/>\n<b>Ejemplo</b></br>\n<code> \nBSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>\nlayers=c('type'),datasetname='Dataset2',<br/>\nchisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>\nresid=FALSE,sresid=FALSE,expected=FALSE,<br/>\nasresid=FALSE)</br>\nBSkyFormat(BSky_Multiway_Cross_Tab)</br>\n</code> <br/>\n<b>Paquete</b></br>\ngmodels</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de este diálogo o ejecute el siguiente comando help(CrossTable, package=gmodels) creando un bloque de código R haciendo clic en + en la ventana de salida  \n    "
  }
}