{
    "title": "Tabla cruzada",
    "navigation": "Tabla cruzada",
    "label6": "Cuando se especifican varias variables de fila y columna, generamos una tabla cruzada separada para cada par de variables de fila y columna.",
    "rowlabel": "Variable de fila",
    "collabel": "Variable de columna",
    "layerlabel": "Variable(s) de capa",
    "weightlabel": "Peso (uno)",
    "label1": "Estadísticas",
    "chisqlabel": "Chi-cuadrado",
    "chisqNoContCorrection": "Sin corrección de continuidad para la prueba de Chi-cuadrado",
    "chisqContCorrection": "Aplicar corrección de continuidad para la prueba de Chi-cuadrado (Aplica a una tabla 2x2)",
    "chisqSimulatePValues": "Calcular valores p usando simulación Monte Carlo",
    "chisqNoOfReplicates": "Número de réplicas utilizadas en la prueba Monte Carlo",
    "mcnemar": "McNemar",
    "mcnemarContCorrection": "Aplicar corrección de continuidad para la prueba de McNemar (Aplica a una tabla 2x2)",
    "fisher": "Fisher",
    "fisherSimulatePValues": "Calcular valores p usando simulación Monte Carlo",
    "fisherNoOfReplicates": "Número de réplicas utilizadas en la prueba Monte Carlo",
    "fishersAlternative": "Hipótesis alternativa para la prueba exacta de Fisher",
    "label2": "Residuales",
    "unstandardized": "No estandarizado",
    "standardized": "Estandarizado",
    "adjusted": "Ajustado",
    "label3": "Porcentajes",
    "rowpercent": "Fila",
    "colpercent": "Columna",
    "label4": "Conteos",
    "expected": "Esperado",
    "label5": "Formato de salida",
    "longTbl": "Tabla estilo lista (Restringir ancho de tabla cuando hay muchos niveles)",
    "help": {
        "title": "Tabla cruzada",
        "r_help": "help(CrossTable, package=gmodels)",	
	"body":"<b>Descripción</b></br>Crea una tabla cruzada con variables de fila, columna y capa. Cuando se especifican múltiples variables de fila y columna, generamos una tabla cruzada separada para cada par de variables de fila y columna. Además, se muestran los siguientes:<br/>Conteos esperados<br/>Porcentajes de fila y columna<br/>Residuos no estandarizados, estandarizados y ajustados<br/>Chi-cuadrado con razón de probabilidades, estadísticas de McNemar y Fisher<br/>NOTA: Eliminamos automáticamente todas las filas donde cada conteo es 0. Esto puede afectar la forma en que se ejecutan las pruebas de Chi-cuadrado, McNemar y Fisher. Por ejemplo, podrías esperar 3 filas y 2 columnas, ya que la variable de fila tiene 3 niveles y la variable de columna tiene 2 niveles. Sin embargo, si un nivel de fila tiene todos los conteos en 0, obtienes una tabla 2*2. Mientras que la simulación de Monte Carlo con la prueba de Fisher se ejecuta en una tabla 3*2, no se aplica a una tabla 2*2, y se ejecuta la prueba normal de Fisher. <br/><b>Uso</b><br/><code> BSkyCrossTable(x,y,capas, peso, nombre_dataset, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE, long_table = FALSE )</code> <br/><b>Argumentos</b><br/><ul><li>x: variable de fila</li><li>y: variable de columna</li><li>capas: una o más variables para las capas</li><li>peso: una variable numérica que contiene los pesos de frecuencia</li><li>nombre_dataset: Nombre del conjunto de datos del cual se seleccionan x, y y las capas (variables)</li><li>chisq: Si es TRUE, genera la tabla de Chi-cuadrado</li><li>prop.r: Se generan porcentajes de fila si esto es TRUE</li><li>prop.c: Se generan porcentajes de columna si esto es TRUE</li><li>resid: Si es TRUE, se generan residuos no estandarizados</li><li>sresid: Si es TRUE, se generan residuos estandarizados</li><li>expected: Se generan los conteos esperados si esto es TRUE</li><li>asresid: Si es TRUE, se generan residuos ajustados</li><li>long_table: La opción de tabla larga se ha introducido para acomodar análisis realizados en un gran número de variables. Elegir el formato largo controla el ancho de la tabla de salida, lo que facilita la visualización de los resultados sin tener que desplazarse hacia la derecha en la ventana de salida.</li></ul><b>Valor</b></br>Una lista con los resultados<br/><b>Ejemplo</b></br><code> BSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>capas=c('type'),nombre_dataset='Dataset2',<br/>chisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>resid=FALSE,sresid=FALSE,expected=FALSE,<br/>asresid=FALSE)</br>BSkyFormat(BSky_Multiway_Cross_Tab)</br></code> <br/><b>Paquete</b></br>gmodels</br><b>Ayuda</b></br>Para ayuda detallada, haz clic en el icono de R en la parte superior derecha de este cuadro de diálogo o ejecuta el siguiente comando: help(CrossTable, package=gmodels) creando un bloque de código R haciendo clic en + en la ventana de salida."
	}
}