{
  "title": "Gráfico de Bosque",
  "navigation": "Gráfico de Bosque",
  "modelselectorlabel": "Seleccionar Nombre del Modelo",
  "plotvarslabel": "Variables a Graficar (ninguna especificada grafica todas las variables)",
  "varlabelslabel": "Etiquetas de Variables (especificar como varname='etiqueta' separadas por comas, p. ej. edad='Edad en años', imc='Índice de Masa Corporal'); se puede usar \\n para saltos de línea dentro de una etiqueta",
  "notelabel": "NOTA: Cambiar etiquetas requiere un nuevo ajuste del modelo, por lo que grandes datos podrían tardar tiempo",
  "label3": "NOTA: LOS MODELOS CONSTRUIDOS UTILIZANDO AJUSTE DE MODELO (ENTRENAMIENTO) NO SON SOPORTADOS",
  "estimateoptlabel": "Opciones de Estimación",
  "estimatelabellabel": "Etiqueta",
  "exponentiatelabel": "Forzar Exponenciación de Estimación de Parámetro",
  "linecolorlabel": "Color de Línea",
  "pointshapelabel": "Forma del Punto",
  "pointsizelabel": "Tamaño del Punto (0-10 mm)",
  "styleoptlabel": "Opciones de Estilo",
  "factorseplinelabel": "Nombres de Factores en Líneas Separadas",
  "plotbandslabel": "Bandas de Gráfico",
  "textsizelabel": "Tamaño del Texto (1-10 mm)",
  "estticklabelsizelabel": "Tamaño de Etiqueta de Marca de Ticks de Estimación (1-50)",
  "help": {
    "title": "Gráfico de Bosque",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nEsto crea un gráfico de coeficientes del modelo, o coeficientes exponenciados, de un modelo de regresión. Cada variable se grafica en su propia fila con totales, estimaciones de parámetros, \nintervalos de confianza del 95% y valores p. Las variables pueden ser etiquetadas para permitir una presentación más agradable. Actualmente, se admiten modelos de clase lm (modelos lineales), glm (modelos lineales generalizados, \nque incluyen logísticos y Poisson), coxph (riesgos proporcionales de Cox) y rq (regresión cuantílica).\n<br/><br/>\n<b>Seleccionar Nombre del Modelo:</b> Elija el nombre del modelo según lo especificado cuando se ajustó el modelo. Este es un campo requerido.\n<br/><br/>\n<b>Variables a Graficar:</b> Si tiene acceso a los datos que crearon el modelo, puede especificar un subconjunto de las variables en el modelo para incluir en el gráfico. Si no se especifican variables, \nse predetermina a todas las variables incluidas.\n<br/><br/>\n<b>Etiquetas de Variables:</b> Especifique etiquetas más agradables para usar en lugar de los nombres de las variables. Si una variable no se etiqueta, se graficará el nombre de la variable o la etiqueta de variable existente utilizada cuando \nse ajustó el modelo (si existe). Estas deben especificarse en un formato variablename=\"etiqueta\", separadas por comas. Tenga en cuenta que incluir \\n en una etiqueta forzará\nun salto de línea dentro de la etiqueta. Esto significa que puede especificar etiquetas de varias líneas y podría ser ventajoso para etiquetas largas, ya que las etiquetas largas dejadas en una línea dejan menos espacio para las estimaciones. Hacer \nun resumen del modelo con Evaluación del Modelo -> Resumir -> Resumir un Modelo imprimirá las variables del modelo utilizadas en caso de que no tenga acceso al conjunto de datos. NOTA: Hay un \nbug actual en el paquete forestmodel de R que no utiliza etiquetas de variables para factores en modelos de Cox - se ha notificado al desarrollador del paquete. Una alternativa hasta que el paquete se \nsolucione es volver a ajustar el modelo con variables codificadas como ficticias en lugar de factores.\n<br/><br/><br/>\n<b>Opciones de Estimación:</b>\n<br/><br/>\n<b>Etiqueta:</b> Etiqueta opcional para la columna de estimación en el gráfico. La regresión logística y los modelos de Cox se detectarán automáticamente y las estimaciones se etiquetarán como \"Razón de Odds\" y \n\"Razón de Riesgo\", respectivamente. Otros modelos usarán el valor predeterminado de \"Estimación\" si no especifica nada.\n<br/><br/>   \n<b>Forzar Exponenciación de Estimación de Parámetro:</b> Elija esto para forzar que los valores de exp(coeficiente) se muestren, es decir, 2.718 elevado a la potencia del coeficiente. Los \ncoeficientes exponenciados se utilizan comúnmente en modelos de riesgos proporcionales de Cox (para razones de riesgo), regresión logística (para razones de odds), modelos log-binomial (para riesgos relativos) y Poisson \nregresión (para razones de tasa). Por defecto, la regresión logística y los modelos de Cox se detectarán automáticamente y se usará exp(coeficiente).\n<br/><br/>\n<b>Color de Línea:</b> Color de línea para los intervalos de confianza.\n<br/><br/>\n<b>Forma del Punto:</b> La forma de los puntos para las estimaciones de parámetros en el gráfico.\n<br/><br/>\n<b>Tamaño del Punto (0-10 mm):</b>  El tamaño de los puntos, en milímetros, para las estimaciones de parámetros en el gráfico. 0 mm eliminaría los puntos. El valor predeterminado es 4 mm.\n<br/><br/><br/>\n<b>Opciones de Estilo:</b>\n<br/><br/>\n<b>Nombres de Factores en Líneas Separadas:</b> Elija esto para mostrar los nombres de las variables de factores en una línea separada de los niveles del factor.\n<br/><br/>\n<b>Bandas de Gráfico:</b> Elija esto para mostrar regiones sombreadas alternas para cada fila del gráfico.\n<br/><br/>\n<b>Tamaño del Texto (1-10 mm):</b> Tamaño del texto, en milímetros, en el gráfico. El valor predeterminado es 4 mm.\n<br/><br/>\nNota: Si desea cambiar el tamaño general del gráfico, el tamaño del gráfico se puede establecer utilizando el botón Temas en el menú de tres puntos.\n<br/><br/>\n<b>Tamaño de Etiqueta de Marca de Ticks de Estimación (1-50):</b> Tamaño de las etiquetas de marca de ticks para el eje de estimación.\n<br/><br/>\n<b>Paquetes R Requeridos:</b>  forestmodel, arsenal, survival, quantreg, insight\n"
  }
}