{
  "title": "Modelo Lineal Generalizado",
  "navigation": "MLG",
  "modelname": "Nombre del modelo",
  "dependent": "Variable dependiente",
  "offset": "Compensación",
  "weights": "Pesos",
  "formulaBuilder": "Constructor de fórmulas",
  "family": "Selecciona una familia y función de enlace",
  "theta": "Especifica un valor de theta (aplicado solo para la familia binomial negativa)",
  "expCoefficients": "Exponentiar coeficientes",
  "help": {
    "title": "Modelo Lineal Generalizado",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>Descripción</b></br>\n            glm se utiliza para ajustar modelos lineales generalizados, especificando una descripción simbólica del predictor lineal y una descripción de la distribución del error.\n            <br/>\nNOTA 1: Se proporciona un cuadro de texto para especificar el valor inicial de theta, esto se aplica solo a la familia binomial negativa. Si se omite, se utiliza un estimador de momento después de un ajuste inicial utilizando un GLM de Poisson.<br/>\nEl theta inicial que se calcula se muestra en la salida sobre la tabla resumen del GLM.<br/>\nNOTA 2: Al especificar una variable que contiene pesos, ten en cuenta que, dado que utilizamos la opción na.exclude para construir el modelo, todos los valores NA se eliminan automáticamente de las variables dependientes e independientes.<br/> \nEsto puede causar un desajuste ya que los valores NA NO se eliminan automáticamente de la variable de ponderación. <br/>\nEn esta situación verás el error de longitudes de variable diferentes (encontrado para (pesos))<br/>\nPara abordar este error, ve a Variables>Valores faltantes>Eliminar NAs y selecciona las variables dependientes, independientes y la variable de ponderación para eliminar los valores faltantes y reconstruir el modelo.<br/>\nNOTA 3: Variables de factores codificadas como variables ficticias, al usar la familia binomial negativa, ver Variables > Calcular > Código Dummie.<br/>\nNOTA 4: El intercepto se incluye por defecto, para eliminar el intercepto ingresa -1 en el constructor de fórmulas\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            glm(formula, family = gaussian, data, weights, subset,\n                na.action, start = NULL, etastart, mustart, offset,\n                control = list(...), model = TRUE, method = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            formula: un objeto de clase \"formula\" (o uno que se puede convertir a esa clase): una descripción simbólica del modelo a ajustar. Los detalles de la especificación del modelo se dan en 'Detalles'.\n            </li>\n            <li>\n            family: una descripción de la distribución del error y la función de enlace que se utilizará en el modelo. Para glm esto puede ser una cadena de caracteres que nombra una función de familia, una función de familia o el resultado de una llamada a una función de familia. Para glm.fit solo se admite la tercera opción. (Ver family para detalles de las funciones de familia.)\n            </li>\n            <li>\n            data: un marco de datos opcional, lista o entorno (o un objeto que se puede convertir mediante as.data.frame a un marco de datos) que contiene las variables en el modelo. Si no se encuentra en los datos, las variables se toman del entorno(formula), típicamente el entorno desde el cual se llama a glm.\n            </li>\n            <li>\n            weights: un vector opcional de 'pesos previos' que se utilizarán en el proceso de ajuste. Debe ser NULL o un vector numérico.\n            </li>\n            <li>\n            subset: un vector opcional que especifica un subconjunto de observaciones que se utilizarán en el proceso de ajuste.\n            </li>\n            <li>\n            na.action: una función que indica qué debe suceder cuando los datos contienen NAs. El valor predeterminado se establece mediante la configuración na.action de opciones, y es na.fail si no se establece. El valor predeterminado 'de fábrica' es na.omit. Otro valor posible es NULL, sin acción. El valor na.exclude puede ser útil.\n            </li>\n            </ul>\n            <b>Detalles</b><br/>\n            Un predictor típico tiene la forma respuesta ~ términos donde respuesta es el vector de respuesta (numérico) y términos es una serie de términos que especifica un predictor lineal para la respuesta. Para familias binomiales y quasibinomial, la respuesta también se puede especificar como un factor (cuando el primer nivel denota fallo y todos los demás éxito) o como una matriz de dos columnas con las columnas que dan los números de éxitos y fracasos. Una especificación de términos de la forma primero + segundo indica todos los términos en primero junto con todos los términos en segundo con cualquier duplicado eliminado.<br/>\n            <b>Valor</b><br/>\n            Un objeto de clase \"glm\" es una lista que contiene al menos los siguientes componentes:\n            <ul>\n            <li>\n            coefficients: un vector nombrado de coeficientes\n            </li>\n            <li>\n            residuals: los residuos de trabajo, es decir, los residuos en la iteración final del ajuste IWLS. Dado que los casos con pesos cero se omiten, sus residuos de trabajo son NA.\n            </li>\n            <li>\n            fitted.values: los valores medios ajustados, obtenidos al transformar los predictores lineales mediante la inversa de la función de enlace.\n            </li>\n            <li>\n            rank: el rango numérico del modelo lineal ajustado.\n            </li>\n            <li>\n            family: el objeto de familia utilizado.\n            </li>\n            <li>\n            linear.predictors: el ajuste lineal en la escala de enlace.\n            deviance: hasta una constante, menos el doble del logaritmo máximo de la verosimilitud. Donde sea sensato, la constante se elige de modo que un modelo saturado tenga devianza cero.\n            </li>\n            <li>\n            aic\t: Una versión del Criterio de Información de Akaike, menos el doble del logaritmo máximo de la verosimilitud más el doble del número de parámetros, calculado a través del componente aic de la familia. Para familias binomiales y de Poisson, la dispersión se fija en uno y el número de parámetros es el número de coeficientes. Para familias gaussianas, Gamma e inversa gaussiana, la dispersión se estima a partir de la devianza residual, y el número de parámetros es el número de coeficientes más uno. Para una familia gaussiana, se utiliza el MLE de la dispersión, por lo que este es un valor válido de AIC, pero para familias Gamma e inversa gaussiana no lo es. Para familias ajustadas por cuasi-verosimilitud, el valor es NA.\n            </li>\n            </ul>\n            <b>Paquete</b></br>\nglm</br>\n<b>Ayuda</b></br>\nhelp(glm, package ='stats')\n"
  }
}