{
  "title": "Estimación de Kaplan-Meier, Comparar Grupos",
  "navigation": "Estimación de Kaplan-Meier, Comparar Grupos",
  "timevar": "Tiempo hasta el evento o censura",
  "eventvar": "Evento (1 = evento, 0 = censura)",
  "groupvar": "Grupo",
  "label1": "Tipo de Gráfico",
  "survivalradio": "Supervivencia",
  "inciradio": "Fallo",
  "allesttable": "Tabla de Estimaciones Incluyendo Todos los Tiempos",
  "printspecest": "Tabla de Estimaciones para Tiempos Específicos",
  "spectimes": "Especificar tiempos como time1, time2, time3, etc. o como seq(1,5,by=1)",
  "styleoptions": "Opciones de Estilo",
  "axisoptions": "Opciones de Ejes",
  "label12": "Haga clic en el botón ? en la parte superior derecha del diálogo para detalles sobre conjuntos de datos de muestra y el formato de datos soportado.",
  "titlebox": "Título del Gráfico",
  "plottitlesizelabel": "Tamaño del Título del Gráfico (5-50)",
  "themedropdown": "Tema del Gráfico",
  "label2": "Número en Riesgo",
  "natriskchkbox": "Incluir Número en Riesgo",
  "risktableprop": "Altura de la Tabla de Riesgo (0-1)",
  "risktablepos": "Posición de la Tabla de Riesgo",
  "risktabletext": "Incluir etiquetas de estratos",
  "risktablevaluesize": "Tamaño de los Valores de la Tabla de Riesgo (1-15)",
  "risktabletitlesize": "Tamaño del Título de la Tabla de Riesgo (5-50)",
  "risktableaxislabelsize": "Tamaño de la Etiqueta del Eje de la Tabla de Riesgo (5-50)",
  "risktableticklabelsize": "Tamaño de la Etiqueta de Marca de Eje de la Tabla de Riesgo (5-50)",
  "risktableclean": "Eliminar Ejes y Líneas de Cuadrícula de la Tabla de Riesgo",
  "label2b": "Leyenda",
  "legendpos": "Posición",
  "legendtitle": "Título",
  "legendlabels": "Etiquetas de Valor (el valor predeterminado es NULL; dar en orden de estratos; por ejemplo, c('Masculino', 'Femenino')):",
  "legendfontsize": "Tamaño de las Etiquetas de la Leyenda (5-50)",
  "label3": "Opciones de Línea",
  "linesize": "Tamaño (0-5)",
  "linecolor": "Paleta de Colores",
  "label4": "Intervalo de Confianza",
  "cichkbox": "incluir IC del 95%",
  "cistyle": "Estilo",
  "citransparency": "Transparencia (0-1)",
  "label5": "Tiempos Censurados",
  "censorchkbox": "Incluir Tiempos Censurados",
  "censorsize": "Tamaño (0-10)",
  "medsurvivalline": "Indicar Supervivencia Mediana (h=horizontal, v=vertical)",
  "label5b": "Valor-P",
  "pvaluechkbox": "Incluir valor-p",
  "label5c": "Tipo",
  "logrank": "Log-Rank",
  "gehanbreslow": "Gehan-Breslow (Wilcoxon)",
  "taroneware": "Tarone-Ware",
  "petopeto": "Peto-Peto",
  "modpetopeto": "Peto-Peto Modificado",
  "flemharr": "Flemington-Harrington",
  "pvaluelocation": "Ubicación ((x,y), por ejemplo, c(tiempo, proporción)):",
  "pvaluesize": "Tamaño",
  "label6": "Eje de Supervivencia",
  "survaxislabel": "Etiqueta",
  "label7": "Escala",
  "defbutton": "proporción",
  "pctbutton": "porcentaje",
  "survaxislimits": "Límites del eje en escala de proporción (0-1) - ingrese 'c(min, max)'",
  "survtickinc": "Incrementos de Marca de Ticks (0-1)",
  "label8": "Eje de Tiempo",
  "timeaxislabel": "Etiqueta",
  "timeaxislimits": "Límites del Eje (NULL es predeterminado, ingrese 'c(min,max)' para cambiar, por ejemplo, 'c(0,20)'",
  "timetickinc": "Incrementos de Marca de Ticks (NULL es predeterminado, ingrese un número para cambiar, min=0",
  "axislabelsize": "Tamaño de la Etiqueta del Eje (5-50)",
  "ticklabelsize": "Tamaño de la Etiqueta de Marca de Eje (5-50)",
  "help": {
    "title": "Estimación de Kaplan-Meier, Comparar Grupos",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tVea el conjunto de datos de muestra en el directorio de instalación, la ubicación predeterminada es en la letra de unidad:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\survival\\mockstudy_upd.RData. La variable Followup_time debe ingresarse como el tiempo hasta el evento o censura y la variable Event debe ingresarse como el Evento (1 = evento, 0 = censura). La variable sex debe ser la variable de grupo.<br/>\n            Este conjunto de datos es una versión actualizada del conjunto de datos mockstudy en el paquete arsenal.<br/><br/>\t\t\t\n            <b>Comparación de curvas de supervivencia de Kaplan-Meier</b>\n            <br/>\n            <br/>\n            Estas se utilizan para estimar el riesgo acumulativo de no tener algún evento (o, por el contrario, tener algún evento) durante un período de tiempo después del inicio del seguimiento para ese evento (o tiempo cero). Los sujetos deben estar en riesgo para el evento comenzando en el tiempo cero.\n            <br/>\n            <br/>\n            <b>Tiempo:</b> Longitud de tiempo hasta un evento, si el evento ocurrió, o último seguimiento para ese evento, si el evento no ocurrió, para cada sujeto\n            <br/><br/>\n            <b>Evento:</b> Indicador numérico de si ocurrió o no el evento (1=evento, 0=censura) para cada sujeto\n            <br/><br/>\n            <b>Grupo:</b> Grupos que desea comparar\n            <br/><br/>\n            <b>Tipo de Gráfico:</b> Si desea graficar la probabilidad de no tener el evento (supervivencia) o tener el evento (fallo)\n            <br/><br/>\n            <b>Tabla de Estimaciones Incluyendo Todos los Tiempos:</b> Opción para incluir una tabla que tiene las probabilidades de estimación de supervivencia y evento para cada tiempo observado en el conjunto de datos\n            <br/>\n            <br/>\n\t\t\t<b>Tabla de Estimaciones para Tiempos Específicos:</b> Opción para incluir una tabla que tiene las probabilidades de estimación de supervivencia para un conjunto de tiempos seleccionados por el usuario.\n\t\t\t<br/><br/>\n\t\t\t<b>Especificar tiempos como time1, time2, time3, etc. o como seq(1,5,by=1):</b> Estos son los tiempos específicos que se incluirán en la tabla para tiempos específicos. Pueden especificarse individualmente con comas, o como una secuencia de valores espaciados uniformemente.\n\t\t\t<br/><br/>\n            Se genera una tabla con el tamaño de la muestra, el número de sujetos con el evento, el tiempo de supervivencia mediana (si está definido) y el tiempo de seguimiento mediano por grupo y en general. El tiempo de seguimiento mediano es una estimación del tiempo de seguimiento \"típico\". Se calcula utilizando el estimador de Kaplan-Meier inverso, que trata los eventos verdaderos como observaciones censuradas y las observaciones censuradas verdaderas como eventos. Así, el \"evento\" en este estimador es \"seguir a los sujetos durante tanto tiempo como el estudio pudiera\".\n            <br/>\n            Las curvas de supervivencia se comparan utilizando múltiples métodos diferentes, siendo el log-rank y Gehan-Breslow (Wilcoxon) los más comúnmente reportados.\n            Se proporciona una tabla de estimaciones de supervivencia y evento de Kaplan-Meier en cada tiempo observado en el conjunto de datos, con intervalos de confianza del 95%. \n            <br/>\n            <br/>\n            <b>Paquetes Requeridos:</b> survival, broom, survminer, dplyr, arsenal, ggthemes, RColorBrewer, ggsci\n            <br/>\n            <br/>\n            <br/>\n            <b>Opciones de Estilo</b>\n            <br/>\n            <br/>\n            <b>Título del Gráfico:</b> Título del gráfico; elimine todo el texto para no tener título\n            <br/><br/>\n\t\t\t<b>Tamaño del Título del Gráfico:</b> Tamaño del título del gráfico.\n\t\t\t<br/><br/>\t\t\t\n            <b>Tema del Gráfico:</b> Estilo general del gráfico\n            <br/><br/>\n            <b>Número en Riesgo:</b> Opcionalmente, incluya una tabla para el número de sujetos que aún están en riesgo a lo largo del tiempo en la parte inferior del gráfico. <b>Posición de la Tabla de Riesgo</b> especifica si desea que la tabla esté fuera de los ejes o dentro de los ejes. <b>Altura de la Tabla de Riesgo</b> controla la proporción del área de trazado que la tabla ocupará. La opción <b>Incluir etiquetas de estratos</b> controla si se incluyen o no las etiquetas de estratos. Si no, los estratos solo se diferenciarán por color. Las opciones de posición de la tabla y etiquetas de estratos se ignoran cuando la posición de la tabla de riesgo está dentro de los ejes.\n\t\t\tEl <b>Tamaño de los Valores de la Tabla de Riesgo</b> controla el tamaño de los números en riesgo. El <b>Tamaño del Título de la Tabla de Riesgo</b> controla el tamaño del título de la tabla de número en riesgo.\n\t\t\tEl <b>Tamaño de la Etiqueta del Eje de la Tabla de Riesgo</b> controla el tamaño de las etiquetas de los ejes. \n\t\t\tLa <b>Tamaño de la Etiqueta de Marca de Eje de la Tabla de Riesgo</b> controla el tamaño de las etiquetas de marca de ticks. Si se desea eliminar todos los ejes y líneas de cuadrícula \n\t\t\tde la tabla de número en riesgo, se puede marcar la opción <b>Eliminar Ejes y Líneas de Cuadrícula de la Tabla de Riesgo</b>. Esto solo incluirá los números en riesgo en la tabla.           \n            <br/><br/>\n            <b>Opciones de Leyenda:</b>\n            <br/>\n            La opción <b>Posición</b> controla la ubicación de la leyenda (superior, inferior, izquierda, derecha). El <b>Título</b> es el título de la leyenda. Para eliminar el título, elimine todo el texto del cuadro de texto. <b>Etiquetas de Valor</b> determina las etiquetas por las cuales los estratos se mostrarán en la leyenda. Importante: Si desea cambiar el valor predeterminado, deben especificarse en el orden de aparición en la leyenda. Cambiar las etiquetas NO cambia el color asociado con cada estrato.\n\t\t\tLa opción <b>Tamaño de las Etiquetas de la Leyenda</b> controla el tamaño de todo el texto contenido en la leyenda.\n            <br/>\n            <br/>\n            <b>Opciones de Línea:</b>\n            <br/>\n            <b>Tamaño</b> controla el grosor y <b>Paleta de Colores</b> controla los colores de las líneas trazadas. Elija una de las opciones \"gris\" para obtener una paleta en escala de grises. También se proporcionan esquemas de color que imitan revistas científicas. Se puede incluir opcionalmente un intervalo de confianza del 95% para las estimaciones en formato de <b>ribbon</b> (área sombreada) o <b>step</b> (línea). <b>Transparencia</b> controla cuán oscura es la cinta y se ignora cuando se selecciona la opción de paso. Los <b>Tiempos Censurados</b> (cuando los sujetos ya no están en riesgo para el evento) pueden indicarse en la línea con símbolos \"+\". Se puede ajustar el tamaño de los símbolos \"+\". La opción <b>Indicar Supervivencia Mediana</b> incluirá líneas horizontales o verticales en el momento en que se estima que el 50% de los sujetos han tenido el evento. El tiempo mediano es indefinido si la curva de supervivencia no cruza el 50%.\n            <br/>\n            <br/>\n            <b>Opciones de Valor-P:</b>\n            <br/>\n            Se puede incluir opcionalmente el valor-p que compara las curvas en el gráfico. El <b>Tipo</b> controla qué valor-p se desea, siendo el Log-Rank y Gehan-Breslow (Wilcoxon) los más comúnmente reportados. La <b>Ubicación</b> controla dónde se colocará el valor-p en el gráfico, en la posición (x,y)=(tiempo,proporción). El <b>Tamaño</b> determina el tamaño del valor-p trazado.\n            <br/>\n            <br/>\n            <br/>      \n            <b>Opciones de Ejes</b>\n            <br/>\n            <br/>\n            La opción <b>Etiqueta</b> especifica la etiqueta de texto para el eje. Los <b>Límites del Eje</b> especifican los valores mínimo y máximo del eje. La opción <b>Incrementos de Marca de Ticks</b> controla el espaciado de las marcas de ticks en el eje. Los incrementos en el eje de tiempo también controlan los tiempos para la tabla opcional de número en riesgo.\n            <br/>\n            La opción <b>Escala</b> del eje de supervivencia especifica si desea que las estimaciones estén en una escala de proporción (0-1) o porcentaje (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño de la Etiqueta del Eje:</b> Esto controla el tamaño de las etiquetas del eje de supervivencia y tiempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño de la Etiqueta de Marca de Eje:</b> Esto controla el tamaño de las etiquetas de marca de ticks del eje de supervivencia y tiempo.\t\t\t\n        "
  }
}