{
  "title": "Cargar un conjunto de datos desde un paquete R",
  "navigation": "Cargar conjunto de datos",
  "label1": "Si el paquete R no está disponible, ve a Herramientas> Paquete> Instalar paquete R desde CRAN para instalarlo.",
  "label2": "Si no ves un conjunto de datos en el menú desplegable, el paquete seleccionado no contiene el conjunto de datos.",
  "selectAPackage": "Selecciona un paquete R desde el cual cargar un conjunto de datos",
  "selectADataset": "Selecciona un conjunto de datos para cargar en la cuadrícula",
  "help": {
    "title": "Cargar un conjunto de datos desde un paquete R",
    "r_help": "help(data,package='utils')",
    "body": "\n<b>Descripción</b></br>\nCarga el conjunto de datos seleccionado en la cuadrícula de datos de BlueSky Statistics. Utiliza la función data que carga conjuntos de datos especificados o lista los conjuntos de datos disponibles.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \n#Carga el conjunto de datos en memoria<br/>\ndata(..., package = NULL, overwrite = TRUE)<br/>\n#Carga el conjunto de datos en la cuadrícula de datos de BlueSky Statistics<br/>\nBSkyLoadRefresh(\"nombre del conjunto de datos\")<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\n...: cadenas de caracteres literales o nombres de los conjuntos de datos a cargar\n</li>\n<li>\npackage: un vector de caracteres que da los paquetes en los que buscar conjuntos de datos, o NULL.\n</li>\n<li>\noverwrite: lógico: ¿deberían reemplazarse los objetos existentes con el mismo nombre en el entorno?\n</li>\n</ul>\n<b>Detalles</b></br>\nCarga el conjunto de datos especificado en la cuadrícula de datos</br>\n<b>Valor</b><br/>\nUn marco de datos.<br/>\n<b>Ejemplos</b><br/>\n<code> \n## Un ejemplo ridículo...\ndata(oil)\nBSkyLoadRefresh(\"oil\")\n</code> <br/>\n<b>Paquete</b></br>\nutils</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haz clic en el ícono de R en la esquina superior derecha de este diálogo o ejecuta el siguiente comando help(data, package ='utils') creando un bloque de código R haciendo clic en + en la ventana de salida           \n"
  }
}