{
  "title": "Fusionar Conjuntos de Datos",
  "navigation": "Fusionar(legado)",
  "description": "Fusionar conjuntos de datos te ayudará a unir 2 conjuntos de datos. Por defecto, este diálogo buscará nombres de variables comunes dentro de los 2 conjuntos de datos y fusionará el conjunto completo de variables comunes.",
  "out": "Ingresa el nombre del conjunto de datos fusionado",
  "in1": "Selecciona el 1er conjunto de datos",
  "in2": "Selecciona el 2do conjunto de datos",
  "label1": "Opciones de Fusión",
  "leftjoin": "Unión Izquierda (Mantener solo filas en el primer conjunto de datos)",
  "rightjoin": "Unión Derecha (Mantener solo filas en el segundo conjunto de datos)",
  "innerjoin": "Unión Interna (Mantener filas comunes a ambos conjuntos de datos)",
  "fulljoin": "Unión Completa (Mantener todas las filas en cualquiera de los conjuntos de datos)",
  "label2": "Sobrescribir la fusión que se realiza en todos los nombres de columnas comunes",
  "by": "Para sobrescribir la configuración predeterminada de la fusión que se realiza en todos los nombres de columnas comunes, ingresa un subconjunto de los nombres de columnas comunes a continuación separados por , Por ejemplo, país, región. La fusión se realizará solo en los nombres de columnas comunes ingresados. Formatea esta lista como valores separados por una coma, por ejemplo, A,B,C",
  "label3": "Si los nombres de columnas en los que se realiza la fusión son diferentes en cada conjunto de datos",
  "byDiffNames": "Ingresa los nombres de columnas coincidentes separados por una coma, por ejemplo, 'C'='D', 'B'='A'. Por favor, usa comillas simples ( ' ) aquí.",
  "label4": "Si hay nombres de columnas comunes en ambos conjuntos de datos",
  "suffix": "Por defecto, .x y .y se usarán como sufijos para las variables comunes. Si deseas cambiarlos, ingrésalos aquí separados por una coma, por ejemplo, 1,2. Ten en cuenta que cualquier . será reemplazado por un _ en el conjunto de datos de salida",
  "advOptions": "Opciones Avanzadas",
  "help": {
    "title": "Fusionar Conjuntos de Datos",
    "r_help": "ayuda(fusión, paquete=dplyr)",
    "body": "\n            <b>Descripción</b></br>\n            Fusionar conjuntos de datos te ayudará a unir 2 conjuntos de datos. Por defecto, este diálogo buscará nombres de variables comunes dentro de los 2 conjuntos de datos y fusionará el conjunto completo de variables comunes.<br/> Si deseas fusionar un conjunto específico de variables, puedes especificarlas en el menú Avanzado.<br/>\n            inner_join: devuelve todas las filas de x donde hay valores coincidentes en y, y todas las columnas de x e y. Si hay múltiples coincidencias entre x e y, se devuelven todas las combinaciones de las coincidencias.</br>\n            left_join: devuelve todas las filas de x, y todas las columnas de x e y. Las filas en x sin coincidencia en y tendrán valores NA en las nuevas columnas. Si hay múltiples coincidencias entre x e y, se devuelven todas las combinaciones de las coincidencias.</br>\n            right_join: devuelve todas las filas de y, y todas las columnas de x e y. Las filas en y sin coincidencia en x tendrán valores NA en las nuevas columnas. Si hay múltiples coincidencias entre x e y, se devuelven todas las combinaciones de las coincidencias.</br>\n            full_join: devuelve todas las filas y todas las columnas de ambos x e y. Donde no hay valores coincidentes, devuelve NA para el que falta.</br>\n            <b>Uso</b>\n            <br/>\n            <code> \n            left_join(x, y, by = c(NULL), suffix = c(\".x\", \".y\"), ...)\n            right_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            inner_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            full_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            x: conjunto de datos a unir\n            </li>\n            <li>\n            y: conjunto de datos a unir\n            </li>\n            <li>\n            by: un vector de caracteres de variables para unir. Si es NULL, el predeterminado, *_join() hará una unión natural, usando todas las variables con nombres comunes en las dos tablas. Un mensaje lista las variables para que puedas verificar que son correctas (para suprimir el mensaje, simplemente enumera explícitamente las variables que deseas unir). Para unir por diferentes variables en x e y usa un vector nombrado. Por ejemplo, by = c(\"a\" = \"b\") hará coincidir x.a con y.b.\n            </li>\n            <li>\n            suffix: Si hay variables duplicadas no unidas en x e y, estos sufijos se agregarán a la salida para desambiguarlas. Debe ser un vector de caracteres de longitud 2.\n            </li>\n            </ul>\n            <b>Valor</b><br/>\n            Un tibble.<br/>\n            <b>Paquete</b></br>\n            dplyr</br>\n            <b>Ayuda</b></br>\n            Para ayuda detallada haz clic en el ícono de R en la esquina superior derecha de este diálogo o ejecuta el siguiente comando ayuda(left_join, paquete=\"dplyr\") creando un bloque de código R haciendo clic en + en la ventana de salida\n"
  }
}