{
  "title": "Escalado Multidimensional",
  "navigation": "Escalado Multidimensional",
  "betRows": "Entre filas",
  "betVariables": "Entre variables",
  "textSize": "Tamaño del texto",
  "textPos": "Posición del texto",
  "destination": "Seleccionar variables",
  "maxDimensions": "Dimensiones máximas",
  "label1": "Matriz de distancias",
  "computationMethod": "Método de cálculo",
  "power": "Potencia de la distancia de Minkowski",
  "dispDist": "Mostrar matriz de distancias",
  "saveDims": "Guardar dimensiones en un nuevo conjunto de datos",
  "datasetName": "Opcionalmente ingrese un nombre de conjunto de datos para guardar dimensiones",
  "label2": "Opciones avanzadas",
  "scalingMethod": "Método de escalado",
  "maxIter": "Número máximo de iteraciones (*No aplicable para métrica clásica)",
  "plotResults": "Graficar resultados",
  "help": {
    "title": "Escalado Multidimensional",
    "r_help": "help(cmdscale, package=stats)",
    "body": "\n<b>Descripción</b></br>\nExisten diferentes tipos de algoritmos de MDS, incluyendo</br>\n<b>Escalado multidimensional clásico</b></br>\nPreserva la métrica de distancia original, entre puntos, tanto como sea posible. Es decir, las distancias ajustadas en el mapa de MDS y las distancias originales están en la misma métrica. El MDS clásico pertenece a la categoría de escalado multidimensional métrico.</br>\nTambién se conoce como análisis de coordenadas principales. Es adecuado para datos cuantitativos.</br></br>\n<b>Escalado multidimensional no métrico</b></br>\nTambién se conoce como MDS ordinal. Aquí, no es la métrica de un valor de distancia lo que es importante o significativo, sino su valor en relación con las distancias entre otros pares de objetos.</br>\nEl MDS ordinal construye distancias ajustadas que están en el mismo orden de rango que la distancia original. Por ejemplo, si la distancia de los objetos 1 y 5 ocupa el quinto lugar en los datos de distancia originales, entonces también deberían ocupar el quinto lugar en la configuración de MDS.</br>\nEs adecuado para datos cualitativos.</br>\nUtilizamos las siguientes funciones de R</br>\ncmdscale() [paquete stats]: Calcular escalado multidimensional clásico (métrico).</br>\nisoMDS() [paquete MASS]: Calcular el escalado multidimensional no métrico de Kruskal (una forma de MDS no métrico).</br>\nsammon() [paquete MASS]: Calcular el mapeo no lineal de Sammon (una forma de MDS no métrico).</br>\nTodas estas funciones toman un objeto de distancia como argumento principal y k es el número deseado de dimensiones en la salida escalada. Por defecto, devuelven soluciones de dos dimensiones, pero podemos cambiar eso a través del parámetro k que por defecto es 2.</br>\n<br/>\nSe pueden seleccionar opciones para mostrar la matriz de distancias, guardar las dimensiones en un nuevo conjunto de datos y graficar las dimensiones.</br>\nCuando se selecciona el método de escalado métrico clásico, mostramos los valores propios, la estadística de bondad de ajuste y el screeplot. Para otros métodos de escalado mostramos el valor de estrés.\n<b>Ayuda</b></br>\nPara ayuda detallada ejecute los siguientes comandos help(dist, package=\"stats\") o help(cmdscale, package ='stats') o help(isoMDS, package = \"MASS\") o help(sammon, package =\"MASS\") en el editor R de BlueSky Statistics.           \n<br/>\n<br/>"
  }
}