{
  "title": "Cuantiles Binomiales Negativos",
  "navigation": "Cuantiles Binomiales Negativos",
  "varvals": "Ingrese probabilidades separadas por una coma. Ejemplo: 0.3,0.2,0.5",
  "size": "Número objetivo de éxitos",
  "prob": "Probabilidades de éxito",
  "labelSig": "Nivel de significancia",
  "lowtail": "Cola inferior",
  "uptail": "Cola superior",
  "help": {
    "title": "Cuantiles Binomiales Negativos",
    "r_help": "help(qnbinom, package=stats)",
    "body": "\n\n            <b>Descripción</b>\n            <br/>\n            Densidad, función de distribución, función cuantil y generación aleatoria para la distribución binomial negativa con parámetros tamaño y prob.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code>\n                dnbinom(x, size, prob, mu, log = FALSE)\n                <br/>\n                pnbinom(q, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qnbinom(p, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rnbinom(n, size, prob, mu)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumentos</b>\n            <br/>\n            <ul>\n                <li>x : vector de cuantiles (números enteros no negativos).</li>\n                \n                \n                <li>q : vector de cuantiles.</li>\n                \n                \n                <li>p : vector de probabilidades.</li>\n                \n                \n                <li>n : número de observaciones. Si length(n) > 1, se toma la longitud como el número requerido.</li>\n                \n                \n                <li>size : objetivo para el número de ensayos exitosos, o parámetro de dispersión (el parámetro de forma de la distribución de mezcla gamma). Debe ser estrictamente positivo, no necesita ser entero.</li>\n                \n                \n                <li>prob : probabilidad de éxito en cada ensayo. 0 < prob <= 1.</li>\n                \n                \n                <li>mu : parametrización alternativa a través de la media: ver 'Detalles'.</li>\n                \n                \n                <li>log, log.p : lógico; si es TRUE, las probabilidades p se dan como log(p).</li>\n                \n                \n                <li>lower.tail : lógico; si es TRUE (por defecto), las probabilidades son P[X ≤ x], de lo contrario, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalles</b>\n            <br/>\n            La distribución binomial negativa con size = n y prob = p tiene densidad\n            <br/>\n            <code>\n                Γ(x+n)/(Γ(n) x!) p^n (1-p)^x\n                para x = 0, 1, 2, …, n > 0 y 0 < p ≤ 1.\n            </code>\n            <br/>\n            Esto representa el número de fracasos que ocurren en una secuencia de ensayos de Bernoulli antes de que se alcance un número objetivo de éxitos. La media es μ = n(1-p)/p y la varianza n(1-p)/p^2.\n            <br/>\n            Una distribución binomial negativa también puede surgir como una mezcla de distribuciones de Poisson con media distribuida como una distribución gamma (ver pgamma) con parámetro de escala (1 - prob)/prob y parámetro de forma size. (Esta definición permite valores no enteros de size.)\n            <br/>\n            Una parametrización alternativa (a menudo utilizada en ecología) es por la media mu (ver arriba), y size, el parámetro de dispersión, donde prob = size/(size+mu). La varianza es mu + mu^2/size en esta parametrización.\n            <br/>\n            Si un elemento de x no es entero, el resultado de dnbinom es cero, con una advertencia.\n            El caso size == 0 es la distribución concentrada en cero. Esta es la distribución límite para size acercándose a cero, incluso si mu en lugar de prob se mantiene constante. Sin embargo, observe que la media de la distribución límite es 0, sea cual sea el valor de mu.\n            <br/>\n            El cuantil se define como el valor más pequeño x tal que F(x) ≥ p, donde F es la función de distribución.\n            <br/>\n            <br/><b>Valor</b>\n            <br/>\n            dnbinom da la densidad, pnbinom da la función de distribución, qnbinom da la función cuantil, y rnbinom genera desviaciones aleatorias.\n            <br/>\n            Un tamaño o prob inválido resultará en un valor de retorno NaN, con una advertencia.\n            <br/>\n            La longitud del resultado está determinada por n para rnbinom, y es el máximo de las longitudes de los argumentos numéricos para las otras funciones.\n            <br/>\n            Los argumentos numéricos distintos de n se reciclan a la longitud del resultado. Solo se utilizan los primeros elementos de los argumentos lógicos.            \n      "
  }
}