{
  "title": "Razones de Momios / Riesgos Relativos, Tabla M por 2",
  "navigation": "Razones de Momios / Riesgos Relativos, Tabla M por 2",
  "outcomevarlabel": "Variable de Resultado (Factor Binario)",
  "expvarlabel": "Variable de Exposición/Predictora (Factor)",
  "statlabel": "Estadística",
  "orlabel": "Razones de Momios",
  "rrlabel": "Riesgos Relativos",
  "oresttypelabel": "Tipo de Estimación de Razón de Momios",
  "orestwaldlabel": "Wald",
  "orestfisherlabel": "Fisher",
  "orestmidplabel": "Mid-p",
  "orestsmalllabel": "Ajustado para Muestra Pequeña",
  "rresttypelabel": "Tipo de Estimación de Riesgo Relativo",
  "rrestwaldlabel": "Wald",
  "rrestsmalllabel": "Ajustado para Muestra Pequeña",
  "reversallabel": "Reversión de Categoría",
  "revnonelabel": "Sin Reversión",
  "revexplabel": "Exposición",
  "revoutlabel": "Resultado",
  "revbothlabel": "Ambos",
  "cilevellabel": "Nivel de Confianza (0-1)",
  "help": {
    "title": "Razones de Momios / Riesgos Relativos, Tabla M por 2",
    "r_help": "help(epitab, package ='epitools')",
    "body": "\nEsto se utiliza para comparar probabilidades de tener una \"enfermedad\" para un grupo en relación con otro, en una forma de razón de momios (razón de momios) o razón de probabilidad (riesgo relativo).  \nLa razón de \"enfermedad\" se define como la probabilidad de \"enfermedad\" dividida por la probabilidad de \"sin enfermedad\". Se proporciona una tabla de contingencia de frecuencias de resultados en cada grupo.  \nAdemás, se incluye una tabla de razones de momios o riesgos relativos para cada grupo en relación con el grupo de referencia con intervalos de confianza y un valor p de Chi-Cuadrado de Wald.  Por último, \nse muestra una tabla de valores p con versiones exactas de mid-p, exactas de Fisher y Chi-Cuadrado de Wald, comparando cada grupo con el grupo de referencia. \n<br/><br/>\n<b>Variable de Resultado:</b> Variable binaria de \"enfermedad\" (sí/no) de interés.  Por defecto, la categoría más alta en el orden de clasificación se define como \"enfermedad sí\".\n<br/><br/>\n<b>Variable de Exposición/Predictora:</b> Grupos a comparar.  Puede haber más de 2 grupos.\n<br/><br/>\n<b>Estadística:</b> Qué estadística calcular\n<br/><br/>\n<b>Tipo de Estimación de Razón de Momios / Riesgo Relativo:</b> Wald (máxima verosimilitud incondicional), Fisher (máxima verosimilitud condicional), Mid-p (método mediano no sesgado), o Ajustado para Muestra Pequeña\n<br/><br/>\n<b>Reversión de Categoría:</b>  Esto controla si se debe o no invertir el orden de las categorías de la variable de exposición o las categorías de la variable de resultado.  Invertir la variable de exposición \n cambiará el grupo de referencia para las razones de momios.  Invertir la variable de resultado cambiará la categoría que corresponde a \"enfermedad\".\n<br/><br/>\n<b>Nivel de Confianza:</b> nivel para los intervalos de confianza; el valor predeterminado es 0.95\n<br/><br/>\n<b>Paquetes R Requeridos:</b> epitools\n\t\t\t"
  }
}