{
  "title": "Número óptimo de árboles",
  "navigation": "Optimizar",
  "dependentvar": "Variable dependiente",
  "independentvars": "Variable(s) independiente(s)",
  "label1": "Configuraciones de simulación de árboles",
  "startval": "Valor inicial",
  "endval": "Valor final",
  "stepval": "Valor de paso",
  "mtry": "mtry",
  "help": {
    "title": "Número óptimo de árboles",
    "r_help": "help(randomForest,package='randomForest')",
    "body": "\n                <b>Descripción</b></br>\nComenzando con el valor predeterminado de mtry, busque el valor óptimo (con respecto a la estimación del error fuera de la bolsa) de ntree (número de árboles a crecer) para randomForest. La función BSkyMultiRandomForest llama a la función randomForest con los argumentos definidos a continuación\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nBSkyMultiRandomForest(x , y=NULL, startval, endval, stepval, mtry)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx : un marco de datos o una matriz de predictores, o una fórmula que describe el modelo a ajustar (para el método de impresión, un objeto randomForest).\n</li>\n<li>\ny :  Un vector de respuesta. Si es un factor, se asume clasificación; de lo contrario, se asume regresión. Si se omite, randomForest se ejecutará en modo no supervisado.\n</li>\n<li>\nstartval : valor inicial para el argumento ntree en randomForest().\n</li>\n<li>\nendval : valor final para el argumento ntree en randomForest().\n</li>\n<li>\nstepval : cuenta por la cual startval debe ser incrementado en cada iteración hasta que alcance el valor de endval.\n</li>\n<li>\nmtry : Número de variables muestreadas aleatoriamente como candidatas en cada división. Tenga en cuenta que los valores predeterminados son diferentes para clasificación (sqrt(p) donde p es el número de variables en x) y regresión (p/3)\n</li>\n</ul>\n<b>Valor</b><br/>\nImprime el número óptimo de árboles. También muestra una tabla con ntree y el correspondiente error fuera de la bolsa<br/>\n<b>Paquete</b></br>\nrandomForest​;BlueSky</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de este diálogo o ejecute el siguiente comando en el editor de sintaxis de R help(randomForest,package='randomForest')\n                "
  }
}