{
    "title": "Regresión paramétrica de supervivencia",
    "navigation": "Regresión paramétrica de supervivencia",
    "modelname": "Ingrese el nombre del modelo",
    "timevar": "Tiempo hasta el evento o censura",
    "eventvar": "Evento (1 o mayor = evento, 0 o menor = censura)",
    "destvars": "Variables independientes",
    "weightvar": "Peso (opcional)",
    "rmstChk": "Calcular el tiempo medio restringido de supervivencia (RMST)",
    "rmstSEChk": "Calcular el error estándar del RMST utilizando bootstrap (nota: esto puede tardar algún tiempo)",
    "bootIter": "Número de iteraciones para bootstrap",
    "HazardRatioChk": "Calcular las razones de riesgo",
    "labelSurvival": "Tipo de gráfico de supervivencia",
    "survivalradioCI": "Supervivencia con IC",
    "survivalradio": "Supervivencia",
    "survivalradioKMCI": "Curva de supervivencia de Kaplan-Meier (no paramétrica) con IC",
    "survivalradioKM": "Curva de supervivencia de Kaplan-Meier (no paramétrica)",
    "labelFailure": "Tipo de gráfico de falla acumulativa",
    "inciradioCI": "Falla acumulativa con IC",
    "inciradio": "Falla acumulativa",
    "inciradioKMCI": "Curva de falla acumulativa de Kaplan-Meier (no paramétrica) con IC",
    "inciradioKM": "Curva de falla acumulativa de Kaplan-Meier (no paramétrica)",
    "spectimes": "Calcular la probabilidad de supervivencia: especifique el tiempo como time1, time2, time3, etc., o en el formato seq(1,5,by=1)",
    "specprobs": "Calcular el tiempo de supervivencia hasta el evento: especifique las probabilidades (por ejemplo, 0.25, 0.50, 0.60, 0.75) o en el formato seq(0.2,0.9,by=0.1)",
    "coVarValues": "Deje en blanco para usar el promedio de las variables independientes (covariables). De lo contrario, especifique los valores separados por comas para las estimaciones de probabilidad y los gráficos deseados.",
    "labelDistribution": "Seleccione la función de distribución que mejor se ajuste a los datos",
    "selectDistFuncWeibullRad": "Weibull",
    "selectDistFuncExpRad": "Exponencial",
    "selectDistFuncGammaRad": "Gamma",
    "selectDistFuncLnormalRad": "Lognormal",
    "selectDistFuncPoissonRad": "Poisson",
    "selectDistFuncNBinomRad": "Binomial negativa",
    "selectDistFuncGeomRad": "Geométrica",
    "selectDistFuncBetaRad": "Beta",
    "selectDistFuncUnifRad": "Uniforme",
    "selectDistFuncLogisRad": "Logística",
    "selectDistFuncLogLogisRad": "Logística logarítmica",
    "selectDistFuncCauchyRad": "Cauchy",
    "selectDistFuncNormRad": "Normal",
    "confidenceInterval": "Intervalo de confianza para las estimaciones de máxima verosimilitud",
    "help": {
        "title": "Regresión paramétrica de supervivencia",
        "r_help": "help(flexsurvreg, package = 'flexsurv')",
        "body": "\n\t\t\tConsulte el conjunto de datos de ejemplo en el directorio de instalación. La ubicación por defecto es drive:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. La variable Followup_time debe ser introducida como el tiempo hasta el evento o censura, y la variable Event como 1 (evento) o 0 (censura).<br/>\n            <br/>\n            <br/>\n\t\t\tLos conjuntos de datos de ejemplo son long, manufacturing_data y bulb reliability.<br/><br/>\t\t\n            <b>Estimación de parámetros de regresión paramétrica y gráfico superpuesto con la curva de supervivencia de Kaplan-Meier (modelo de cero/intercepto)</b>\n            <br/>\n            <br/>\n            Estas se utilizan para estimar el riesgo acumulado de la probabilidad de un evento (o de la ausencia del mismo) a lo largo de un período de tiempo, desde el inicio del seguimiento hasta el evento.<br/>\n            <br/>\n            <b>Tiempo:</b> el tiempo hasta el evento (si ocurrió el evento) o hasta el último seguimiento (si el evento no ocurrió)<br/><br/>\n            <b>Evento:</b> variable numérica que indica si ocurrió un evento (1) o no (0)<br/><br/>\n            <b>Tipo de gráfico:</b> probabilidad de supervivencia (sin evento) o probabilidad de falla (con evento)<br/><br/>\n            <br/>\n            <br/>\n\t\t\t<b>Estimación de la tabla para un tiempo específico o probabilidad:</b> opcionalmente, puede incluir una tabla con las estimaciones de la probabilidad de supervivencia para un tiempo seleccionado.<br/><br/>\n\t\t\t<b>Especifique el tiempo como time1, time2, time3, etc., o como seq(1,5,by=1):</b> especifique el tiempo para la tabla de estimación. Puede ingresarlo individualmente por comas o como una secuencia de valores equidistantes.\n\t\t\t<br/><br/>\n            La tabla muestra el número de sujetos, el número de eventos, el tiempo medio de supervivencia (si está definido), el tiempo medio restringido de supervivencia y el tiempo medio de seguimiento. El tiempo medio de seguimiento se estima utilizando el estimador de Kaplan-Meier invertido, tratando las observaciones reales como censuradas y las observaciones censuradas como eventos. Por lo tanto, el "evento" en este estimador representa "el seguimiento del sujeto tanto como sea posible".\n            <br/>\n            Las estimaciones paramétricas para la distribución seleccionada y las estimaciones de eventos se muestran para cada tiempo en el conjunto de datos, con intervalos de confianza.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Opciones de estilo</b>\n            <br/>\n            <br/>\n            <b>Título del gráfico:</b> título del gráfico; deje todo el texto en blanco para no mostrar el título.<br/><br/>\n\t\t\t<b>Tamaño del título del gráfico:</b> tamaño del título del gráfico<br/><br/>\n            <b>Tema del gráfico:</b> estilo general del gráfico<br/><br/>\n            <b>Inclusión del número de riesgos:</b> opcionalmente, puede incluir una tabla que muestre el número de sujetos en riesgo por tiempo, debajo del gráfico. <b>Posición de la tabla de riesgos</b> controla si la tabla se coloca internamente o externamente en el eje. <b>Altura de la tabla de riesgos</b> controla cuánto de la zona del gráfico está ocupada por la tabla de riesgos. Esta opción se ignora si la posición de la tabla de riesgos es interna.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opciones para líneas</b>\n            <br/> \n            <br/> \n            <b>Tamaño</b> controla el grosor de la línea y <b>color</b> controla el color de la línea. Opcionalmente, puede incluir un IC estimado del 95% en forma de <b>cinta</b> (área sombreada) o <b>escalón</b> (línea). <b>Transparencia</b> controla la densidad de la cinta y se ignora si selecciona la opción de escalón. <b>Tiempo censurado</b> (cuando el sujeto ya no está expuesto al riesgo de evento) se puede mostrar con el símbolo “+” en la línea y puede ajustar el tamaño del símbolo “+”. La opción <b>Línea que muestra el tiempo medio de supervivencia</b> agrega una línea horizontal o vertical al tiempo estimado en el que se estima que el 50% de los sujetos han experimentado el evento. Si la curva de supervivencia no supera el 50%, el tiempo medio no está definido.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opciones para ejes</b>\n            <br/> \n            <br/> \n            La opción <b>Etiquetas</b> especifica las etiquetas de texto del eje. <b>Límites de los ejes</b> especifica los valores mínimos y máximos de los ejes. La opción <b>Incremento de la escala</b> controla el intervalo entre las marcas del eje. El incremento de tiempo en el eje de tiempo también controla la tabla de tiempo de los riesgos opcionales.\n            <br/> \n            La opción <b>Escala del eje</b> especifica si las estimaciones se muestran en una escala de razón (0-1) o en una escala de porcentaje (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño de las etiquetas del eje:</b> controla el tamaño de las etiquetas del eje de supervivencia y tiempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño de las etiquetas de las marcas del eje:</b> controla el tamaño de las etiquetas en los ejes de supervivencia y tiempo.\n"
    }
}
