{
  "title": "Regresión de Supervivencia Paramétrica",
  "navigation": "Regresión de Supervivencia Paramétrica",
  "modelname": "Ingrese el Nombre del Modelo",
  "timevar": "Tiempo hasta el evento o censura",
  "eventvar": "Evento (1 o más = evento, 0 o menos = censura)",
  "destvars": "Variables Independientes",
  "weightvar": "Pesos (opcional)",
  "rmstChk": "Calcular el tiempo medio de supervivencia restringido (RMST)",
  "rmstSEChk": "Calcular el error estándar para RMST usando bootstrap (nota: tomará un tiempo)",
  "bootIter": "Iteración de Bootstrap",
  "HazardRatioChk": "Calcular Razones de Riesgo",
  "labelSurvival": "Tipo de Gráfico de Supervivencia",
  "survivalradioCI": "Supervivencia con CI",
  "survivalradio": "Supervivencia",
  "survivalradioKMCI": "Supervivencia con Kaplan-Meier (no paramétrico) superpuesto con CI",
  "survivalradioKM": "Supervivencia con Kaplan-Meier (no paramétrico) superpuesto",
  "labelFailure": "Tipo de Gráfico de Fallo Acumulativo",
  "inciradioCI": "Fallo Acumulativo con CI",
  "inciradio": "Fallo Acumulativo",
  "inciradioKMCI": "Fallo Acumulativo con Kaplan-Meier (no paramétrico) superpuesto con CI",
  "inciradioKM": "Fallo Acumulativo con Kaplan-Meier (no paramétrico) superpuesto",
  "spectimes": "Calcular la Probabilidad de Supervivencia - especifique los tiempos como time1, time2, time3, etc. o como seq (1,5,by=1)",
  "specprobs": "Calcular el Tiempo de Supervivencia hasta el Evento - especifique el cuantil (probabilidad) como 0.25, 0.50, 0.60, 0.75, etc. o como seq (0.2,0.9,by=0.1)",
  "coVarValues": "Si se deja en blanco, se utilizarán los valores medios de las variables independientes (Covariables). De lo contrario, especifique valores separados por comas que se utilizarán para estimar probabilidades y graficar",
  "labelDistribution": "Seleccione una función de distribución que se ajuste mejor a los datos",
  "selectDistFuncWeibullRad": "Weibull",
  "selectDistFuncExpRad": "Exponencial",
  "selectDistFuncGammaRad": "Gamma",
  "selectDistFuncLnormalRad": "Log Normal",
  "selectDistFuncPoissonRad": "Poisson",
  "selectDistFuncNBinomRad": "Binomial Negativa",
  "selectDistFuncGeomRad": "Geométrica",
  "selectDistFuncBetaRad": "Beta",
  "selectDistFuncUnifRad": "Uniforme",
  "selectDistFuncLogisRad": "Logística",
  "selectDistFuncLogLogisRad": "Logística Logarítmica",
  "selectDistFuncCauchyRad": "Cauchy",
  "selectDistFuncNormRad": "Normal",
  "confidenceInterval": "Intervalos de confianza para estimaciones de máxima verosimilitud",
  "help": {
    "title": "Regresión de Supervivencia Paramétrica",
    "r_help": "help(flexsurvreg, paquete = 'flexsurv')",
    "body": "\n\t\t\tVea el conjunto de datos de muestra en el directorio de instalación, la ubicación predeterminada es en la letra de unidad:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. La variable Followup_time debe ingresarse como el tiempo hasta el evento o censura y la variable Event debe ingresarse como el Evento (1 = evento, 0 = censura).<br/>\n            <br/>\n            <br/>\n\t\t\tLos conjuntos de datos de ejemplo son lung, manufacturing_data y bulb reliability <br/><br/>\t\t\n            <b>Estimaciones de parámetros de Regresión de Supervivencia Paramétrica y gráficos junto con curvas de supervivencia de Kaplan-Meier (modelo nulo/intercepto solamente) superpuestas</b>\n            <br/>\n            <br/>\n            Estos se utilizan para estimar el riesgo acumulativo de no tener algún evento (o, por el contrario, tener algún evento) durante un período de tiempo después del inicio del seguimiento para ese evento (o tiempo cero). Los sujetos deben estar en riesgo para el evento comenzando en el tiempo cero.\n            <br/>\n            <br/>\n            <b>Tiempo:</b> Longitud del tiempo hasta un evento, si el evento ocurrió, o el último seguimiento para ese evento, si el evento no ocurrió, para cada sujeto\n            <br/><br/>\n            <b>Evento:</b> Indicador numérico de si ocurrió o no el evento (1=evento, 0=censura) para cada sujeto\n            <br/><br/>\n            <b>Tipo de Gráfico:</b> Graficar la probabilidad de no tener el evento (supervivencia) o tener el evento (fallo)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Tabla de Estimaciones para Tiempos Específicos o probabilidad:</b> Opción para incluir una tabla que tenga las probabilidades de estimación de supervivencia para un conjunto de tiempos seleccionados por el usuario.\n\t\t\t<br/><br/>\n\t\t\t<b>Especifique tiempos como time1, time2, time3, etc. o como seq(1,5,by=1):</b> Estos son los tiempos específicos que se incluirán en la tabla para tiempos específicos. Pueden especificarse individualmente con comas, o como una secuencia de valores espaciados uniformemente.\n\t\t\t<br/><br/>\n            Las tablas se generan con el tamaño de muestra, el número de sujetos con el evento, el tiempo medio de supervivencia (si está definido), el tiempo medio de supervivencia restringido y el tiempo medio de seguimiento. El tiempo medio de seguimiento se calcula utilizando el estimador de Kaplan-Meier inverso, que trata los eventos verdaderos como observaciones censuradas y las observaciones censuradas verdaderas como eventos. Así, el \"evento\" en este estimador es \"seguir a los sujetos durante el tiempo que el estudio pudiera\".\n            <br/>\n            Una tabla de estimaciones de Supervivencia Paramétrica y eventos para la distribución elegida se proporciona en cada tiempo observado en el conjunto de datos, con intervalos de confianza dados. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Opciones de Estilo</b>\n            <br/>\n            <br/>\n            <b>Título del Gráfico:</b> Título del gráfico; elimine todo el texto para no tener título\n            <br/><br/>\n\t\t\t<b>Tamaño del Título del Gráfico:</b> Tamaño del título del gráfico.\n\t\t\t<br/><br/>\n            <b>Tema del Gráfico:</b> Estilo general del gráfico\n            <br/><br/>\n            <b>Incluir Número en Riesgo:</b> Opcionalmente, incluir una tabla para el número de sujetos aún en riesgo a lo largo del tiempo en la parte inferior del gráfico.  <b>Posición de la Tabla de Riesgo</b> especifica si desea que la tabla esté fuera de los ejes o dentro de los ejes.  La <b>Altura de la Tabla de Riesgo</b> controla la proporción del área de graficación que la tabla ocupará. Esta opción se ignora cuando la posición de la tabla de riesgo está dentro de los ejes. \n\t\t\tEl <b>Tamaño del Valor de la Tabla de Riesgo</b> controla el tamaño de los números en riesgo. El <b>Tamaño del Título de la Tabla de Riesgo</b> controla el tamaño del título de la tabla de número en riesgo.\n\t\t\tEl <b>Tamaño de la Etiqueta del Eje de la Tabla de Riesgo</b> controla el tamaño de las etiquetas del eje.\n\t\t\tEl <b>Tamaño de la Etiqueta de Marca de Ticks de la Tabla de Riesgo</b> controla el tamaño de las etiquetas de marca de ticks para los tiempos en la tabla de número en riesgo. Si se desea eliminar todos los ejes y líneas de cuadrícula \n\t\t\tde la tabla de número en riesgo, se puede marcar la opción <b>Eliminar Ejes y Líneas de Cuadrícula de la Tabla de Riesgo</b>. Esto solo incluirá los números en riesgo en la tabla.\n            <br/>\n            <br/>\n            <b>Opciones de Línea:</b>\n            <b>Tamaño</b> controla el grosor y <b>Color</b> controla el color de la línea graficada. Se puede incluir opcionalmente un intervalo de confianza del 95% para las estimaciones en formato de <b>ribbon</b> (área sombreada) o <b>step</b> (línea). <b>Transparencia</b> controla cuán oscura es la cinta y se ignora cuando se selecciona la opción de paso. <b>Tiempos Censurados</b> (cuando los sujetos ya no están en riesgo para el evento) pueden indicarse en la línea con símbolos de \"+\". Se puede ajustar el tamaño de los símbolos de \"+\". La opción <b>Indicar Supervivencia Mediana</b> incluirá líneas horizontales o verticales en el momento en que se estima que el 50% de los sujetos han tenido el evento. El tiempo medio no está definido si la curva de supervivencia no cruza el 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opciones de Eje</b>\n            <br/> \n            <br/> \n            La opción <b>Etiqueta</b> especifica la etiqueta de texto para el eje. La <b>Limite del Eje</b> especifica los valores mínimo y máximo del eje. La opción <b>Incrementos de Marca de Ticks del Eje</b> controla el espaciado de las marcas de ticks en el eje. Los incrementos en el eje de tiempo también controlan los tiempos para la tabla opcional de número en riesgo.\n            <br/> \n            La opción <b>Escala</b> del eje de supervivencia especifica si desea que las estimaciones estén en una escala de proporción (0-1) o porcentaje (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño de la Etiqueta del Eje:</b>  Esto controla el tamaño de las etiquetas del eje de supervivencia y tiempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Tamaño de la Etiqueta de Marca de Ticks del Eje:</b>  Esto controla el tamaño de las etiquetas de marca de ticks del eje de supervivencia y tiempo."
  }
}