{
  "title": "Estadísticas de Personfit y la Prueba de Razón de Verosimilitud de Martin-Löf",
  "navigation": "Ajuste de Persona",
  "label1": "Selecciona un modelo (se admiten modelos de clase Rm, dRm y eRm)",
  "label1b": "Si no hay modelos disponibles, primero debes crear un modelo seleccionando Ajuste de Modelo -> IRT -> Modelo Rasch Simple y elegir la estimación CML",
  "modelselector1": "Selecciona un modelo",
  "chkbox": "Mostrar Estadísticas de la Prueba de Razón de Verosimilitud de Martin-Löf",
  "lbl2": "Criterios de División para la Prueba de Razón de Verosimilitud",
  "rd1": "mediana",
  "rd2": "media",
  "help": {
    "title": "Estadísticas de Personfit y la Prueba de Razón de Verosimilitud de Martin-Löf",
    "r_help": "help(personfit, package='eRm')",
    "body": "\n                <b>Descripción: estadísticas de personfit</b></br>\n                Para modelos de clase Rm, eRm o dRm (creados utilizando IRT -> Modelo Rasch Simple con estimación CML) utiliza la función personfit para mostrar estadísticas de personfit.\n\n                <br/><br/>\n                <b>Uso</b>\n                <br/>\n                <code>\n                eRm::personfit(object)\n                </code>\n                <br/><br/>\n                <b>Detalles</b>\n                <br/>  \n                object: Objeto de clase ppar, derivado de person.parameter, ejecuta help(person.parameter) desde el editor de sintaxis para obtener ayuda.\n                <br/><br/>\n                <b>Valores</b>\n                <br/>\n                p.df: grados de libertad para estadísticas de personfit\n                <br/>\n                st.res: Residuales estandarizados (de la función personfit).\n                <br/>\n                p.outfitMSQ: Estadísticas de media cuadrática de outfit (de la función personfit).\n                <br/>\n                p.infitMSQ: Estadísticas de media cuadrática de infit (de la función personfit).\n                <br/><br/>\n                <b>Ayuda</b>\n                <br/>\n                Ejecuta lo siguiente desde el editor de sintaxis de BlueSky Statistics help(personfit, package ='eRm')\n                <br/><br/>\n                <b>Paquetes</b>\n                <br/>\n                eRm\n                <br/>\n\n                <b>Descripción: Prueba de Razón de Verosimilitud de Martin-Löf</b></br>\n                Esta Prueba de Razón de Verosimilitud se basa en la división de subgrupos de ítems.\n                <br/><br/>\n                <b>Uso</b>\n                <br/>\n                <code>\n                MLoef(robj, splitcr = \"mediana\")\n                </code>\n                <br/><br/>\n                <b>Detalles</b>\n                <br/>  \n                robj: Un objeto de clase 'Rm'.\n                <br/>\n                splitcr: Criterio de división para definir los grupos de ítems. \"mediana\" y \"media\" dividen los ítems en dos grupos basados en las puntuaciones brutas de sus ítems. splitcr también puede ser un vector de longitud k (donde k denota el número de ítems) que toma dos o más valores distintos para definir grupos utilizados para la Prueba de Martin-Löf.\n                <br/><br/>\n                <b>Valores</b>\n                <br/>\n                MLoef devuelve un objeto de clase MLoef que contiene:\n                <br/><br/>\n                LR: valor LR\n                <br/>\n                df: grados de libertad\n                <br/>\n                p.value: valor p de la prueba\n                <br/>\n                fullModel: el modelo Rasch general\n                <br/>\n                subModels: una lista que contiene los submodelos\n                <br/>\n                Lf: log-verosimilitud del modelo completo\n                <br/>\n                Ls: lista de las log-verosimilitudes de los submodelos\n                <br/>\n                i.groups: una lista de los grupos de ítems\n                <br/>\n                splitcr: criterio de división enviado\n                <br/>\n                split.vector: asignación binaria de ítems a grupos\n                <br/>\n                warning: ítems que son iguales a la mediana o media para los respectivos criterios de división\n                <br/><br/>\n                <b>Paquetes</b>\n                <br/>\n                eRm                \n                <br/><br/>\n                <b>Ayuda</b>\n                <br/>\n                Ejecuta lo siguiente desde el editor de sintaxis de BlueSky Statistics  help(MLoef, package ='eRm')\n\n                "
  }
}