{
  "title": "Prueba de Proporción de Muestra Única",
  "navigation": "Muestra única",
  "tvarbox1": "Numérico o factor con solo 2 niveles/valores",
  "label1": "Hipótesis alternativa",
  "test1": "Proporción != Proporción hipotetizada",
  "test2": "Proporción > Proporción hipotetizada",
  "test3": "Proporción < Proporción hipotetizada",
  "txtbox1": "Nivel de confianza",
  "txtbox2": "Hipótesis nula (Proporción hipotetizada en el rango 0-1)",
  "chkbox1": "Con corrección de continuidad",
  "dataInCols": "Una o más variables contienen muestras",
  "summarized": "Datos resumidos",
  "noOfEvents": "Número de eventos",
  "noOfTrials": "Número de ensayos",
  "method": "Seleccionar método",
  "help": {
    "title": "Prueba de Proporción de Muestra Única",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>Descripción</b></br>\nprop.test se puede usar para probar la nulidad de que las proporciones (probabilidades de éxito) en varios grupos son las mismas, o que son iguales a ciertos valores dados.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: un vector de conteos de éxitos, una tabla unidimensional con dos entradas, o una tabla bidimensional (o matriz) con 2 columnas, que da los conteos de éxitos y fracasos, respectivamente.\n</li>\n<li>\nn: un vector de conteos de ensayos; ignorado si x es una matriz o una tabla.\n</li>\n<li>\np: un vector de probabilidades de éxito. La longitud de p debe ser la misma que el número de grupos especificados por x, y sus elementos deben ser mayores que 0 y menores que 1.\n</li>\n<li>\nalternative: una cadena de caracteres que especifica la hipótesis alternativa, debe ser uno de \"two.sided\" (predeterminado), \"greater\" o \"less\". Puedes especificar solo la letra inicial. Solo se usa para probar la nulidad de que una sola proporción es igual a un valor dado, o que dos proporciones son iguales; ignorado de otro modo.\n</li>\n<li>\nconf.level: nivel de confianza del intervalo de confianza devuelto. Debe ser un solo número entre 0 y 1. Solo se usa al probar la nulidad de que una sola proporción es igual a un valor dado, o que dos proporciones son iguales; ignorado de otro modo.\n</li>\n<li>\ncorrect: un lógico que indica si se debe aplicar la corrección de continuidad de Yates donde sea posible.\n</li>\n</ul>\n<b>Detalles</b></br>\nSolo se utilizan grupos con números finitos de éxitos y fracasos. Los conteos de éxitos y fracasos deben ser no negativos y, por lo tanto, no mayores que los números correspondientes de ensayos que deben ser positivos. Todos los conteos finitos deben ser enteros.</br>\nSi p es NULL y hay más de un grupo, la nulidad probada es que las proporciones en cada grupo son las mismas. Si hay dos grupos, las alternativas son que la probabilidad de éxito en el primer grupo es menor que, no igual a, o mayor que la probabilidad de éxito en el segundo grupo, según lo especificado por alternative. Se devuelve un intervalo de confianza para la diferencia de proporciones con un nivel de confianza según lo especificado por conf.level y recortado a [-1,1]. La corrección de continuidad se usa solo si no excede la diferencia de las proporciones de muestra en valor absoluto. De lo contrario, si hay más de 2 grupos, la alternativa es siempre \"two.sided\", el intervalo de confianza devuelto es NULL, y la corrección de continuidad nunca se usa.</br>\nSi hay solo un grupo, entonces la nulidad probada es que la probabilidad subyacente de éxito es p, o .5 si p no se da. La alternativa es que la probabilidad de éxito es menor que, no igual a, o mayor que p o 0.5, respectivamente, según lo especificado por alternative. Se devuelve un intervalo de confianza para la proporción subyacente con un nivel de confianza según lo especificado por conf.level y recortado a [0,1]. La corrección de continuidad se usa solo si no excede la diferencia entre las proporciones de muestra y nula en valor absoluto. El intervalo de confianza se calcula invirtiendo la prueba de puntuación.</br>\nFinalmente, si p se da y hay más de 2 grupos, la nulidad probada es que las probabilidades subyacentes de éxito son las que se dan por p. La alternativa es siempre \"two.sided\", el intervalo de confianza devuelto es NULL, y la corrección de continuidad nunca se usa.</br>\n<b>Valor</b><br/>\nUna lista con clase \"htest\" que contiene los siguientes componentes:</br>\nstatistic: el valor de la estadística de prueba chi-cuadrado de Pearson.</br>\nparameter: los grados de libertad de la distribución chi-cuadrado aproximada de la estadística de prueba.</br>\np.value: el valor p de la prueba.</br>\nestimate: un vector con las proporciones de muestra x/n.</br>\nconf.int: un intervalo de confianza para la verdadera proporción si hay un grupo, o para la diferencia en proporciones si hay 2 grupos y p no se da, o NULL de otro modo. En los casos donde no es NULL, el intervalo de confianza devuelto tiene un nivel de confianza asintótico según lo especificado por conf.level, y es apropiado para la hipótesis alternativa especificada.</br>\nnull.value: el valor de p si se especifica por la nulidad, o NULL de otro modo.</br>\nalternative: una cadena de caracteres que describe la alternativa.</br>\nmethod: una cadena de caracteres que indica el método utilizado, y si se aplicó la corrección de continuidad de Yates.</br>\ndata.name: una cadena de caracteres que da los nombres de los datos.</br>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nhelp(prop.test, package ='stats')\n"
  }
}