{
  "title": "Bosque Aleatorio",
  "label1": "El bosque aleatorio se puede ejecutar en modo supervisado o no supervisado. Para ejecutar en modo no supervisado, no especifique una variable dependiente.",
  "navigation": "Bosque Aleatorio",
  "modelname": "Ingrese el nombre del modelo",
  "dependentvar": "Variable dependiente",
  "independentvars": "Variable(s) independiente(s)",
  "ntree": "No. de árboles",
  "mtry": "mtry",
  "proximity": "Proximidad:",
  "newds": "Especifique el nombre del conjunto de datos para almacenar la proximidad:",
  "predictor": "Guardar valores predichos:",
  "newcolname": "Especifique el nuevo nombre de columna para los valores predichos:",
  "help": {
    "title": "Bosque Aleatorio",
    "r_help": "help(randomForest,package='randomForest')",
    "body": "\n                <b>Descripción</b></br>\nrandomForest implementa el algoritmo de bosque aleatorio de Breiman (basado en el código original de Fortran de Breiman y Cutler) para clasificación y regresión. También se puede utilizar en modo no supervisado para evaluar proximidades entre puntos de datos.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nrandomForest(x, y=NULL,  ntree=500, importance=FALSE, proximity, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx : Un marco de datos o una matriz de predictores, o una fórmula que describe el modelo a ajustar (para el método de impresión, un objeto randomForest).\n</li>\n<li>\ny: Un vector de respuesta. Si es un factor, se asume clasificación; de lo contrario, se asume regresión. Si se omite, randomForest se ejecutará en modo no supervisado.\n</li>\n<li>\nntree : Número de árboles a crecer. Esto no debe establecerse en un número demasiado pequeño, para asegurar que cada fila de entrada se prediga al menos unas pocas veces.\n</li>\n<li>\nimportance : ¿Se debe evaluar la importancia de los predictores? \n</li>\n<li>\nproximity : ¿Se debe calcular la medida de proximidad entre las filas?\n</li>\n<li>\n... : parámetros opcionales que se pasarán a la función de bajo nivel randomForest.default.\n</li>\n</ul>\n<b>Valor</b><br/>\nUn objeto de clase randomForest, que es una lista con los siguientes componentes:<br/>\ncall: la llamada original a randomForest<br/>\ntype: uno de regresión, clasificación o no supervisado.<br/>\npredicted: los valores predichos de los datos de entrada basados en muestras fuera de la bolsa.<br/>\nimportance:\ta matriz con nclass + 2 (para clasificación) o dos (para regresión) columnas. Para clasificación, las primeras nclass columnas son las medidas específicas de clase calculadas como disminución media en precisión. La columna nclass + 1 es la disminución media en precisión sobre todas las clases. La última columna es la disminución media en el índice de Gini. Para regresión, la primera columna es la disminución media en precisión y la segunda la disminución media en MSE. Si importance=FALSE, la última medida aún se devuelve como un vector.<br/>\nimportanceSD: Los “errores estándar” de la medida de importancia basada en permutación. Para clasificación, una matriz p por nclass + 1 correspondiente a las primeras nclass + 1 columnas de la matriz de importancia. Para regresión, un vector de longitud p.<br/>\nlocalImp: una matriz p por n que contiene las medidas de importancia caso por caso, el elemento [i,j] de la cual es la importancia de la i-ésima variable en el j-ésimo caso. NULL si localImp=FALSE.<br/>\nntree: número de árboles crecidos.<br/>\nmtry: número de predictores muestreados para dividir en cada nodo.<br/>\nforest: (una lista que contiene todo el bosque; NULL si randomForest se ejecuta en modo no supervisado o si keep.forest=FALSE.<br/>\nerr.rate: (solo clasificación) vector de tasas de error de la predicción en los datos de entrada, el i-ésimo elemento siendo la tasa de error (OOB) para todos los árboles hasta el i-ésimo.<br/>\nconfusion: (solo clasificación) la matriz de confusión de la predicción (basada en datos OOB).<br/>\nvotes: (solo clasificación) una matriz con una fila para cada punto de datos de entrada y una columna para cada clase, dando la fracción o número de “votos” (OOB) del bosque aleatorio.<br/>\noob.times: número de veces que los casos están “fuera de la bolsa” (y por lo tanto utilizados en el cálculo de la estimación de error OOB)<br/>\nproximity: si proximity=TRUE cuando se llama a randomForest, una matriz de medidas de proximidad entre los datos de entrada (basada en la frecuencia con que pares de puntos de datos están en los mismos nodos terminales).<br/>\nmse\t: (solo regresión) vector de errores cuadráticos medios: suma de residuos al cuadrado dividido por n.<br/>\nrsq\t: (solo regresión) “pseudo R-cuadrado”: 1 - mse / Var(y).<br/>\ntest: si se proporciona un conjunto de prueba (a través de los argumentos xtest o adicionalmente ytest), este componente es una lista que contiene los correspondientes predichos, err.rate, confusión, votos (para clasificación) o predichos, mse y rsq (para regresión) para el conjunto de prueba. Si proximity=TRUE, también hay un componente, proximidad, que contiene la proximidad entre el conjunto de prueba así como la proximidad entre los datos de prueba y entrenamiento.<br/>\n<b>Paquete</b></br>\nrandomForest​;BlueSky</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la parte superior derecha de este diálogo o ejecute el siguiente comando en el editor de sintaxis de R</br>\nhelp(randomForest,package='randomForest')\n                "
  }
}