{
  "title": "Análisis de Fiabilidad (Omega de McDonald)",
  "navigation": "Omega de McDonald",
  "tvarbox1": "Todos los Ítems",
  "help": {
    "title": "Omega de McDonald",
    "r_help": "help(omega, package=psych)",
    "body": "\n            <b>Descripción</b></br>\nCalcular las estimaciones de omega de McDonald de la saturación de factores generales y totales\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nomega(m,nfactors=3,fm=\"minres\",n.iter=1,p=.05,poly=FALSE,key=NULL,\n    flip=TRUE,digits=2, title=\"Omega\",sl=TRUE,labels=NULL,\nplot=TRUE,n.obs=NA,rotate=\"oblimin\",Phi=NULL,option=\"equal\",covar=FALSE, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nm​: Una matriz de correlación, o un data.frame/matriz de datos, o (si Phi) está especificado, una matriz de patrones de factores oblicuos\n</li>\n<li>\nnfactors: El número de factores agrupados\n</li>\n<li>\nfm​: método de factor (el predeterminado es minres) fm=\"pa\" para ejes principales, fm=\"minres\" para una solución de residuales mínimos (OLS), fm=\"pc\" para componentes principales (ver nota), o fm=\"ml\" para máxima verosimilitud.\n</li>\n<li>\nn.iter: Cuántas replicaciones hacer en omega para estimaciones bootstrap​\n</li>\n<li>\np: probabilidad de límites de conferencia de dos colas\n</li>\n<li>\ndigits​: si se especifica, redondear la salida a dígitos​\n</li>\n<li>\npoly: ¿debería encontrarse la matriz de correlación utilizando correlaciones policóricas/tetráchoricas o correlaciones de Pearson normales?\n</li>\n<li>\nkey​: un vector de +/- 1s para especificar la dirección de la puntuación de los ítems. El predeterminado es asumir que todos los ítems están positivamente puntuados, pero si algunos ítems tienen puntuaciones invertidas, entonces se debe especificar key.​\n</li>\n</ul>\n<b>Valor</b><br/>\nomega jerárquica: El coeficiente ω_h<br/>\nomega.lim: El límite de ω_h a medida que la prueba se vuelve infinitamente grande<br/>\nomega total: El coeficiente omega_t<br/>\nalpha: α de Cronbach<br/>\nschmid: La matriz de factores transformada de Schmid Leiman y matrices asociadas<br/>\nschmid$sl: Las cargas del factor g así como los factores residualizados<br/>\nschmid$orthog: Solución rotada Varimax de los factores originales<br/>\nschmid$oblique: Los factores transformados oblimin o promax<br/>\nschmid$phi: la matriz de correlación de los factores oblicuos<br/>\nschmid$gloading: Las cargas en el factor de orden superior, g, de los factores oblimin<br/>\nkey: Un vector de -1 o 1 que muestra en qué dirección se puntuaron los ítems.<br/>\nmodel: una lista de dos elementos, uno adecuado para dar a la función sem para modelos de ecuaciones estructurales, el otro, para dar al paquete lavaan.<br/>\nsem: La salida de un análisis sem<br/>\nomega.group: Las estadísticas resumidas para el omega total, omega jerárquica (general) y omega dentro de cada grupo.<br/>\nscores: Se encuentran estimaciones de puntuaciones de factores para la solución de Schmid-Leiman. Para obtener puntuaciones para el modelo jerárquico, consulte la nota en la ayuda detallada de R.<br/>\nvarios estadísticos de ajuste, ver salida<br/>\n<b>Paquete</b></br>\npsych​</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de este diálogo o ejecute el siguiente comando help(omega, package=psych) creando un bloque de código R haciendo clic en + en la ventana de salida\n\t\t\t"
  }
}