{
  "title": "Tamaño de Muestra, Prueba de Dos Medias",
  "navigation": "Dos Medias",
  "howtouse": "Para calcular el tamaño de la muestra: especifique ambas medias de grupo y la potencia\nPara calcular la potencia: especifique ambas medias de grupo y el tamaño de la muestra\nPara calcular la diferencia media detectable: especifique el tamaño de la muestra y la potencia",
  "n": "Tamaño de Muestra",
  "power": "Potencia (0-1)",
  "meangrp1": "Media del Grupo de Tratamiento",
  "meangrp2": "Media del Grupo de Control",
  "ratio": "Relación de Tamaño de Muestra de Tratamiento vs Control",
  "sd": "Desviación Estándar",
  "siglevel": "Nivel de Significancia (0-1)",
  "alternativeopt": "Hipótesis Alternativa",
  "twosided": "Dos Lados",
  "onesided": "Un Lado",
  "help": {
    "title": "Tamaño de Muestra, Prueba de Dos Medias",
    "r_help": "help(epi.sscompc, package ='epiR')",
    "body": "\nEsta es una evaluación del tamaño de muestra para una prueba t de dos muestras de medias. Calcula el tamaño de muestra, la potencia o la diferencia de medias (delta) cuando el usuario \nespecifica las otras dos.\n<br/><br/>\n<b>Tamaño de Muestra:</b> Especifique el número de sujetos en el estudio\n<br/><br/>\n<b>Potencia:</b> Especifique la potencia deseada del estudio, es decir, la probabilidad de que la prueba rechace la hipótesis nula si la hipótesis alternativa es verdadera.\n<br/><br/>\n<b>Media del Grupo de Tratamiento:</b> Especifique la media para el grupo de tratamiento\n<br/><br/>\n<b>Media del Grupo de Control:</b> Especifique la media para el grupo de control\n<br/><br/>\n<b>Relación de Tamaño de Muestra de Tratamiento vs Control:</b> Especifique la relación deseada de los tamaños de muestra (N de tratamiento dividido por N de control). Una relación de 1 significa tamaños de muestra iguales.\n<br/><br/>\n<b>Desviación Estándar:</b> Estimación de la desviación estándar agrupada de los grupos\n<br/><br/>\n<b>Nivel de Significancia:</b> Especifique el nivel de significancia deseado (es decir, error tipo I) de la prueba\n<br/><br/>\n<b>Hipótesis Alternativa:</b> Especifique si la prueba es de dos lados o de un lado\n<br/><br/>\n<b>Paquetes R Requeridos:</b> epiR\n\t\t\t"
  }
}