{
    "title": "Probabilidades de supervivencia paramétricas predichas",
    "label100": "Este cuadro de diálogo genera la probabilidad de supervivencia predicha en uno o más momentos específicos.\nSe deben cumplir los siguientes requisitos:\n1. Debe haber construido un modelo de regresión paramétrica flexsurvreg sobre un conjunto de datos donde un valor de 1 o mayor = evento, y un valor de 0 o menor = censura.\n2. El conjunto de datos para el que desea generar predicciones debe contener todas las variables independientes utilizadas para crear el modelo original.\n3. La escala de tiempo utilizada para el tiempo debe coincidir con la escala de tiempo utilizada para crear el modelo original.\n4. Si desea predicciones para una sola observación, debe crear un nuevo conjunto de datos con esa observación.",
    "navigation": "Scoring de supervivencia paramétrica",
    "filterModels": "Filtrar modelos por clase",
    "modelSelection": "Seleccione un modelo para puntuar un conjunto de datos",
    "label1": "Pruebas de diagnóstico",
    "followUpTime": "Especifique uno o más momentos, por ejemplo, 200, 1200, 1250. Se generarán probabilidades de supervivencia y de fallo predichas para cada momento.",
    "levelOfInterest": "Cuando la variable a predecir tiene 2 niveles, especifique el nivel de interés. La matriz de confusión y las estadísticas relacionadas se muestran con el nivel de interés especificado como referencia.",
    "label12": "Resultados de las pruebas: Tan pronto como se seleccione un modelo, realizaremos pruebas para ver si las variables dependientes especificadas en el modelo están disponibles en el conjunto de datos que se va a puntuar. Los resultados se mostrarán aquí.",
    "label2": "Guardar probabilidades de supervivencia y de fallo.",
    "label3": "Las probabilidades predichas se almacenan como nuevas variables (con prefijo especificado, si se indica)",
    "label4": "**Para variables dependientes con 2 niveles, el 2do nivel se considera como el nivel positivo. Consulte Datos > Niveles de factor > Reordenar niveles manualmente para cambiar el orden de los niveles de factor y reconstruir el modelo.",
    "conflevel": "Guardar intervalos de confianza para valores predichos individuales **(Válido solo para modelos lineales (clase lm))",
    "roctable": "Mostrar tabla ROC (**Solo para variables dependientes binarias)",
    "colname": "Especifique el prefijo del nombre de la columna",
    "label5": "**Marcar la casilla de arriba supondrá una penalización en el rendimiento para conjuntos de datos grandes.",
    "level": "Especifique el nivel de confianza",
    "confusioncheck": "Generar matriz de confusión",
    "help": {
        "title": "Puntuar un conjunto de datos utilizando un modelo flexsurvreg (paramétrico de supervivencia)",
        "r_help": "help(flexsurvreg, package = 'flexsurv')",
        "body": "\n    CUANDO SE ESPECIFICAN MÚLTIPLES PERÍODOS DE TIEMPO, UNA MATRIZ DE CONFUSIÓN Y UNA CURVA ROC SE GENERAN SOLO PARA EL PRIMER PERÍODO DE TIEMPO\n    <b>Descripción</b></br>\n    El puntaje del modelo realiza las siguientes acciones:</br>\n    1. Puntúa el conjunto de datos actual utilizando el modelo preconstruido seleccionado. Guarda las predicciones con el intervalo de confianza especificado en el conjunto de datos actual, utilizando el prefijo especificado.</br>\n    2. Opcionalmente, crea una matriz de confusión y una curva ROC.</br>\n    3. En el caso de que puntúe un conjunto de datos de entrenamiento que contenga la variable dependiente/variable a predecir y la variable dependiente tenga 2 niveles, tiene la opción de seleccionar el nivel de referencia/nivel de interés.<br/>\n    4. La matriz de confusión y las estadísticas relacionadas se crean utilizando el nivel de interés especificado.<br/>\n    Consulte los detalles sobre la función predict y la matriz de confusión a continuación.\n    <br/>\n    <br/>\n    <b>Descripción</b></br>\n    predict es una función genérica para realizar predicciones utilizando el modelo seleccionado.\n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    modelname: un objeto de modelo para el cual se desea hacer la predicción.\n    </li>\n    <li>\n    prefix: cadena de texto que se utilizará para crear nuevas variables que contengan las predicciones.\n    </li>\n    <li>\n    datasetname: es el conjunto de datos actual para puntuar y guardar las predicciones.\n    </li>\n    </ul>\n    <b>Detalles</b></br>\n    Guarda las predicciones con el intervalo de confianza especificado en el conjunto de datos actual, utilizando el prefijo especificado.</br>\n    <b>Paquete</b></br>\n    stats</br>\n    <b>Ayuda</b></br>\n    Para obtener ayuda detallada, haga clic en el icono de R en la parte superior derecha de este cuadro de diálogo o ejecute el siguiente comando: help(predict, package ='stats') en la ventana del editor R.\n    </br>\n    </br>\n    <b>Descripción</b></br>\n    Crea una matriz de confusión al cruzar las clases observadas y predichas con las estadísticas asociadas.\n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    modelname: un objeto de modelo para el cual se desea la matriz de confusión.\n    </li>\n    <li>\n    showCofusionMatrix: lógico, si es TRUE, la matriz de confusión se genera (si aplica); si es FALSE, la matriz de confusión no se genera.\n    </li>\n    <li>\n    predictions: un objeto devuelto como resultado de la llamada a predict().\n    </li>\n    <li>\n    datasetname: es el nombre del conjunto de datos actual que queremos usar para hacer predicciones.\n    </li>\n    </ul>\n    <b>Detalles</b></br>\n    Muestra la matriz de confusión utilizando la función confusionMatrix del paquete caret.</br>\n    <b>Paquete</b></br>\n    caret</br>\n    <b>Ayuda</b></br>\n    Para obtener ayuda detallada, haga clic en el icono de R en la parte superior derecha de este cuadro de diálogo o ejecute el siguiente comando: help(confusionMatrix, package ='caret') en la ventana del editor R."
    }
}
