{
  "title": "SEM",
  "residualCovHeatmap": "Mapa de calor de la desviación entre las matrices de covarianza observadas y las implícitas del modelo",
  "observedCorr": "Correlaciones observadas",
  "modelImpliedCorr": "Correlaciones implícitas del modelo",
  "residualCorr": "Desviación entre las correlaciones observadas y ajustadas",
  "residualCorrHeatmap": "Mapa de calor de la desviación entre las matrices de correlaciones observadas y las implícitas del modelo",
  "intercepts1": "Los interceptos de las variables observadas",
  "intercepts": "Mostrar interceptos",
  "means": "Los interceptos/medias de las variables latentes",
  "residuals1": "Las varianzas residuales de las variables observadas",
  "residual_covariances": "Las covarianzas residuales de las variables observadas",
  "lv_variances": "Las varianzas (residuales) de las variables latentes",
  "lv_covariances": "Las covarianzas (residuales) de las variables latentes",
  "regressions": "Todos los coeficientes de regresión en el modelo",
  "loadings": "Cargas de las variables observadas en sus respectivas variables latentes",
  "secOrdFacOptvar" : "Factores de segundo orden",
  "EqConstraintsOptvar" : "Restricciones de igualdad",  
  "mediationOptvar" : "Mediación",  
  "multiGrpOptions": "Opciones de múltiples grupos",
  "multiGrpSrc": "Variables fuente",
  "multiGrpDependent": "Variables de agrupamiento",
  "modelname": "Ingrese un nombre para el modelo",
  "mediationSrcCtrl": "Relaciones fuente",
  "mediationDestCtrl": "Parámetros de mediación",
  "navigation": "SEM",
  "modelTermsDst": "Relación",
  "modelTerms": "Predictor",
  "modelTerms1": "Resultado",
  "sem": "Variables latentes",
  "sem_model_terms": "Parámetros estructurales",
  "semSuppCtrl": "Factores de primer orden",
  "sem2": "Factores de segundo orden",
  "label1": "Seleccione un elemento de las listas de predictor y resultado y haga clic en el botón con una flecha para mover los elementos seleccionados a la lista de relaciones",
  "label2": "Seleccione un elemento de las listas de predictor y resultado y haga clic en el botón con una flecha para mover los elementos seleccionados a la lista de relaciones",
  "label3": "Información",
  "label4": "Salidas adicionales",
  "label5": "Covarianzas y correlaciones (ver ayuda)",
  "label6": "R-cuadrado",
  "label7": "Guardar predicciones",
  "label9": "Restricciones",
  "coVarTerms": "1ra variable/factor",
  "coVarTerms1": "2da variable/factor",
  "coVarDst": "Covarianzas seleccionadas",
  "optionsCoVarTerms": "Covarianzas",
  "parameterizeFormula": "Mostrar etiquetas de parámetros",
  "modelOptions": "Opciones del modelo",
  "method": "Seleccione un método y enfoque (si corresponde)",
  "approach": "Enfoque de máxima verosimilitud",
  "missing": "Valores faltantes",
  "addFitMeasures": "Medidas de ajuste adicionales",
  "mardiaSkew": "Asimetría de Mardia (solo casos completos)",
  "mardiaKurt": "Curtosis de Mardia (solo casos completos)",
  "observed": "Covarianzas observadas",
  "modelImplied": "Covarianzas implícitas del modelo",
  "residual": "Desviación entre covarianzas observadas y ajustadas",
  "r2squareNone": "Ninguno",
  "r2squareEndo": "Endógeno",
  "factorScores": "Puntuaciones de factores (variables guardadas con el prefijo FS)",
  "indicators": "Indicadores (variables guardadas con el prefijo I)",
  "dependentVars": "Variables dependientes (variables guardadas con el prefijo DV)",
  "label8": "Índices de modificación",
  "modIndices": "Índices de modificación",
  "highLowIndices": "Ocultar índices bajos",
  "threshold": "Umbral",
  "residuals": "Mostrar residuales",
  "includeThresholds": "Mostrar umbrales",
  "edgeLabels": "Seleccione opciones para etiquetas de bordes",
  "layout": "Opciones para cómo deben colocarse los nodos",
  "rotate": "Posición de las variables exógenas cuando se utiliza el diseño de árbol o árbol2",
  "abbNodeLabels": "Número de caracteres para abreviar etiquetas de nodos",
  "abbEdgeLabels": "Número de caracteres para abreviar etiquetas de bordes",
  "label101": "Rutas",
  "label102": "Diseño",
  "label103": "Nodos",
  "semPlotOptions": "Opciones de gráfico",
  "parameterOptions": "Opciones de parámetros",
  "manifestShapes": "Formas manifiestas",
  "latentShapes": "Formas latentes",
  "outputOptions": "Opciones de salida",
  "label104": "Soluciones estandarizadas",
  "stdall": "Las estimaciones estandarizadas se basan en las varianzas de las variables observadas y latentes (continuas)",
  "stdlv": "Las estimaciones estandarizadas se basan en las varianzas de las variables latentes (continuas) solamente",
  "stdnox": "Las estimaciones estandarizadas se basan en las varianzas de las variables observadas y latentes (continuas), pero no en las varianzas de covariables exógenas",
  "label105": "Errores estándar",
  "label106": "Configuraciones de bootstrap",
  "automatic": "Automático",
  "standard": "Estándar",
  "robust": "Robusto",
  "pseudoML": "Pseudo ML",
  "bootstrap": "Bootstrap",
  "percentiles": "Percentiles",
  "normal": "Normal",
  "adjustedBiasCorrected": "Corregido por sesgo ajustado",
  "basic": "básico",
  "bootstratRep": "Repeticiones de bootstrap",
  "autoComputeCovar": "Calcular covarianzas automáticamente",
  "equalityConstraints1": "Relaciones",
  "sem3": "Restricciones de igualdad",
  "help": {
    "title": "SEM",
    "r_help": "ayuda(sem, paquete=lavaan)",
    "body": "\n<b>Descripción</b></br>\nEl Modelado de Ecuaciones Estructurales (SEM) utiliza el paquete lavaan (0.6.16) para la estimación y trabaja con la formulación tradicional de SEM de LISREL (en lugar de las formulaciones de Bentler-Weeks, RAMpath o LISCOMP). La estimación predeterminada es de máxima verosimilitud y utiliza NLMINB (quasi-Newton) utilizando el enfoque de verosimilitud normal (en lugar del método de verosimilitud de Wishart). Los errores estándar se basan en matrices de información esperadas (en lugar de observadas), pero se pueden examinar las observadas, esperadas y las desviaciones utilizando mapas de calor. Se proporciona un cribado de normalidad (es decir, asimetría y curtosis de Mardia). El usuario puede especificar modelos con y sin variables latentes continuas (es decir, modelado de medición) tanto en órdenes inferiores como superiores, así como modelos estructurales (es decir, modelado de caminos). Son posibles restricciones de igualdad, mediación y análisis multigrupo. Se admiten una variedad de métodos de estimación (por ejemplo, variedades de máxima verosimilitud, mínimos cuadrados y James-Stein). Numerosas estadísticas de ajuste están disponibles a pedido (por ejemplo, GFI, aGFI, ECVI, etc.), y un pequeño subconjunto (es decir, CFI, TLI, SRMR, RMSEA, AIC, BC) se proporciona por defecto. También se pueden obtener intervalos de confianza utilizando varias funciones de bootstrap. Se producen diagramas de modelos utilizando semPlot (1.1.6).  \n</br>\n</br>\nCuando haga clic en Covarianzas en el diálogo, verá que la casilla de verificación, calcular covarianzas automáticamente está marcada. Puede eliminar una covarianza calculada automáticamente seleccionando la covarianza y haciendo clic en el ícono de papelera. Cuando elimina una covarianza, la suprimimos en el código generado. Si desea deshacer la supresión, debe agregarla manualmente nuevamente o eliminar y recrear la variable latente o el factor de orden superior que forma parte de la covarianza que desea deshacer la supresión.\n</br>\n</br>\nCuando se selecciona una variable de agrupamiento (haga clic en Opciones de múltiples grupos en el diálogo), debe seleccionar la casilla de verificación \"Los interceptos de las variables observadas\" y la casilla de verificación \"Los interceptos/medias de las variables latentes\"\nSolo marcar la 1ra casilla le brinda más flexibilidad.\n</br>\nLa descripción de las funciones de ajuste se encuentra a continuación</br>\n\"ML\" máxima verosimilitud</br>\n\"GLS\": mínimos cuadrados generalizados. Solo para datos completos.</br>\n\"WLS\": mínimos cuadrados ponderados (a veces llamado estimación ADF). Solo para datos completos.</br>\n\"DWLS\": mínimos cuadrados ponderados diagonalmente</br>\n\"ULS\": mínimos cuadrados no ponderados</br>\n\"DLS\": mínimos cuadrados ponderados distribucionalmente</br>\n\"PML\": máxima verosimilitud por pares</br>\nMuchos estimadores tienen variantes robustas, lo que significa que proporcionan errores estándar robustos y una estadística de prueba escalada. Por ejemplo, para el estimador de máxima verosimilitud, lavaan proporciona las siguientes variantes robustas:</br>\n\"MLM\": estimación de máxima verosimilitud con errores estándar robustos y una estadística de prueba escalada de Satorra-Bentler. Solo para datos completos.</br>\n\"MLMVS\": estimación de máxima verosimilitud con errores estándar robustos y una estadística de prueba ajustada por media y varianza (también conocida como el enfoque de Satterthwaite). Solo para datos completos.</br>\n\"MLMV\": estimación de máxima verosimilitud con errores estándar robustos y una estadística de prueba ajustada por media y varianza (utilizando un enfoque de desplazamiento de escala). Solo para datos completos.</br>\n\"MLF\": para la estimación de máxima verosimilitud con errores estándar basados en las derivadas de primer orden, y una estadística de prueba convencional. Para datos completos e incompletos.</br>\n\"MLR\": estimación de máxima verosimilitud con errores estándar robustos (Huber-White) y una estadística de prueba escalada que es (asintóticamente) igual a la estadística de prueba de Yuan-Bentler. Para datos completos e incompletos.</br>\n</br>\nTBD\nManejar la documentación de la etiqueta ver ayuda\nNecesitamos documentar la situación en torno a los grados de libertad, básicamente cuando se selecciona una variable de agrupamiento, debe seleccionar\nthe checkbox \"Los interceptos de las variables observadas\" y the checkbox \"Los interceptos/medias de las variables latentes\"\nSolo marcar la 1ra casilla le brinda más flexibilidad.\n<b>Paquete</b></br>\nlavaan;semPlot;semTools</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la parte superior derecha de este diálogo o ejecute el siguiente comando en el editor de sintaxis de R</br>\nayuda(sem, paquete='lavaan')\n\n\n"
  }
}