{
  "title": "Gráfico de líneas con dos ejes Y",
  "navigation": "Dos ejes Y",
  "x": "Eje X",
  "y": "Eje Y1, especificar una variable numérica",
  "y2": "Eje Y2, especificar una variable numérica",
  "y1_sf": "Factor de escala Y1",
  "y2_sf": "Factor de escala Y2",
  "help": {
    "title": "Gráfico de líneas",
    "r_help": "help(geom_line, package=ggplot2)",
    "body": "\n            <b>Descripción</b></br>\n            Crea un gráfico de líneas (conectado por orden) o un gráfico de escalera o ordena el gráfico de líneas por la ocurrencia de los puntos en el conjunto de datos. Haz clic en la pestaña correspondiente al tipo de gráfico de líneas que deseas.</br>\n            Gráfico de líneas (conectado por orden): Un gráfico de líneas traza una línea a través de puntos definidos por las coordenadas x e y y los conecta en el orden de las variables en el eje x. Cuando un color se establece en una variable de factor, los puntos se agrupan por color y se genera una línea separada para cada grupo de color. Los facetas se pueden crear opcionalmente especificando una variable de factor. También puedes especificar temas opcionalmente, y especificar un título y etiquetas para los ejes x e y​</br>\n            Gráfico de escalera: Un gráfico de líneas traza una línea a través de puntos definidos por las coordenadas x e y y crea un gráfico de escalera, destacando exactamente cuándo ocurren los cambios. Cuando un color se establece en una variable de factor, los puntos se agrupan por color y se genera una línea separada para cada grupo de color. Los facetas se pueden crear opcionalmente especificando una variable de factor. También puedes especificar temas opcionalmente, y especificar un título y etiquetas para los ejes x e y​</br>\n            Ordenado por ocurrencia: Un gráfico de líneas traza una línea a través de puntos definidos por las coordenadas x e y y los conecta en el orden en que ocurren las variables en el conjunto de datos. Cuando un color se establece en una variable de factor, los puntos se agrupan por color y se genera una línea separada para cada grupo de color. Los facetas se pueden crear opcionalmente especificando una variable de factor. También puedes especificar temas opcionalmente, y especificar un título y etiquetas para los ejes x e y​.</br>\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            #Gráfico de líneas<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_line( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Gráfico de líneas para ...\")<br/>\n            #Gráfico de escalera<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_step( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Gráfico de líneas para ...\")<br/>\n            #Ordenado por ocurrencia<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_path( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Gráfico de líneas para ...\")\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            data: El conjunto de datos predeterminado​\n            </li>\n            <li>\n            aes(): Genera mapeos estéticos que describen cómo las variables en los datos se asignan a propiedades visuales (estéticas) de los geoms.​\n            </li>\n            <li>\n            x: Una variable numérica o de factor\n            </li>\n            <li>\n            y: la variable numérica/escala para la cual se trazan los puntos en el eje y​\n            </li>\n            <li>\n            color: una variable de factor opcional para agrupar puntos (por color)​\n            </li>\n            <li>\n            labs(): Cambiar etiquetas de ejes y títulos de leyenda (esto es opcional)​\n            </li>\n            <li>\n            facet_grid(): Disponer paneles en una cuadrícula (esto es opcional)​\n            </li>\n            <li>\n            theme_calc(): Especifica el tema de la calculadora (esto es opcional)​\n            </li>\n            <li>\n            geom_line(): Conectar observaciones ordenadas por valor x, ver x:​\n            </li>\n            <li>\n            coord_flip(): Voltear ejes (esto es opcional)​\n            </li>\n            </ul>\n            <b>Paquete</b></br>\n            ggplot2;ggthemes;</br>\n            <b>Ayuda</b></br>\n            #Gráfico de líneas\n            help(geom_line, package='ggplot2')\n            #Gráfico de líneas escalera\n            help(geom_step, package=ggplot2)\n            #Orden de variable\n            help(geom_path, package='ggplot2')\n            Otro: Haz clic en el botón de ayuda de R para obtener ayuda detallada de R. También puedes ingresar help(labs), help(geom_line), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​            \n    "
  }
}