{
  "title": "t Cuantiles",
  "navigation": "t Cuantiles",
  "prob": "Ingrese probabilidades separadas por una coma. Ejemplo: 0.3,0.2,0.5",
  "degoffree": "Grados de libertad",
  "labelSig": "Nivel de significancia",
  "lowtail": "Cola inferior",
  "uptail": "Cola superior",
  "help": {
    "title": "t Cuantiles",
    "r_help": "help(qt, package=stats)",
    "body": "\n            ​​\n            <b>Descripción</b>\n            <br/>\n            Densidad, función de distribución, función cuantil y generación aleatoria para la distribución t con df grados de libertad (y parámetro de no centralidad opcional ncp).\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code>\n                dt(x, df, ncp, log = FALSE)\n                <br/>\n                pt(q, df, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qt(p, df, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rt(n, df, ncp)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumentos</b>\n            <br/>\n            <ul>\n                <li>x, q : vector de cuantiles.</li>\n                \n                \n                <li>p : vector de probabilidades.</li>\n                \n                \n                <li>n : número de observaciones. Si la longitud(n) > 1, se toma la longitud como la cantidad requerida.</li>\n                \n                \n                <li>df : grados de libertad (> 0, puede no ser entero). df = Inf está permitido.</li>\n                \n                \n                <li>ncp : parámetro de no centralidad delta; actualmente excepto para rt(), solo para abs(ncp) <= 37.62. Si se omite, se utiliza la distribución t central.</li>\n                \n                \n                <li>log, log.p : lógico; si es TRUE, las probabilidades p se dan como log(p).</li>\n                \n                \n                <li>lower.tail : lógico; si es TRUE (por defecto), las probabilidades son P[X ≤ x], de lo contrario, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalles</b>\n            <br/>\n            La distribución t con df = n grados de libertad tiene densidad\n            <br/>\n            <code>f(x) = Γ((n+1)/2) / (√(n π) Γ(n/2)) (1 + x^2/n)^-((n+1)/2)</code>\n            <br/>\n            para todo x real. Tiene media 0 (para n > 1) y varianza n/(n-2) (para n > 2).\n            <br/>\n            La t no central general con parámetros (df, Del) = (df, ncp) se define como la distribución de T(df, Del) := (U + Del) / √(V/df) donde U y V son variables aleatorias independientes, U ~ N(0,1) y V ~ χ^2(df) (ver Chi-cuadrado).\n            <br/>\n            Las aplicaciones más utilizadas son cálculos de potencia para pruebas t:\n             Sea T= (mX - m0) / (S/sqrt(n)) donde mX es la media y S la desviación estándar de la muestra (sd) de X_1, X_2, …, X_n que son i.i.d. N(μ, σ^2) Entonces T se distribuye como t no central con df= n - 1 grados de libertad y parámetro de no centralidad ncp = (μ - m0) * sqrt(n)/σ.\n             <br/>\n            <br/><b>Valor</b>\n            <br/>\n            dt da la densidad, pt da la función de distribución, qt da la función cuantil, y rt genera desviaciones aleatorias.\n            <br/>\n            Argumentos inválidos resultarán en un valor de retorno NaN, con una advertencia.\n            <br/>\n            La longitud del resultado está determinada por n para rt, y es el máximo de las longitudes de los argumentos numéricos para las otras funciones.\n            <br/>\n            Los argumentos numéricos que no son n se reciclan a la longitud del resultado. Solo se utilizan los primeros elementos de los argumentos lógicos.\n            <br/>\n            <br/><b>Nota</b>\n            <br/>\n            Suministrar ncp = 0 utiliza el algoritmo para la distribución no central, que no es el mismo algoritmo utilizado si ncp se omite. Esto es para dar un comportamiento consistente en casos extremos con valores de ncp muy cercanos a cero.\n            <br/>\n            El código para ncp no cero está destinado principalmente a ser utilizado para valores moderados de ncp: no será altamente preciso, especialmente en las colas, para valores grandes.            \n      "
  }
}