{
  "title": "フォレストプロット",
  "navigation": "フォレストプロット",
  "modelselectorlabel": "モデル名を選択",
  "plotvarslabel": "プロットする変数（指定しない場合はすべての変数をプロット）",
  "varlabelslabel": "変数ラベル（varname='label'形式で指定し、カンマで区切る。例：age='年齢', bmi='体重指数'）；ラベル内で改行するには\\nを使用",
  "notelabel": "注意：ラベルを変更するにはモデルの再フィットが必要です。大きなデータの場合、時間がかかることがあります",
  "label3": "注意：モデルチューニング（トレーニング）を使用して構築されたモデルはサポートされていません",
  "estimateoptlabel": "推定オプション",
  "estimatelabellabel": "ラベル",
  "exponentiatelabel": "パラメータ推定の指数化を強制",
  "linecolorlabel": "ラインカラー",
  "pointshapelabel": "ポイント形状",
  "pointsizelabel": "ポイントサイズ（0-10 mm）",
  "styleoptlabel": "スタイルオプション",
  "factorseplinelabel": "ファクター名を別の行に表示",
  "plotbandslabel": "プロットバンド",
  "textsizelabel": "テキストサイズ（1-10 mm）",
  "estticklabelsizelabel": "推定ティックマークラベルサイズ（1-50）",
  "help": {
    "title": "フォレストプロット",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nこれは回帰モデルからのモデル係数または指数化された係数のプロットを作成します。各変数はその行にプロットされ、合計、パラメータ推定、95％信頼区間、およびp値が表示されます。変数には、より良いプレゼンテーションのためにラベルを付けることができます。現在、lm（線形モデル）、glm（一般化線形モデル、ロジスティックおよびポアソンを含む）、coxph（コックス比例ハザード）、およびrq（分位回帰）のクラスのモデルがサポートされています。\n<br/><br/>\n<b>モデル名を選択：</b>モデルがフィットされたときに指定されたモデルの名前を選択します。これは必須フィールドです。\n<br/><br/>\n<b>プロットする変数：</b>モデルを作成したデータにアクセスできる場合、プロットに含める変数のサブセットを指定できます。変数が指定されていない場合、すべての変数がデフォルトで含まれます。\n<br/><br/>\n<b>変数ラベル：</b>変数名の代わりに使用するより良いラベルを指定します。変数にラベルが付けられない場合、変数名またはモデルがフィットされたときに使用された既存の変数ラベル（存在する場合）がプロットされます。これらはvariablename=\"label\"形式で指定し、カンマで区切る必要があります。ラベルに\\nを含めると、ラベル内で改行が強制されます。これにより、複数行のラベルを指定でき、長いラベルの場合に有利です。長いラベルを1行に残すと、推定値のためのスペースが少なくなります。モデルの要約を行うには、モデル評価 -> 要約 -> モデルを要約を使用すると、データセットにアクセスできない場合に使用されたモデル変数が印刷されます。注意：現在、forestmodel Rパッケージには、コックスモデルのファクターに対して変数ラベルを使用しないバグがあります - パッケージ開発者には通知されています。パッケージが修正されるまでの代替手段は、ファクターの代わりにダミーコーディングされた変数でモデルを再フィットすることです。\n<br/><br/><br/>\n<b>推定オプション：</b>\n<br/><br/>\n<b>ラベル：</b>プロット内の推定列のオプションラベル。ロジスティック回帰およびコックスモデルは自動的に検出され、推定値は「オッズ比」および「ハザード比」としてラベル付けされます。他のモデルは、何も指定しない場合は「推定値」のデフォルトを使用します。\n<br/><br/>   \n<b>パラメータ推定の指数化を強制：</b>これは、exp（係数）の値を表示するために選択します。すなわち、係数のべき乗に対して2.718を使用します。指数化された係数は、コックス比例ハザードモデル（ハザード比用）、ロジスティック回帰（オッズ比用）、対数二項モデル（相対リスク用）、およびポアソン回帰（率比用）で一般的に使用されます。デフォルトでは、ロジスティック回帰およびコックスモデルは自動的に検出され、exp（係数）が使用されます。\n<br/><br/>\n<b>ラインカラー：</b>信頼区間のラインカラー。\n<br/><br/>\n<b>ポイント形状：</b>プロット内のパラメータ推定のポイントの形状。\n<br/><br/>\n<b>ポイントサイズ（0-10 mm）：</b>プロット内のパラメータ推定のポイントのサイズ（ミリメートル単位）。0 mmはポイントを削除します。デフォルトは4 mmです。\n<br/><br/><br/>\n<b>スタイルオプション：</b>\n<br/><br/>\n<b>ファクター名を別の行に表示：</b>ファクターのレベルとは別の行にファクター変数名を表示するために選択します。\n<br/><br/>\n<b>プロットバンド：</b>プロットの各行に対して交互に陰影を表示するために選択します。\n<br/><br/>\n<b>テキストサイズ（1-10 mm）：</b>プロット内のテキストのサイズ（ミリメートル単位）。デフォルトは4 mmです。\n<br/><br/>\n注意：プロット全体のサイズを変更したい場合、プロットサイズは三点メニューのテーマボタンを使用して設定できます。\n<br/><br/>\n<b>推定ティックマークラベルサイズ（1-50）：</b>推定軸のティックマークラベルのサイズ。\n<br/><br/>\n<b>必要なRパッケージ：</b>forestmodel、arsenal、survival、quantreg、insight\n"
  }
}