{
  "title": "リスクセットマッチング",
  "navigation": "リスクセットマッチング",
  "newdatasetnamelabel": "マッチングデータを保存するためのデータセット名",
  "groupvarlabel": "イベント変数 (1=イベント, 0=センサー)",
  "timevarlabel": "時間変数",
  "calipervarslabel": "マッチング用の変数 (数値)",
  "caliperslabel": "マッチング変数の順にカリパーを指定し、カンマで区切ります。例: 5, 2; 正確なマッチの場合は0を指定します",
  "ratiolabel": "ケースごとのコントロール数",
  "repeatcontrolslabel": "コントロールが複数回マッチングされることを許可する",
  "supercontrolslabel": "ケースが他のケースにマッチングされることを許可しない",
  "help": {
    "title": "リスクセットマッチング",
    "body": "\n            コホート内でリスクセットの被験者マッチングを行います。結果イベントを持つ者（ケース）は、イベントを持たない者（コントロール）とマッチングされ、ケースのイベント時のリスクセットにいます。これはネストされたケース/コントロールデザインです。コホート入場時に知られているベースライン変数もケースとコントロールのマッチングに使用されます。\n\t\t\t<br/><br/>\n\t\t\t値が正確に一致する必要があるベースライン変数と、数値カリパー内で一致する値がサポートされています。コントロールは、各ケースのためにすべての適格なコントロールからランダムに選択されます。\n\t\t\t<br/><br/>\n\t\t\tマッチングデータを含む出力データセットには、元の変数、イベントインジケーター（\"failed\"）、およびマッチングセットを識別する変数（\"match.num\"）が含まれます。\n\t\t\t<br/><br/>\n\t\t\tマッチングプロセスに関与する変数に欠損値がある観察は、マッチング前に削除されます。\n\t\t\t<br/><br/>\n\t\t\tネストされたケース/コントロールデザインの簡単な紹介は次の文献にあります:\n\t\t\tEssebag V , et al. 心臓病学におけるネストされたケースコントロール研究。Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>マッチングデータを保存するためのデータセット名:</b>\n\t\t\t<br/>マッチングされた被験者セットを含む出力データセットの名前。\n\t\t\t<br/><br/>\n\t\t\t<b>イベント変数 (1=イベント, 0=センサー):</b>\n\t\t\t<br/>イベントを示す変数の名前。1=イベント、0=センサーで、数値でなければなりません。\n\t\t\t</br><br/>\n\t\t\t<b>マッチング用の変数:</b>\n\t\t\t<br/>ケース/コントロールセットをマッチングするために指定したいベースライン変数を指定します。これらは数値でなければなりません。\n\t\t\t<br/><br/>\n\t\t\t<b>マッチング変数の順にカリパーをカンマで区切って指定:</b>\n\t\t\t<br/>各変数の順に数値カリパー値を指定します。正確なマッチにはカリパー0を使用します。\n\t\t\t例えば、年齢（年単位）が5のカリパーで指定された場合、コントロールはマッチングされたケースの±5年以内でなければなりません。\n\t\t\t各マッチング変数にはカリパー値を指定する必要があります。\n\t\t\t<br/><br/>\n\t\t\t<b>ケースごとのコントロール数:</b>\n\t\t\t<br/>これは、各ケースにマッチングされる最大のコントロール数です。適切なマッチが特定できない場合、一部のマッチングセットはこの値より少なくなることがあります。\n            <br/><br/>\n\t\t\t<b>コントロールが複数回マッチングされることを許可:</b>\n\t\t\t<br/>コントロールが複数のケースにマッチングされる可能性があるかどうかを指定します。このオプションを選択することをお勧めします。バイアスを避けるためです。\n            <br/><br/>\n\t\t\t<b>ケースが他のケースにマッチングされることを許可しない:</b>\n\t\t\t<br/>ケースイベント時刻の前にケースをコントロールとして考慮することを許可するかどうかを指定します。このオプションを選択しないことをお勧めします。バイアスを避けるためです。このオプションを選択しない場合、ケースはコントロールリスクセットプールにあり、イベント時刻まで他のケースにマッチングされる資格があります。\n            <br/><br/>\n            <b>必要なRパッケージ:</b> dplyr, tidyr\n"
  }
}