{
  "title": "主題マッチング",
  "navigation": "主題マッチング",
  "newdatasetnamelabel": "一致したデータを保存するためのデータセット名",
  "groupvarlabel": "ケース/コントロール変数（コントロール=低い値、ケース=高い値）",
  "notelabel": "注意：正確またはキャリパー変数のために少なくとも1つの変数を指定する必要があります",
  "exactvarslabel": "正確なマッチングのための変数",
  "calipervarslabel": "キャリパーマッチングのための変数",
  "caliperslabel": "キャリパー変数の順にカンマで区切ってキャリパーを指定してください。例：5, 2",
  "idvarlabel": "被験者ID変数",
  "ratiolabel": "ケースごとのコントロールの数",
  "help": {
    "title": "主題マッチング",
    "r_help": "help(matchit, package = 'MatchIt')",
    "body": "\n            近接隣接の被験者マッチングを実行し、ケースのセットを1つ以上のコントロールにマッチさせます。これはケース/コントロール研究およびマッチしたコホート研究に適しています。\n\t\t\t<br/><br/>\n\t\t\t値が正確に一致する必要がある変数と、数値キャリパー内で一致する値がサポートされています。\n\t\t\tマッチングは置き換えなしで行われ（各被験者は1回だけマッチングされる）、潜在的なコントロールの中から各ケースのデータ順に選択されます。\n\t\t\t<br/><br/>\n\t\t\t出力データセットには元のデータと2つの追加変数が含まれます：1）サブクラス：マッチしたセットを識別する変数、2）重み：必要に応じてその後の分析に使用できるマッチングケース重み変数。\n\t\t\t<br/><br/>\n\t\t\t<b>一致したデータを保存するためのデータセット名：</b>\n\t\t\t<br/>一致した被験者セットを含む出力データセットの名前。\n\t\t\t<br/><br/>\n\t\t\t<b>ケース/コントロール変数（コントロール=低い値、ケース=高い値）：</b>\n\t\t\t<br/>ケースとコントロールを示す変数の名前。数値、因子、または文字列である可能性があります。\n\t\t\t数値変数の場合、これは0=コントロール、1=ケースとしてコーディングする必要があります。因子変数の場合、低い順序のレベルがコントロールであり、高い順序のレベルがケースになります。\n\t\t\t文字列変数の場合、低い順序の値（アルファベット順）はコントロールであり、高い順序の値（アルファベット順）はケースになります。\n\t\t\tしたがって、安全のために0=コントロール、1=ケースとしてコーディングすることをお勧めします。\n\t\t\t</br><br/>\n\t\t\t<b>正確なマッチングのための変数：</b>\n\t\t\t<br/>ケース/コントロールセットが正確にマッチするために必要な変数を指定してください。\n\t\t\tこれは、マッチしたセット内のケースとコントロールがこれらの変数に対して正確に同じ値を持つことを意味します。これらは文字列、日付、数値、因子、または順序変数である可能性があります。\n\t\t\t<br/><br/>\n\t\t\t<b>キャリパーマッチングのための変数：</b>\n\t\t\t<br/>数値キャリパー値でマッチさせたいケース/コントロールセットのための変数を指定してください。コントロールは、これらの変数の各々に対して指定されたキャリパー幅内に収まります。\n\t\t\tこれらは数値または日付変数である可能性があります。各キャリパー変数にはキャリパー値が指定されている必要があります。\n\t\t\t<br/><br/>\n\t\t\t<b>キャリパー変数の順にカンマで区切ってキャリパーを指定してください：</b>\n\t\t\t<br/>キャリパー変数の順に各キャリパー変数の数値キャリパー値を指定してください。\n\t\t\t例えば、年齢（年単位）が5のキャリパーで指定された場合、コントロールはマッチしたケースの±5年以内でなければなりません。\n\t\t\t各キャリパー変数にはキャリパー値が指定されている必要があります。キャリパー変数がない場合、このフィールドは空でなければなりません。\n\t\t\t<br/><br/>\n\t\t\t<b>ケースごとのコントロールの数：</b>\n\t\t\t<br/>これは、各ケースにマッチする最大のコントロールの数です。適切なマッチが特定できない場合、一部のマッチセットはこの値より少なくなる可能性があります。\n            <br/><br/>\n            <b>必要なRパッケージ：</b> dplyr, tidyr, MatchIt\n"
  }
}