{
  "title": "Adăugați o variabilă recalibrată pentru numărul de eșantion",
  "navigation": "Recalibrați numărul de eșantion",
  "sampleVariableToCalibrate": "Selectați variabila de eșantion pe care doriți să o recalibrați",
  "sampleVarName": "Specificați numele noii variabile recalibrate pentru eșantion de adăugat (de exemplu, sample_recal). Dacă numele variabilei este deja prezent în setul de date, va fi actualizat",
  "help": {
    "title": "Adăugați o variabilă recalibrată pentru numărul de eșantion",
    "body": "\n\t\t\t\t<b>Descriere</b></br>\n\t\t\t\tOrganizarea subgrupurilor (de exemplu, grupul de eșantion) pentru capacitatea procesului și alte analize de subgrup\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tAnalizele, cum ar fi analiza capacității procesului, presupun că datele sunt introduse în ordinea în care au fost colectate (ordine cronologică). Aceasta înseamnă că toate observațiile din același subgrup trebuie să apară în rânduri consecutive ale setului de date. O coloană ID de subgrup este utilizată de obicei pentru a defini care rânduri aparțin aceluiași subgrup.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDacă această condiție nu este îndeplinită (de exemplu, dacă rândurile din același subgrup sunt dispersate în întregul set de date și nu sunt plasate una lângă alta), atunci ID-urile subgrupurilor trebuie recalibrate.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tRecalibrarea înseamnă:\n\t\t\t\t<br/>\n\t\t\t\tUn nou număr de subgrup este atribuit de fiecare dată când ID-ul subgrupului se schimbă de la un rând la altul.\n\t\t\t\t<br/>\n\t\t\t\tDacă același ID de subgrup reapare mai târziu, dar nu este adiacent apariției sale anterioare, va fi tratat ca un nou subgrup.\n\t\t\t\t<br/>\n\t\t\t\tCu alte cuvinte, doar valorile identice care apar una lângă alta sunt considerate parte din același subgrup. Valorile identice separate de alte subgrupuri vor fi împărțite în subgrupuri separate în timpul recalibrării.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tVariabila recalibrată pentru numărul de eșantion din setul de date este necesară pentru a efectua multe analize, de exemplu, capacitatea procesului, diagramele Shewhart cum ar fi xbar, R, S, etc \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}