{
  "title": "ANOVA, unidirecțional cu blocuri aleatorii",
  "navigation": "ANOVA, 1 direcție (blocuri aleatorii)",
  "tvarbox1": "Variabila de răspuns",
  "tvarbox2": "Efect fix",
  "blockVar": "Variabila(e) de blocare",
  "Post_hoc": "Analiza post-hoc",
  "chk1": "Histogramă a rezidualelor",
  "help": {
    "title": "ANOVA, unidirecțional cu blocuri aleatorii",
    "r_help": "help(lmer, package ='lme4')",
    "body": "\n<b>Descriere</b></br>\nSe potrivește un model liniar cu efecte mixte (LMM) la date, prin REML sau maximă verosimilitate.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nlmer(formula, data = NULL, REML = TRUE, control = lmerControl(),\n        start = NULL, verbose = 0L, subset, weights, na.action,\n        offset, contrasts = NULL, devFunOnly = FALSE, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nformula: un obiect de formulă liniară bidirecțională care descrie atât partea de efecte fixe, cât și partea de efecte aleatorii a modelului, cu răspunsul pe partea stângă a operatorului ~ și termenii, separați prin operatori +, pe partea dreaptă. Termenii de efecte aleatorii sunt distincți prin bare verticale (|) care separă expresiile pentru matricele de design de factorii de grupare. Două bare verticale (||) pot fi folosite pentru a specifica efecte aleatorii necorelate multiple pentru aceeași variabilă de grupare. (Din cauza modului în care este implementat, sintaxa || funcționează doar pentru matricele de design care conțin predictori numerici (continue); pentru a se potrivi modele cu efecte categorice independente, consultați funcția dummy sau lmer_alt din pachetul afex.)\n</li>\n<li>\ndata: un cadru de date opțional care conține variabilele numite în formulă. În mod implicit, variabilele sunt preluate din mediu din care este apelat lmer. Deși datele sunt opționale, autorii pachetului recomandă cu tărie utilizarea acestora, în special atunci când se aplică ulterior metode precum update și drop1 modelului ajustat (astfel de metode nu sunt garantate să funcționeze corect dacă datele sunt omise). Dacă datele sunt omise, variabilele vor fi preluate din mediu de formulă (dacă este specificată ca o formulă) sau din cadrul părinte (dacă este specificată ca un vector de caractere).\n</li>\n<li>\nREML: scalar logic - Ar trebui estimările să fie alese pentru a optimiza criteriul REML (spre deosebire de log-verosimilitate)?\nna.action: o funcție care indică ce ar trebui să se întâmple atunci când datele conțin NAs. Acțiunea implicită (na.omit, moștenită din valoarea 'fabrica proaspătă' a getOption(\"na.action\")) elimină orice observații cu valori lipsă în orice variabile.\n</li>\n</ul>\n<b>Valoare</b></br>\nUn obiect de clasă merMod (mai specific, un obiect de subclasă lmerMod), pentru care sunt disponibile multe metode (de exemplu, methods(class=\"merMod\"))</br>\n<b>Pachet</b></br>\nlme4</br>\n<b>Ajutor</b></br>\nhelp(lmer, package ='lme4')</br></br>\n<b>Descriere</b></br>\nMetode de descriere pentru funcția anova în pachetul lmerTest\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \n## Metodă S4 pentru semnătura 'merModLmerTest' anova(object, ... , ddf=\"Satterthwaite\", type=3)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: obiect de clasă \"merModLmerTest\" ... obiect de clasă \"merModLmerTest\". Apoi, statisticile de comparație a modelului vor fi calculate\n</li>\n<li>\nddf: În mod implicit, aproximarea lui Satterthwaite la gradele de libertate este calculată. Dacă ddf=\"Kenward-Roger\", atunci aproximarea lui Kenward-Roger este calculată folosind funcția KRmodcomp din pachetul pbkrtest. Dacă ddf=\"lme4\" atunci tabelul anova care provine din pachetul lme4 este returnat.\n</li>\n<li>\nTip: tipul de ipoteză care trebuie testată. Poate fi type=3 sau type=2 sau type = 1 (Definiția provine din teoria SAS) Detalii Conform (Goodnight, J.H. 1976) comportamentul ipotezei de tip 3 nu este pe deplin studiat pentru situațiile cu celule lipsă (unde observațiile lipsesc la unele combinații de niveluri de factor). O avertizare este returnată în astfel de cazuri.\n</li>\n</ul>\n<b>Detalii</b></br>\nConform (Goodnight, J.H. 1976) comportamentul ipotezei de tip 3 nu este pe deplin studiat pentru situațiile cu celule lipsă (unde observațiile lipsesc la unele combinații de niveluri de factor). O avertizare este returnată în astfel de cazuri.</br>\n<b>Pachet</b></br>\nlme4;lmerTest;rcompanion;ggplot2;multcomp</br>\n<b>Ajutor</b></br>\nhttps://cran.r-project.org/web/packages/lmerTest/lmerTest.pdf</br>\nhelp(nagelkerke, package ='rcompanion')</br>\nhelp(emmeans,package=\"cld\")</br>\nhelp(cld,package='emmeans')</br>\n<b>Material de referință</b></br>\nhttp://rcompanion.org/handbook/I_07.html\n"
  }
}