{
  "title": "Grafic cu bare",
  "navigation": "Grafic cu bare",
  "optionsLabels": "Opțiuni pentru etichete",
  "suppressLabels": "Suprimă toate etichetele pentru număr și procente",
  "suppressThreshold": "Suprimă etichetele pentru număr și procente sub procentul specificat",
  "label1": "Faceți clic pe tab-ul de mai jos pentru a selecta numărul sau media. Când numărul este selectat, o variabilă Y este opțională. Când numărul este selectat și o variabilă Y NU este specificată, se afișează numerele variabilei X. Când numărul este specificat și o variabilă Y este specificată, valorile variabilei Y sunt sumate. Când media este selectată, trebuie să selectați o variabilă Y și o variabilă X. Mediile sunt calculate pentru variabila(e) Y.",
  "x": "Variabila X",
  "y": "Variabila(e) Y, specificați o variabilă numerică",
  "fill": "Specificați o variabilă factor pentru a umple barele.",
  "dropna": "Eliminați valorile lipsă",
  "bottomlbl": "Selectați Grafic cu bare",
  "meanlbl": "Medie",
  "countlbl": "Număr",
  "fill1": "Selectați o culoare pentru bare. Notă: Aceasta este ignorată atunci când o variabilă pentru umplerea barelor este specificată",
  "barType": "Tipul graficului cu bare",
  "stackedBar": "Grafic cu bare stivuite",
  "sideBySide": "Afișați grupurile una lângă alta",
  "fillPercent": "Umpleți barele",
  "errorBarOptions": "Barele de eroare",
  "noErrBars": "Fără bare de eroare",
  "stderr": "Erori standard",
  "stddev": "Deviație standard",
  "cilevel": "Specificați nivelul de încredere:",
  "confidenceInterval": "Nivel de încredere:",
  "alpha": "Opacitate (0-1)",
  "flipBox": "Răsturnați axa",
  "specify_a_title": "Introduceți un titlu",
  "x_title": "Eticheta axei X",
  "y_title": "Eticheta axei Y",
  "hide": "Afișați doar partea de sus a barelor de eroare (trebuie să setați opacitatea la 1)",
  "Facetrow": "Rând de fațete",
  "Facetcolumn": "Coloană de fațete",
  "Facetwrap": "Împachetare de fațete",
  "Facetscale": "Scală de fațete",
  "relFreq": "Frecvențe relative",
  "facets_lbl": "Fațete",
  "help": {
    "title": "Ajutor pentru Grafic cu bare",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Un grafic cu bare este un grafic care prezintă date grupate cu bare dreptunghiulare cu lungimi proporționale valorilor pe care le reprezintă. Barele pot fi plotate vertical sau orizontal. Barele pot fi grupate după o variabilă factor opțională. Grupurile pot fi stivuite pe o singură bară sau afișate una lângă alta. Fațetele pot fi create opțional specificând o variabilă factor. De asemenea, puteți specifica opțional teme și un titlu și etichete pentru axele x și y.\n        Puteți crea un grafic cu bare pentru o singură variabilă factor, barele vor reprezenta numerele fiecărui nivel al variabilei factor. Aici variabila factor va fi pe axa x, vedeți exemplul de mai jos. Când caseta de frecvențe relative este selectată, arătăm frecvența relativă în loc de numere pe axa y.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=0.4) +\n         labs(x =\"year\",y =\"Count\",title= \"Grafic cu bare pentru axa X: year, axa Y: Count\")\n        </code>\n        <br />\n        Puteți crea un grafic cu bare plasând o variabilă scală/numerică pe axa y și umplând barele cu o variabilă factor. Bara va fi umplută prin sumarea valorilor variabilei y pentru fiecare nivel al variabilei factor, vedeți exemplul de mai jos\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=0.4,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"Grafic cu bare pentru axa X:, axa Y: weight, Umplere: origin\")\n        </code>\n        <br />\n        Puteți specifica o variabilă x, o variabilă y și umplere. Bara este umplută prin suma valorilor variabilei y pentru fiecare nivel al variabilei x, grupată după nivelul variabilei specificate în umplere.\n        Când specificați mai multe variabile x, creăm un grafic cu bare separat pentru fiecare variabilă x.\n        <br />\n        Utilizare:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Setul de date implicit​\n        </li>\n        <li>\n        aes():    Generați mapări estetice care descriu modul în care variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geoms.​\n        </li>\n        <li>\n        x: O variabilă factor/categorială. Lungimea barei corespunde numărului fiecărui nivel al variabilei factor.​\n        </li>\n        <li>\n        fill: O variabilă factor/categorială opțională pentru a grupa numerele nivelurilor în x: (vezi mai sus)​\n        </li>\n        <li>\n        geom_bar(): Creează graficul cu bare, position =”stack” stivează grupurile pe o singură bară, position =”dodge” stivează grupurile una lângă alta, position =\"fill\" umple bara cu un procent din fiecare nivel de grupare.​\n        </li>\n        <li>\n        Labs(): Schimbați etichetele axelor și titlurile legendelor (aceasta este opțional)​\n        </li>\n        <li>\n        facet_grid(): Așezați panourile într-o grilă (aceasta este opțional)​\n        </li>\n        <li>\n        theme_calc(): Specifică tema calculatorului (aceasta este opțional)​\n        </li>\n        <li>\n        coord_flip(): Răsturnați axa (aceasta este opțional)​\n        </li>\n        <li>\n        alpha: Controlează opacitatea, ia valori între 0-1. 1 înseamnă fără opacitate.\n        </li>\n        </ul>\n        Pachet: ggplot2,ggthemes​\n        <br />\n        Alte: Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n        "
  }
}