{
  "title": "Testul Bartlett",
  "navigation": "Testul Bartlett",
  "tvarbox1": "Variabila de răspuns",
  "tvarbox2": "Variabile numerice sau factori",
  "help": {
    "title": "Testul Bartlett",
    "r_help": "ajutor(bartlett.test, pachet=stats)",
    "body": "\n<b>Descriere</b></br>\nEfectuează testul Bartlett al ipotezei nule conform căreia varianțele din fiecare dintre grupuri (probe) sunt aceleași.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nbartlett.test(x, ...)</br>\n## Metodă S3 implicită:</br>\nbartlett.test(x, g, ...)</br>\n## Metodă S3 pentru clasa 'formulă'</br>\nbartlett.test(formulă, date, subset, na.action, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nArgumente\nx: un vector numeric de valori de date, sau o listă de vectori de date numerice care reprezintă probele respective, sau obiecte de model liniar ajustate (care moștenesc din clasa \"lm\").\n</li>\n<li>\ng: un vector sau un obiect factor care oferă grupul pentru elementele corespunzătoare ale lui x. Ignorat dacă x este o listă.\n</li>\n<li>\nformulă: o formulă de forma lhs ~ rhs unde lhs oferă valorile de date și rhs grupurile corespunzătoare.\n</li>\n<li>\ndate: o matrice sau un cadru de date opțional (sau similar: vezi model.frame) care conține variabilele din formulă. În mod implicit, variabilele sunt preluate din mediu(formulă).\n</li>\n<li>\nsubset: un vector opțional care specifică un subset de observații care trebuie utilizate.\n</li>\n<li>\nna.action: o funcție care indică ce ar trebui să se întâmple atunci când datele conțin NAs. Implicit, se utilizează getOption(\"na.action\").\n</li>\n<li>\n...: alte argumente care vor fi transmise către sau de la metode.\n</li>\n</ul>\n<b>Detalii</b></br>\nDacă x este o listă, elementele sale sunt considerate probele sau modelele liniare ajustate care trebuie comparate pentru omogenitatea varianțelor. În acest caz, elementele trebuie să fie fie toate vectori de date numerice, fie obiecte de model liniar ajustat, g este ignorat, și se poate folosi pur și simplu bartlett.test(x) pentru a efectua testul. Dacă probele nu sunt încă conținute într-o listă, folosiți bartlett.test(list(x, ...)).</br>\nÎn caz contrar, x trebuie să fie un vector de date numerice, iar g trebuie să fie un vector sau un obiect factor de aceeași lungime ca x care oferă grupul pentru elementele corespunzătoare ale lui x.</br>\n<b>Valoare</b><br/>\nO listă de clasă \"htest\" care conține următoarele componente:<br/>\nstatistică: statistica testului K-pătrat de Bartlett.<br/>\nparameter: gradele de libertate ale distribuției chi-pătrat aproximative a statisticii testului.<br/>\np.value: valoarea p a testului.<br/>\nmethod: șirul de caractere \"Testul Bartlett al omogenității varianțelor\".<br/>\ndata.name: un șir de caractere care oferă numele datelor.<br/>\n<b>Exemple</b><br/>\n<code> \nDataset <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))\nResult_Bartlett_Test = bartlett.test(sales ~ interaction(Dataset$Gender),data=Dataset)\n</code> <br/>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\naid(bartlett.test, package=stats)\n"
  }
}