{
  "title": "Testul valorilor aberante Bonferroni",
  "navigation": "Testul valorilor aberante",
  "label1": "Selectați un model din una dintre următoarele clase (clasa între paranteze) - Model liniar (lm), Model liniar generalizat (glm)",
  "modelselector1": "Selectați un model",
  "help": {
    "title": "Testul valorilor aberante Bonferroni",
    "r_help": "help(outlierTest, package='car')",
    "body": "\n                <b>Descriere</b></br>\nRaportează valorile p Bonferroni pentru testarea fiecărei observații pe rând ca fiind o valoare aberantă de deplasare a mediei, bazată pe reziduurile studentizate în modele liniare (teste t), modele liniare generalizate (teste normale) și modele mixte liniare.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## Metodă S3 pentru clasa 'lm'<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## Metodă S3 pentru clasa 'lmerMod'<br/>\noutlierTest(model, ...)<br/>\n## Metodă S3 pentru clasa 'outlierTest'<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmodel: un obiect de model lm, glm sau lmerMod; metoda \"lmerMod\" apelează metoda \"lm\" și poate accepta aceleași argumente.\n</li>\n<li>\ncutoff: observațiile cu valori p Bonferroni care depășesc cutoff nu sunt raportate, cu excepția cazului în care nu sunt nominalizate observații, caz în care se raportează cea cu cel mai mare reziduu studentizat.\n</li>\n<li>\nn.max: numărul maxim de observații de raportat (implicit, 10).\n</li>\n<li>\norder: raportați reziduurile studentizate în ordine descrescătoare a magnitudinii? (implicit, TRUE).\n</li>\n<li>\nlabels: un vector opțional de nume de observație.\n</li>\n<li>\n...: argumente transmise funcțiilor de metode.\n</li>\n<li>\nx: obiect outlierTest.\n</li>\n<li>\ndigits: numărul de cifre pentru valorile p raportate.\n</li>\n</ul>\n<b>Detalii</b></br>\nPentru un model liniar, valorile p raportate folosesc distribuția t cu un grad de libertate cu unul mai puțin decât df-ul rezidual pentru model. Pentru un model liniar generalizat, valorile p se bazează pe distribuția normală standard. Ajustarea Bonferroni înmulțește valoarea p obișnuită cu două fețe cu numărul de observații. Metoda lm funcționează pentru obiecte glm. Pentru a arăta toate observațiile, setați cutoff=Inf și n.max=Inf.<br/>\n<b>Valoare</b><br/>\nun obiect de clasă outlierTest, care este de obicei doar imprimat.<br/>\n<b>Exemple</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>Pachet</b></br>\ncar</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestei suprapuneri de dialog sau rulați următoarea comandă în editorul de sintaxă R help(outlierTest, package=\"car\")\n                "
  }
}