{
  "title": "Diagramă Box Plot",
  "navigation": "Diagramă Box Plot",
  "x": "Variabila X, specificați o variabilă de categorie",
  "y": "Variabila(e) Y, specificați o variabilă numerică(e)",
  "Fill": "Specificați o variabilă de grupare (categorie)",
  "flipaxis": "Răsturnați axa",
  "dataPoints": "Selectați o opțiune pentru a plota punctele de date",
  "alpha": "Opacitate (0-1)",
  "notch": "Decupaj",
  "outliers": "Arată valori aberante (în roșu)",
  "barcolor": "Selectați o culoare pentru liniile din jurul cutiilor (după selectarea culorii, faceți clic în afara controlului pentru a aplica)",
  "showCountsChk": "Afișați valorile pe cutie (1Q, mediana, 3Q)",
  "specify_a_title": "Introduceți un titlu",
  "x_title": "Eticheta axei X",
  "y_title": "Eticheta axei Y",
  "angleXaxis_text": "Unghiul pentru a înclina valorile textului axei x (implicit 0 pentru fără înclinare)",
  "angleYaxis_text": "Unghiul pentru a înclina valorile textului axei y (implicit 0 pentru fără înclinare)",
  "axisTickmarksCount": "Câte valori ale axei (de exemplu, marcaj) să fie afișate (implicit 10)",
  "Facetrow": "Rând de fațete",
  "Facetcolumn": "Coloană de fațete",
  "Facetwrap": "Împachetare de fațete (dacă este ales, orice selecție de rând și coloană de fațete va fi ignorată)",
  "Facetscale": "Scală de fațete",
  "label1": "Linii orizontale",
  "yIntercept": "Introduceți valori de interceptare Y separate prin virgulă pentru liniile orizontale, de exemplu 100, 200, 300",
  "hLineColor": "Selectați o culoare pentru linia(e) și eticheta(e) (după selectarea culorii, faceți clic în afara controlului pentru a aplica)",
  "lineType": "Selectați tipul de linie",
  "horizontalLinelabel": "Specificați etichete separate prin virgulă (fără ghilimele) pentru linia(e) orizontală(e)",
  "horizontalLinelabel_angle_text": "Unghiul pentru a înclina textul etichetei liniei orizontale (implicit 0 pentru fără înclinare)",
  "label2": "Notă: valori mai mari mută textul mai jos, valori mai mici mută textul mai sus",
  "addHoriRefLines": "Adăugați linii de referință",
  "xyLimits": "Limitele axelor X și Y",
  "label5": "Specificați un interval pentru valorile axelor X și Y",
  "rangeXValues": "Specificați intervalul axei X, de exemplu 0,100 (lăsați-l gol pentru axa categorială/factor)",
  "rangeYValues": "Specificați intervalul axei Y, de exemplu 0,100",
  "labelHori_HorizontalJustification": "Notă: valori mai mari plasează textul la stânga, valori mai mici mută textul la dreapta",
  "verticalJustification": "Controlați justificarea verticală a etichetei",
  "hori_HorizontalJustification": "Controlați justificarea orizontală a etichetei",
  "addlLabelHlineTextPositionOffset": "Ajustări suplimentare pentru a poziționa textul etichetei pentru liniile orizontale",
  "horiMovementHReflineLabel": "Mută textul orizontal la stânga sau la dreapta - folosiți orice număr cu semn + sau - (lăsați 0 pentru axa categorială)",
  "nobreaklineHRefLabelandValueChk": "Bifați această casetă pentru a elimina întreruperea liniei între valoarea etichetei și textul etichetei",
  "vertiMovementHReflineLabel": "Mută textul vertical în sus sau în jos - folosiți orice număr cu semn + sau - (lăsați 0 pentru axa categorială)",
  "help": {
    "title": "Diagramă Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descriere</b></br>\n        În statistica descriptivă, o diagramă box plot sau boxplot este o modalitate convenabilă de a reprezenta grafic grupuri de date numerice prin intermediul quartilelor lor. Diagramele box plot pot avea, de asemenea, linii care se extind vertical din cutii (mustăți) indicând variabilitatea din afara quartilelor superioare și inferioare, de aici termenii diagramă box-and-whisker și diagramă box-and-whisker. Valorile aberante pot fi reprezentate ca puncte individuale. Diagramele box și whisker sunt uniforme în utilizarea cutiei: partea de jos și partea de sus a cutiei sunt întotdeauna primul și al treilea quartil, iar banda din interiorul cutiei este întotdeauna al doilea quartil (mediana). Mustața superioară se extinde de la balama la cea mai mare valoare care se află în 1.5 * IQR de balama, unde IQR este intervalul interquartil, sau distanța dintre primul și al treilea quartil. Mustața inferioară se extinde de la balama la cea mai mică valoare în 1.5 * IQR de balama. Datele dincolo de capătul mustăților sunt valori aberante și sunt reprezentate ca puncte (așa cum este specificat de Tukey).​</br>\n        Fațetele pot fi create opțional prin specificarea unei variabile factor. De asemenea, puteți specifica opțional teme și specifica un titlu și etichete pentru axele x și y​</br>\n        Când selectați opțiunea de a plota punctele de date, facem acest lucru folosind geom_dotplot</br>\n        În mod implicit, valorile aberante sunt afișate cu puncte negre, când selectați opțiunea de a arăta valorile aberante (în roșu) prin caseta de selectare, valorile aberante devin mai proeminente.\n        <br/>\n        <b>Utilizare</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumente</b><br/>\n        <ul>\n        <li>\n        data: Setul de date implicit​\n        </li>\n        <li>\n        x: O variabilă factor/categorială care definește gruparea variabilei y​\n        </li>\n        <li>\n        y: O variabilă numerică pentru care se calculează boxplot-ul​\n        </li>\n        <li>\n        fill: O variabilă factor/categorială opțională pentru a grupa suplimentar grupurile existente. Fiecare subgrup va fi afișat într-o culoare distinctă.​\n        </li>\n        <li>\n        aes():    Generați mapări estetice care descriu modul în care variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geoms.​\n        </li>\n        <li>\n        geom_boxplot(): Creează boxplot-ul. \"Balamele\" superioare și inferioare corespund primelor și celor de-al treilea quartile (percentilele 25 și 75).​\n        </li>\n        <li>\n        geom_dotplot: Plotează punctele de date\n        </li>\n        <li>\n        Labs(): Schimbați etichetele axelor și titlurile legendelor (aceasta este opțional)​\n        </li>\n        <li>\n        facet_grid(): Așezați panourile într-o rețea (aceasta este opțional)​\n        </li>\n        <li>\n        theme_calc(): Specifică tema calculatorului (aceasta este opțional)​\n        </li>\n        <li>\n        coord_flip(): Răsturnați axa (aceasta este opțional)​\n        </li>\n        <li>\n        notch: Diagramele box plot cu decupaj aplică un \"decupaj\" sau îngustare a cutiei în jurul medianei. Decupajele sunt utile pentru a oferi un ghid aproximativ pentru semnificația diferenței medianelor; dacă decupajele a două cutii nu se suprapun, aceasta oferă dovezi ale unei diferențe semnificative din punct de vedere statistic între mediane. Într-o diagramă box plot cu decupaj, decupajele se extind 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n        <b>Pachet</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Ajutor</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}