{
  "title": "Box Plot",
  "navigation": "Box Plot",
  "x": "Variabila X, specificați o variabilă de tip Categorie",
  "y": "Variabilă(y), specificați o variabilă de tip Numeric",
  "Fill": "Specificați o variabilă de grupare (Categorie)",
  "flipaxis": "Răsturnați axa",
  "dataPoints": "Selectați o opțiune pentru a plota punctele de date",
  "alpha": "Opacitate (0-1)",
  "notch": "Decupaj",
  "outliers": "Arată valorile aberante (în roșu)",
  "barcolor": "Selectați o culoare pentru liniile din jurul cutiilor (După selectarea culorii, faceți clic în afara controlului pentru a aplica)",
  "showCountsChk": "Afișați valorile pe cutie (1Q, mediană, 3Q)",
  "drawSignificanceChk": "Adăugați semnificație (valori p) comparație medie între fiecare pereche de cutii (selectați facet pentru analiza de grup). Pentru tukey_hsd și games_howell_test, valorile p sunt deja ajustate. Metoda suplimentară de ajustare a valorilor p este ignorată.",
  "methodForMeanDiffSignificance": "Metoda de testare utilizată pentru compararea mediilor",
  "adjPvalue": "Ajustați valorile p din compararea mediilor",
  "pValueFromatting": "Formatați valorile p (semnificație) afișate",
  "specify_a_title": "Introduceți un titlu",
  "x_title": "Eticheta axei X",
  "y_title": "Eticheta axei Y",
  "legends": "Arată Legende și, dacă da, poziția legendelor (implicit este dreapta)",
  "angleXaxis_text": "Unghiul pentru a înclina valorile textului axei x (implicit 0 pentru fără înclinare)",
  "angleYaxis_text": "Unghiul pentru a înclina valorile textului axei y (implicit 0 pentru fără înclinare)",
  "axisTickmarksCount": "Câte valori ale axei (de ex. marcaj) să afișați (implicit 10)",
  "positionJitterWidth": "Răspândirea punctelor jitter (alegeți o valoare între 0 și 1. Implicit este 0.2)",
  "Facetrow": "Rând facet",
  "Facetcolumn": "Coloană facet",
  "Facetwrap": "Împachetare facet (dacă este ales, orice selecție de rând și coloană facet va fi ignorată)",
  "Facetscale": "Scală facet",
  "label1": "Linii orizontale",
  "plotMeanLineChk": "Plotați o linie orizontală pentru mediana variabilei Y (numerică) selectate",
  "yIntercept": "Introduceți valori de interceptare Y separate prin virgulă pentru liniile orizontale, de ex. 100, 200, 300",
  "hLineColor": "Selectați o culoare pentru linie și etichete (După selectarea culorii, faceți clic în afara controlului pentru a aplica)",
  "lineType": "Selectați tipul de linie",
  "horizontalLinelabel": "Specificați etichete separate prin virgulă (fără ghilimele) pentru liniile orizontale",
  "horizontalLinelabel_angle_text": "Unghiul pentru a înclina textul etichetei liniei orizontale (implicit 0 pentru fără înclinare)",
  "label2": "Notă: Valorile mai mari mută textul mai jos, valorile mai mici mută textul mai sus",
  "addHoriRefLines": "Adăugați linii de referință",
  "xyLimits": "Limitele axelor X și Y",
  "label5": "Specificați un interval pentru valorile axelor X și Y",
  "rangeYValues": "Specificați intervalul axei Y, de ex. 0,100",
  "labelHori_HorizontalJustification": "Notă: valorile mai mari plasează textul la stânga, valorile mai mici mută textul la dreapta",
  "verticalJustification": "Controlați justificarea verticală a etichetei",
  "hori_HorizontalJustification": "Controlați justificarea orizontală a etichetei",
  "addlLabelHlineTextPositionOffset": "Ajustări suplimentare pentru a poziționa textul etichetei pentru liniile orizontale",
  "horiMovementHReflineLabel": "Mută textul orizontal la stânga sau la dreapta - folosiți orice număr cu semn + sau - (lăsați 0 pentru axa Categorială)",
  "nobreaklineHRefLabelandValueChk": "Bifați această casetă pentru a elimina întreruperea liniei între valoarea etichetei și textul etichetei",
  "vertiMovementHReflineLabel": "Mută textul vertical în sus sau în jos - folosiți orice număr cu semn + sau - (lăsați 0 pentru axa Categorială)",
  "facets_lbl": "Facete",
  "help": {
    "title": "Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descriere</b></br>\n        În statisticile descriptive, un box plot sau boxplot este o modalitate convenabilă de a reprezenta grafic grupuri de date numerice prin intermediul quartilelor lor. Box plot-urile pot avea, de asemenea, linii care se extind vertical din cutii (mustăți) indicând variabilitatea dincolo de quartilele superioare și inferioare, de aici termenii box-and-whisker plot și box-and-whisker diagram. Valorile aberante pot fi reprezentate ca puncte individuale. Box și whisker plot-urile sunt uniforme în utilizarea cutiei: partea de jos și partea de sus a cutiei sunt întotdeauna primul și al treilea quartile, iar banda din interiorul cutiei este întotdeauna al doilea quartile (mediana). Mustața superioară se extinde de la balama până la cea mai mare valoare care se află în 1.5 * IQR de balama, unde IQR este intervalul interquartil, sau distanța dintre primul și al treilea quartile. Mustața inferioară se extinde de la balama până la cea mai mică valoare în 1.5 * IQR de balama. Datele dincolo de capetele mustăților sunt valori aberante și sunt reprezentate ca puncte (așa cum este specificat de Tukey).​</br>\n        Facetele pot fi create opțional specificând o variabilă factor. De asemenea, puteți specifica opțional teme și specificați un titlu și etichete pentru axele x și y​</br>\n        Când selectați opțiunea de a plota punctele de date, facem acest lucru folosind geom_dotplot</br>\n        În mod implicit, valorile aberante sunt afișate cu puncte negre, când selectați opțiunea de a arăta valorile aberante (în roșu) prin caseta de selectare, valorile aberante devin mai proeminente.\n        <br/>\n        <b>Utilizare</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumente</b><br/>\n        <ul>\n        <li>\n        data: Setul de date implicit​\n        </li>\n        <li>\n        x: O variabilă factor/categorială care definește gruparea variabilei y​\n        </li>\n        <li>\n        y: O variabilă numerică pentru care se calculează boxplot-ul​\n        </li>\n        <li>\n        fill: O variabilă factor/categorială opțională pentru a grupa suplimentar grupurile existente. Fiecare subgrup va fi afișat într-o culoare distinctă.​\n        </li>\n        <li>\n        aes():    Generați mapări estetice care descriu modul în care variabilele din date sunt mapate pe proprietăți vizuale (estetice) ale geoms.​\n        </li>\n        <li>\n        geom_boxplot(): Creează boxplot-ul. \"Balamele\" superioare și inferioare corespund primelor și celor de-al treilea quartile (percentile 25 și 75).​\n        </li>\n        <li>\n        geom_dotplot: Plotează punctele de date\n        </li>\n        <li>\n        Labs(): Schimbați etichetele axelor și titlurile legendelor (Aceasta este opțional)​\n        </li>\n        <li>\n        facet_grid(): Aranjează panourile într-o grilă (Aceasta este opțional)​\n        </li>\n        <li>\n        theme_calc(): Specifică tema calculatorului (Aceasta este opțional)​\n        </li>\n        <li>\n        coord_flip(): Răsturnați axa (Aceasta este opțional)​\n        </li>\n        <li>\n        notch: Box plot-urile cu decupaj aplică un \"decupaj\" sau o îngustare a cutiei în jurul medianei. Decupajele sunt utile pentru a oferi un ghid aproximativ pentru semnificația diferenței medianelor; dacă decupajele a două cutii nu se suprapun, aceasta oferă dovezi ale unei diferențe semnificative din punct de vedere statistic între mediane. Într-un box plot cu decupaj, decupajele se extind 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tDacă 'Adăugați semnificație (valori p) comparație medie între fiecare pereche de cutii' este selectat, codurile pentru valorile p pe plot sunt următoarele\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tMetodele de ajustare a valorilor P:\n\t\t<br/>\n\t\tMetodele de ajustare a valorilor P includ corecția Bonferroni (\"bonferroni\") în care valorile p sunt înmulțite cu \n\t\tnumărul de comparații. Corecții mai puțin conservatoare sunt incluse și de Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" sau aliasul său \"fdr\"), și Benjamini & Yekutieli (2001) (\"BY\"), \n\t\trespectiv. O opțiune de trecere (\"none\") este, de asemenea, inclusă. Setul de metode este conținut în vectorul p.adjust.methods \n\t\tpentru beneficiul metodelor care trebuie să aibă metoda ca opțiune și să o transmită la p.adjust.\n\t\t<br/>\n\t\t<br />\n\t\tPrimele patru metode sunt concepute pentru a oferi un control puternic al ratei de eroare familiale. Nu pare să existe un motiv pentru a folosi corecția Bonferroni nemodificată, deoarece este dominată de metoda lui Holm, care este, de asemenea, validă sub presupuneri arbitrare.\n\t\t<br/>\n\t\t<br />\n\t\tMetodele lui Hochberg și Hommel sunt valide atunci când testele de ipoteză sunt independente sau când sunt asociate non-negativ \n\t\t(Sarkar, 1998; Sarkar și Chang, 1997). Metoda lui Hommel este mai puternică decât cea a lui Hochberg, dar diferența este de obicei mică \n\t\tși valorile p ale lui Hochberg sunt mai rapide de calculat.\n\t\t<br/>\n\t\t<br />\n\t\tMetodele \"BH\" (aka \"fdr\") și \"BY\" ale lui Benjamini, Hochberg și Yekutieli controlează rata de descoperire falsă, proporția așteptată \n\t\tde descoperiri false printre ipotezele respinse. Rata de descoperire falsă este o condiție mai puțin stringentă decât \n\t\trata de eroare familială, astfel încât aceste metode sunt mai puternice decât celelalte.\n\t\t<br/>\n\t\t<br />\n\t\tVezi de asemenea \n\t\t<br/>\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br/>\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br/>\n\t\t<br />\n        <b>Pachet</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Ajutor</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}