{
  "title": "Diagramă Box Plot",
  "dropna": "Elimină valorile lipsă",
  "navigation": "Diagramă Box Plot",
  "x": "Variabila X, specificați o variabilă de factor",
  "y": "Variabilă(variabile) Y, specificați o variabilă numerică",
  "fill": "Umplere, specificați o variabilă de factor",
  "dataPoints": "Selectați o opțiune pentru a plota punctele de date",
  "alpha": "Opacitate (0-1)",
  "flip": "Răsturnați axa",
  "notch": "Decupaj",
  "outliers": "Arată valori atipice (în roșu)",
  "specify_a_title": "Introduceți un titlu",
  "x_title": "Eticheta axei X",
  "y_title": "Eticheta axei Y",
  "barcolor": "Selectați o culoare pentru liniile din jurul cutiilor (După selectarea culorii, faceți clic în afara controlului pentru a aplica)",
  "Facetrow": "Rând de Facete",
  "Facetcolumn": "Coloană de Facete",
  "Facetwrap": "Împachetare Facete",
  "Facetscale": "Scală de Facete",
  "help": {
    "title": "Diagramă Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descriere</b></br>\n        În statistica descriptivă, un box plot sau diagramă boxplot este o modalitate convenabilă de a reprezenta grafic grupuri de date numerice prin intermediul cuartilelor lor. Diagramele box plot pot avea, de asemenea, linii care se extind vertical din cutii (mustăți) indicând variabilitatea din afara cuartilelor superioare și inferioare, de aici termenii diagramă box-and-whisker. Valorile atipice pot fi reprezentate ca puncte individuale. Diagramele box-and-whisker sunt uniforme în utilizarea cutiei: partea de jos și de sus a cutiei sunt întotdeauna primul și al treilea cuartil, iar banda din interiorul cutiei este întotdeauna al doilea cuartil (mediana). Mustața superioară se extinde de la balama până la cea mai mare valoare care se află în interiorul a 1.5 * IQR de balama, unde IQR este intervalul intercuartilic, sau distanța dintre primul și al treilea cuartil. Mustața inferioară se extinde de la balama până la cea mai mică valoare în interiorul a 1.5 * IQR de balama. Datele dincolo de capătul mustăților sunt valori atipice și sunt reprezentate ca puncte (așa cum specifică Tukey).​</br>\n        Facetele pot fi create opțional specificând o variabilă de factor. De asemenea, puteți specifica opțional teme și specifica un titlu și etichete pentru axele x și y​</br>\n        Când selectați opțiunea de a plota punctele de date, facem acest lucru folosind geom_dotplot</br>\n        În mod implicit, valorile atipice sunt afișate cu puncte negre, când selectați opțiunea de a arăta valori atipice (în roșu) prin caseta de selectare, valorile atipice devin mai proeminente.\n        <br/>\n        <b>Utilizare</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumente</b><br/>\n        <ul>\n        <li>\n        data: Setul de date implicit​\n        </li>\n        <li>\n        x: O variabilă de factor/categorială care definește gruparea variabilei y​\n        </li>\n        <li>\n        y: O variabilă numerică pentru care se calculează boxplotul​\n        </li>\n        <li>\n        fill: O variabilă de factor/categorială opțională pentru a grupa și mai mult grupurile existente. Fiecare subgrup va fi arătat într-o culoare distinctă.​\n        </li>\n        <li>\n        aes():    Generează mapări estetice care descriu modul în care variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geoms.​\n        </li>\n        <li>\n        geom_boxplot():Creează boxplotul. \"Balamele\" superioare și inferioare corespund primelor și celor de-al treilea cuartil (percentilele 25 și 75).​\n        </li>\n        <li>\n        geom_dotplot: Reprezintă punctele de date\n        </li>\n        <li>\n        Labs(): Schimbă etichetele axelor și titlurile legendelor (aceasta este opțional)​\n        </li>\n        <li>\n        facet_grid(): Aranjează panourile într-o grilă (aceasta este opțional)​\n        </li>\n        <li>\n        theme_calc(): Specifică tema calculatorului (aceasta este opțional)​\n        </li>\n        <li>\n        coord_flip(): Răsturnați axa (aceasta este opțional)​\n        </li>\n        <li>\n        notch: Diagramele de box cu decupaj aplică un \"decupaj\" sau îngustare a cutiei în jurul mediei. Decupajele sunt utile pentru a oferi o ghidare aproximativă asupra semnificației diferenței medianelor; dacă decupajele a două cutii nu se suprapun, aceasta oferă dovezi ale unei diferențe statistic semnificative între mediane. Într-o diagramă de box cu decupaj, decupajele se extind 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n        <b>Pachet</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Ajutor</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}