{
  "title": "Coeficientul de Corelație de Concordanță, evaluatori multipli",
  "navigation": "Coeficientul de Corelație de Concordanță, evaluatori multipli",
  "ratervars": "Variabilele Evaluatorului, cel puțin 2",
  "cilevel": "Nivel de Încredere:",
  "bootsamp": "Numărul de mostre bootstrap",
  "plotoptionslabel": "Opțiuni de Grafic",
  "plotchkbox": "Grafice de dispersie pentru toate perechile de evaluatori",
  "plottitle": "Titlu",
  "varlabels": "Etichete pentru Variabile (dacă sunt utilizate, trebuie specificate etichete pentru toate variabilele, în ordine, ca 'eticheta 1', 'eticheta 2', etc.)",
  "plottheme": "Tema Graficului",
  "help": {
    "title": "Coeficientul de Corelație de Concordanță, evaluatori multipli",
    "r_help": "help(epi.occc,package=epiR)",
    "body": "\nCoeficientul de corelație de concordanță (CCC) măsoară acordul între observatori care măsoară aceleași subiecte pe aceeași scară pentru date continue. CCC poate varia între \n-1 și 1, 1 fiind un acord perfect și 0 fiind fără acord. Valorile negative indică un acord negativ, dar acest lucru este rar în practică. CCC-ul general și CCC-urile pereche \n(toate perechile de evaluatori) sunt calculate cu intervale de încredere bootstrap percentil și intervale de încredere bootstrap percentil ajustate. Orice observație cu o valoare lipsă pentru variabilele evaluatorului specificate este eliminată din analiză.\n<br/><br/>\n<b>Variabilele Evaluatorului:</b> Variabile care conțin valorile furnizate de observatori; trebuie să fie numerice\n<br/>\n<b>Nivelul Intervalului de Încredere:</b> Nivelul dorit al intervalului de încredere pentru CCC\n<br/>\n<b>Numărul de mostre bootstrap:</b> Numărul dorit de mostre bootstrap de extras din datele originale pentru a calcula intervalele de încredere. Se recomandă cel puțin 1000, \nîn cazul în care este practic fezabil.\n<br/>\n<b>Grafice de dispersie pentru toate perechile de evaluatori:</b> Opțiune de a crea grafice de dispersie pentru toate perechile de evaluatori într-un format de matrice.   \n<br/><br/>\n<b>Pachete R necesare:</b> epiR, boot, GGally, ggthemes\n                "
  }
}