{
  "title": "Riscuri Competing, compară grupuri",
  "navigation": "Riscuri Competing, compară grupuri",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (0 = cenzură, 1 = eveniment 1, 2 = eveniment 2, ...)",
  "groupvarlabel": "Grup",
  "eventnum": "Cod Eveniment",
  "singleeventchkbox": "Plotează pentru un Singur Eveniment",
  "printallest": "Tabel de Estimări Incluzând Toate Timpurile",
  "printspecest": "Tabel de Estimări pentru Timpuri Specifice",
  "spectimes": "Specificați timpi ca time1, time2, time3, etc. sau ca seq(1,5,by=1)",
  "styleoptions": "Opțiuni de Stil",
  "axisoptions": "Opțiuni de Axă",
  "titleboxall": "Titlu Grafic (grafice pentru toate evenimentele)",
  "titleboxsingle": "Titlu Grafic (grafic pentru un singur eveniment)",
  "plottitlesizelabel": "Dimensiune Titlu Grafic (5-50)",
  "themedropdown": "Tema Graficului",
  "label1": "Legendă",
  "legendpos": "Poziție",
  "keywidthlabel": "Lățime Cheie (cm; grafic combinat doar)",
  "legendeventslabel": "Evenimente",
  "legendtitle": "Titlu",
  "eventlabels": "Etichete (specificați etichete separate prin virgule în ordinea codurilor de eveniment: de exemplu, 'Eveniment 1', 'Eveniment 2', etc; nu cod de cenzură)",
  "legendgroupslabel": "Grupuri",
  "grouplabels": "Etichete (specificați etichete separate prin virgule în ordinea grupurilor: de exemplu, 'Grup 1', 'Grup 2', etc.)",
  "legendfontsize": "Dimensiune Etichete Legendă (5-50)",
  "wraplabelfontsize": "Dimensiune Etichetă Eveniment pentru Grafic pe Eveniment (5-50)",
  "label2": "Număr în Risc",
  "natriskchkbox": "Includeți Numărul în Risc",
  "risktableprop": "Înălțimea Tabelului de Risc (0-1)",
  "risktablevaluesize": "Dimensiune Valoare Tabel de Risc (1-15)",
  "risktabletitlesize": "Dimensiune Titlu Tabel de Risc (5-50)",
  "risktableaxislabelsize": "Dimensiune Etichetă Axă Tabel de Risc (5-50)",
  "risktableticklabelsize": "Dimensiune Etichetă Marcă Axă Tabel de Risc (5-50)",
  "risktableclean": "Eliminați Axe și Linii de Grilă din Tabelul de Risc",
  "label3": "Opțiuni Linie",
  "linesize": "Dimensiune (0-5)",
  "colorpalette": "Paletă de Culori",
  "label4": "Interval de Încredere",
  "cichkbox": "Includeți IC de 95%",
  "labelblank": "",
  "cistyle": "Stil",
  "citransparency": "Transparență (0-1)",
  "censorlabel": "Timpi Cenzurați",
  "censorchkbox": "Includeți Timpi Cenzurați",
  "censorsize": "Dimensiune (0-10)",
  "pvaluelabel": "Valoare P (grafic pentru un singur eveniment doar)",
  "pvaluechkbox": "Includeți valoare p",
  "pvaluelocationx": "Locație Axă X (Timp)",
  "pvaluelocationy": "Locație Axă Y (Probabilitate)",
  "pvaluesize": "Dimensiune (1-20)",
  "pvalueaccuracy": "Precizie (0-1)",
  "label5": "Axă de Incidență",
  "incaxislabelall": "Etichetă (grafice pentru toate evenimentele)",
  "incaxislabelsingle": "Etichetă (grafic pentru un singur eveniment)",
  "label6": "Scară",
  "defbutton": "proporție",
  "pctbutton": "procent",
  "label7": "Limite Axă și Incrementuri Marcă Ticks (0-1)",
  "incaxismin": "Minim",
  "incaxismax": "Maxim",
  "incaxisinc": "Increment",
  "label8": "Axă de Timp",
  "timeaxislabel": "Etichetă",
  "label9": "Limite Axă și Incrementuri Marcă Ticks",
  "timeaxismin": "Minim",
  "timeaxismax": "Maxim",
  "timeaxisinc": "Increment",
  "label10": "Notă: Maximul poate fi specificat fără ca Incrementul să fie specificat. Incrementul nu poate fi specificat fără ca Maximul să fie specificat.",
  "axislabelsize": "Dimensiune Etichetă Axă (5-50)",
  "ticklabelsize": "Dimensiune Etichetă Marcă Axă (5-50)",
  "help": {
    "title": "Riscuri Competing, Compară Grupuri",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n            <br/>\n            Un risc competitiv este un eveniment a cărui apariție împiedică apariția evenimentului primar de interes. Efectuarea unei analize standard Kaplan-Meier în astfel de cazuri este părtinitoare și supraestimează riscul de eveniment. Acest dialog este utilizat pentru a estima riscul cumulativ de a avea evenimentul primar după începutul urmăririi pentru acel eveniment (sau timp zero), atunci când unul sau mai multe riscuri competitive sunt prezente. Suma incidențelor cumulative pentru fiecare eveniment este egală cu incidența cumulativă pentru orice eveniment. Subiecții trebuie să fie în risc pentru toate evenimentele începând de la timpul zero. Graficele de incidență cumulativă pentru toate evenimentele (curbe separate pentru fiecare eveniment pe același grafic), și opțional pentru un eveniment specific de unul singur, sunt furnizate. \n            <br/>\n            O introducere în subiectul riscurilor competitive poate fi găsită în \"Introducerea în Analiza Datelor de Supraviețuire în Prezența Riscurilor Competitive\" de Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Timp până la eveniment sau cenzură:</b> Pentru fiecare subiect, lungimea timpului până la primul eveniment, dacă a avut loc un eveniment, sau ultimul follow-up pentru evenimente, dacă nu au avut loc evenimente.\n            <br/><br/>\n            <b>Evenimente:</b> Indicator numeric al evenimentului care a avut loc (1=eveniment 1, 2=eveniment 2, etc.) sau când nu au avut loc evenimente (0=cenzură) pentru fiecare subiect\n            <br/><br/>\n            <b>Plotează pentru un Singur Eveniment:</b> Dacă doriți să plotați incidența cumulativă pentru un eveniment specific de unul singur. <b>Codul Evenimentului</b> corespunde evenimentului care va fi plottat.\n            <br/><br/>\n            <b>Tabel de Estimări Incluzând Toate Timpurile:</b> Opțiune de a include un tabel care listează probabilitățile de incidență cumulativă și intervalele de încredere de 95% pentru fiecare timp observat în setul de date\n            <br/>\n            <br/>\n\t\t\t<b>Tabel de Estimări pentru Timpuri Specifice:</b> Opțiune de a include un tabel care are probabilitățile de incidență cumulativă pentru un set de timp selectat de utilizator.\n\t\t\t<br/><br/>\n\t\t\t<b>Specificați timpi ca time1, time2, time3, etc. sau ca seq(1,5,by=1):</b> Aceștia sunt timpii specifici care vor fi incluși în tabel pentru timpi specifici. Pot fi specificați individual cu virgule, sau ca o secvență de valori uniform distribuite.\n\t\t\t<br/><br/>\t\t\t\n            Tabelele sunt generate cu dimensiunea eșantionului, numărul de subiecți cu fiecare eveniment, timpul mediu restricționat în stare și timpul mediu de urmărire. Timpul mediu de urmărire este calculat folosind estimarea Kaplan-Meier inversă, care tratează evenimentele adevărate ca observații cenzurate și observațiile cenzurate adevărate ca evenimente. Astfel, \"evenimentul\" în acest estimator este \"urmărirea subiecților atât timp cât studiul ar putea\".\n            <br/>\n            O tabelă de estimări de incidență cumulativă este furnizată la fiecare timp observat în setul de date, cu intervale de încredere de 95%. \n            <br/>\n            <br/>\n            <b>Pachete R Necesare:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>Opțiuni de Stil</b>\n            <br/>\n            <br/>\n            <b>Titlu Grafic (grafice pentru toate evenimentele):</b> Titlul graficelor care afișează toate evenimentele; ștergeți tot textul pentru a nu avea titlu\n            <br/><br/>\n            <b>Titlu Grafic (grafic pentru un singur eveniment):</b> Titlul graficului care afișează evenimentul selectat; ștergeți tot textul pentru a nu avea titlu\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiune Titlu Grafic:</b> Dimensiunea titlurilor graficelor.\n\t\t\t<br/><br/>\n            <b>Tema Graficului:</b> Stilul general al graficului\n            <br/><br/>\n            <b>Opțiuni de Legendă:</b>\n            <br/>\n            Opțiunea <b>Poziție</b> controlează locația legendei (sus, jos, stânga, dreapta). <b>Lățimea Cheii</b> este utilizată pentru a schimba lățimea cheilor legendei în graficul care combină toate evenimentele și toate grupurile. Acest lucru poate fi folosit pentru a face tipurile de linii mai lizibile în legendă.\n\t\t\t<b>Titlu Eveniment</b> este titlul pentru partea legendei care delimitează evenimentele. <b>Titlu Grup</b> este titlul pentru partea legendei care delimitează grupurile. Ștergeți textul dacă nu se dorește un titlu. <b>Etichetele Evenimentelor</b> sunt utilizate pentru a arăta text pentru fiecare cod numeric de eveniment în loc de coduri. <b>Etichetele Grupurilor</b> sunt utilizate pentru a schimba textul pentru grupuri. Dacă specificați orice etichete, toate etichetele trebuie să fie specificate.\n\t\t\tOpțiunea <b>Dimensiune Etichete Legendă</b> controlează dimensiunea tuturor textelor conținute în legendă.\n\t\t\tOpțiunea <b>Dimensiune Etichetă Eveniment pentru Grafic pe Eveniment</b> controlează dimensiunea textului numelui evenimentului în graficul care se împarte pe tip de eveniment.\n            <br/>\n            <br/>\n            <b>Număr în Risc:</b>\n\t\t\t<br/>\n\t\t\tOpțional, includeți un tabel pentru numărul de subiecți care sunt încă în risc în timp în partea de jos a graficelor. Acest lucru nu este furnizat pentru graficul care se împarte pe eveniment din motive de spațiu și lizibilitate. <b>Înălțimea Tabelului de Risc</b> controlează proporția zonei de graficare pe care tabelul o va ocupa.\n\t\t\t<b>Dimensiunea Valorii Tabelului de Risc</b> controlează dimensiunea numerelor în risc. <b>Dimensiunea Titlului Tabelului de Risc</b> controlează dimensiunea titlului pentru tabelul numărului în risc.\n\t\t\t<b>Dimensiunea Etichetei Axei Tabelului de Risc</b> controlează dimensiunea etichetelor axelor. \n\t\t\t<b>Dimensiunea Etichetei Mărcii Axei Tabelului de Risc</b> controlează dimensiunea etichetelor mărcii de ticks. Dacă se dorește eliminarea tuturor axelor și liniilor de grilă \n\t\t\tdin tabelul numărului în risc, opțiunea <b>Eliminați Axe și Linii de Grilă din Tabelul de Risc</b> poate fi bifată. Aceasta va include doar numerele în risc în tabel.           \n            <br/><br/>\n            <b>Opțiuni de Linie:</b>\n            <br/>\n            <b>Dimensiune</b> controlează grosimea. Opțiunea <b>Paleta de Culori</b> controlează paleta de culori utilizată pentru liniile din toate graficele. Schemele de culori care imită revistele științifice sunt de asemenea furnizate. Se poate include opțional un interval de încredere de 95% pentru estimări în format <b>ribbon</b> (zonă umbrită) sau <b>step</b> (linie). <b>Transparența</b> controlează cât de întunecată este panglica și este ignorată atunci când este selectată opțiunea pas.\n\t\t\t<br/><br/>\n\t\t\t<b>Includeți Timpi Cenzurați:</b> Timpii cenzurați (când subiecții nu mai sunt în risc pentru evenimente) pot fi incluși ca semne plus pe linii. Acest lucru este mai util în seturi de date mai mici sau în cazuri de număr mai mic de subiecți cenzurați. Nu sunt furnizate în graficul care suprapune toate evenimentele și grupurile din motive de lizibilitate.\n\t\t\t<b>Dimensiune</b> controlează dimensiunea semnelor plus de timp cenzurat.\n\t\t\t<br/><br/>\n\t\t\t<b>Includeți valoare p</b> poate fi utilizat pentru a include valoarea p a testului Gray pentru evenimentul selectat în graficul de un singur eveniment. <b>Locația pe Axă X (Timp)</b> și <b>Locația pe Axă Y (Probabilitate)</b> oferă coordonatele (X, Y) ale valorii p în grafic.\n\t\t\t<b>Dimensiune</b> controlează dimensiunea valorii p în grafic. <b>Precizie</b> controlează precizia valorii p. De exemplu, valoarea implicită de 0.0001 ar afișa valori p nu mai mici de 0.0001. Orice valoare p mai mică de 0.0001 ar fi afișată ca \"p<0.0001\". \n            <br/><br/><br/>\n\t\t\t<b>Opțiuni de Axă</b>\n            <br/>\n            <br/>\n            Opțiunile <b>Etichetă</b> specifică eticheta de text pentru axă. Opțiunile <b>Limite Axă</b> specifică valorile minime și maxime ale axei. Opțiunea <b>Incrementuri Marcă Ticks</b> controlează distanțarea marcajelor de ticks pe axă. Incrementurile pe axa de timp controlează de asemenea timpii pentru tabelul opțional de număr în risc.\n            <br/>\n            Opțiunea <b>Scară</b> a axei de incidență specifică dacă doriți ca estimările să fie pe o scară de proporție (0-1) sau procent (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiune Etichetă Axă:</b>  Aceasta controlează dimensiunea atât a etichetelor axei de incidență, cât și a etichetelor axei de timp.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiune Etichetă Marcă Axă:</b>  Aceasta controlează dimensiunea atât a etichetelor mărcii axei de incidență, cât și a etichetelor mărcii axei de timp.\n"
  }
}