{
    "title": "Calculează valorile variabilelor modelului pentru a atinge răspunsul țintă",
    "navigation": "Calculează răspunsul țintă",
    "label100": "Acest dialog calculează variabilele modelului pentru a atinge valoarea răspunsului țintă al modelului\nNotă: Dacă există vreo variabilă non-numerică în modelul selectat,\n         calculul răspunsului țintă va dura mai mult timp",
    "modelSelection": "Selectați un model pentru a calcula valorile optime ale variabilelor",
    "targetResponse": "Specificați valoarea răspunsului țintă (numeric) dorită pentru modelul selectat",
    "targetResponseLower": "(Opțional) Specificați valoarea inferioară a răspunsului țintă (numeric) dorită pentru modelul selectat",
    "targetResponseUpper": "(Opțional) Specificați valoarea superioară a răspunsului țintă (numeric) dorită pentru modelul selectat",
    "label200": "Constrângeri pentru optimizarea răspunsului țintă",
    "label12": "Variabilele (factori) din modelul selectat sunt listate mai jos în aceeași ordine în care apar în model",
    "factorConstraintUseDatasetLowerChk": "Constrângeri pentru limita inferioară: Dacă este bifat, valoarea minimă (doar pentru variabilele numerice) a fiecărei variabile utilizate în model va fi folosită pentru limita inferioară",
    "factorConstraintLower": "Constrângeri pentru limita inferioară: (Ignorat dacă este bifat mai sus) Lăsați gol pentru a nu avea constrângeri asupra limitei inferioare pentru valorile variabilelor modelului (adică factori). În caz contrar, trebuie să tastați valori separate prin virgulă pentru fiecare variabilă a modelului. Dacă o anumită variabilă a modelului nu are limită inferioară, tastați -Inf, de exemplu, 0, 0.1, -Inf, 20",
    "factorConstraintUseDatasetUpperChk": "Constrângeri pentru limita superioară: Dacă este bifat, valoarea maximă (doar pentru variabilele numerice) a fiecărei variabile utilizate în model va fi folosită pentru limita superioară",
    "factorConstraintUpper": "Constrângeri pentru limita superioară: (Ignorat dacă este bifat mai sus) Lăsați gol pentru a nu avea constrângeri asupra limitei superioare pentru valorile variabilelor modelului (adică factori). În caz contrar, trebuie să tastați valori separate prin virgulă pentru fiecare variabilă a modelului. Dacă o anumită variabilă a modelului nu are limită superioară, tastați Inf, de exemplu, 0, 0.2, 0.9, Inf",
    "factorInitalValues": "Valori inițiale: Lăsați gol pentru ca sistemul să aleagă valorile inițiale pentru variabilele modelului (doar pentru variabilele numerice) (implicit: toate zero). În caz contrar, trebuie să tastați valori separate prin virgulă pentru fiecare variabilă a modelului, de exemplu, 0, 0, 0, 0",
    "confidenceLevel": "Nivel de încredere",
    "showModelEquationChk": "Arată ecuația modelului (dacă modelul conține variabile categorice, ecuația s-ar putea să nu fie afișată)",
    "help": {
      "title": "Calculează valorile variabilelor modelului (factori) pentru răspunsul țintă pentru modelul selectat",
      "r_help": "help(optim, package = 'stats')",
      "body": "\n        "
    }
}