{
  "title": "Riscuri Competitoare, un grup",
  "navigation": "Riscuri Competitoare, un grup",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (0 = cenzură, 1 = eveniment 1, 2 = eveniment 2, ...)",
  "eventnum": "Cod Eveniment",
  "singleeventchkbox": "Graficați pentru un Singur Eveniment",
  "printallest": "Tabel de Estimări Incluzând Toate Timpurile",
  "printspecest": "Tabel de Estimări pentru Timpuri Specifice",
  "spectimes": "Specificați timpi ca timp1, timp2, timp3, etc. sau ca seq(1,5,by=1)",
  "styleoptions": "Opțiuni de Stil",
  "axisoptions": "Opțiuni de Axă",
  "label12": "Faceți clic pe butonul ? din colțul din dreapta sus al dialogului pentru detalii despre seturi de date de probă și formatul de date acceptat.",
  "titleboxall": "Titlul Graficului (grafic pentru toate evenimentele)",
  "titleboxsingle": "Titlul Graficului (grafic pentru un singur eveniment)",
  "plottitlesizelabel": "Dimensiunea Titlului Graficului (5-50)",
  "themedropdown": "Tema Graficului",
  "label1": "Legendă (grafic pentru toate evenimentele)",
  "legendpos": "Poziție",
  "legendtitle": "Titlu",
  "eventlabels": "Etichete Eveniment (specificați etichete separate prin virgule în ordinea codurilor de eveniment: de exemplu, 'Eveniment 1', 'Eveniment 2', etc; nu cod de cenzură)",
  "legendfontsize": "Dimensiunea Etichetelor Legendei (5-50)",
  "label2": "Număr în Risc",
  "natriskchkbox": "Includeți Numărul în Risc",
  "risktableprop": "Înălțimea Tabelului de Risc (0-1)",
  "risktablevaluesize": "Dimensiunea Valorii Tabelului de Risc (1-15)",
  "risktabletitlesize": "Dimensiunea Titlului Tabelului de Risc (5-50)",
  "risktableaxislabelsize": "Dimensiunea Etichetei Axei Tabelului de Risc (5-50)",
  "risktableticklabelsize": "Dimensiunea Etichetei de Marcaj a Axei Tabelului de Risc (5-50)",
  "risktableclean": "Eliminați Axe și Linii de Grilă din Tabelul de Risc",
  "label3": "Opțiuni de Linie",
  "linesize": "Dimensiune (0-5)",
  "colorpalette": "Paletă de Culori (grafic pentru toate evenimentele)",
  "linecolor": "Culoare (grafic pentru un singur eveniment)",
  "label4": "Interval de Încredere",
  "cichkbox": "includeți IC de 95%",
  "labelblank": "",
  "cistyle": "Stil",
  "citransparency": "Transparență (0-1)",
  "censorchkbox": "Includeți Timpuri Cenzurate",
  "label5": "Axa de Incidență",
  "incaxislabelall": "Etichetă (grafic pentru toate evenimentele)",
  "incaxislabelsingle": "Etichetă (grafic pentru un singur eveniment)",
  "label6": "Scară",
  "defbutton": "proporție",
  "pctbutton": "procent",
  "label7": "Limite de Axă și Incremente de Marcaj (0-1)",
  "incaxismin": "Minim",
  "incaxismax": "Maxim",
  "incaxisinc": "Increment",
  "label8": "Axa de Timp",
  "timeaxislabel": "Etichetă",
  "label9": "Limite de Axă și Incremente de Marcaj",
  "timeaxismin": "Minim",
  "timeaxismax": "Maxim",
  "timeaxisinc": "Increment",
  "label10": "Notă: Maximul poate fi specificat fără a specifica Incrementul. Incrementul nu poate fi specificat fără a specifica Maximul.",
  "axislabelsize": "Dimensiunea Etichetei Axei (5-50)",
  "ticklabelsize": "Dimensiunea Etichetei de Marcaj a Axei (5-50)",
  "help": {
    "title": "Riscuri Competitoare, Un Grup",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n\t\t\tVedeți setul de date de probă în directorul de instalare, locația implicită este pe litera unității:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\melanoma_upd.RData. Variabila timp trebuie introdusă ca timpul până la eveniment sau cenzură, iar variabila moarte trebuie introdusă ca Evenimente.<br/>\t\t\t\n            Acest set de date este o versiune actualizată a setului de date melanoma din pachetul MASS.\n            <br/>\n            <br/>\n            Un risc competitiv este un eveniment a cărui apariție exclude apariția evenimentului primar de interes. Efectuarea unei analize standard Kaplan-Meier în astfel de cazuri este părtinitoare și supraestimează riscul de eveniment. Acest dialog este utilizat pentru a estima riscul cumulativ de a avea evenimentul primar după începutul urmăririi pentru acel eveniment (sau timp zero), atunci când unul sau mai multe riscuri competitive sunt prezente. Suma incidențelor cumulative pentru fiecare eveniment este egală cu incidența cumulativă pentru orice eveniment. Subiecții trebuie să fie în risc pentru toate evenimentele începând de la timpul zero. Graficele de incidență cumulativă pentru toate evenimentele (curbe separate pentru fiecare eveniment pe același grafic), și opțional pentru un eveniment specific de unul singur, sunt furnizate. \n            <br/>\n            O introducere în subiectul riscurilor competitive poate fi găsită în \"Introducerea în Analiza Datelor de Supraviețuire în Prezența Riscurilor Competitive\" de Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Timp până la eveniment sau cenzură:</b> Pentru fiecare subiect, lungimea timpului până la primul eveniment, dacă a avut loc un eveniment, sau ultimul follow-up pentru evenimente, dacă nu au avut loc evenimente.\n            <br/><br/>\n            <b>Evenimente:</b> Indicator numeric al evenimentului care a avut loc (1=eveniment 1, 2=eveniment 2, etc.) sau când nu au avut loc evenimente (0=cenzură) pentru fiecare subiect\n            <br/><br/>\n            <b>Graficați pentru un Singur Eveniment:</b> Dacă doriți să graficați incidența cumulativă pentru un eveniment specific de unul singur. <b>Codul Evenimentului</b> corespunde evenimentului care va fi graficat.\n            <br/><br/>\n            <b>Tabel de Estimări Incluzând Toate Timpurile:</b> Opțiune de a include un tabel care listează probabilitățile de incidență cumulativă și intervalele de încredere de 95% pentru fiecare timp observat în setul de date\n            <br/>\n            <br/>\n\t\t\t<b>Tabel de Estimări pentru Timpuri Specifice:</b> Opțiune de a include un tabel care are probabilitățile de estimare a supraviețuirii pentru un set de timp selectat de utilizator.\n\t\t\t<br/><br/>\n\t\t\t<b>Specificați timpi ca timp1, timp2, timp3, etc. sau ca seq(1,5,by=1):</b> Aceștia sunt timpii specifici care vor fi incluși în tabel pentru timpi specifici. Pot fi specificați individual cu virgule, sau ca o secvență de valori uniform distribuite.\n\t\t\t<br/><br/>\n            Tabelele sunt generate cu dimensiunea eșantionului, numărul de subiecți cu fiecare eveniment, timpul mediu restricționat în stare și timpul mediu de urmărire. Timpul mediu de urmărire este calculat folosind estimarea Kaplan-Meier inversă, care tratează evenimentele adevărate ca observații cenzurate și observațiile cenzurate adevărate ca evenimente. Astfel, \"evenimentul\" în acest estimator este \"urmărirea subiecților cât mai mult timp posibil\".\n            <br/>\n            Un tabel de estimări de incidență cumulativă este furnizat la fiecare timp observat în setul de date, cu intervale de încredere de 95%. \n            <br/>\n            <br/>\n            <b>Pachete R Necesare:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n            <br/>\n            <br/>\n            <br/>\n            <b>Opțiuni de Stil</b>\n            <br/>\n            <br/>\n            <b>Titlu Grafic (grafic pentru toate evenimentele):</b> Titlul graficului care afișează toate evenimentele; ștergeți tot textul pentru a nu avea titlu\n            <br/><br/>\n            <b>Titlu Grafic (grafic pentru un singur eveniment):</b> Titlul graficului care afișează evenimentul selectat; ștergeți tot textul pentru a nu avea titlu\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Titlului Graficului:</b> Dimensiunea titlurilor graficului.\n\t\t\t<br/><br/>\n            <b>Tema Graficului:</b> Stilul general al graficului\n            <br/><br/>\n            <b>Opțiuni de Legendă:</b>\n            <br/>\n            Opțiunea <b>Poziție</b> controlează locația legendei (sus, jos, stânga, dreapta). <b>Titlul</b> este titlul legendei. Pentru a elimina titlul, eliminați tot textul din caseta de text. <b>Etichetele Evenimentelor</b> sunt folosite pentru a arăta text pentru fiecare cod de eveniment numeric în loc de coduri. Dacă specificați orice etichete, toate evenimentele trebuie să fie etichetate.\n\t\t\tOpțiunea <b>Dimensiunea Etichetelor Legendei</b> controlează dimensiunea tuturor textelor conținute în legendă.\n            <br/>\n            <br/>\n            <b>Număr în Risc:</b>\n\t\t\t<br/>\n\t\t\tOpțional, includeți un tabel pentru numărul de subiecți care sunt încă în risc de-a lungul timpului în partea de jos a graficelor. <b>Înălțimea Tabelului de Risc</b> controlează proporția zonei de graficare pe care o va ocupa tabelul.\n\t\t\t<b>Dimensiunea Valorii Tabelului de Risc</b> controlează dimensiunea numerelor în risc. <b>Dimensiunea Titlului Tabelului de Risc</b> controlează dimensiunea titlului pentru tabelul numărului în risc.\n\t\t\t<b>Dimensiunea Etichetei Axei Tabelului de Risc</b> controlează dimensiunea etichetelor axelor. \n\t\t\t<b>Dimensiunea Etichetei de Marcaj a Axei Tabelului de Risc</b> controlează dimensiunea etichetelor de marcaj. Dacă doriți să eliminați toate axele și liniile de grilă \n\t\t\tdin tabelul numărului în risc, opțiunea <b>Eliminați Axe și Linii de Grilă din Tabelul de Risc</b> poate fi bifată. Aceasta va include doar numerele în risc în tabel.           \n            <br/><br/>\n            <b>Opțiuni de Linie:</b>\n            <br/>\n            <b>Dimensiune</b> controlează grosimea. Opțiunile de <b>Culoare</b> controlează paleta de culori utilizată pentru liniile din graficul tuturor evenimentelor și culoarea liniei din graficul unui singur eveniment. Se oferă, de asemenea, scheme de culori care imită revistele științifice. Se poate include opțional un interval de încredere de 95% pentru estimări în format <b>ribbon</b> (zonă umbrită) sau <b>step</b> (linie). <b>Transparența</b> controlează cât de întunecată este banda și este ignorată atunci când se selectează opțiunea pas.\n\t\t\t<br/><br/>\n\t\t\t<b>Includeți Timpuri Cenzurate:</b> Timpurile cenzurate (când subiecții nu mai sunt în risc pentru evenimente) pot fi incluse ca o linie lângă axa de timp a ambelor grafice. Acest lucru este mai util în seturi de date mai mici sau în cazuri cu un număr mai mic de subiecți cenzurați.\n            <br/><br/><br/>\n\t\t\t<b>Opțiuni de Axă</b>\n            <br/>\n            <br/>\n            Opțiunea <b>Etichetă</b> specifică eticheta de text pentru axă. <b>Limitele Axei</b> specifică valorile minime și maxime ale axei. Opțiunea <b>Incremente de Marcaj</b> controlează distanțarea marcajelor pe axă. Incrementele de pe axa de timp controlează, de asemenea, timpii pentru tabelul opțional de număr în risc.\n            <br/>\n            Opțiunea <b>Scară</b> a axei de incidență specifică dacă doriți ca estimările să fie pe o scară de proporție (0-1) sau procent (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Etichetei Axei:</b> Aceasta controlează dimensiunea etichetelor axelor de incidență și timp.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Etichetei de Marcaj a Axei:</b> Aceasta controlează dimensiunea etichetelor de marcaj ale axelor de incidență și timp.\t\t\t\t\n      "
  }
}