{
  "title": "Convertiți variabilele de caractere în dată și oră",
  "navigation": "Caracter în dată și oră",
  "label1": "Selectați un sufix sau un prefix pentru variabilele convertite",
  "suffix": "Sufix",
  "prefix": "Prefix",
  "prefixOrSuffix": "Introduceți un prefix sau sufix",
  "Destination": "Selectați variabilele de caractere de convertit în dată",
  "DateFormat": "Selectați formatul șirului de caractere",
  "TimeZone": "Selectați un fus orar (implicit - nimic selectat este fusul orar local al PC-ului)",
  "help": {
    "title": "Convertiți caractere în dată",
    "r_help": "help(strptime, package=\"base\")",
    "body": "\n<b>Descriere</b></br>\nConvertește un caracter într-o dată (clasa POSIXct). Trebuie să specificați formatul datei stocate într-un șir de caractere.\nFuncția de mai sus apelează intern strptime în pachetul de bază. Am extins strftime pentru a suporta mai multe variabile.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nBSkystrptime <-function (varNames = \"\", dateFormat = \"\", timezone = \"\", prefixOrSuffix = \"suffix\", \n    prefixOrSuffixValue = \"\", data = \"\") \n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndataset: Numele setului de date ca șir de caractere.\n</li>\n<li>\nvarNames: Numele variabilelor de clasă caracter care trebuie convertite în dată (clasa POSIXct)\n</li>\n<li>\ndateFormat: Un șir de caractere. Valoarea implicită pentru metodele de format este \"%Y-%m-%d %H:%M:%S\" dacă orice element are o componentă de timp care nu este miezul nopții, și \"%Y-%m-%d\" în caz contrar. Dacă options(\"digits.secs\") este setat, se vor imprima până la numărul specificat de cifre pentru secunde\n</li>\n<li>\nzonă: Un șir de caractere care specifică fusul orar care va fi utilizat pentru conversie. Specific pentru sistem (vezi as.POSIXlt), dar \"\" este fusul orar curent, iar \"GMT\" este UTC. Valorile invalide sunt tratate de obicei ca UTC, pe unele platforme cu un avertisment.\n</li>\n<li>\nprefixOrSuffix: Specifică un prefix sau sufix pentru variabilele convertite de clasă POSIXct. Acceptă fie c(\"prefix\"), fie c(\"sufix\"). Variabilele noi care sunt create cu acest prefix/sufix la numele variabilei originale.\n</li>\n<li>\nprefixOrSuffixValue = Un vector de caractere care specifică numele prefixului sau sufixului de utilizat.\n</li>\n</ul>\n<b>Pachet</b></br>\nbază</br>\n<b>Ajutor</b></br>\nhelp(strptime)\n"
  }
}