{
  "title": "Convertiți Variabilele de Dată în Caracter",
  "navigation": "Dată în Caracter",
  "label1": "Selectați un sufix sau un prefix pentru variabilele convertite",
  "suffix": "Sufix",
  "prefix": "Prefix",
  "prefixOrSuffix": "Introduceți un prefix sau un sufix",
  "Destination": "Selectați variabilele de dată care trebuie convertite în caractere",
  "DateFormat": "Selectați formatul datei pentru conversie",
  "TimeZone": "Selectați un fus orar (implicit - nimic selectat este fusul orar local al PC-ului)",
  "help": {
    "title": "Convertiți Data în Caracter",
    "r_help": "help(strftime, package=\"base\")",
    "body": "\n<b>Descriere</b></br>\nConvertește data (posixct și clasa datei) în caracter - pentru a controla formatul în care este afișată data. Specificați ca intrare formatul în care trebuie generată șirul, adică an/lună/zi sau lună-zi=an etc.\nFuncția de mai sus apelează intern strftime în pachetul de bază. Am extins strftime pentru a suporta variabile multiple.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nBSkystrftime <-function (varNames = \"\", dateFormat = \"\", timezone = \"\", prefixOrSuffix = \"suffix\", \n    prefixOrSuffixValue = \"\", data = \"\") \n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\n​data: Numele setului de date\n</li>\n<li>\nvarNames: Variabilele de clasă posixct și clasă de dată care trebuie convertite​ în caractere\n</li>\n<li>\ndateFormat: Un șir de caractere. Valoarea implicită pentru metodele de format este \"%Y-%m-%d %H:%M:%S\" dacă orice element are o componentă de timp care nu este miezul nopții, și \"%Y-%m-%d\" în caz contrar. Dacă options(\"digits.secs\") este setat, se vor imprima până la numărul specificat de cifre pentru secunde\n</li>\n<li>\ntimezone: Un șir de caractere care specifică fusul orar care va fi utilizat pentru conversie. Specific pentru sistem (vezi as.POSIXlt), dar \"\" este fusul orar curent, iar \"GMT\" este UTC. Valorile invalide sunt tratate de obicei ca UTC, pe unele platforme cu un avertisment.\n</li>\n<li>\nprefixOrSuffix: Specifică un prefix sau un sufix pentru noile variabile de șir. Ia fie c(\"prefix\") sau c(\"sufix\"). Noile variabile care sunt create cu acest prefix/sufix la numele variabilei originale.\n</li>\n</ul>\n<b>Pachet</b></br>\nbază</br>\n<b>Ajutor</b></br>\nhelp(strftime)    \n"
  }
}