{
  "title": "Cox, Fine-Gray",
  "navigation": "Cox, Fine-Gray",
  "modelname": "Introduceți numele modelului",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (0 = cenzură, 1 = eveniment 1, 2 = eveniment 2, ...)",
  "eventcodelabel": "Cod Eveniment",
  "modelterms": "Constructor de expresie a modelului pentru variabile independente",
  "stratavarslabel": "Variabile de Stratificare (opțional)",
  "weightvar": "Greutăți (opțional)",
  "tiemethod": "Metoda Timpului Legat",
  "diagnosticsbox": "Diagnosticare Model",
  "martminlabel": "Valoarea minimă a axei reziduale Martingale a Modelului Null (-Inf la 1)",
  "anovachkboxlabel": "Analiza Deviatiei (Tip II)",
  "help": {
    "title": "Cox, Fine-Gray",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nSe potrivește un model Cox de riscuri proporționale Fine-Gray pentru datele de timp până la eveniment cu observații cenzurate atunci când sunt prezente riscuri concurente. Modelele Fine-Gray modelează efectul \ncovariatelor asupra funcției de incidență cumulată. O alternativă este de a modela efectul covariatelor asupra riscului specific cauzei, pentru care se pot folosi modele de regresie Cox standard. \nO introducere în subiectul riscurilor concurente poate fi găsită în \"Introducere în analiza datelor de supraviețuire în prezența riscurilor concurente\" de Peter Austin, \net. al., Circulation, 2016; 133:601-609. \n<br/><br/>\nSe oferă statistici de ajustare a modelului, estimări ale parametrilor și rapoarte de risc. Opțiunile disponibile includ metoda timpului legat și diagnosticele modelului. Modelul este ajustat folosind funcțiile \nfinegray și coxph din pachetul survival.\n<br/><br/>\n<b>Introduceți numele modelului:</b> Specificați numele modelului în care vor fi stocate rezultatele.\n<br/><br/>\n<b>Timp până la eveniment sau cenzură:</b> Timp până la primul eveniment pentru cei care experimentează un eveniment sau timp până la ultima urmărire pentru cei care nu experimentează niciun eveniment\n<br/><br/>\n<b>Evenimente (0 = cenzură, 1 = eveniment 1, 2 = eveniment 2, ...):</b> Indicator numeric al evenimentului; 0=cenzură, 1=eveniment 1, 2=eveniment 2, etc.\n<br/><br/>\n<b>Cod Eveniment:</b> Selectați evenimentul de interes pe care doriți să-l modelați. Poate fi selectat sau introdus.\n<br/><br/>\n<b>Constructor de Formule:</b> Construiește termeni de inclus în model. Factorii, șirurile și variabilele logice vor fi codificate ca variabile fictive. Butoanele furnizate vă permit să specificați efecte principale, efecte factoriale complete (efecte principale și toate interacțiunile cu variabilele implicate), polinoame, interacțiuni specifice și să ștergeți termeni din listă. Se permit interacțiuni \ncu variabilele de stratificare.\n<br/><br/>\n<b>Variabile de Stratificare:</b> Specificați una sau mai multe variabile de stratificare. Acestea pot fi numerice, factori, factori ordonați sau variabile de caracter. Stratele împart subiecții în grupuri separate, fiecare grup având o funcție de risc de bază distinctă. Dacă sunt date mai multe variabile de stratificare, se folosește o funcție de risc de bază separată pentru fiecare combinație de niveluri ale variabilelor de stratificare.\n<br/><br/>\n<b>Greutăți:</b> Variabilă numerică pentru greutățile observației. Util în situații în care fiecare înregistrare nu ar trebui să fie numărată ca o observație. \n<br/><br/>\n<b>Metoda Timpului Legat:</b> Metoda de rupere a timpilor observați legați. Efron este de obicei cea mai bună alegere atunci când nu există multe timpuri legate.\n<br/><br/>\n<b>Diagnosticare Model:</b> Dacă este selectat, se va evalua proporționalitatea riscurilor și forma funcțională a covariatelor, inclusiv grafice relevante. \nDacă există variabile de stratificare sau predictori non-numerici, nu vor fi produse grafice de formă funcțională. \n<b>Valoarea minimă a axei reziduale Martingale a Modelului Null</b> poate necesita modificări pentru a vedea toate reziduurile Martingale.\n<br/><br/>\n<b>Analiza Deviatiei (Tip II):</b> Dacă este selectat, vor fi furnizate teste complete ale variabilelor (inclusiv teste cu mai multe grade de libertate pentru covariate multicategoriale). Se folosesc teste Wald.\n<br/><br/>\n<b>Pachete R Necesare:</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nFaceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R despre funcția coxph. Mergeți la Ajutor-> Ajutor Funcție R pentru a obține mai multe informații despre funcția finegray, care creează \ndatasetul necesar.\n"
  }
}