{
    "title": "Cox, Bază",
    "navigation": "Cox, Bază",
    "helplabel": "Apăsați pe butonul ? din colțul din dreapta sus al dialogului pentru detalii despre seturile de date de exemplu și formatul de date acceptat.",
    "modelname": "Introduceți Numele Modelului",
    "timevar": "Timp până la eveniment sau cenzură",
    "eventvar": "Evenimente (1 = eveniment 1, 0 = cenzură)",
    "destvars": "Variabile Independente",
    "weightvar": "Greutăți (opțional)",
    "tiemethod": "Metoda pentru Timpuri Identice",
    "forestplotbox": "Grafic Forestier",
    "diagnosticsbox": "Diagnostic Model",
    "martscalebox": "Valoarea Minimă a Axa Rezidualelor Martingale ale Modelului Null (-Inf până la 1):",
    "devbox": "Analiza Deviantelor (Tip II)",
    "devtype": "Statistica Testului",
    "help": {
        "title": "Cox, Bază",
        "r_help": "help(coxph, package = 'survival')",
        "body": "\n\t\t\tConsultați setul de date de exemplu în directorul de instalare, locația implicită este la litera discului:&bsol;program files&bsol;BlueSky Statistics&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. Variabila Followup_time trebuie introdusă ca timp până la eveniment sau cenzură și variabila Event trebuie introdusă ca Evenimente (1 = eveniment, 0 = cenzură). Sexul, vârsta și IMC-ul pot fi variabile independente. \n\t\t\t<br/>\n            Variabila de eveniment trebuie să fie numerică, factorii nu sunt permiși. Dacă aveți o variabilă de eveniment de tip factor cu 2 valori, de exemplu 0 și 1, convertiți-o în numeric.\n\t\t\tAcest set de date este o versiune actualizată a setului de date mockstudy din pachetul arsenal.\n\t\t\t<br/><br/>\n            <b>Modelul Hazardelor Proporționale Cox</b>\n            <br/>\n            <br/>\n            Ajustează un model Cox al hazardelor proporționale pentru datele de timp până la eveniment cu observații cenzurate. Sunt furnizate statistici de ajustare a modelului, estimări ale parametrilor și rapoarte de hazard. Opțiunile disponibile includ metoda pentru timpuri identice, diagnosticele modelului, cum ar fi testele de hazard proporțional și evaluările formei funcționale ale covariabilelor, și un grafic forestier al rapoartelor de hazard cu intervale de încredere. Modelul este ajustat folosind funcția coxph din pachetul survival.\n            <br/>\n            <br/>\n            <b>Timp:</b> Timp până la eveniment pentru cei care experimentează evenimentul sau timp până la ultimul follow-up pentru cei care nu experimentează evenimentul\n            <br/><br/>\n            <b>Eveniment:</b> Indicator numeric pentru eveniment; 1=eveniment, 0=cenzură\n            <br/><br/>\n            <b>Variabile Independente:</b> Variabilele independente care vor fi incluse în model. Factorii, șirurile și variabilele logice vor fi codificate prin variabile fictive.\n            <br/><br/>\n            <b>Greutăți:</b> Variabilă numerică pentru greutatea observațiilor. Utilă în situațiile în care fiecare înregistrare nu trebuie contorizată ca o singură observație. \n            <br/>\n            <br/>\n            <b>Pachete Necesare:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Apăsați butonul Obține Ajutor R pentru a obține ajutor detaliat despre funcția coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opțiuni</b>\n            <br/>\n            <br/>\n            <b>Metoda pentru Timpuri Identice:</b>\n            <br/>\n            Metoda de descompunere a timpilor observați identici. Efron este de obicei alegerea mai bună când nu sunt mulți timpi identici. Metoda exactă poate fi benefică dacă există mulți timpi identici, ca în situațiile de timp discret, dar poate dura puțin mai mult pentru ajustarea modelului.\n            <br/>\n            <br/>\n            <b>Grafic Forestier:</b>\n            <br/>\n            Grafic al rapoartelor de hazard și intervalelor de încredere pentru fiecare predictor din model.\n            <br/>\n            <br/>\n            <b>Diagnostic Model:</b>\n            <br/>\n            Dacă este selectat, vor fi furnizate teste și grafice de hazard proporțional, pe lângă evaluările formei funcționale pentru fiecare covariabilă din model. Opțiunea pentru valoarea minimă a axei rezidualelor martingale ale modelului nul ar putea fi nevoie să fie schimbată astfel încât toate reziduurile să apară în grafic. Pentru a obține evaluări ale formei funcționale, trebuie să specificați doar predictori numerici și să nu aveți date lipsă. Consultați Variabile > Valori Lipsă > Eliminare NAs.\n            <br/>\n            <br/>\n            <b>Analiza Deviantelor (Tip II):</b>\n            Test global pentru fiecare predictor din model. Vor fi furnizate teste cu mai multe grade de libertate pentru efectele cu mai mult de 2 niveluri. Se pot obține teste Wald și teste de raport de probabilitate, cu teste de raport de probabilitate care au proprietăți mai bune pentru eșantioane mici.\n            \n"
    }
}
