{
  "title": "Cox, Stratificat",
  "navigation": "Cox, Stratificat",
  "modelname": "Introduceți numele modelului",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (1 = eveniment 1, 0 = cenzură)",
  "modelterms": "Constructor de expresie a modelului pentru variabile independente",
  "stratavarslabel": "Variabile de Stratificare",
  "weightvar": "Greutăți (opțional)",
  "tiemethod": "Metoda Timpului Legat",
  "diagnosticsbox": "Diagnosticarea Modelului",
  "help": {
    "title": "Cox, Stratificat",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n            Se potrivește un model de riscuri proporționale Cox stratificat pentru datele de timp până la eveniment cu observații cenzurate. Acesta este un model Cox care permite o funcție de risc de bază separată pentru fiecare nivel de strat. Se oferă statistici de ajustare a modelului, estimări ale parametrilor și rapoarte de risc. Opțiunile disponibile includ metoda timpului legat și diagnosticele modelului. Modelul este ajustat folosind funcția coxph din pachetul survival. \n            <br/>\n            <br/>\n            <b>Timp până la eveniment sau cenzură:</b> Timp până la eveniment pentru cei care experimentează evenimentul sau timp până la ultima urmărire pentru cei care nu experimentează evenimentul\n            <br/><br/>\n            <b>Evenimente (1=eveniment, 0=cenzură):</b> Indicator numeric de eveniment; 1=eveniment, 0=cenzură\n            <br/><br/>\n            <b>Constructor de Formule:</b> Construiți termeni pentru a include în model. Factorii, șirurile și variabilele logice vor fi codificate ca variabile fictive. Butoanele furnizate vă permit să specificați efecte principale, efecte factoriale complete (efecte principale și toate interacțiunile cu variabilele implicate), polinoame, interacțiuni specifice și să eliminați termeni din listă. Se permit interacțiuni cu variabilele de stratificare.\n            <br/><br/>\n\t\t\t<b>Variabile de Stratificare:</b> Specificați una sau mai multe variabile de stratificare. Acestea pot fi variabile numerice, factori, factori ordonați sau variabile de caracter. Straturile împart subiecții în grupuri separate, fiecare grup având o funcție de risc de bază distinctă. Dacă se oferă mai multe variabile de stratificare, se utilizează o funcție de risc de bază separată pentru fiecare combinație de niveluri ale variabilelor de stratificare.\n\t\t\t<br/><br/>\n            <b>Greutăți:</b> Variabilă numerică pentru greutățile observației. Utilă în situații în care fiecare înregistrare nu ar trebui să fie numărată ca o observație. \n            <br/>\n            <br/>\n            <b>Pachete necesare:</b> survival, broom, survminer\n            <br/>\n            <br/>\n            Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat despre funcția coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opțiuni</b>\n            <br/>\n            <br/>\n            <b>Metoda Timpului Legat:</b>\n            <br/>\n            Metodă de rupere a timpilor observați legați. Efron este de obicei cea mai bună alegere atunci când nu există multe timpuri legate. Metoda exactă poate fi benefică dacă există multe timpuri legate, ca în situațiile de timp discret, dar poate dura puțin mai mult pentru a ajusta modelul. \n            <br/>\n            <br/>\n            <b>Diagnosticarea Modelului:</b>\n            <br/>\n            Dacă este selectat, vor fi furnizate teste și grafice de riscuri proporționale, în plus față de un grafic de reziduuri Martingale.\n"
  }
}