{
  "title": "Cox, Avansat",
  "navigation": "Cox, Avansat",
  "helplabel": "Faceți clic pe butonul ? din colțul din dreapta sus al dialogului pentru detalii despre seturile de date de exemplu și formatul de date acceptat.",
  "modelname": "Introduceți numele modelului",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Evenimente (1 = eveniment 1, 0 = cenzură)",
  "modelterms": "Constructor de expresie a modelului pentru variabile independente",
  "weightvar": "Greutăți (opțional)",
  "tiemethod": "Metoda timpului legat",
  "forestplotbox": "Diagramă forestieră",
  "diagnosticsbox": "Diagnosticarea modelului",
  "martscalebox": "Valoarea minimă a axei reziduale martingale a modelului nul (-Inf la 1):",
  "devbox": "Analiza devianței (Tip II)",
  "devtype": "Statistică de test",
  "help": {
    "title": "Cox, Avansat",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n\t\t\tConsultați setul de date de exemplu din directorul de instalare, locația implicită este pe unitate:&bsol;program files&bsol;BlueSky Statistics&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. Variabila Followup_time trebuie introdusă ca timpul până la eveniment sau cenzură, iar variabila Event trebuie introdusă ca Evenimente (1 = eveniment, 0 = cenzură). Sexul, vârsta și IMC pot fi variabilele independente. \n\t\t\t<br/>\n\t\t\tAcest set de date este o versiune actualizată a setului de date mockstudy din pachetul arsenal.\n\t\t\t<br/><br/>\n            <b>Modelul de Riscuri Proporționale Cox</b>\n            <br/>\n            <br/>\n            Se potrivește un model de riscuri proporționale Cox pentru datele de timp până la eveniment cu observații cenzurate. Se oferă statistici de ajustare a modelului, estimări ale parametrilor și rapoarte de risc. Opțiunile disponibile includ metoda timpului legat, diagnosticele modelului, cum ar fi evaluările riscurilor proporționale și evaluările formei funcționale a covariatelor, precum și o diagramă forestieră a rapoartelor de risc cu intervale de încredere. Modelul este ajustat folosind funcția coxph din pachetul survival.\n            <br/>\n            <br/>\n            <b>Timp:</b> Timp până la eveniment pentru cei care experimentează evenimentul sau timp până la ultima urmărire pentru cei care nu experimentează evenimentul\n            <br/><br/>\n            <b>Eveniment:</b> Indicator numeric al evenimentului; 1=eveniment, 0=cenzură\n            <br/><br/>\n            <b>Variabile Independente:</b> Variabile independente de inclus în model. Factorii, șirurile și variabilele logice vor fi codificate ca variabile fictive.\n            <br/><br/>\n            <b>Greutăți:</b> Variabilă numerică pentru greutățile observației. Util în situații în care fiecare înregistrare nu ar trebui să fie considerată o observație. \n            <br/>\n            <br/>\n            <b>Pachete necesare:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Faceți clic pe butonul Obțineți ajutor R pentru a obține ajutor detaliat despre funcția coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opțiuni</b>\n            <br/>\n            <br/>\n            <b>Metoda Timpului Legat:</b>\n            <br/>\n            Metoda de rupere a timpilor observați legați. Efron este de obicei cea mai bună alegere atunci când nu există multe timpuri legate. Metoda exactă poate fi benefică dacă există multe timpuri legate, cum ar fi în situații de timp discret, dar poate dura puțin mai mult pentru a se potrivi modelului. \n            <br/>\n            <br/>\n            <b>Diagramă Forestieră:</b>\n            <br/>\n            Diagramă a rapoartelor de risc și intervalelor de încredere pentru fiecare predictor din model.\n            <br/>\n            <br/>\n            <b>Diagnosticarea Modelului:</b>\n            <br/>\n            Dacă este selectat, vor fi furnizate teste și grafice de riscuri proporționale, în plus față de evaluările formei funcționale pentru fiecare covariată din model. Opțiunea de valoare minimă a axei reziduale martingale a modelului nul ar putea necesita modificări pentru ca toate reziduurile să apară în grafic. Pentru a obține evaluări ale formei funcționale, trebuie să specificați doar predictori numerici și să nu aveți date lipsă. Consultați Variabile > Valori Lipsă > Eliminare NAs.\n            <br/>\n            <br/>\n            <b>Analiza Devianței (Tip II):</b>\n            Test global pentru fiecare predictor din model. Vor fi furnizate teste cu mai multe grade de libertate pentru efecte cu mai mult de 2 niveluri. Testele Wald și de raport de verosimilitate pot fi obținute, testele de raport de verosimilitate având proprietăți mai bune pentru eșantioane mici.\n            \n      "
  }
}