{
  "title": "Testare Diagnostica",
  "navigation": "Testare Diagnostica",
  "outvar": "Variabila de Rezultat (1=pozitiv, 0=negativ):",
  "testvar": "Variabila de Test (1=pozitiv, 0=negativ):",
  "cilevel": "Nivel de Încredere:",
  "help": {
    "title": "Testare Diagnostica",
    "r_help": "help(epi.tests,package=epiR)",
    "body": "\n<b>Descriere</b></br>\nAceasta calculează diverse măsuri adecvate în studiile de testare diagnostica pentru un test binar versus un rezultat binar de standard de aur pentru detectarea unei \"boli\".<br/>\nVariabila de Rezultat: Variabila care conține valorile pentru standardul de aur. Aceasta trebuie să fie o variabilă numerică codificată ca 1 = \"boală\" pozitivă și 0 = \"boală\" negativă, deoarece calculele depind de această ordine.<br/>\nVariabila de Test: Variabila care conține valorile pentru testul în discuție. Aceasta trebuie să fie o variabilă numerică codificată ca 1 = \"boală\" pozitivă și 0 = \"boală\" negativă, deoarece calculele depind de această ordine.<br/>\nNivel de Încredere: Nivelul dorit al intervalului de încredere<br/>\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nepi.tests(dat, conf.level = 0.95)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndat: Un obiect de clasă tabel care conține frecvențele individuale ale celulelor create prin tabularea variabilei de rezultat și a variabilei de test. Variabila de Rezultat conține valorile pentru standardul de aur. Aceasta trebuie să fie o variabilă numerică codificată ca 1 = \"boală\" pozitivă și 0 = \"boală\" negativă, deoarece calculele depind de această ordine. Variabila de test conține valorile pentru testul în discuție. Aceasta trebuie să fie o variabilă numerică codificată ca 1 = \"boală\" pozitivă și 0 = \"boală\" negativă, deoarece calculele depind de această ordine.\n</li>\n<li>\nNivel de Încredere: Nivelul dorit al intervalului de încredere\n</li>\n</ul>\n<b>Detalii</b></br>\nLimitele de încredere binomiale exacte sunt calculate pentru sensibilitatea testului, specificitatea și valoarea predictivă pozitivă și negativă (vezi Collett 1999 pentru detalii).</br>\nIntervalele de încredere pentru raporturile de probabilitate pozitive și negative se bazează pe formulele furnizate de Simel et al. (1991).</br>\nAcuratețea diagnostică este definită ca proporția tuturor testelor care oferă un rezultat corect. Raportul de șanse diagnostice este definit ca cât de mult mai probabil va fi testul să facă un diagnostic corect decât un diagnostic incorect la pacienții cu boala (Scott et al. 2008). Numărul necesar pentru diagnosticare este definit ca numărul de pacienți care trebuie testați pentru a obține un test pozitiv corect. Indexul Youden este diferența dintre rata adevărat pozitivă și rata fals pozitivă. Indexul Youden variază de la -1 la +1 cu valori mai apropiate de 1 dacă atât sensibilitatea, cât și specificitatea sunt ridicate (adică aproape de 1).</br>\n<b>Valoare</b></br>\nVezi ajutorul detaliat mai jos pentru a accesa ajutorul R care va descrie valorile returnate</br>\n<b>Pachet</b></br>\nepiR;DescTools</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă help(epi.tests,package=epiR) creând un chunk de cod R făcând clic pe + în fereastra de ieșire\n\t\t\t"
  }
}