{
  "title": "Ajustarea distribuțiilor univariate la datele neîngrădite (cu valoare P)",
  "navigation": "Ajustare distribuție P-valoare",
  "variableSelcted": "Selectați o variabilă care conține distribuția",
  "label1": "Fiți conștienți că testul de ajustare pentru distribuții durează de obicei mai mult timp pentru a se finaliza",
  "label2": "Test de ajustare pentru diverse distribuții",
  "normDistChk": "Normal",
  "weibullDistChk": "Weibull",
  "lnormDistChk": "Log Normal",
  "poissonDistChk": "Poisson",
  "expDistChk": "Exponențial",
  "gammaDistChk": "Gamma",
  "nbinomDistChk": "Binomial Negativ",
  "geomDistChk": "Geometric",
  "betaDistChk": "Beta",
  "unifDistChk": "Uniform",
  "logisDistChk": "Logistic",
  "cauchyDistChk": "Cauchy",
  "method": "Metoda de ajustare",
  "gof": "Bunătatea ajustării (gof) - necesară doar atunci când metoda 'mge' de ajustare este aleasă mai sus",
  "shoChiqTestChk": "Arată rezultatele testului Chi-pătrat pentru distribuția continuă",
  "showCompareTablesOnlyChk": "Arată doar tabelele și graficele de comparație a distribuțiilor. Trebuie să debifați aceasta dacă selectați doar o distribuție",
  "bootstrapIter": "Metoda bootstrap este utilizată pentru a îmbunătăți acuratețea valorii p. Iterația implicită este 600. Mai multe iterații pot îmbunătăți acuratețea, dar vor dura mai mult timp pentru a fi calculate",
  "help": {
    "title": "Ajustarea distribuțiilor univariate la datele neîngrădite",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descriere</b></br>\n\t\t\t\tAjustarea distribuțiilor univariate la datele neîngrădite prin maximizarea verosimilității (mle), potrivirea momentelor (mme), potrivirea cuantilelor (qme) sau maximizarea estimării bunătății ajustării (mge), care este cunoscută și sub numele de minimizarea estimării distanței.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPentru ajutor detaliat - utilizați ajutorul R help(fitdist, package = fitdistrplus) și help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCele patru metode posibile de ajustare sunt descrise mai jos:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCând metoda=\"mle\" (implicit)\n\t\t\t\tEstimarea verosimilității maxime constă în maximizarea log-verosimilității. O optimizare numerică este efectuată în mledist prin optim pentru a găsi cele mai bune valori (vezi mledist pentru detalii).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCând metoda=\"mme\"\n\t\t\t\tEstimarea potrivirii momentelor constă în egalizarea momentelor teoretice și empirice. Valorile estimate ale parametrilor distribuției sunt calculate printr-o formulă în formă închisă pentru următoarele distribuții: \"norm\", \"lnorm\", \"pois\", \"exp\", \"gamma\", \"nbinom\", \"geom\", \"beta\", \"unif\" și \"logis\". În caz contrar, momentele teoretice și cele empirice sunt potrivite numeric, prin minimizarea sumei diferențelor pătrate între momentele observate și cele teoretice. În acest ultim caz, sunt necesare argumente suplimentare în apelul la fitdist: order și memp (vezi mmedist pentru detalii).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCând metoda = \"qme\"\n\t\t\t\tEstimarea potrivirii cuantilelor constă în egalizarea cuantilelor teoretice și empirice. O optimizare numerică este efectuată în qmedist prin optim pentru a minimiza suma diferențelor pătrate între cuantilele observate și cele teoretice. Utilizarea acestei metode necesită un argument suplimentar probs, definit ca vectorul numeric al probabilităților pentru care cuantilele trebuie să fie potrivite (vezi qmedist pentru detalii).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCând metoda = \"mge\"\n\t\t\t\tEstimarea maximă a bunătății ajustării constă în maximizarea unei statistici de bunătate a ajustării. O optimizare numerică este efectuată în mgedist prin optim pentru a minimiza distanța bunătății ajustării. Utilizarea acestei metode necesită un argument suplimentar gof codificând distanța bunătății ajustării alese. Se poate utiliza distanța clasică Cramer-von Mises (\"CvM\"), distanța clasică Kolmogorov-Smirnov (\"KS\"), distanța clasică Anderson-Darling (\"AD\") care dă mai multă greutate cozii distribuției, sau una dintre variantele acestei ultime distanțe propuse de Luceno (2006) (vezi mgedist pentru mai multe detalii). Această metodă nu este potrivită pentru distribuții discrete.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCând metoda = \"mse\"\n\t\t\t\tEstimarea maximă a bunătății ajustării constă în maximizarea distanței medii logaritmice. O optimizare numerică este efectuată în msedist prin optim.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tconvergența este \n\t\t\t\tun cod întreg pentru convergența optimizării definit mai jos sau definit de utilizator în funcția de optimizare furnizată de utilizator. 0 indică o convergență de succes. 1 indică faptul că limita de iterație a optimizării a fost atinsă. 10 indică degenerarea simplexului Nealder-Mead. 100 indică faptul că optimizarea a întâmpinat o eroare internă.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tStatisticile bunătății ajustării sunt calculate de gofstat(). Statistica Chi-pătrat este calculată folosind celule definite de argumentul chisqbreaks sau celule definite automat din date, pentru a ajunge la aproximativ același număr de observații pe celulă, aproximativ egal cu argumentul meancount, sau ușor mai mult dacă există unele legături. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPentru distribuții continue, statisticile Kolmogorov-Smirnov, Cramer-von Mises și Anderson-Darling sunt de asemenea calculate, așa cum este definit de Stephens (1986).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tStatisticile importante sunt statisticile Cramer-von Mises, Anderson-Darling și Kolmogorov pentru distribuții continue și statisticile Chi-pătrat pentru cele discrete (\"binom\", \"nbinom\", \"geom\", \"hyper\" și \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Pentru o bună prezentare generală a ajustării distribuției, consultați https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Pentru o bună prezentare generală a ajustării distribuției, consultați https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}