{
  "title": "Graficul Cullen și Frey cu descriptivi ai unei distribuții empirice pentru date ne-cenzurate",
  "navigation": "Analiza distribuției (graficul Cullen și Frey)",
  "variableSelcted": "Selectați o variabilă care conține distribuția",
  "boot": "(Opțional) Valori bootstrap ale asimetriei și kurtosis. Dacă este specificat, trebuie să fie un întreg mai mare de 10",
  "discreteChk": "Discret - debifat (implicit) pentru uniform, normal, logistic, lognormal, beta și gamma. Bifat pentru poisson și binomial negativ",
  "method": "Neîndoit (implicit) pentru valori estimate neîndoită ale statisticilor sau eșantion pentru valorile eșantionului",
  "help": {
    "title": "Descrierea unei distribuții empirice pentru date ne-cenzurate",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descriere</b></br>\n\t\t\t\tCalculează parametrii descriptivi ai unei distribuții empirice pentru date ne-cenzurate și oferă un grafic de asimetrie-kurtosis\n\t\t\t\t<br/>\n\t\t\t\tPentru ajutor detaliat - folosiți R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMinim, maxim, mediană, medie, deviație standard a eșantionului și eșantion (dacă metoda==\"sample\") sau estimări neîndoită prin default de \n\t\t\t\tasimetrie și valori de kurtosis ale lui Pearson sunt imprimate (Sokal și Rohlf, 1995). Un grafic de asimetrie-kurtosis, cum ar fi cel \n\t\t\t\tpropus de Cullen și Frey (1999), este dat pentru distribuția empirică. În acest grafic, valorile pentru distribuții comune \n\t\t\t\tsunt de asemenea afișate ca instrumente pentru a ajuta la alegerea distribuțiilor de ajustat la date. Pentru unele \n\t\t\t\tdistribuții (normal, uniform, logistic, exponențial de exemplu), există doar o singură valoare posibilă pentru asimetrie \n\t\t\t\tsi kurtosis (de exemplu, pentru o distribuție normală, asimetrie = 0 și kurtosis = 3), iar distribuția este astfel \n\t\t\t\treprezentată printr-un punct pe grafic. Pentru alte distribuții, zonele de valori posibile sunt reprezentate, constând în \n\t\t\t\tlinii (distribuții gamma și lognormală de exemplu), sau zone mai mari (distribuția beta de exemplu). \n\t\t\t\tDistribuția Weibull nu este reprezentată pe grafic, dar este indicat în legendă că formele apropiate de \n\t\t\t\tdistribuțiile lognormale și gamma pot fi obținute cu această distribuție.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPentru a lua în considerare incertitudinea valorilor estimate ale kurtosis și asimetriei din date, setul de date \n\t\t\t\tpoate fi bootstrapat prin fixarea argumentului boot la un întreg mai mare de 10. Valorile bootstrap ale asimetriei și kurtosis \n\t\t\t\tcorespunzătoare probelor bootstrap sunt apoi calculate și raportate în culoare albastră pe graficul de asimetrie-kurtosis.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDacă discret este TRUE, distribuțiile reprezentate sunt distribuțiile Poisson, binomiale negative și distribuția normală \n\t\t\t\tla care distribuțiile discrete anterioare pot converge. Dacă discret este FALSE, acestea sunt distribuții uniforme, normale, \n\t\t\t\tlogistice, lognormale, beta și gamma.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Pentru o bună prezentare generală a ajustării distribuțiilor, consultați https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}