{
  "title": "Elimină Nivelurile Neutilizate",
  "navigation": "Elimină Neutilizate",
  "target": "Variabilele factor pentru a elimina nivelurile",
  "label1": "Introduceți variabilele factor pentru a elimina nivelurile. Puteți specifica nivelurile neutilizate de eliminat introducându-le sau selectați să eliminați toate nivelurile neutilizate pentru variabilele selectate. Dacă variabila din setul de date are valori NA în date, atunci acel nivel NU este eliminat.",
  "label2": "Salvați nivelurile noi în variabile noi sau suprascrieți variabilele existente",
  "rd3": "Specificați un sufix (O nouă variabilă va fi creată cu sufixul)",
  "txt3": "Introduceți un sufix",
  "rd2": "Specificați un prefix (O nouă variabilă va fi creată cu prefixul)",
  "txt4": "Introduceți un prefix",
  "rd1": "Suprascrieți variabilele existente",
  "label3": "Metoda de utilizat",
  "dropUnused": "Eliminați toate nivelurile neutilizate",
  "levelsToDrop": "Specificați nivelurile de eliminat",
  "drop": "Introduceți nivelurile de eliminat separate prin virgulă, de exemplu: nivel1,nivel2,nivel3 NOTĂ: Nu folosiți spații ca separatori între niveluri",
  "help": {
    "title": "Elimină Nivelurile Neutilizate",
    "r_help": "help(fct_drop, package =forcats)",
    "body": "\n<b>NOTĂ: NU ÎNCONJURAȚI NIVELURILE ÎN GHILIMELE DUBLE SAU SIMPLE, NU POT FI SPAȚII ÎN NUMELE NIVELURILOR. INTRODUCEȚI NIVELURILE SEPARATE PRIN VIRGULE ÎN FORMATUL NIVEL1,NIVEL2,NIVEL3</b></br>\n<b>Descriere</b></br>\nIntroduceți variabilele factor pentru a elimina nivelurile neutilizate. Puteți specifica nivelurile neutilizate de eliminat introducându-le sau selectați să eliminați toate nivelurile neutilizate pentru variabilele selectate. Dacă variabila din setul de date are valori NA în date, atunci acel nivel NU este eliminat.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nfct_drop(f, only)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nf: O variabilă factor (sau vector de caractere).\n</li>\n<li>\nonly: Un vector de caractere care restricționează setul de niveluri de eliminat. Dacă este furnizat, doar nivelurile care nu au intrări și apar în acest vector vor fi eliminate.\n</li>\n</ul>\n<b>Exemple</b><br/>\n</code>\nf <- factor(c(\"a\", \"b\"), levels = c(\"a\", \"b\", \"c\"))<br/>\nf<br/>\nfct_drop(f)<br/>\n# Set only pentru a restricționa care niveluri să fie eliminate<br/>\nfct_drop(f, only = \"a\")<br/>\nfct_drop(f, only = \"c\")<br/>\n<b>Pachet</b></br>\nforcats</br>\n<b>Ajutor</b></br>\nhelp(fct_drop, package =forcats)\n"
  }
}