{
  "title": "Egalitatea variatelor",
  "navigation": "Egalitatea variatelor",
  "label1": "Alege teste",
  "bartlett": "Testul Bartlett",
  "levene": "Testul Levene",
  "fligner": "Testul Fligner–Killeen",
  "normal_distribution": "Test bazat pe distribuția normală",
  "pairwiseLeveneTest": "Testul Levene pereche",
  "label2": "Formatul datelor",
  "wide": "Format larg",
  "long": "Format lung",
  "label3": "Nivel de încredere",
  "label4": "Ipoteza alternativă",
  "alt1": "Bidirecțional",
  "alt2": "Mai mare",
  "alt3": "Mai mic",
  "label5": "Metoda de ajustare a valorii P (pentru testul Levene pereche)",
  "padj1": "Holm",
  "padj2": "Hochberg",
  "padj3": "Hommel",
  "padj4": "Bonferroni",
  "padj5": "BH",
  "padj6": "BY",
  "padj7": "FDR",
  "padj8": "Niciuna",
  "help": {
    "title": "Teste pentru egalitatea variatelor",
    "r_help": "help(bartlett.test, package=stats); help(leveneTest, package=car); help(fligner.test, package=stats)",
    "body": "\n<b>Descriere</b></br>\nTestează egalitatea variatelor. Suportă date în următoarele formate<br/>\nlarg: Fiecare variabilă conține măsurători, de exemplu, variabila 1 conține măsurători de la mașina A, variabila 2 conține măsurători de la mașina B...<br/>\nlung: Măsurătorile dintr-o variabilă sunt grupate după una sau mai multe variabile, de exemplu, scorurile testelor sunt grupate după gen și clasă. <br/>\nMetoda de ajustare a valorii P se aplică doar atunci când testul Levene pereche este selectat.<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"larg\" ),<br/>\n    cols_to_compare = c('A','B','C'),<br/>\n    response_col = NULL,<br/>\n    group_col = NULL,<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidirecțional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n    Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset1\"<br/>\n)<br/>\nBSky_variance_analysis (<br/>\n    data_format = c(\"lung\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Scor'),<br/>\n    group_col = c('Gen','Clasă'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidirecțional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset2\"<br/>\n)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndata_format: Poate fi larg sau lung\n</li>\n<li>\ncols_to_compare: Variabilele pentru a compara variatele atunci când setul de date este în format larg, NULL pentru date în format lung\n</li>\n<li>\nresponse_col: Variabila de măsurare pentru a compara variatele între grupuri. NULL pentru datele largi\n</li>\n<li>\ngroup_col: Una sau mai multe variabile utilizate pentru a grupa variabila de măsurare, testăm pentru egalitatea variatelor între grupuri\n</li>\n<li>\nconf_level: Interval de încredere\n</li>\n<li>\nalt_hypothesis: Setat pe bidirecțional\n</li>\n<li>\np_adjust_method: Metoda utilizată pentru a ajusta valoarea P\n</li>\n<li>\nnormal_distribution: dacă este ADEVĂRAT, presupunem normalitatea\n</li>\n<li>\nFligner_Killeen: dacă este ADEVĂRAT, efectuează un test Fligner_Killeen\n</li>\n<li>\npairwiseComparison: Efectuează un test Levene pereche\n</li>\n<li>\ndatasetname: Numele setului de date din care sunt alese x,y și straturi (variabile)\n</li>\n</ul>\n<b>Valoare</b></br>\nIntervale de încredere Bonferroni pentru intervalele de încredere specificate. Rezultatele testelor pentru teste de comparație multiplă (când normalitatea nu este presupusă) și rezultatele altor teste\n<br/>\n<b>Exemplu</b></br>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"lung\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Scor'),<br/>\n    group_col = c('Gen','Clasă'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidirecțional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset2\"<br/>\n)<br/>\n</code> <br/>\n\n<b>Detalii</b></br>\nTest de comparații multiple</br>\nUtilizat atunci când nu selectați „Utilizați testul bazat pe distribuția normală” – adică, favorizați metodele robuste la distribuțiile non-normale. </br>\nDacă aveți k > 2 grupuri, calculăm intervalele pentru deviațiile standard astfel încât dacă două intervale nu se suprapun, deviațiile standard asociate sunt \ndiferite semnificativ.</br> \nPentru k = 2 eșantioane, folosește metoda Bonett pentru testarea a două variate cu raportul ipotetic = 1. </br>\nCând testul general de comparație multiplă este semnificativ, deviațiile standard care corespund intervalelor care nu se suprapun sunt diferite din punct de vedere statistic.</br>\nAvantaje: Mai puternic decât metoda Levene în multe situații (pentru distribuții continue). Dar când dimensiunile eșantionului sunt mici (< 20) sau distribuțiile sunt \nextrem de asimetrice/grele, rata de eroare de tip I poate fi crescută.</br>\nValoarea P pentru test</br>\nDacă există 2 eșantioane în design, atunci calculăm valoarea P pentru testul de comparații multiple folosind metoda Bonett pentru un test de 2 variate și un raport ipotetic, Ρo, de 1.</br>\nDacă există k > 2 eșantioane în design, atunci să l Pij fie valoarea P a testului pentru orice pereche (i, j ) de eșantioane. Valoarea P pentru procedura de comparații multiple ca un test general de egalitate a variatelor este dată de următoarele:</br>\nP =min{Pij, 1<=i<j<=k}\n</br>\nStatisticile testului Levene</br>\nTestul Levene este utilizat pentru a testa ipoteza nulă că variatele sunt egale între grupuri (H₀: toate variatele egale) versus alternativa că cel puțin \no variabilă diferă. </br>\nEste mai robust la abaterile de la normalitate comparativ cu testele care presupun normalitatea (de exemplu, testul Bartlett). </br>\nÎn mod specific, folosim modificarea Brown-Forsythe (deviații absolute de la mediana eșantionului mai degrabă decât media) pentru o robustete îmbunătățită. </br>\nInterpretare: Dacă valoarea P < α, respingeți H₀ și concluzionați că variatele nu sunt egale. </br>\n</br>\nStatisticile testului Bartlett</br>\nTestul Bartlett este conceput pentru a testa egalitatea variatelor atunci când datele sunt distribuite normal. H₀: toate variatele egale. Când k > 2 grupuri,\nfolosim testul Bartlett (dacă „utilizați testul bazat pe distribuția normală” este selectat). </br>\nStatisticile testului (denumit în mod obișnuit B) se bazează pe compararea media aritmetică ponderată și media geometrică ponderată a variatelor eșantionului. </br>\nStatisticile urmează (aproximativ) o distribuție chi-pătrată cu k-1 df. </br>\nPentru că testul Bartlett presupune normalitatea, este sensibil la abaterile de la normalitate (adică, distribuțiile non-normale sau grele pot duce la \nrezultate înșelătoare)</br>\n</br>\nStatisticile testului F</br>\nCând există exact două grupuri (k = 2), folosim un test F în loc de testul Bartlett (dacă „utilizați testul bazat pe distribuția normală” este selectat). </br>\nH₀: variatele sunt egale (σ₁² = σ₂²). </br>\nStatisticile F sunt calculate ca raportul celor două variate eșantionului (mai mari peste mai mici). Apoi, valoarea P depinde de ipoteza alternativă\n (unidirecțional „mai mic decât” sau „mai mare decât”, sau bidirecțional). </br>\nInterpretare: Dacă valoarea P < α, respingeți H₀ și concluzionați că variatele diferă. Este validă doar sub presupunerea normalității.</br>\n<b>Valoare</b><br/>\n\n<b>Pachet</b></br>\nBlueSky</br>\n<b>Ajutor</b></br>\nVă rugăm să contactați support@blueskystatistics.com pentru informații suplimentare.\n    "
  }
}