{
  "title": "Graficul Distribuției F",
  "navigation": "Graficul Distribuției F",
  "dfnumerator": "Grade de libertate pentru numărător",
  "dfdenominator": "Grade de libertate pentru numitor",
  "pdenfun": "Grafic funcția de densitate",
  "pdstfun": "Grafic funcția de distribuție",
  "lblregions": "Specificați opțional regiunile sub funcția de densitate prin",
  "xvals": "valori x",
  "quantiles": "cuantile",
  "lblRegFill": "Regiuni de umplut (specificați una sau două, sau lăsați liber)",
  "lblreg1": "Regiunea 1 :",
  "lblreg2": "Regiunea 2 :",
  "lblregfrm": "De la",
  "lblregto": "Până la",
  "lblregcol": "Culoare",
  "lblLegPos": "Poziția legendei",
  "toprt": "Sus dreapta",
  "toplt": "Sus stânga",
  "topmid": "Sus centru",
  "help": {
    "title": "Graficul Distribuției F",
    "r_help": "ajutor(qf, pachet=stats)",
    "body": "\n            ​​\n            <b>Descriere</b>\n            <br/>\n            Densitate, funcție de distribuție, funcție cuantilă și generare aleatoare pentru distribuția F cu df1 și df2 grade de libertate (și parametru de non-centralitate opțional ncp).\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code>\n                df(x, df1, df2, ncp, log = FALSE)\n                <br/>\n                pf(q, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qf(p, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rf(n, df1, df2, ncp)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumente</b>\n            <br/>\n            <ul>\n                <li>x, q : vector de cuantile.</li>\n                \n                \n                <li>p : vector de probabilități.</li>\n                \n                \n                <li>n : numărul de observații. Dacă length(n) > 1, lungimea este considerată a fi numărul necesar.</li>\n                \n                \n                <li>df1, df2 : grade de libertate. Inf este permis.</li>\n                \n                \n                <li>ncp : parametru de non-centralitate. Dacă este omis, se presupune F central.</li>\n                \n                \n                <li>log, log.p : logic; dacă este TRUE, probabilitățile p sunt date ca log(p).</li>\n                \n                \n                <li>lower.tail : logic; dacă este TRUE (implicit), probabilitățile sunt P[X ≤ x], altfel, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalii</b>\n            <br/>\n            Distribuția F cu df1 = n1 și df2 = n2 grade de libertate are densitate\n            <br/>\n            <code>f(x) = Γ((n1 + n2)/2) / (Γ(n1/2) Γ(n2/2)) (n1/n2)^(n1/2) x^(n1/2 - 1) (1 + (n1/n2) x)^-(n1 + n2)/2</code>\n            <br/>\n            pentru x > 0.\n            <br/>\n            Este distribuția raportului pătratelor medii ale n1 și n2 normale standard independente, și prin urmare a raportului a două variabile chi-pătrate independente fiecare împărțită la gradele lor de libertate. Deoarece raportul unei normale și a rădăcinii pătrate medii a m normale independente are o distribuție t_m de Student, pătratul unei variabile t_m are o distribuție F pe 1 și m grade de libertate.\n            <br/>\n            Distribuția F non-centrală este din nou raportul pătratelor medii ale normale independente de varianță unitară, dar cele din numărător pot avea medii nenule și ncp este suma pătratelor mediilor. Consultați Chi-pătrat pentru detalii suplimentare despre distribuțiile non-centrale.\n            <br/>\n            <br/><b>Valoare</b>\n            <br/>\n            df dă densitatea, pf dă funcția de distribuție, qf dă funcția cuantilă, iar rf generează deviații aleatoare.\n            <br/>\n            Argumentele invalide vor rezulta într-o valoare de returnare NaN, cu un avertisment.\n            <br/>\n            Lungimea rezultatului este determinată de n pentru rf, și este maximul lungimilor argumentelor numerice pentru celelalte funcții.\n            <br/>\n            Argumentele numerice diferite de n sunt reciclate la lungimea rezultatului. Numai primele elemente ale argumentelor logice sunt utilizate.\n            <br/>\n            <br/><b>Notă</b>\n            <br/>\n            Furnizarea ncp = 0 folosește algoritmul pentru distribuția non-centrală, care nu este același algoritm utilizat dacă ncp este omis. Acest lucru este pentru a oferi un comportament consistent în cazuri extreme cu valori de ncp foarte aproape de zero.\n            <br/>\n            Codul pentru ncp diferit de zero este destinat în principal să fie utilizat pentru valori moderate de ncp: nu va fi foarte precis, în special în extreme, pentru valori mari.            \n"
  }
}