{
  "title": "Grafic de Pădure",
  "navigation": "Grafic de Pădure",
  "modelselectorlabel": "Selectați Numele Modelului",
  "plotvarslabel": "Variabile de Grafiat (dacă nu sunt specificate, se grafică toate variabilele)",
  "varlabelslabel": "Etichete de Variabile (specificați ca varname='eticheta' separate prin virgule, de exemplu, vârstă='Vârstă în ani', imc='Indicele de Masă Corporală'); se poate folosi \\n pentru întreruperi de linie în cadrul unei etichete",
  "notelabel": "NOTĂ: Schimbarea etichetelor necesită o recalibrare a modelului, așa că datele mari ar putea dura timp",
  "label3": "NOTĂ: MODELELE CONSTRUITE UTILIZÂND REGLAREA MODELULUI (ÎNVĂȚARE) NU SUNT SUPORTATE",
  "estimateoptlabel": "Opțiuni de Estimare",
  "estimatelabellabel": "Etichetă",
  "exponentiatelabel": "Forțează Exponencierea Estimării Parametrului",
  "linecolorlabel": "Culoarea Liniei",
  "pointshapelabel": "Forma Punctului",
  "pointsizelabel": "Dimensiunea Punctului (0-10 mm)",
  "styleoptlabel": "Opțiuni de Stil",
  "factorseplinelabel": "Numele Factorilor pe Linii Separate",
  "plotbandslabel": "Bande de Grafic",
  "textsizelabel": "Dimensiunea Textului (1-10 mm)",
  "estticklabelsizelabel": "Dimensiunea Etichetei Mărcii de Estimare (1-50)",
  "help": {
    "title": "Grafic de Pădure",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nAcesta creează un grafic al coeficientelor modelului, sau coeficientelor exponentiate, dintr-un model de regresie. Fiecare variabilă este graficată în propria sa linie cu totaluri, estimări de parametru, \nintervale de încredere de 95% și valori p. Variabilele pot fi etichetate pentru a permite o prezentare mai plăcută. În prezent, sunt acceptate modele de clasă lm (modele liniare), glm (modele liniare generalizate, \ncare includ logistic și Poisson), coxph (riscuri proporționale Cox) și rq (regresie cuantilă).\n<br/><br/>\n<b>Selectați Numele Modelului:</b> Alegeți numele modelului așa cum a fost specificat atunci când modelul a fost ajustat. Acesta este un câmp obligatoriu.\n<br/><br/>\n<b>Variabile de Grafiat:</b> Dacă aveți acces la datele care au creat modelul, puteți specifica un subset al variabilelor din model pentru a fi incluse în grafic. Dacă nu sunt specificate variabile, \nse va reveni la toate variabilele incluse.\n<br/><br/>\n<b>Etichete de Variabile:</b> Specificați etichete mai plăcute pentru a fi utilizate în locul numelui variabilei. Dacă o variabilă nu este etichetată, se va grafică numele variabilei sau eticheta variabilei existente utilizate atunci când \na fost ajustat modelul (dacă există). Acestea trebuie specificate într-un format variablename=\"eticheta\", separate prin virgule. Rețineți că includerea \\n într-o etichetă va forța\no întrerupere de linie în cadrul etichetei. Acest lucru înseamnă că puteți specifica etichete pe mai multe linii și ar putea fi avantajos pentru etichete lungi, deoarece etichetele lungi lăsate pe o linie lasă mai puțin spațiu pentru estimări. Efectuarea \nun rezumat al modelului cu Evaluarea Modelului -> Rezumați -> Rezumați un Model va imprima variabilele modelului utilizate în cazul în care nu aveți acces la setul de date. NOTĂ: Există un \nbug actual în pachetul forestmodel R care nu utilizează etichetele variabilelor pentru factorii din modelele Cox - dezvoltatorul pachetului a fost notificat. O alternativă până când pachetul se \nrezolvă este să recalibrați modelul cu variabile codificate fictiv în loc de factori.\n<br/><br/><br/>\n<b>Opțiuni de Estimare:</b>\n<br/><br/>\n<b>Etichetă:</b> Etichetă opțională pentru coloana de estimare din grafic. Regresia logistică și modelele Cox vor fi detectate automat și estimările vor fi etichetate ca \"Raport de Momente\" și \n\"Raport de Risc\", respectiv. Alte modele vor folosi valoarea implicită de \"Estimare\" dacă nu specificați nimic.\n<br/><br/>   \n<b>Forțează Exponencierea Estimării Parametrului:</b> Alegeți aceasta pentru a forța ca valorile exp(coeficient) să fie afișate, adică 2.718 ridicat la puterea coeficientului. \nCoeficientii exponentiați sunt utilizați frecvent în modelele de riscuri proporționale Cox (pentru rapoarte de risc), regresie logistică (pentru rapoarte de momente), modele log-binomial (pentru riscuri relative) și regresie Poisson \n(pentru rapoarte de rată). În mod implicit, regresia logistică și modelele Cox vor fi detectate automat și se va folosi exp(coeficient).\n<br/><br/>\n<b>Culoarea Liniei:</b> Culoarea liniei pentru intervalele de încredere.\n<br/><br/>\n<b>Forma Punctului:</b> Forma punctelor pentru estimările parametrilor din grafic.\n<br/><br/>\n<b>Dimensiunea Punctului (0-10 mm):</b>  Dimensiunea punctelor, în milimetri, pentru estimările parametrilor din grafic. 0 mm ar elimina punctele. Valoarea implicită este de 4 mm.\n<br/><br/><br/>\n<b>Opțiuni de Stil:</b>\n<br/><br/>\n<b>Numele Factorilor pe Linii Separate:</b> Alegeți aceasta pentru a afișa numele variabilelor de factori pe o linie separată de nivelurile factorului.\n<br/><br/>\n<b>Bande de Grafic:</b> Alegeți aceasta pentru a afișa regiuni umbrite alternativ pentru fiecare linie a graficului.\n<br/><br/>\n<b>Dimensiunea Textului (1-10 mm):</b> Dimensiunea textului, în milimetri, în grafic. Valoarea implicită este de 4 mm.\n<br/><br/>\nNotă: Dacă doriți să schimbați dimensiunea generală a graficului, dimensiunea graficului poate fi setată folosind butonul Tematici din meniul cu trei puncte.\n<br/><br/>\n<b>Dimensiunea Etichetei Mărcii de Estimare (1-50):</b> Dimensiunea etichetelor de marcă pentru axa de estimare.\n<br/><br/>\n<b>Pachete R Necesare:</b>  forestmodel, arsenal, survival, quantreg, insight\n"
  }
}