{
  "title": "Testul Friedman",
  "navigation": "Testul Friedman",
  "tvarbox1": "Variabile de răspuns, 2 sau mai multe",
  "help": {
    "title": "Testul Friedman",
    "r_help": "help(friedman.test, package=stats)",
    "body": "\n<b>Descriere</b></br>\nEfectuează un test de sumă a rangurilor Friedman cu date blocate nereplicate.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## Metodă S3 implicită:\nfriedman.test(y, groups, blocks, ...)\n## Metodă S3 pentru clasa 'formula'\nfriedman.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ny: fie un vector numeric de valori de date, fie o matrice de date.\n</li>\n<li>\ngroups: un vector care oferă grupul pentru elementele corespunzătoare ale lui y dacă acesta este un vector; ignorat dacă y este o matrice. Dacă nu este un obiect factor, este convertit într-unul.\n</li>\n<li>\nblocks: un vector care oferă blocul pentru elementele corespunzătoare ale lui y dacă acesta este un vector; ignorat dacă y este o matrice. Dacă nu este un obiect factor, este convertit într-unul.\n</li>\n<li>\nformula: o formulă de forma a ~ b | c, unde a, b și c oferă valorile de date și grupurile și blocurile corespunzătoare, respectiv.\n</li>\n<li>\ndata: o matrice sau un cadru de date opțional (sau similar: vezi model.frame) care conține variabilele din formulă. În mod implicit, variabilele sunt preluate din environment(formula).\n</li>\n<li>\nsubset: un vector opțional care specifică un subset de observații de utilizat.\n</li>\n<li>\nna.action: o funcție care indică ce ar trebui să se întâmple atunci când datele conțin NAs. Implicit, se utilizează getOption(\"na.action\").\n</li>\n<li>\n...: alte argumente care trebuie transmise metodelor.\n</li>\n</ul>\n<b>Detalii</b></br>\nfriedman.test poate fi utilizat pentru a analiza designuri complete de blocuri nereplicate (adică există exact o observație în y pentru fiecare combinație de niveluri de grupuri și blocuri) unde presupunerea de normalitate poate fi încălcată.</br>\nIpoteza nulă este că, în afară de un efect al blocurilor, parametrul de locație al lui y este același în fiecare dintre grupuri.\nDacă y este o matrice, grupurile și blocurile sunt obținute din indicii de coloană și rând, respectiv. NAs nu sunt permise în grupuri sau blocuri; dacă y conține NAs, blocurile corespunzătoare sunt eliminate.</br>\n<b>Valoare</b><br/>\nO listă cu clasa \"htest\" care conține următoarele componente:<br/>\nstatistică: valoarea statisticii chi-pătrat a lui Friedman.<br/>\nparametru: gradele de libertate ale distribuției chi-pătrat aproximative a statisticii de test.<br/>\np.value: valoarea p a testului.<br/>\nmetodă: șirul de caractere \"Testul de sumă a rangurilor Friedman\".<br/>\ndata.name: un șir de caractere care oferă numele datelor.​<br/>\n<b>Exemple</b><br/>\n<code> \nDataframe <- data.frame(Expenses=c(20,23,19,25,26), Sales=c(48,50,55,51,49), Gender=c('m','f','f','m','m'), Deptt=c('Accounts', 'HR', 'Sales','Marketing','IT'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Sales,Expenses)))<br/>\nResult_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(friedman.test, package=stats)\n"
  }
}