{
  "title": "Hartă de Căldură",
  "navigation": "Hartă de Căldură",
  "rowVariables": "Variabilă țintă",
  "columnVariables": "Variabile de coloană",
  "options": "Opțiuni",
  "title1": "Titlul Hărții de Căldură",
  "dendrogram": "Dendrogram:",
  "label1": "Opțiuni pentru dendrograma pe rânduri:",
  "plotRowYes": "Reordonare dendrogramă pe baza mediei pe rânduri",
  "plotRowNo": "Fără reordonare (dendrograma nu va fi calculată)",
  "label2": "Opțiuni pentru dendrograma pe coloane",
  "plotColumnYes": "Reordonare dendrogramă pe baza mediei pe coloane",
  "plotColumnNo": "Nu",
  "symmetric": "În cazul unei matrice simetrice, tratați coloanele ca pe rânduri",
  "trace": "Opțiuni pentru desenarea unei linii de trasare solide pe rânduri, coloane, atât rânduri cât și coloane sau niciuna",
  "density": "Opțiuni de densitate:",
  "scale": "Valorile ar trebui să fie centrate în direcția rândului, direcția coloanei sau niciuna",
  "label3": "Valori lipsă",
  "Remove": "Eliminați toate rândurile care conțin o valoare lipsă",
  "Keep": "Păstrați rândurile care conțin valori lipsă",
  "label4": "Plasați valorile în celulă",
  "valuesNo": "Da",
  "valuesYes": "Nu",
  "noteColors": "Alegeți o culoare pentru valorile celulelor (După selectarea culorii, faceți clic în afara controlului pentru a aplica):",
  "help": {
    "title": "Hartă de Căldură",
    "r_help": "help(heatmap.2,package='gplots')",
    "body": "\n            <b>Descriere</b></br>\n            O hartă de căldură este o reprezentare grafică a datelor în care valorile individuale conținute într-o matrice sunt reprezentate ca culori. Facetele pot fi create opțional specificând o variabilă factor. De asemenea, puteți specifica teme și specifica un titlu și etichete pentru axa x și axa y</br>\n            Setul de date trebuie să fie în formatul coloană1, coloană2…coloanăN unde</br>\n            coloană1: Identifică subiecții, de exemplu, numele persoanelor ale căror valori de colesterol sunt reprezentate grafic</br>\n            coloană2:  Identifică valorile colesterolului în timpul 1</br>\n            coloană3:  Identifică valorile colesterolului în timpul 2</br>\n            coloană4:  Identifică valorile colesterolului în timpul 3</br>\n            coloană5:  Identifică valorile colesterolului în timpul 4…</br>\n            Coloana1 este o etichetă pentru fiecare rând din harta de căldură.</br>\n            Pentru coloana 2 încolo, valorile din fiecare rând al coloanei sunt reprezentate ca culori în harta de căldură.</br>\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code> \n            BSkyHeatMap(rowVariable=c('Subiect'),colVariables=c('chol1','chol2','chol3','chol4'),Colv=FALSE,Rowv=TRUE,dendrogram=c(\"rând\"),scale=c(\"niciunul\"),trace=c(\"niciunul\"),density.info=c(\"niciunul\"),na.rm=TRUE,noteForCells =FALSE,notecol =c(\"negru\"),dataset=\"Set de Date4\")<br/>\n            Funcția de mai sus este în pachetul BlueSky și invocă funcția heatmap.2 din pachetul gplots.\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            data: Setul de date implicit\n            </li>\n            <li>\n            rowVariable: Variabila de coloană care conține informații despre subiecții pentru care este construit graficul, vezi mai sus\n            </li>\n            <li>\n            colVariables:  o listă de variabile de coloană care conțin valori care vor fi reprezentate ca culori în harta de căldură\n            </li>\n            <li>\n            Colv: determină dacă și cum ar trebui să fie reordonată dendrograma pe coloană. Are opțiunile ca argumentul Rowv de mai sus și, în plus, atunci când x este o matrice pătrată, Colv=\"Rowv\" înseamnă că coloanele ar trebui tratate identic cu rândurile.\n            </li>\n            <li>\n            Rowv:   determină dacă și cum ar trebui să fie reordonată dendrograma pe rând. În mod implicit, este TRUE, ceea ce implică că dendrograma este calculată și reordonată pe baza mediei pe rânduri. Dacă este NULL sau FALSE, atunci nu se calculează nicio dendrogramă și nu se face nicio reordonare. Dacă este o dendrogramă, atunci este utilizată \"așa cum este\", adică fără nicio reordonare. Dacă este un vector de întregi, atunci dendrograma este calculată și reordonată pe baza ordinii vectorului.\n            </li>\n            <li>\n            na.rm: logic care determină dacă NA-urile ar trebui eliminate\n            </li>\n            <li>\n            dendrogram: șir de caractere care indică dacă să se deseneze 'niciunul', 'rând', 'coloană' sau 'ambele' dendrograme. Implicit este 'ambele'. Cu toate acestea, dacă Rowv (sau Colv) este FALSE sau NULL și dendrograma este 'ambele', atunci se emite un avertisment și se respectă argumentele Rowv (sau Colv).\n            </li>\n            <li>\n            scale: caracter care indică dacă valorile ar trebui să fie centrate și scalate fie în direcția rândului, fie în direcția coloanei, sau niciuna. Valoarea implicită este \"niciunul\".\n            </li>\n            <li>\n            trace: caracter care indică dacă valorile ar trebui să fie centrate și scalate fie în direcția rândului, fie în direcția coloanei, sau niciuna. Valoarea implicită este \"niciunul\".\n            </li>\n            <li>\n            density.info: șir de caractere care indică dacă să se suprapună un 'histogramă', un grafic de 'densitate', sau niciun grafic ('niciunul') pe cheia de culoare.\n            </li>\n            <li>\n            noteForCells: logic care indică dacă valorile ar trebui plasate în celulele hărții de căldură.\n            </li>\n            <li>\n            notecol: culoarea notelor. Dacă este specificată, valorile sunt notate în celulele hărții de căldură în culoarea specificată..\n            </li>\n            </ul>\n            <b>Pachet</b></br>\n            BlueSky;gplots;</br>\n            <b>Ajutor</b></br>\n            help(heatmap.2,package='gplots')</br>\n            Altceva: Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(labs), help(geom_histogram), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)</br>\n            Seturi de date de exemplu: Vezi Heatmaps.Rdata în folderul Seturi de Date Exemplu R</br>\n     "
  }
}