{
    "title": "Histogramă cu Curbe Normale Suprapuse",
    "navigation": "Histogramă",
    "x": "Axa X, specificați o variabilă numerică",
    "bins": "Specificați numărul de coșuri (bins)",
    "fill": "Specificați o variabilă de grupare (Categorie)",
    "binwidth": "Lățimea coșului",
    "barcolor": "Selectați opțional o culoare de umplere (După selectarea culorii, faceți clic în afara controlului pentru aplicare)",
    "alpha": "Opacitate (0-1)",
    "flip": "Răsturnați axa",
    "specify_a_title": "Introduceți un titlu",
    "x_title": "Etichetă axă X",
    "y_title": "Etichetă axă Y",
    "facets_lbl": "Fațete",
    "Facetrow": "Rând fațetă",
    "Facetcolumn": "Coloană fațetă",
    "Facetwrap": "Împachetare fațetă (dacă este selectat, orice selecție de rând și coloană fațetă va fi ignorată)",
    "Facetscale": "Scara fațetelor",
    "normalCurveColor": "Selectați opțional o culoare pentru curba normală (După selectarea culorii, faceți clic în afara controlului pentru aplicare)",
    "rugPlot": "Afișați un grafic de tip \"rug\" (potrivit pentru seturi mici de date)",
    "normalCurve": "Afișați o curbă normală (Valorile lipsă sunt eliminate pentru afișarea curbei)",
    "normalCurveHeightScaleFactor": "Orice număr, inclusiv zecimale, pentru scalarea înălțimii curbei normale (pentru bare stivuite). Introduceți 0 pentru a nu scala",
    "showCountsChk": "Afișați numărul de elemente în coșuri (numărarea nu va fi afișată dacă este selectat un grup sau o fațetă)",
    "histogramBarPosition": "Poziția barei, dacă este ales un grup (stivuit sau alăturat)",
    "histogramBinDetailsChk": "Afișați detalii despre coșurile histogramului într-un tabel",
    "help": {
        "title": "Histogramă",
        "r_help": "help(geom_histogram, package=ggplot2)",
        "body": "<b>Descriere</b></br>O histogramă este o reprezentare grafică a distribuției datelor numerice. Este o estimare a distribuției probabilității unei variabile continue (variabilă cantitativă). Puteți specifica o lățime pentru coșuri sau folosi valoarea implicită, vedeți mai jos. Fațetele pot fi create opțional prin specificarea unei variabile factor. De asemenea, puteți specifica opțional teme, un titlu și etichete pentru axele x și y.</br>Când aveți selectate mai multe variabile pentru axa X, creăm o histogramă separată pentru fiecare variabilă de pe axa x. Opțional, suprapunem o curbă normală și un grafic de tip \"rug\".</br><br/><b>Utilizare</b><br/><code>ggplot(data=Dataset2,aes(x=engine)) + geom_histogram(binwidth=10) + labs(x=\"engine\", y=\"Număr\") + xlab(\"\")</code><br/><b>Argumente</b><br/><ul><li>data: Setul de date implicit</li><li>aes(): Generează mapări estetice care descriu cum variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geoms.</li><li>x: O variabilă numerică/scalară pentru care se trasează histograma.</li><li>geom_histogram: Creează o histogramă, implicit stat_bin folosește 30 de coșuri - acesta nu este un bun implicit, dar ideea este să experimentați cu diferite lățimi de coș.</li><li>geom_rug: Creează un grafic de tip \"rug\".</li><li>stat_function: Creează o curbă normală (Notă: valorile lipsă trebuie eliminate pentru afișarea curbei).</li><li>Labs(): Modifică etichetele axelor și titlurile legendei (opțional).</li><li>facet_grid(): Aranjează panourile într-o grilă (opțional).</li><li>theme_calc(): Specifică tema calculatorului (opțional).</li><li>coord_flip(): Răstoarnă axa (opțional).</li><li>alpha: Primește o valoare între 0-1, 1 înseamnă fără opacitate. Opacitatea se aplică culorii de umplere a histogramei.</li></ul><b>Pachet</b>: ggplot2; ggthemes; stringr<br/><b>Ajutor</b>: help(geom_histogram, package=ggplot2)"
    }
}
