{
  "title": "Histogramă cu curbe normale suprapuse pe fațetă și grup",
  "navigation": "Histogramă",
  "x": "Axa X, specificați o (sau mai multe) variabile numerice",
  "bins": "Specificați numărul de bins",
  "fill": "Specificați o variabilă de grupare (categorie)",
  "binwidth": "Lățimea bin-ului",
  "barcolor": "Selectați opțional o culoare de umplere (După selectarea culorii, faceți clic în afara controlului pentru a aplica)",
  "alpha": "Opacitate (0-1)",
  "flip": "Răsturnați axa",
  "specify_a_title": "Introduceți un titlu",
  "x_title": "Eticheta axei X",
  "y_title": "Eticheta axei Y",
  "Facetrow": "Rând de fațete",
  "Facetcolumn": "Coloană de fațete",
  "Facetwrap": "Împachetare de fațete (dacă este aleasă, orice selecție de rând și coloană de fațete va fi ignorată)",
  "Facetscale": "Scara de fațete",
  "normalCurveColor": "Selectați opțional o culoare pentru curba normală (După selectarea culorii, faceți clic în afara controlului pentru a aplica)",
  "rugPlot": "Afișați un grafic de tip rug (potrivit pentru seturi de date mici)",
  "normalCurve": "Afișați o curbă normală (valorile lipsă sunt eliminate pentru a afișa curba)",
  "help": {
    "title": "Histogramă",
    "r_help": "help(geom_histogram, package=ggplot2)",
    "body": "\n            <b>Descriere</b></br>\n            Un histogramă este o reprezentare grafică a distribuției datelor numerice. Este o estimare a distribuției de probabilitate a unei variabile continue (variabilă cantitativă). Puteți specifica o lățime a bin-ului sau utiliza lățimea implicită, vedeți mai jos. Fațetele pot fi create opțional specificând o variabilă factor. De asemenea, puteți specifica opțional teme și specifica un titlu și etichete pentru axele x și y.</br>\n            Când aveți mai multe variabile selectate pentru variabila axei X, creăm un histogramă separată pentru fiecare variabilă a axei X. Opțional, suprapunem o curbă normală și un grafic de tip rug.</br>\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Counts\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            data: Setul de date implicit​\n            </li>\n            <li>\n            aes(): Generează asocieri estetice care descriu modul în care variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geoms.​\n            </li>\n            <li>\n            x: O variabilă numerică/scală pentru a trasa histogramă.​\n            </li>\n            <li>\n            geom_histogram: Creează un histogramă, implicit, stat_bin folosește 30 de bins - acesta nu este un bun implicit, dar ideea este să experimentați cu diferite lățimi de bin..\n            </li>\n            <li>\n            geom_rug: Creează un grafic de tip rug    \n            </li>\n            <li>\n            stat_function: Creează o curbă normală (Notă: valorile lipsă trebuie eliminate pentru ca curba să fie afișată)    \n            </li>\n            <li>\n            Labs(): Schimbă etichetele axelor și titlurile legendelor (acesta este opțional)​\n            </li>\n            <li>\n            facet_grid(): Așează panourile într-o grilă (acesta este opțional)​\n            </li>\n            <li>\n            theme_calc(): Specifică tema calculatorului (acesta este opțional)​\n            </li>\n            <li>\n            coord_flip(): Răsturnați axa (acesta este opțional)\n            </li>\n            <li>\n            alpha: Ia o valoare între 0-1, 1 înseamnă fără opacitate. Opacitatea se aplică culorii de umplere a histogramă\n            </li>\n            </ul>\n            <b>Pachet</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Ajutor</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Faceți clic pe butonul de ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n           "
  }
}