{
  "title": "Instalați pachet(e) R",
  "navigation": "Instalați pachet(e) R",
  "package_name": "Vă rugăm să introduceți numele unuia sau mai multor pachete separate prin virgulă",
  "instruction_text": "\nNOTĂ: Numele pachetelor R sunt sensibile la majuscule. Puteți instala mai multe nume de pachete folosind , ca separator\nExemplu 1: foreign\nExemplu 2: foreign, car, MASS",
  "instruction_text1": "\nNOTĂ: Trebuie să aveți acces de scriere la calea selectată mai jos, altfel relansați aplicația selectând opțiunea de a rula ca \nadministrator",
  "repository": "Introduceți URL-ul depozitului CRAN, implicit https://cloud.r-project.org/ instalează de la oglinda CRAN cea mai apropiată de dumneavoastră.",
  "label1": "Exemplu 1: foreign",
  "label2": "NOTĂ: Logo-ul R care se afișează pe bara de meniu este proprietatea de copyright a fundației R",
  "installPath": "Selectați calea bibliotecii R unde va fi instalat pachetul R",
  "help": {
    "title": "Instalați pachet(e) R",
    "r_help": "help(install.packages)",
    "body": "\n            <b>Descriere</b></br>\n            Instalați sau actualizați unul sau mai multe pachete R în calea bibliotecii selectate.</br>\n            NOTĂ:</br>\n            1. Vom instala toate pachetele de care depind pachetele specificate, importă sau leagă</br>\n            2. Dacă actualizați un pachet existent, trebuie să reporniți aplicația BioStat Prime.</br>\n            3. Vom încărca pachetul nou instalat/actualizat după instalare.</br>\n            4. Implicit, vom instala întotdeauna în biblioteca personală R a utilizatorului pe mașina locală.</br>\n            5. Dacă același pachet R este instalat în locația bibliotecii personale și în cea a sistemului (Locația bibliotecii sistemului este locația implicită de instalare care conține pachetele \n                pe care le livrăm din cutie cu BioStat Prime), încărcăm pachetul din locația personală.</br>\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Calea către biblioteca utilizatorului sau a sistemului\", repos = \"Calea către depozitul care conține pachetul\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            pkgs: vector de caractere cu numele pachetelor ale căror versiuni curente ar trebui să fie descărcate din depozitul specificat.\n            </li>\n            <li>\n            lib: vector de caractere care oferă calea bibliotecii pe mașina locală unde să instalați pachet(e). Implicit, ne bazăm pe locația bibliotecii personale a utilizatorului.\n            </li>\n            <li>\n            repos: vector de caractere, URL-urile de bază ale depozitelor de utilizat, de exemplu, URL-ul unei oglinzi CRAN, cum ar fi \"https://cloud.r-project.org\".\n            </li>\n            <li>\n            BSkypackageinstall: Acesta este un semnal pe care aplicația BioStat Prime îl folosește intern pentru a semnala că \n            pachetul este instalat prin meniu și pentru a-l transmite mai departe.\n            </li>\n            </ul>\n            <b>Valoare</b><br/>\n            NULL invizibil.<br/>\n            <b>Exemple</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Pachet</b></br>\n            broom</br>\n            <b>Ajutor</b></br>\n            Pentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog\n\n"
  }
}