{
  "title": "Estimarea Kaplan-Meier, Un Grup",
  "navigation": "Estimarea Kaplan-Meier, Un Grup",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Eveniment (1 = eveniment, 0 = cenzură)",
  "label1": "Tip Grafic",
  "survivalradio": "Supraviețuire",
  "inciradio": "Eșec",
  "printallest": "Tabel de Estimări Incluzând Toate Timpurile",
  "printspecest": "Tabel de Estimări pentru Timpuri Specifice",
  "spectimes": "Specificați timpi ca time1, time2, time3, etc. sau ca seq(1,5,by=1)",
  "styleoptions": "Opțiuni de Stil",
  "axisoptions": "Opțiuni de Axă",
  "label12": "Faceți clic pe butonul ? din colțul din dreapta sus al dialogului pentru detalii despre seturi de date de probă și formatul de date acceptat.",
  "titlebox": "Titlul Graficului",
  "plottitlesizelabel": "Dimensiunea Titlului Graficului (5-50)",
  "themedropdown": "Tema Graficului",
  "label2": "Numărul în Risc",
  "natriskchkbox": "Includeți Numărul în Risc",
  "risktableprop": "Înălțimea Tabelului de Risc (0-1)",
  "risktablepos": "Poziția Tabelului de Risc",
  "risktablevaluesize": "Dimensiunea Valorii Tabelului de Risc (1-15)",
  "risktabletitlesize": "Dimensiunea Titlului Tabelului de Risc (5-50)",
  "risktableaxislabelsize": "Dimensiunea Etichetei Axei Tabelului de Risc (5-50)",
  "risktableticklabelsize": "Dimensiunea Etichetei de Marcaj a Tabelului de Risc (5-50)",
  "risktableclean": "Eliminați Axe și Linii de Grilă din Tabelul de Risc",
  "label3": "Opțiuni de Linie",
  "linesize": "Dimensiune (0-5)",
  "linecolor": "Culoare",
  "label4": "Interval de Încredere",
  "cichkbox": "includeți IC de 95%",
  "cistyle": "Stil",
  "citransparency": "Transparență (0-1)",
  "label5": "Timpuri Cenzurate",
  "censorchkbox": "Includeți Timpuri Cenzurate",
  "censorsize": "Dimensiune (0-10)",
  "medsurvivalline": "Indicați Supraviețuirea Mediană (h=orizontal, v=vertical)",
  "label6": "Axă de Supraviețuire",
  "survaxislabel": "Etichetă",
  "axislabelsize": "Dimensiunea Etichetei Axei (5-50)",
  "label7": "Scală",
  "defbutton": "proporție",
  "pctbutton": "procent",
  "survaxislimits": "Limitele axei pe scală de proporție (0-1) - introduceți 'c(min, max)'",
  "survtickinc": "Incrementuri de Marcaj (0-1)",
  "label8": "Axă de Timp",
  "timeaxislabel": "Etichetă",
  "timeaxislimits": "Limitele Axei (NULL este implicit, introduceți 'c(min,max)' pentru a schimba, de ex. 'c(0,20)')",
  "timetickinc": "Incrementuri de Marcaj (NULL este implicit, introduceți un număr pentru a schimba, min=0)",
  "ticklabelsize": "Dimensiunea Etichetei de Marcaj a Axei (5-50)",
  "help": {
    "title": "Estimarea Kaplan-Meier, Un Grup",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tConsultați setul de date de probă din directorul de instalare, locația implicită este pe litera unității:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. Variabila Followup_time trebuie introdusă ca timpul până la eveniment sau cenzură, iar variabila Event trebuie introdusă ca Eveniment (1 = eveniment, 0 = cenzură).<br/>\n            Acest set de date este o versiune actualizată a setului de date mockstudy din pachetul arsenal.<br/><br/>\t\t\n            <b>Curbele de supraviețuire Kaplan-Meier</b>\n            <br/>\n            <br/>\n            Acestea sunt utilizate pentru a estima riscul cumulativ de a nu avea un anumit eveniment (sau, invers, de a avea un anumit eveniment) pe o perioadă de timp după începutul urmăririi pentru acel eveniment (sau timpul zero). Subiecții trebuie să fie în risc pentru eveniment începând de la timpul zero.\n            <br/>\n            <br/>\n            <b>Timp:</b> Durata timpului până la un eveniment, dacă evenimentul a avut loc, sau ultima urmărire pentru acel eveniment, dacă evenimentul nu a avut loc, pentru fiecare subiect\n            <br/><br/>\n            <b>Eveniment:</b> Indicator numeric dacă evenimentul a avut loc sau nu (1=eveniment, 0=cenzură) pentru fiecare subiect\n            <br/><br/>\n            <b>Tip Grafic:</b> Dacă doriți să reprezentați grafic probabilitatea de a nu avea evenimentul (supraviețuire) sau de a avea evenimentul (eșec)\n            <br/><br/>\n            <b>Tabel de Estimări Incluzând Toate Timpurile:</b> Opțiune de a include un tabel care are probabilitățile de estimare a supraviețuirii și evenimentului pentru fiecare timp observat în setul de date\n            <br/>\n            <br/>\n\t\t\t<b>Tabel de Estimări pentru Timpuri Specifice:</b> Opțiune de a include un tabel care are probabilitățile de estimare a supraviețuirii pentru un set de timp selectat de utilizator.\n\t\t\t<br/><br/>\n\t\t\t<b>Specificați timpi ca time1, time2, time3, etc. sau ca seq(1,5,by=1):</b> Acestea sunt timpii specifici care vor fi incluși în tabel pentru timpi specifici. Pot fi specificați individual cu virgule sau ca o secvență de valori uniform distribuite.\n\t\t\t<br/><br/>\n            Tabelele sunt generate cu dimensiunea eșantionului, numărul de subiecți cu evenimentul, timpul mediu de supraviețuire (dacă este definit), timpul mediu de supraviețuire restricționat și timpul mediu de urmărire. Timpul mediu de urmărire este calculat folosind estimarea Kaplan-Meier inversă, care tratează evenimentele adevărate ca observații cenzurate și observațiile cenzurate adevărate ca evenimente. Prin urmare, \"evenimentul\" în acest estimator este \"urmărirea subiecților cât mai mult timp posibil\".\n            <br/>\n            O tabelă de estimări de supraviețuire și eveniment Kaplan-Meier este furnizată la fiecare timp observat în setul de date, cu intervale de încredere de 95%. \n            <br/>\n            <br/>\n            <b>Pachete Necesare:</b> survival, broom, survminer, dplyr, arsenal, ggthemes \n            <br/>\n            <br/>\n            <br/>           \n            <b>Opțiuni de Stil</b>\n            <br/>\n            <br/>\n            <b>Titlu Grafic:</b> Titlul graficului; ștergeți tot textul pentru a nu avea titlu\n            <br/><br/>\n\t\t\t<b>Dimensiunea Titlului Graficului:</b> Dimensiunea titlului graficului.\n\t\t\t<br/><br/>\n            <b>Tema Graficului:</b> Stilul general al graficului\n            <br/><br/>\n            <b>Includeți Numărul în Risc:</b> Opțional, includeți un tabel pentru numărul de subiecți care sunt încă în risc de-a lungul timpului în partea de jos a graficului.  <b>Poziția Tabelului de Risc</b> specifică dacă doriți ca tabelul să fie în afara axelor sau în interiorul axelor.  <b>Înălțimea Tabelului de Risc</b> controlează proporția zonei de grafic pe care o va ocupa tabelul. Această opțiune este ignorată atunci când poziția tabelului de risc este în interiorul axelor. \n\t\t\tDimensiunea <b>Valorii Tabelului de Risc</b> controlează dimensiunea numerelor în risc. Dimensiunea <b>Titlului Tabelului de Risc</b> controlează dimensiunea titlului pentru tabelul numărului în risc.\n\t\t\tDimensiunea <b>Etichetei Axei Tabelului de Risc</b> controlează dimensiunea etichetelor axei.\n\t\t\tDimensiunea <b>Etichetei de Marcaj a Tabelului de Risc</b> controlează dimensiunea etichetelor de marcaj pentru timpii din tabelul numărului în risc. Dacă doriți să eliminați toate axele și liniile de grilă \n\t\t\tdin tabelul numărului în risc, opțiunea <b>Eliminați Axe și Linii de Grilă din Tabelul de Risc</b> poate fi bifată. Aceasta va include doar numerele în risc în tabel.\n            <br/>\n            <br/>\n            <b>Opțiuni de Linie:</b>\n            <b>Dimensiunea</b> controlează grosimea și <b>Culoarea</b> controlează culoarea liniei desenate. Se poate include opțional un interval de încredere de 95% pentru estimări în format <b>ribbon</b> (zonă umbrită) sau <b>step</b> (linie). <b>Transparența</b> controlează cât de întunecată este banda și este ignorată atunci când se selectează opțiunea pas. <b>Timpurile Cenzurate</b> (când subiecții nu mai sunt în risc pentru eveniment) pot fi indicate pe linie cu simboluri de \"+\". Dimensiunea simbolurilor de \"+\" poate fi ajustată. Opțiunea <b>Indicați Supraviețuirea Mediană</b> va include linii orizontale sau verticale în momentul în care se estimează că 50% dintre subiecți au avut evenimentul. Timpul median nu este definit dacă curba de supraviețuire nu trece de 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opțiuni de Axă</b>\n            <br/> \n            <br/> \n            Opțiunea <b>Etichetă</b> specifică eticheta de text pentru axă. Opțiunea <b>Limitele Axei</b> specifică valorile minime și maxime ale axei. Opțiunea <b>Incrementuri de Marcaj</b> controlează distanța dintre marcajele de pe axă. Incrementurile de pe axa de timp controlează, de asemenea, timpii pentru tabelul opțional de număr în risc.\n            <br/> \n            Opțiunea <b>Scală</b> a axei de supraviețuire specifică dacă doriți ca estimările să fie pe o scară de proporție (0-1) sau procent (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Etichetei Axei:</b> Aceasta controlează dimensiunea etichetelor axei de supraviețuire și timp.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea Etichetei de Marcaj a Axei:</b> Aceasta controlează dimensiunea etichetelor de marcaj ale axei de supraviețuire și timp.\n"
  }
}