{
  "title": "Faceți predicții cu KNN",
  "navigation": "Predicție cu KNN",
  "dataset_var": "Deschideți seturi de date",
  "header": "KNN este un clasificator leneș, nu creează un model ajustat care poate fi folosit pentru a prezice mai târziu. Se ajustează și face predicții în același timp. Trebuie să urmați pașii de mai jos pentru a face predicții/evaluări.",
  "NOTE1": "SETUL DE DATE ACTIV TREBUIE SĂ FIE SETUL DE DATE PE CARE DORIȚI SĂ CONSTRUIȚI UN MODEL ȘI NU SETUL DE DATE PE CARE DORIȚI SĂ ÎNDRUMAȚI",
  "step1": "Pasul 1: Ca de obicei, trebuie să selectați setul de date de antrenament în Datagrid înainte de a deschide acest dialog.",
  "step2": "Pasul 2: Selectați variabila dependentă din setul de date de antrenament utilizat pentru a ajusta modelul.",
  "step3": "Pasul 3: Specificați variabilele independente din setul de date de antrenament.",
  "step4": "Pasul 4: Specificați numărul de vecini care trebuie utilizați pentru a construi modelul.",
  "step5": "Pasul 5: Introduceți un prefix de variabilă pentru noua variabilă care conține predicțiile.",
  "step6": "Pasul 6: Specificați setul de date la care se vor adăuga predicții. Acesta trebuie să conțină aceleași variabile independente utilizate pentru a antrena modelul.",
  "dependentvar": "Variabilă dependentă (din setul de date de antrenament)",
  "independentvars": "Variabilă(variabile) independentă(e) (din setul de date de antrenament)",
  "Seed": "Setați semința",
  "datasetToScore": "Set de date pentru scor/predicție",
  "Group2": "Parametrii de reglare pentru KNN",
  "noneighbhors": "Numărul de vecini (Când nu este specificată o valoare, valoarea implicită este setată la rădăcina pătrată a numărului de observații din setul de date)",
  "testDatasetName": "Introduceți numele setului de date pentru a face predicții",
  "predictedValues": "Introduceți un prefix de variabilă pentru valorile prezise. O nouă variabilă este creată prin adăugarea prefixului la numele variabilei dependente.",
  "help": {
    "title": "K Cei Mai Aproape Vecini",
    "r_help": "ajutor(knn, pachet ='class')",
    "body": "\n                <b>Descriere</b></br>\nClasificare k-vecini cei mai apropiați\n<br/>\n<b>Notă: </b></br>\nConsultați textul de ajutor din dialog\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nknn(train= dataset1, test, cl, k = 1, l = 0, prob = FALSE, use.all = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ntrain: Acesta este setul de date sursă (activ) utilizat pentru a crea un model ajustat.\n</li>\n<li>\ntest: Acesta este setul de date în care valorile prezise vor fi salvate atunci când prefixul specificat. O nouă variabilă este creată prin adăugarea prefixului la variabila dependentă specificată din setul de date sursă.\n</li>\n<li>\ncl: factor al clasificărilor reale din setul de date utilizat pentru a ajusta modelul\n</li>\n<li>\nk: numărul de vecini considerați.\n</li>\n<li>\nl: votul minim pentru o decizie definitivă, altfel îndoială. (Mai precis, se permit mai puțin de k-l voturi de dezacord, chiar dacă k este crescut prin egalitate.)\n</li>\n<li>\nprob: Dacă acest lucru este adevărat, proporția voturilor pentru clasa câștigătoare este returnată ca atribut prob.\n</li>\n<li>\nuse.all: controlează gestionarea egalităților. Dacă este adevărat, toate distanțele egale cu cea de-a k-a cea mai mare sunt incluse. Dacă este fals, se alege o selecție aleatorie de distanțe egale cu cea de-a k-a pentru a folosi exact k vecini.\n</li>\n</ul>\n<b>Valoare</b></br>\nFactor de clasificări ale setului de test. îndoiala va fi returnată ca NA.</br>\n<b>Pachet</b></br>\ncaret;class</br>\n<b>Ajutor</b></br>\najutor(knn, pachet ='class')\n                "
  }
}