{
  "title": "Testul de sumă a rangurilor Kruskal-Wallis",
  "navigation": "Testul Kruskal-Wallis",
  "tvarbox1": "Variabila de răspuns",
  "tvarbox2": "Variabila factor",
  "label1": "Metoda de estimare",
  "default": "Asimptotic",
  "exact": "Exact NOTĂ: variabila factor trebuie să aibă exact 2 niveluri, altfel va apărea o eroare",
  "normal": "Monte Carlo",
  "header": "NOTĂ: Atunci când selectați metoda de estimare exactă, variabila factor trebuie să aibă exact 2 niveluri, altfel va apărea o eroare",
  "padjust": "Ajustarea comparațiilor multiple",
  "ties": "Opțiuni pentru gestionarea legăturilor",
  "simulations": "Introduceți numărul de simulări",
  "help": {
    "title": "Testul de sumă a rangurilor Kruskal-Wallis",
    "r_help": "help(kruskal.test, package=stats)",
    "body": "\n<b>Descriere</b></br>\nEfectuează un test de sumă a rangurilor Kruskal-Wallis.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nkruskal.test(x, ...)\n## Metoda S3 implicită:\nkruskal.test(x, g, ...)\n## Metoda S3 pentru clasa 'formula'\nkruskal.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nArgumente\nx: un vector numeric de valori de date, sau o listă de vectori de date numerice. Elementele non-numerice dintr-o listă vor fi convertite, cu un avertisment.\n</li>\n<li>\ng: un vector sau un obiect factor care oferă grupul pentru elementele corespunzătoare ale lui x. Ignorat cu un avertisment dacă x este o listă.\n</li>\n<li>\nformula: o formulă de forma răspuns ~ grup unde răspunsul oferă valorile de date și grupul un vector sau factor al grupurilor corespunzătoare.\n</li>\n<li>\ndata: o matrice sau un cadru de date opțional (sau similar: vezi model.frame) care conține variabilele din formula formula. În mod implicit, variabilele sunt preluate din environment(formula).\n</li>\n<li>\nsubset: un vector opțional care specifică un subset de observații de utilizat.\n</li>\n<li>\nna.action: o funcție care indică ce ar trebui să se întâmple atunci când datele conțin NAs. Implicit este getOption(\"na.action\").\n</li>\n<li>\n...: argumente suplimentare care vor fi transmise la sau de la metode.\n</li>\n</ul>\n<b>Detalii</b></br>\nkruskal.test efectuează un test de sumă a rangurilor Kruskal-Wallis al ipotezei nule că parametrii de localizare ai distribuției lui x sunt aceiași în fiecare grup (eșantion). Alternativa este că diferă în cel puțin unul.</br>\nDacă x este o listă, elementele sale sunt luate ca eșantioane de comparat, și prin urmare trebuie să fie vectori de date numerice. În acest caz, g este ignorat, și se poate folosi pur și simplu kruskal.test(x) pentru a efectua testul. Dacă eșantioanele nu sunt încă conținute într-o listă, folosiți kruskal.test(list(x, ...)).</br>\nÎn caz contrar, x trebuie să fie un vector de date numerice, iar g trebuie să fie un vector sau un obiect factor de aceeași lungime ca x care oferă grupul pentru elementele corespunzătoare ale lui x.</br>\n<b>Valoare</b><br/>\nO listă cu clasa \"htest\" care conține următoarele componente:<br/>\nstatistic: statistica de sumă a rangurilor Kruskal-Wallis<br/>\nparameter: gradele de libertate ale distribuției chi-pătrată aproximative a statisticii de testare<br/>\np.value: valoarea p a testului<br/>\nmethod: șirul de caractere \"testul de sumă a rangurilor Kruskal-Wallis\"<br/>\ndata.name: un șir de caractere care oferă numele datelor<br/>\n<b>Descriere</b></br>\nAjustarea comparațiilor multiple</br>\nMetodele de ajustare includ corecția Bonferroni (\"bonferroni\") în care valorile p sunt înmulțite cu numărul de comparații. Corecții mai puțin conservatoare sunt incluse de asemenea de Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), Hommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" sau aliasul său \"fdr\"), și Benjamini & Yekutieli (2001) (\"BY\"), respectiv. O opțiune de trecere (\"none\") este de asemenea inclusă. Setul de metode este conținut în vectorul p.adjust.methods pentru beneficiul metodelor care trebuie să aibă metoda ca opțiune și să o transmită la p.adjust.</br>\nPrimele patru metode sunt concepute pentru a oferi un control puternic al ratei de eroare familiale. Nu pare să existe un motiv pentru a folosi corecția Bonferroni ne-modificată deoarece este dominată de metoda Holm, care este de asemenea validă sub presupuneri arbitrare.</br>\nMetodele Hochberg și Hommel sunt valide atunci când testele de ipoteză sunt independente sau când sunt asociate negativ (Sarkar, 1998; Sarkar și Chang, 1997). Metoda Hommel este mai puternică decât metoda Hochberg, dar diferența este de obicei mică și valorile p Hochberg sunt mai rapide de calculat.</br>\nMetoda \"BH\" (cunoscută și sub numele de \"fdr\") și metoda \"BY\" a lui Benjamini, Hochberg și Yekutieli controlează rata de descoperire falsă, proporția așteptată de descoperiri false printre ipotezele respinse. Rata de descoperire falsă este o condiție mai puțin strictă decât rata de eroare familială, astfel încât aceste metode sunt mai puternice decât celelalte.</br>\n</br>\nMetoda de testare pentru comparații de grup pe perechi:</br>\nImplicit: se calculează o valoare p exactă dacă eșantioanele conțin mai puțin de 50 de valori finite și nu există legături. În caz contrar, se folosește o aproximare normală.</br>\nExact: se calculează o valoare p exactă; nu se recomandă pentru dimensiuni mari ale eșantionului din cauza timpului de calcul</br>\nAproximare normală: se calculează valori p folosind o aproximare normală</br>\nCu corecție de continuitate: se calculează valori p folosind o aproximare normală cu o corecție de continuitate </br>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(kruskal.test, package=stats)\n"
  }
}