{
  "title": "Raporturi de Probabilitate și Betas de Grafic",
  "navigation": "Raporturi de Probabilitate și Betas de Grafic",
  "label1": "Selectați un model (modelele de clasă Rm, dRm și eRm sunt acceptate)",
  "label1b": "Dacă nu sunt disponibile modele, trebuie să creați mai întâi un model selectând Ajustare Model -> IRT -> Model Rasch Simplu și alegeți estimarea CML",
  "modelselector1": "Selectați un model",
  "spcr": "Criterii de împărțire",
  "destination": "Selectați variabilele pentru a trasa betas",
  "help": {
    "title": "Raporturi de Probabilitate și Betas de Grafic",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>Descriere</b></br>\n                Acest test LR se bazează pe împărțirea subgrupurilor de subiecți.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \n## Metodă S3 pentru clasa 'Rm'\n<br/>\nLRtest(object, splitcr = \"medie\", se = TRUE)\n<br/>\n## Metodă S3 pentru clasa 'LR'\n<br/>\nplotGOF(x, beta.subset = \"toate\", main = \"Verificare Grafică a Modelului\", xlab, ylab,\n    tlab = \"item\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: Obiect de clasă \"Rm\".\n</li>\n<li>\nsplitcr: Criteriu de împărțire pentru scorul brut al subiectului. \"all.r\" corespunde unei împărțiri complete a scorului brut, \"medie\" folosește media ca criteriu de împărțire, \"mediana\" efectuează o împărțire pe mediana. Opțional, splitcr poate fi, de asemenea, un vector care atribuie fiecărei persoane un anumit subgrup (de exemplu, conform unui criteriu extern). Acest vector poate fi numeric, caracter sau un factor.\n</li>\n<li>\nse: controlează calculul erorilor standard în submodele (implicit: TRUE)\n</li>\n<li>\nx: Obiect de clasă \"LR\". De asemenea, utilizat pentru vizualizarea ajustării elementelor individuale.\n</li>\n<li>\nbeta.subset: Dacă \"toate\", toate elementele sunt trase. În caz contrar, se poate specifica un vector de subset numeric.\n</li>\n<li>\ntlab: Specificarea etichetelor de item: \"item\" imprimă numele itemelor, \"număr\" oferă întregi corespunzători ordinii parametrilor beta, dacă \"niciunul\" nu se imprimă etichete. \"identificare\" permite o etichetare interactivă. Inițial, nu se imprimă etichete, după ce faceți clic aproape de un punct de item, eticheta corespunzătoare este adăugată. Procesul de identificare se termină făcând clic pe al doilea buton și selectând 'Oprire' din meniu, sau din meniul 'Oprire' din fereastra grafică. Pentru mai multe informații și operațiuni de bază, consultați identificare.\n</li>\n<li>\nconf: pentru a trasa elipse de încredere pentru parametrii itemului. Dacă conf = NULL (implicit) nu se desenează elipse. În caz contrar, conf trebuie specificat ca o listă cu elemente opționale: gamma, este nivelul de încredere (numeric), col și lty, culoare și tip de linie (vezi par), care (vector de index numeric) specifică pentru care elemente se desenează elipse (trebuie să fie un subset din beta.subset), și ia, logic, dacă elipsele trebuie desenate interactiv (cf., tlab = \"identificare\" mai sus). Pentru detalii despre comportamentul implicit, dacă conf este specificat ca o listă goală, consultați Detalii și Exemple mai jos. Pentru a folosi conf, obiectul LR x trebuie generat folosind opțiunea se = TRUE în LRtest(). Consultați help(MLoef) pentru mai multe detalii.\n</li>\n</ul>\n<b>Detalii</b></br>\nDacă setul de date conține valori lipsă și se specifică media sau mediana ca criteriu de împărțire, se calculează medii sau medii pentru fiecare subgrup de valori lipsă și se utilizează în consecință pentru împărțirea scorurilor brute.\n<br/>\nCând se utilizează selecția interactivă atât pentru etichetarea punctelor individuale (tlab = \"identificare\" și desenarea elipselor de încredere în anumite puncte (ia = TRUE), mai întâi toate punctele desenate sunt etichetate și apoi toate elipsele sunt generate. Ambele procese de identificare pot fi terminate făcând clic pe al doilea (drept) buton al mouse-ului și selectând 'Oprire' din meniu, sau din meniul 'Oprire' din fereastra grafică.\n<br/>\nFolosind specificația care permite desenarea elipselor selectiv doar pentru anumite elemente, de exemplu, care = 1:3 desenează elipse pentru elementele 1 până la 3 (atâta timp cât sunt incluse în beta.subset). Predeterminat este desenarea elipselor pentru toate elementele. Elementul col din lista conf poate fi fie o specificație de culoare unică, cum ar fi \"albastru\", fie un vector cu specificații de culoare pentru toate elementele. Lungimea trebuie să fie aceeași cu numărul de elipse de desenat. Pentru specificația de culoare, se poate configura o paletă folosind palete standard (de exemplu, curcubeu) sau palete din pachetul colorspace sau RColorBrewer. Un exemplu este dat mai jos.\n<br/>\nMetodele de rezumat și imprimare sunt disponibile pentru obiecte de clasă LR.\n<br/><br/>\n<b>Valoare</b><br/>\nLRtest returnează un obiect de clasă LR care conține:\n<br/><br/>\nLR: valoare LR.\n<br/>\ndf: Grade de libertate ale statisticii testului.\n<br/>\nChisq: valoarea Chi-pătrat cu df corespunzător.\n<br/>\n<br/>\n<b>Pachet</b></br>\neRm\n<br/><br/>\n<b>Ajutor</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}