{
  "ProjectTitleStr": "Proiect",
  "Source_variables": "Variabile sursă",
  "Source_Datasets": "Seturi de date sursă",
  "Source_Datasets_rerun": "Seturi de date sursă",
  "jsoncomment000": "=======Formula Builder below this line=======",
  "FBStr0":"Constructor de Formule",
  "FBStr1": "Faceți clic pe un buton de mai jos și trageți și plasați variabile pentru a crea o expresie.",
  "FBStr2": "Clic pe un buton selectat va comuta starea acestuia.",
  "FBStr3": "Pentru a insera la o poziție, plasați cursorul în acea poziție și trageți & plasați/mutați variabilele.",
  "FBStr4": "Treceți cu mouse-ul peste un buton pentru ajutor.",
  "FBStr5": "Nu puteți comuta butonul All N-way.",
  "FBttip1": "Faceți clic pe butonul + apoi mutați variabilele pe care doriți să le separați cu +. Pentru a insera doar +, faceți dublu clic pe el",
  "FBttip2": "Faceți clic pe butonul - apoi mutați variabilele pe care doriți să le separați cu -. Pentru a insera doar -, faceți dublu clic pe el",
  "FBttip3": "Faceți clic pe butonul * apoi mutați variabilele pe care doriți să le separați cu *. Pentru a insera doar *, faceți dublu clic pe el",
  "FBttip4": "Faceți clic pe butonul / apoi mutați variabilele pe care doriți să le separați cu /. Pentru a insera doar /, faceți dublu clic pe el",
  "FBttip5": "Faceți clic pe butonul ( pentru a-l insera",
  "FBttip6": "Faceți clic pe butonul ) pentru a-l insera",
  "FBttip7": "Faceți clic pe butonul %in% pentru a insera %in%",
  "FBttip8": "Faceți clic pe butonul | pentru a-l insera",
  "FBttip9": "Faceți clic pe butonul : apoi mutați variabilele pe care doriți să le separați cu :. Pentru a insera doar :, faceți dublu clic pe el",
  "FBbtnlbl10a" : "Toate cele 2 moduri",  
  "FBbtnlbl10b" : "Toate cele 3 moduri",
  "FBbtnlbl10c" : "Toate cele 4 moduri",
  "FBbtnlbl10d" : "Toate cele 5 moduri",
  "FBbtnlbl10e" : "Toate cele 6 moduri",
  "FBbtnlbl10f" : "Toate cele 7 moduri",
  "FBbtnlbl10g" : "Toate cele 8 moduri",
  "FBbtnlbl10h" : "Toate cele 9 moduri",
  "FBbtnlbl10i" : "Toate cele 10 moduri",   
  "FBttip10": "Faceți clic pe opțiunea All N-way și apoi mutați variabilele pentru a crea interacțiuni N-way. Pentru a dezactiva, faceți clic pe un alt buton.",
  "FBbtnlbl11": "Termeni polinomiali",
  "FBttip11": "Selectați un număr, faceți clic pe buton și mutați variabilele pentru a adăuga termeni polinomiali de grad N",
  "FBbtnlbl12": "df pentru spline",
  "FBttip12": "Specificați un grad de libertate pentru spline",
  "FBbtnlbl13": "Grad polinomial",
  "FBttip13": "Specificați un grad polinomial",
  "FBbtnlbl14": "B-spline",
  "FBttip14": "Faceți clic pe B-spline apoi mutați una sau mai multe variabile. Pentru a insera cod generic, faceți dublu clic",
  "FBbtnlbl15": "Spline natural",
  "FBttip15": "Faceți clic pe spline natural apoi mutați una sau mai multe variabile. Pentru a insera cod generic, faceți dublu clic",
  "FBbtnlbl16": "Polinomial ortogonal",
  "FBttip16": "Faceți clic pe butonul polinomial ortogonal apoi mutați una sau mai multe variabile. Pentru a insera cod generic, faceți dublu clic",
  "FBbtnlbl17": "Polinomial brut",
  "FBttip17": "Faceți clic pe butonul polinomial brut apoi mutați una sau mai multe variabile. Pentru a insera cod generic, faceți dublu clic",
  "jsoncomment001": "=======Compute Builder below this line=======",
  "CBStr1": "Faceți clic pe un buton de mai jos și trageți și plasați variabile pentru a crea o expresie.",
  "CBStr2": "Clic pe un buton selectat va comuta starea acestuia.",
  "CBStr3": "Pentru a insera la o poziție, plasați cursorul în acea poziție și trageți & plasați/mutați variabilele.",
  "CBStr4": "Treceți cu mouse-ul peste un buton pentru ajutor.",
  "CBtabArithmetic": "Aritmetică",
  "CBtabLogical": "Logic",
  "CBtabMath": "Matematică",
  "CBtabString1": "String(1)",
  "CBtabString2": "String(2)",
  "CBtabConversion": "Conversie",
  "CBtabStatistical": "Statistică",
  "CBtabRandomNumbers": "Numere aleatorii",
  "CBtabDate1": "Dată(1)",
  "CBtabDate2": "Dată(2)",
  "CBtabDate3": "Dată(3)",
  "CBtabDate4": "Dată(4)",
  "CBttip1": "Faceți clic pe butonul + apoi mutați variabilele pe care doriți să le separați cu +. Pentru a insera doar +, faceți dublu clic pe el",
  "CBttip2": "Faceți clic pe butonul - apoi mutați variabilele pe care doriți să le separați cu -. Pentru a insera doar -, faceți dublu clic pe el",
  "CBttip3": "Faceți clic pe butonul * apoi mutați variabilele pe care doriți să le separați cu *. Pentru a insera doar *, faceți dublu clic pe el",
  "CBttip4": "Faceți clic pe butonul / apoi mutați variabilele pe care doriți să le separați cu /. Pentru a insera doar /, faceți dublu clic pe el",
  "CBttip5": "Faceți clic pe ^ și mutați variabile pentru a exponenția, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl6": "sqrt",
  "CBttip6": "Faceți clic pe SQRT și mutați variabile pentru a calcula rădăcina pătrată, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl7": "log",
  "CBttip7": "Faceți clic pe LOG și mutați variabile pentru a calcula logaritmul natural, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl8": "log10",
  "CBttip8": "Faceți clic pe LOG10 și mutați variabile pentru a calcula logaritmul în baza 10, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl9": "log2",
  "CBttip9": "Faceți clic pe LOG2 și mutați variabile pentru a calcula logaritmul în baza 2, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl10": "mod",
  "CBttip10": "Faceți clic pe MOD și mutați variabile pentru a împărți și a calcula restul, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl11": "abs",
  "CBttip11": "Faceți clic pe abs și mutați variabile pentru a calcula valoarea absolută, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl12": "exp",
  "CBttip12": "Faceți clic pe exp și mutați variabile pentru a calcula o exponențială, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl13": "",
  "CBttip13": "Faceți clic pentru a insera simbolul >",
  "CBbtnlbl14": "",
  "CBttip14": "Faceți clic pentru a insera simbolul <",
  "CBbtnlbl15": "",
  "CBttip15": "Faceți clic pentru a insera simbolul >=",
  "CBbtnlbl16": "",
  "CBttip16": "Faceți clic pentru a insera simbolul <=",
  "CBbtnlbl17": "",
  "CBttip17": "Faceți clic pentru a insera simbolul == (test de egalitate)",
  "CBbtnlbl18": "",
  "CBttip18": "Faceți clic pentru a insera simbolul !- (neegal)",
  "CBbtnlbl19": "",
  "CBttip19": "Faceți clic pentru a insera simbolul | (sau logic)",
  "CBbtnlbl20": "",
  "CBttip20": "Faceți clic pentru a insera simbolul & (și logic)",
  "CBbtnlbl21": "%/%",
  "CBttip21": "Faceți clic pentru a insera simbolul de împărțire întreagă (%/%)",
  "CBbtnlbl22": "isTRUE",
  "CBttip22": "Faceți clic pe isTRUE pentru a selecta și a muta variabila pentru a verifica valorile TRUE. Returnează TRUE/FALSE, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl23": "is.na",
  "CBttip23": "Faceți clic pe is.na pentru a selecta și a muta variabila pentru a verifica valorile NA. Returnează TRUE/FALSE, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl24": "%in%",
  "CBttip24": "Faceți clic pe butonul %in% pentru a insera %in%",
  "CBbtnlbl25": "round",
  "CBttip25": "Faceți clic pe round și mutați variabile pentru a rotunji, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl26": "ceiling",
  "CBttip26": "Faceți clic pe ceiling și mutați variabile pentru a calcula plafonul, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl27": "floor",
  "CBttip27": "Faceți clic pe floor și mutați variabile pentru a calcula podeaua, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl28": "signif",
  "CBttip28": "Faceți clic pe signif și mutați variabile pentru a rotunji la un număr specificat de cifre semnificative, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl29": "gamma",
  "CBttip29": "Faceți clic pe gamma și mutați variabile pentru a calcula o funcție gamma, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl30": "lgamma",
  "CBttip30": "Faceți clic pe lgamma și mutați variabile pentru a calcula o funcție lgamma, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl31": "beta",
  "CBttip31": "Faceți clic pe beta și mutați variabile pentru a calcula o funcție beta, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl32": "lbeta",
  "CBttip32": "Faceți clic pe lbeta și mutați variabile pentru a calcula o funcție lbeta, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl33": "factorial",
  "CBttip33": "Faceți clic pe factorial și mutați variabile pentru a calcula factoriale, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl34": "pigamma",
  "CBttip34": "Faceți clic pe pigamma și mutați variabile pentru a calcula o funcție pigamma, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl35": "toupper",
  "CBttip35": "Faceți clic pe toupper și mutați variabile pentru a converti în litere mari, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl36": "tolower",
  "CBttip36": "Faceți clic pe tolower și mutați variabile pentru a converti în litere mici, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl37": "Pad",
  "CBttip37": "Faceți clic pe Pad și mutați variabile pentru a umple cu un caracter, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl38": "Trim",
  "CBttip38": "Faceți clic pe Trim și mutați variabile pentru a elimina spațiile albe din stânga, dreapta sau de la ambele capete, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl39": "Length",
  "CBttip39": "Faceți clic pe Length și mutați variabile pentru a returna numărul de caractere din șir, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl40": "Count(matches)",
  "CBttip40": "Faceți clic pe Count(matches) și mutați variabile pentru a număra potrivirile unui model/sub-șir, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl41": "Extract Substring",
  "CBttip41": "Faceți clic pe Extract Substring și mutați variabile pentru a extrage un sub-șir (înlocuiți poziția de început și sfârșit cu numere întregi), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl42": "Concatenate",
  "CBttip42": "Faceți clic pe Concatenate și mutați variabile pentru a concatena cu un separator opțional, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl43": "Replace Pattern",
  "CBttip43": "Faceți clic pe Replace Pattern și mutați variabile pentru a înlocui un model, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl44": "Replace Pattern(ALL)",
  "CBttip44": "Faceți clic pe Replace Pattern(ALL) și mutați variabile pentru a înlocui toate modelele, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl45": "Extrage un număr",
  "CBttip45": "Faceți clic pe Extrage un număr și mutați variabile pentru a extrage un număr din, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl46": "ToNumeric",
  "CBttip46": "Faceți clic pe ToNumeric și mutați variabile pentru a converti în numeric, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl47": "ToCharacter",
  "CBttip47": "Faceți clic pe ToCharacter și mutați variabile pentru a converti într-un caracter, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl48": "ToFactor",
  "CBttip48": "Faceți clic pe ToFactor și mutați variabile pentru a converti într-un factor, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl49": "ToOrdered",
  "CBttip49": "Faceți clic pe ToOrdered și mutați variabile pentru a converti într-un factor ordonat, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl50": "ToLogical",
  "CBttip50": "Faceți clic pe ToLogical și mutați variabile pentru a converti într-un tip logic, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl51": "MAX",
  "CBttip51": "Faceți clic pe MAX și mutați variabile pentru a calcula valoarea maximă, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl52": "MIN",
  "CBttip52": "Faceți clic pe MIN și mutați variabile pentru a calcula valoarea minimă, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl53": "MEAN",
  "CBttip53": "Faceți clic pe MEAN și mutați variabile pentru a calcula valoarea medie, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl54": "MEDIAN",
  "CBttip54": "Faceți clic pe MEDIAN și mutați variabile pentru a calcula valoarea mediană, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl55": "SD",
  "CBttip55": "Faceți clic pe SD și mutați variabile pentru a calcula deviația standard, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl56": "SUM",
  "CBttip56": "Faceți clic pe SUM și mutați variabile pentru a calcula suma, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl57": "VARIANCE",
  "CBttip57": "Faceți clic pe VARIANCE și mutați variabile pentru a calcula varianța, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl58": "runif",
  "CBttip58": "Faceți dublu clic pe RUNIF și numere aleatorii vor fi generate dintr-o distribuție uniformă cu min și max.",
  "CBbtnlbl59": "sample",
  "CBttip59": "Faceți clic pe SAMPLE și mutați variabile pentru a genera mostre aleatorii cu/sau fără înlocuire, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl60": "rnorm",
  "CBttip60": "Faceți dublu clic pe rnorm pentru a genera variabile dintr-o distribuție normală cu o medie și o deviație standard specificate",
  "CBbtnlbl61": "Ziua săptămânii",
  "CBttip61": "Faceți clic pe Ziua săptămânii și mutați o variabilă de dată din care doriți să extrageți ziua săptămânii (luni..), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl62": "Ziua lunii",
  "CBttip62": "Faceți clic pe Ziua lunii și mutați o variabilă de dată din care doriți să extrageți ziua lunii (1-31), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl63": "Ziua anului",
  "CBttip63": "Faceți clic pe Ziua anului și mutați o variabilă de dată din care doriți să extrageți ziua anului (001-366), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl64": "Săptămâna anului",
  "CBttip64": "Faceți clic pe Săptămâna anului și mutați o variabilă de dată din care doriți să extrageți săptămâna anului (00-53), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl65": "Luna",
  "CBttip65": "Faceți clic pe Lună și mutați o variabilă de dată din care doriți să extrageți luna (ianuarie..), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl66": "Luna (decimal)",
  "CBttip66": "Faceți clic pe Luna (decimal) și mutați o variabilă de dată din care doriți să extrageți luna (01-12), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl67": "Trimestru",
  "CBttip67": "Faceți clic pe Trimestru și mutați o variabilă de dată din care doriți să extrageți trimestrul (T1, T2..), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl68": "An (XXXX)",
  "CBttip68": "Faceți clic pe An (XXXX) și mutați o variabilă de dată din care doriți să extrageți anul (1980), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl69": "An (XX)",
  "CBttip69": "Faceți clic pe An (XX) și mutați o variabilă de dată din care doriți să extrageți anul (80), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl70": "Oră (00-12)",
  "CBttip70": "Faceți clic pe Oră (00-12) și mutați o variabilă de dată din care doriți să extrageți ora (00), pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl71": "Oră (00-23)",
  "CBttip71": "Faceți clic pe Oră (00-23) și mutați o variabilă de dată din care doriți să extrageți ora, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl72": "Minute",
  "CBttip72": "Faceți clic pe Minute și mutați o variabilă de dată din care doriți să extrageți minutele, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl73": "Secs",
  "CBttip73": "Faceți clic pe Secs și mutați o variabilă de dată din care doriți să extrageți secundele, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl74": "Dată din șir",
  "CBttip74": "Faceți clic pe Dată din șir și mutați o variabilă de tip șir pe care doriți să o convertiți în dată, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl75": "Diferență de date",
  "CBttip75": "Faceți clic pe Diferență de date și mutați o variabilă de dată pe care doriți să o scădeți dintr-o altă variabilă de dată, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl76": "Numeric la dată",
  "CBttip76": "Faceți clic pe Numeric la dată și mutați o variabilă numerică pe care doriți să o convertiți în dată, pentru a insera cod generic, faceți dublu clic",
  "CBbtnlbl77": "Șir la dată",
  "CBttip77": "Faceți clic pe Șir la dată și mutați o variabilă de tip șir pe care doriți să o convertiți în dată, pentru a insera cod generic, faceți dublu clic",
  "jsoncomment002": "=======switchCase below this line=======",
  "SCStr0": "Constructor de condiții multiple",
  "SCStr1": "Faceți clic pe un buton și trageți și dropați variabile pentru a crea o expresie.",
  "SCStr2": "Facerea clic pe un buton selectat va comuta starea acestuia.",
  "SCStr3": "Pentru a insera la o poziție desemnată, trageți și dropați direct la acea poziție.",
  "SCStr4": "Treceți cu mouse-ul peste un buton pentru ajutor.",
  "SCifthenbtn": "DACA ATUNCI",
  "SCelsebtn": "ALTFEL",
  "SCIFlbl": "DACA",
  "SCTHENlbl": "ATUNCI",
  "SCELSElbl": "ALTFEL",
  "SCtabArithmetic": "Aritmetică",
  "SCtabLogical": "Logic",
  "SCtabMath": "Matematică",
  "SCtabString1": "Șir(1)",
  "SCtabString2": "Șir(2)",
  "SCtabConversion": "Conversie1",
  "SCtabStatistical": "Statistic",
  "SCtabRandomNumbers": "Numere aleatorii",
  "SCtabDate1": "Dată(1)",
  "SCtabDate2": "Dată(2)",
  "SCtabDate3": "Dată(3)",
  "SCtabDate4": "Dată(4)",
  "SCttip1": "Faceți clic pe simbolul + și mutați variabilele pe care doriți să le separați cu +. Pentru a insera doar +, faceți dublu clic pe acesta",
  "SCttip2": "Faceți clic pe simbolul - și mutați variabilele pe care doriți să le separați cu -. Pentru a insera doar -, faceți dublu clic pe acesta",
  "SCttip3": "Faceți clic pe simbolul * și mutați variabilele pe care doriți să le separați cu *. Pentru a insera doar *, faceți dublu clic pe acesta",
  "SCttip4": "Faceți clic pe simbolul / și mutați variabilele pe care doriți să le separați cu /. Pentru a insera doar /, faceți dublu clic pe acesta",
  "SCttip5": "Faceți clic pe ^ și mutați variabilele pentru a exponenția, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl6": "sqrt",
  "SCttip6": "Faceți clic pe SQRT și mutați variabilele pentru a calcula rădăcina pătrată, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl7": "log",
  "SCttip7": "Faceți clic pe LOG și mutați variabilele pentru a calcula un logaritm natural, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl8": "log10",
  "SCttip8": "Faceți clic pe LOG10 și mutați variabilele pentru a calcula un logaritm cu baza 10, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl9": "log2",
  "SCttip9": "Faceți clic pe LOG2 și mutați variabilele pentru a calcula un logaritm cu baza 2, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl10": "mod",
  "SCttip10": "Faceți clic pe MOD și mutați variabilele pentru a împărți și a calcula restul, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl11": "abs",
  "SCttip11": "Faceți clic pe abs și mutați variabilele pentru a calcula valoarea absolută, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl12": "exp",
  "SCttip12": "Faceți clic pe exp și mutați variabilele pentru a calcula o exponențială, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl13": "",
  "SCttip13": "Faceți clic pentru a insera simbolul >",
  "SCbtnlbl14": "",
  "SCttip14": "Faceți clic pentru a insera simbolul <",
  "SCbtnlbl15": "",
  "SCttip15": "Faceți clic pentru a insera simbolul >= (mai mare sau egal)",
  "SCbtnlbl16": "",
  "SCttip16": "Faceți clic pentru a insera simbolul <= (mai mic sau egal)",
  "SCbtnlbl17": "",
  "SCttip17": "Faceți clic pentru a insera simbolul == (test de egalitate)",
  "SCbtnlbl18": "",
  "SCttip18": "Faceți clic pentru a insera simbolul !- (diferit de)",
  "SCbtnlbl19": "",
  "SCttip19": "Faceți clic pentru a insera simbolul | (sau logic)",
  "SCbtnlbl20": "",
  "SCttip20": "Faceți clic pentru a insera simbolul & (și logic)",
  "SCbtnlbl21": "%/%",
  "SCttip21": "Faceți clic pentru a insera simbolul de diviziune întreagă (%/%)",
  "SCbtnlbl22": "isTRUE",
  "SCttip22": "Faceți clic pe isTRUE pentru a selecta și muta variabila pentru a verifica valorile TRUE. Returnează TRUE/FALSE, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl23": "is.na",
  "SCttip23": "Faceți clic pe is.na pentru a selecta și muta variabila pentru a verifica valorile NA. Returnează TRUE/FALSE, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl24": "%in%",
  "SCttip24": "Faceți clic pe %in% pentru a-l insera. %in% este utilizat pentru a verifica dacă o variabilă conține valori, de ex. var1 %in% c(1,2)",
  "SCbtnlbl25": "round",
  "SCttip25": "Faceți clic pe round și mutați variabilele pentru a rotunji, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl26": "ceiling",
  "SCttip26": "Faceți clic pe ceiling și mutați variabilele pentru a calcula tavanul, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl27": "floor",
  "SCttip27": "Faceți clic pe floor și mutați variabilele pentru a calcula podeaua, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl28": "signif",
  "SCttip28": "Faceți clic pe signif și mutați variabilele pentru a rotunji la un număr specificat de cifre semnificative, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl29": "gamma",
  "SCttip29": "Faceți clic pe gamma și mutați variabilele pentru a calcula o funcție gamma, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl30": "lgamma",
  "SCttip30": "Faceți clic pe lgamma și mutați variabilele pentru a calcula o funcție lgamma, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl31": "beta",
  "SCttip31": "Faceți clic pe beta și mutați variabilele pentru a calcula o funcție beta, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl32": "lbeta",
  "SCttip32": "Faceți clic pe lbeta și mutați variabilele pentru a calcula o funcție lbeta, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl33": "factorial",
  "SCttip33": "Faceți clic pe factorial și mutați variabilele pentru a calcula factorizările, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl34": "pigamma",
  "SCttip34": "Faceți clic pe pigamma și mutați variabilele pentru a calcula o funcție pigamma, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl35": "toupper",
  "SCttip35": "Faceți clic pe toupper și mutați variabilele pentru a le converti în majuscule, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl36": "tolower",
  "SCttip36": "Faceți clic pe tolower și mutați variabilele pentru a le converti în minuscule, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl37": "Pad",
  "SCttip37": "Faceți clic pe Pad și mutați variabilele pentru a le umple cu un caracter, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl38": "Trim",
  "SCttip38": "Faceți clic pe Trim și mutați variabilele pentru a elimina spațiile albe din stânga, dreapta sau de la ambele capete, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl39": "Length",
  "SCttip39": "Faceți clic pe Length și mutați variabilele pentru a returna numărul de caractere din șir, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl40": "Count(matches)",
  "SCttip40": "Faceți clic pe Count(matches) și mutați variabilele pentru a număra potrivirile unui model/sub-șir, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl41": "Extract Substring",
  "SCttip41": "Faceți clic pe Extract Substring și mutați variabilele pentru a extrage un sub-șir (înlocuiți pozițiile de început și sfârșit cu numere întregi), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl42": "Concatenate",
  "SCttip42": "Faceți clic pe Concatenate și mutați variabilele pentru a concatena cu un separator opțional, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl43": "Replace Pattern",
  "SCttip43": "Faceți clic pe Replace Pattern și mutați variabilele pentru a înlocui un model, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl44": "Replace Pattern(ALL)",
  "SCttip44": "Faceți clic pe Replace Pattern(ALL) și mutați variabilele pentru a înlocui toate modelele, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl45": "Extract a Number",
  "SCttip45": "Faceți clic pe Extract a Number și mutați variabilele pentru a extrage un număr dintr-o variabilă, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl46": "ToNumeric",
  "SCttip46": "Faceți clic pe ToNumeric și mutați variabilele pentru a le converti în numeric, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl47": "ToCharacter",
  "SCttip47": "Faceți clic pe ToCharacter și mutați variabilele pentru a le converti într-un caracter, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl48": "ToFactor",
  "SCttip48": "Faceți clic pe ToFactor și mutați variabilele pentru a le converti într-un factor, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl49": "ToOrdered",
  "SCttip49": "Faceți clic pe ToOrdered și mutați variabilele pentru a le converti într-un factor ordonat, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl50": "ToLogical",
  "SCttip50": "Faceți clic pe ToLogical și mutați variabilele pentru a le converti într-un tip logic, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl51": "MAX",
  "SCttip51": "Faceți clic pe MAX și mutați variabilele pentru a calcula valoarea maximă, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl52": "MIN",
  "SCttip52": "Faceți clic pe MIN și mutați variabilele pentru a calcula valoarea minimă, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl53": "MEAN",
  "SCttip53": "Faceți clic pe MEAN și mutați variabilele pentru a calcula valoarea medie, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl54": "MEDIAN",
  "SCttip54": "Faceți clic pe MEDIAN și mutați variabilele pentru a calcula valoarea mediană, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl55": "SD",
  "SCttip55": "Faceți clic pe SD și mutați variabilele pentru a calcula deviația standard, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl56": "SUM",
  "SCttip56": "Faceți clic pe SUM și mutați variabilele pentru a calcula suma, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl57": "VARIANCE",
  "SCttip57": "Faceți clic pe VARIANCE și mutați variabilele pentru a calcula varianța, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl58": "runif",
  "SCttip58": "Faceți dublu clic pe RUNIF și vor fi generate numere aleatoare dintr-o distribuție uniformă cu min și max",
  "SCbtnlbl59": "sample",
  "SCttip59": "Faceți clic pe SAMPLE și mutați variabilele pentru a genera eșantioane aleatoare cu/sau fără înlocuire, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl60": "rnorm",
  "SCttip60": "Faceți dublu clic pe rnorm pentru a genera variabile dintr-o distribuție normală cu o medie specificată și o deviație standard",
  "SCbtnlbl61": "Day of Week",
  "SCttip61": "Faceți clic pe Day of Week și mutați o variabilă de dată din care doriți să extrageți ziua săptămânii (Luni..), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl62": "Day of Month",
  "SCttip62": "Faceți clic pe Day of Month și mutați o variabilă de dată din care doriți să extrageți ziua lunii (1-31), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl63": "Day of Year",
  "SCttip63": "Faceți clic pe Day of Year și mutați o variabilă de dată din care doriți să extrageți ziua anului (001-366), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl64": "Week of Year",
  "SCttip64": "Faceți clic pe Week of Year și mutați o variabilă de dată din care doriți să extrageți săptămâna anului (00-53), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl65": "Month",
  "SCttip65": "Faceți clic pe Month și mutați o variabilă de dată din care doriți să extrageți luna (Ianuarie..), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl66": "Month(decimal)",
  "SCttip66": "Faceți clic pe Month(decimal) și mutați o variabilă de dată din care doriți să extrageți luna (01-12), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl67": "Quarters",
  "SCttip67": "Faceți clic pe Quarters și mutați o variabilă de dată din care doriți să extrageți trimestrele (Q1, Q2..), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl68": "Year(XXXX)",
  "SCttip68": "Faceți clic pe Year(XXXX) și mutați o variabilă de dată din care doriți să extrageți anul (1980), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl69": "Year(XX)",
  "SCttip69": "Faceți clic pe Year(XX) și mutați o variabilă de dată din care doriți să extrageți anul (80), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl70": "Hour(00-12)",
  "SCttip70": "Faceți clic pe Hour(00-12) și mutați o variabilă de dată din care doriți să extrageți ora (00), pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl71": "Hour(00-23)",
  "SCttip71": "Faceți clic pe Hour(00-23) și mutați o variabilă de dată din care doriți să extrageți ora, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl72": "Minutes",
  "SCttip72": "Faceți clic pe Minutes și mutați o variabilă de dată din care doriți să extrageți minutele, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl73": "Secs",
  "SCttip73": "Faceți clic pe Secs și mutați o variabilă de dată din care doriți să extrageți secundele, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl74": "Date from String",
  "SCttip74": "Faceți clic pe Date from String și mutați o variabilă de tip șir pe care doriți să o convertiți în dată, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl75": "Date Difference",
  "SCttip75": "Faceți clic pe Date Difference și mutați o variabilă de dată pe care doriți să o scădeți dintr-o altă variabilă de dată, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl76": "Numeric to date",
  "SCttip76": "Faceți clic pe Numeric to date și mutați o variabilă numerică pe care doriți să o convertiți în dată, pentru a insera cod generic, faceți dublu clic",
  "SCbtnlbl77": "String to date",
  "SCttip77": "Faceți clic pe String to date și mutați o variabilă de tip șir pe care doriți să o convertiți în dată, pentru a insera cod generic, faceți dublu clic",
  "jsoncomment003": "=======Rep Measures CTRL below this line=======",
  "RMstr0": "Faceți clic pentru a afișa/ascunde configurația pentru factorul și măsura din cadrul subiectului",
  "RMstr0a" : "Notă",
  "RMstr1": "1. Aplicația trebuie să reformateze datele atunci când rulează o ANOVA cu măsuri repetate pe un set de date larg",
  "RMstr2": "2. Susținem multiple măsuri repetate pentru o singură variabilă, de exemplu, Glucoza măsurată la pretest, posttest și la o vizită de urmărire",
  "RMstr3": "3. Pentru ca aplicația să reformateze datele, trebuie să specificați un nume de factor repetat, de exemplu, Glucoza, și numărul de nivele. Vom crea o variabilă de factor, de exemplu, numită Glucoza, cu nivele create din numele variabilelor care conțin măsurile repetate, de exemplu, nivelele factorului vor fi pretest, posttest și followup",
  "RMstr4": "4. Trebuie să specificați un nume de măsură, de exemplu, Valoare. Vom crea o variabilă, de exemplu, Valoare, cu toate valorile Glucozei corespunzătoare pretestului, posttestului și followup-ului pentru fiecare subiect.",
  "RMstr5": "5. Susținem o singură variabilă de factor între-subiect și în cadrul subiectului.",
  "RMstr6": "6. Versiunile viitoare vor susține multiple măsuri, precum și multiple variabile de factor între-subiect și în cadrul subiectului.",
  "RMlbl1": "Nume factor în cadrul subiectului",
  "RMlbl2": "Număr de nivele",
  "RMaddbtn": "Adăugare",
  "RMlbl3": "Nouă variabilă de factor în cadrul subiectului",
  "RMdelbtn": "Ștergere",
  "RMlbl4": "Nume măsură",
  "RMlbl5": "Nouă variabilă de măsură",
  "RMdefinebtn": "Definește",
  "RMmsgboxTitle1": "Nivele incorecte pentru factor",
  "RMmsgboxMsg1": "Trebuie să specificați un nume de factor cu mai mult de un nivel.",
  "RMmsgboxTitle2": "Mai mult de un factor în cadrul subiectului specificat",
  "RMmsgboxMsg2": "În prezent, susținem un singur factor în cadrul subiectului. Vom susține mai multe variabile de factor în cadrul subiectului într-o versiune viitoare.",
  "RMmsgboxTitle3": "Mai mult de o măsură specificată",
  "RMmsgboxMsg3": "În prezent, susținem o singură măsură. Vom susține multiple măsuri într-o versiune viitoare.",
  "RMmsgboxTitle4": "Variabila de măsură nu este specificată",
  "RMmsgboxMsg4": "Numele variabilei de măsură nu este specificat. Trebuie să specificați un nume de măsură și să faceți clic pe adăugare.",
  "RMmsgboxTitle5": "Variabila de factor în cadrul subiectului nu este specificată",
  "RMmsgboxMsg5": "Trebuie să faceți clic pe butonul Definește după ce ați introdus un nume de variabilă de factor repetat și un nume de măsură.",
  "jsoncomment004": "=======SelectDataset below this line=======",
  "SelDSsrclbl1": "Variabile din ",
  "SelDSsrclbl2": "activ (stânga) ",
  "SelDSsrclbl3": "selectat (dreapta)",
  "SelDSsrclbl4": " set de date",
  "SelDSsrclbl5": "Selectați un set de date pentru a se alătura ",
  "SelDSsrclbl6": " cu",
  "jsoncomment005": "=======mergejoin below this line=======",
  "MJlbl1": "Selectați o variabilă din setul de date activ și o variabilă din setul de date selectat și faceți clic pe Adăugare",
  "MJbtn1": "Adăugare",
  "MJbtn2": "Ștergere",
  "jsoncomment006": "=======options below this line=======",
  "OptVarDefaultLbl": "Opțiuni",
  "jsoncomment007": "=======Choose file/folder below this line=======",
  "fileOpenLbl": "Alegeți",
  "fileSaveLbl" : "Specificați sau selectați un/o",
  "jsoncomment008" : "=======wrap-control below this line=======",
  "wrapCtrllabel1":"Afișați numărătorile în setul de date agregat",
  "wrapCtrllabel2":"Introduceți opțional numele pentru contorizați și variabilele agregate, separate prin virgulă (,)",  
  "colpickerttip1" : "Faceți clic pentru a selecta o culoare",
  "sixSigmaOvrViewLbl1" : "Tutorialul Six Sigma al Institutului Pyzdek",
  "sixSigmaOvrViewLink1" : "Ce este Six Sigma și cum funcționează?",
  "sixSigmaOvrViewLbl2" : "Tutorial pentru diagramele de control al calității cu pachetul R (QCC)",
  "sixSigmaOvrViewLink2" : "Tutorial pentru diagramele de control al calității în R",
  "sixSigmaOvrViewLbl3" : "Tutorial suplimentar Six Sigma găsit pe internet (bazat pe pachetul R SixSigma)",
  "sixSigmaOvrViewLink3" : "Partea 1",
  "sixSigmaOvrViewLink4" : "Partea 2",
  "sixSigmaOvrViewLink5" : "Partea 3",
  "sixSigmaOvrViewLink6" : "Partea 4",
  "sixSigmaOvrViewLink7" : "Partea 5",  
  "OKBtnTxt": "Ok",
  "CancelBtnTxt": "Anulează",
  "FBRulVoiMsg": "Controlul cu eticheta: Constructor de formule trebuie completat pentru a continua",
  "SCruleVoilationMsgTitle1": "Încălcare regulă de intrare",
  "SCruleVoilationMsgTitle2": "Încălcare regulă de intrare condițională",
  "SCruleVoilationMsg1": "O condiție 'dacă' din controlul cu eticheta",
  "SCruleVoilationMsg2": "O condiție 'atunci' din controlul cu eticheta",
  "SCruleVoilationMsg3": "O condiție 'altfel' din controlul cu eticheta",
  "SCruleVoilationMsg4": "Intrare condițională cu eticheta",
  "dstVarRuleViolationMsgTitle": "Încălcare a regulii listei de variabile de destinație",
  "dstVarRuleViolationMsg1": "O listă de variabile de destinație cu eticheta",
  "dstVarRuleViolationMsg2": " trebuie completată pentru a continua.",
  "dstVarRuleViolationMsg3": " trebuie să conțină",
  "dstVarRuleViolationMsg4": " variabile",
  "advTxtBxRulViolationMSgTitle1": "Avertizare de suprascriere",
  "advTxtBxRulViolationMSgTitle2": "Încălcare a regulii câmpului de intrare",
  "advTxtBxRulViolationMSg1": "Valoarea specificată în câmpul cu eticheta",
  "advTxtBxRulViolationMSg2": "va suprascrie variabila existentă.",
  "advTxtBxRulViolationMSg3": "Valoarea specificată în câmpul cu eticheta",
  "advTxtBxRulViolationMSg4": "va suprascrie setul de date.",
  "advTxtBxRulViolationMSg5": "Câmpul cu eticheta",
  "advTxtBxRulViolationMSg6": "trebuie completat pentru a continua.",
  "advTxtBxRulViolationMSg7": "trebuie completat cu o valoare numerică pentru a continua.",
  "advTxtBxRulViolationMSg8": "trebuie completat cu o valoare de tip caracter pentru a continua.",
  "advTxtBxRulViolationMSg9": "Câmpul de intrare cu eticheta",
  "advTxtBxRulViolationMSg10": "nu poate începe cu un număr. Nu poți crea variabile, seturi de date sau nume de modele care încep cu un număr.",
  "advTxtBxRulViolationMSg11": "nu poate conține spații. Nu poți crea variabile, seturi de date sau nume de modele care conțin spații.",
  "advTxtBxRulViolationMSg12": "trebuie să conțină doar litere, cifre și caractere de tip punct sau subliniere. Trebuie să înceapă cu o literă sau un punct care nu este urmat de un număr.",
  "chkboxRulVoiMsgTitle": "Infracțiune la regulile casetei de selectare",
  "chkboxRulVoiMsg1": "Caseta de selectare cu eticheta",
  "chkboxRulVoiMsg2": "necesită ca alt control să fie completat pentru a continua",
  "comboboxRulVoiTitle": "Infracțiune la regulile controlului combobox",
  "comboboxRulVoiMsg1": "Trebuie să faceți o selecție în combobox-ul cu eticheta",
  "comboboxWchildRulVoiTitle": "Infracțiune la regulile combobox-ului",
  "comboboxWchildRulVoiMsg1": "Trebuie să faceți o selecție în combobox-ul cu eticheta",
  "CBuilderRulVoiTitle": "Infracțiune la regulile de introducere",
  "CBuilderRulVoiMsg1": "Controlul cu eticheta",
  "CBuilderRulVoiMsg2": "trebuie să fie completat pentru a continua",
  "fileOpnRulVoiTitle": "Infracțiune la regulile câmpului de introducere a fișierului",
  "fileOpnRulVoiMsg1": "Selectați un fișier din butonul de navigare cu eticheta",
  "fileOpnRulVoiMsg2": "și executați din nou",
  "fileOpnRulVoiMsg3": "Selectați un dosar din butonul de navigare cu eticheta",
  "fileOpnRulVoiMsg4": "Butonul de navigare cu eticheta",
  "fileOpnRulVoiMsg5": "conține un parcurs care nu există",
  "fileSavRulVoiMsg1": "Trebuie să selectați un fișier folosind butonul cu eticheta",
  "fileSavRulVoiMsg2": "pentru a continua",
  "handlerRulVoiTitle1": "Tipuri incompatibile",
  "handlerRulVoiTitle2": "Nu este suportat",
  "handlerRulVoiTitle3": "Eroare",
  "handlerRulVoiTitle4": "Variabile de asociere specificate incorect",
  "handlerRulVoiMsg1": "Un set de constrângere de egalitate trebuie să conțină toate încărcările de factori, relațiile de covarianță sau relațiile structurale. Elementele pe care le mutați au tipuri diferite.",
  "handlerRulVoiMsg2": "Un set de constrângere de egalitate trebuie să conțină toate încărcările de factori, relațiile de covarianță sau relațiile structurale. Nu puteți combina tipuri într-un singur set.",
  "handlerRulVoiMsg3": "Nu suportăm mai mult de 2 variabile într-un set de mediere. Vă rugăm să contactați suportul dacă aveți nevoie de această capacitate.",
  "handlerRulVoiMsg4": "Variabilele de relație de mediere trebuie să fie în forma A->B și B->C",
  "handlerRulVoiMsg5": "Variabilele de relație de mediere trebuie să fie în forma A->B și B->C sau B->C și A->B",
  "handlerRulVoiMsg6": "Controlul de destinație nu permite eliminarea variabilelor din controlul sursă cu eticheta",
  "handlerRulVoiMsg7": "Trebuie să selectați o variabilă unică din ambele seturi de date active și de destinație pentru a le alătura.",
  "inSpinerRulVoiMsg1": "este în afara limitelor",
  "inSpinerRulVoiMsg2": "este necesar să se introducă o valoare",
  "inSpinerRulVoiMsg3": "este necesar să se introducă o valoare numerică",
  "inSpinerRulVoiMsg4": "este necesar să se introducă o valoare de tip caracter",
  "mergejoinRulVoiTitle1" : "Încălcarea regulii de control al selecției",
  "mergejoinRulVoiMsg1" : "Trebuie să faceți o selecție în controlul de mapare a combinațiilor cu eticheta",
  "radioRulVoiTitle1" : "Încălcarea regulii butonului radio",
  "radioRulVoiMsg1" : "Butonul radio cu eticheta",
  "radioRulVoiMsg2" : "necesită ca un alt control să fie completat pentru a continua",
  "selectRulVoiMsg1" : "Trebuie să faceți o selecție în controlul de selecție cu eticheta",
  "semCtrlRulVoiMsg1" : "Trebuie să aveți specificate 2 relații de mediere în controlul cu eticheta",
  "semCtrlRulVoiMsg2" : "Un set de constrângere de egalitate din controlul cu eticheta",
  "semCtrlRulVoiMsg3" : "are mai puțin de 2 variabile.",
  "semCtrlRulVoiMsg4" : "Unul dintre numele trăsăturilor latente din",
  "semCtrlRulVoiMsg5" : "control nu este completat.",
  "semCtrlRulVoiMsg6" : "Unul dintre numele factorilor de ordin superior din",
  "semCtrlRulVoiMsg7" : "control nu este completat.",
  "semCtrlRulVoiMsg8" : "Ați introdus un număr într-unul dintre numele trăsăturilor latente din",
  "semCtrlRulVoiMsg9" : "control. Vă rugăm să introduceți un nume valid.",
  "semCtrlRulVoiMsg10" : "Variabilele care formează trăsătura latentă nu au fost specificate în",
  "semCtrlRulVoiMsg11" : "control. Vă rugăm să adăugați variabile sau să ștergeți controlul.",
  "semCtrlRulVoiMsg12" : "Nu au fost specificate trăsături latente în",
  "semCtrlRulVoiMsg13" : "control. Vă rugăm să adăugați trăsături latente sau să ștergeți controlul.",
  "semCtrlAddBtn" : "Adăuga",
  "semModTermRulVoiTitle" : "Eroare de relație",
  "semModTermRulVoiMsg1" : "Ați definit o relație între variabile",
  "semModTermRulVoiMsg2" : "în parametrii structurali și covarianțe. Trebuie să definiți relația o singură dată",
  "wrapCtrlRulVoiTitle" : "Încălcarea regulii de control al înfășurării",
  "wrapCtrlRulVoiMsg1" : "Controlul de înfășurare cu eticheta",
  "wrapCtrlRulVoiMsg2" : "are un număr neașteptat de variabile (așteptat",
  "wrapCtrlRulVoiMsg3" : "Trebuie completat pentru a continua",
  "utilityRulVoiTitle1" : "Variabilă de măsură nespecificată",
  "utilityRulVoiTitle2" : "Nume duplicat introdus",
  "utilityRulVoiTitle3" : "Nume incorect specificat",
  "utilityRulVoiMsg1" : "Numele variabilei de măsură nu este specificat. Trebuie să specificați un nume de măsură și să faceți clic pe adăugare.",
  "utilityRulVoiMsg2" : "Nu suportăm mai mult de 1 set de mediere. Vă rugăm să contactați suportul dacă aveți nevoie de această capacitate.",
  "utilityRulVoiMsg3" : "Ați introdus un nume de variabilă latentă sau un nume de factor de ordine superior care a fost deja introdus. Toate numele de variabile latente și numele de factori de ordine superior trebuie să fie unice.",
  "utilityRulVoiMsg4" : "Un nume de variabilă latentă sau un nume de factor de ordine superior nu poate coincide cu un nume de variabilă din setul de date.",
  "utilityRulVoiMsg5" : "Trebuie să faceți o selecție în controlul cu eticheta",
  "utilityRulVoiMsg6" : "și",
  "utilityRulVoiMsg7" : "înainte de a face clic pe butonul de mutare.",
  "utilityRulVoiMsg8" : "Nu puteți selecta aceeași variabilă în controlul cu eticheta",
  "utilityRulVoiMsg9" : "Vă rugăm să faceți selecții diferite.",
  "utilityRulVoiMsg10" : "înainte de a face clic pe butonul de mutare.",
  "utilityRulVoiMsg11" : "Aveți deja o relație între",
  "utilityRulVoiMsg12" : "Nu puteți avea două relații între aceleași variabile.",
  "errormessageIPCmsg1" : "Trebuie să specificați un șir non-vid pentru a-l folosi ca nume de factor",
  "errormessageIPCmsg2" : "Trebuie să selectați o intrare pentru a o șterge înainte de a face clic pe butonul de ștergere",
  "errormessageIPCmsg3" : "Trebuie să specificați un șir non-vid pentru a-l folosi ca nume de măsurare",
  "errormessageIPCmsg4" : "Trebuie să specificați un nume de factor cu mai mult de un nivel.",
  "errormessageIPCmsg5" : "În prezent, suportăm doar un singur factor pe subiect. Vom sprijini mai multe variabile de factori pe subiect într-o viitoare versiune.",
  "errormessageIPCmsg6" : "În prezent, suportăm doar o singură măsură. Vom sprijini mai multe măsuri într-o viitoare versiune.",
  "errormessageIPCmsg7" : "Există deja o variabilă de destinație pentru a captura măsurile factorului pe subiect",
  "errormessageIPCmsg8" : "Acest câmp așteaptă o valoare numerică, nu un șir",
  "errormessageIPCmsg9" : "Acest câmp așteaptă un șir, nu o valoare numerică",
  "errormessageIPCmsg10" : "Variabila ",
  "errormessageIPCmsg11" : "nu poate fi mutată, destinația nu permite variabile de acest tip",
  "errormessageIPCmsg12" :  "Trebuie să selectați o intrare pentru a șterge înainte de a face clic pe butonul de ștergere.",  
  "errormessageIPCTitle1" : "Tip neașteptat",
  "projLaunchLoadMsg1": "Doriți să încărcați proiectul anterior ",
  "projLaunchLoadMsg2": "Acest lucru poate dura puțin.",
  "projSwitchMsg1": "Dacă treceți la același proiect la care lucrați în prezent, modificările nesalvate vor fi pierdute, iar ultimul proiect salvat va fi încărcat.",
  "projSwitchMsg2": "Doriți să continuați?",
  "projSwitchMsg3": "Avertisment: Reîncărcarea aceleiași versiuni salvate a proiectului. Modificările nesalvate vor fi pierdute.\n",
  "projSwitchMsg4": "Acest lucru poate dura puțin.",
  "projValidMsg1": "Avertisment: Încărcarea unui proiect invalid sau corupt",
  "projValidMsg2": "Proiectul ",
  "projValidMsg3": " este un proiect invalid sau corupt și va fi eliminat din listă.",
  "projSwitchSaveCurrnentMsg1": "Trecerea la un proiect diferit poate dura ceva timp. Temporar, este posibil să vedeți un ecran gol.",
  "projSwitchSaveCurrnentMsg2": "Doriți să salvați modificările, dacă există, în proiectul curent '",
  "projSwitchSaveCurrnentMsg3": " înainte de",
  "projSwitchSaveCurrnentMsg4": " trecerea la un proiect diferit ",
  "projSwitchSaveCurrnentMsg5": " trecerea la un proiect 'NOU'?",
  "projSwitchSaveCurrnentMsg6": " ieșirea din aplicație?",
  "projSwitchSaveCurrnentMsg7": " deschiderea altui proiect?",
  "projSaveRSpcTitle": "Fișierul este utilizat în prezent de o altă aplicație",
  "projSaveRSpcMsg1": "Se pare că fișierul ",
  "projSaveRSpcMsg2": " este utilizat în prezent de o altă aplicație.",
  "projSaveRSpcMsg3": "Închideți fișierul ",
  "projSaveRSpcMsg4": " în cealaltă aplicație și încercați din nou.",
  "projAsknameTitle": "Există deja un proiect cu același nume în lista derulantă a proiectelor",
  "projAsknameTitle2": "Avertisment: Deschiderea unui proiect invalid sau corupt",
  "projAsknameMsg1": "Proiectul ",
  "projAsknameMsg2": "localizat în",
  "projAsknameMsg3": "există deja.",
  "projAsknameMsg4": "Proiectul pe care îl salvați va fi salvat în",
  "projAsknameMsg5": "Doriți să înlocuiți proiectul existent cu cel nou?",
  "projAsknameMsg6": "este un proiect invalid sau corupt.",
  "jsoncomment0010" : "=======Top level menus and sub-menu dropdown below this line=======",
  
  "agreement_top_level_title": "Acord",
  "professional_Agreement_Menu": "Acord",
  "agreement_Method": "Metodă",
  "professional_Method": "Metodă",
  "agreement_Scale": "Scală",
  "analysis_top_level_title": "Analiză",
  "contribution_Analysis_Menu": "Analiză",
  "professional_Analysis_Menu": "Analiză",
  "sixsigmapro_Analysis_Menu": "Analiză",
  "analysis_Association_Rules": "Reguli de asociere",
  "analysis_Cluster": "Clustru",
  "analysis_Correlations": "Corelații",
  "analysis_Crosstab": "Tabel încrucișat",
  "professional_Crosstab": "Tabel încrucișat",
  "analysis_Distribution_Analysis": "Analiză de distribuție",
  "sixsigmapro_Distribution_Analysis": "Analiză de distribuție",
  "analysis_Factor_Analysis": "Analiză factorială",
  "analysis_Means": "Medii",
  "sixsigmapro_Means": "Medii",
  "analysis_Moments": "Momente",
  "analysis_Non_Parametric": "Non-parametric",
  "analysis_Outlier" : "Valoare aberantă",
  "analysis_Proportions": "Proporții",
  "analysis_Summary": "Rezumat",
  "professional_Summary": "Rezumat",
  "sixsigmapro_Summary": "Rezumat",
  "analysis_Survival": "Supraviețuire",
  "contribution_Survival": "Supraviețuire",
  "professional_Survival": "Supraviețuire",
  "analysis_Tables": "Tabele",
  "contribution_Tables": "Tabele",
  "analysis_Variance": "Varianță",
  "contribution_Sample_Size_Menu": "Mărimea eșantionului",
  "contribution_Precision": "Precizie",
  "contribution_Tests": "Teste",
  "contribution_Datasets_Menu": "Seturi de date",
  "datasets_top_level_title": "Seturi de date",
  "datasetspro_Datasets_Menu": "Seturi de date",
  "professional_Datasets_Menu": "Seturi de date",
  "contribution_Subset": "Subset",
  "datasets_Subset": "Subset",
  "professional_Subset": "Subset",
  "datasets_group_by": "Grupează după",
  "datasets_Matching": "Potrivire",
  "professional_Matching": "Potrivire",
  "datasets_Merge": "Îmbinare",
  "professional_Merge": "Îmbinare",
  "datasets_ReShape": "Reshape",
  "datasets_Sampling": "Eșantionare",
  "datasets_Sort": "Sortare",
  "professional_Sort": "Sortare",
  "datasets_Transpose": "Transpune",
  "distribution_top_level_title": "Distribuție",
  "sixsigmapro_Distribution_Menu": "Distribuție",
  "distribution_Beta": "Beta",
  "distribution_Binomial": "Binomial",
  "distribution_Cauchy": "Cauchy",
  "distribution_Chi_squared": "Chi-pătrat",
  "distribution_Exponential": "Exponențială",
  "distribution_F": "F",
  "distribution_Gamma": "Gamma",
  "distribution_Geometric": "Geometrică",
  "distribution_Gumbel": "Gumbel",
  "distribution_Hypergeometric": "Hipergeometrică",
  "distribution_Logistic": "Logistică",
  "distribution_Lognormal": "Lognormală",
  "distribution_Negative_Binomial": "Binomial negativ",
  "distribution_Normal": "Normală",
  "sixsigmapro_Normal": "Normală",
  "distribution_Poisson": "Poisson",
  "distribution_t": "t",
  "distribution_Uniform": "Uniformă",
  "distribution_Weibull": "Weibull",
  "doe_top_level_title": "DoE",
  "doe_Create_DoE_Factor_Table": "Creează tabel DoE Factori",
  "doe_Create_Design": "Creează design",
  "doe_Inspect_Design": "Inspectează design",
  "doe_Modify_Design": "Modifică design",
  "doe_Analyze_Design": "Analizează design",
  "file_top_level_title": "Fișier",
  "modelfitting_File": "Fișier",
  "outputpro_File_Menu": "Fișier",
  "projectspace_File_Menu": "Fișier",
  "utility_File_Menu": "Fișier",
  "utilitypro_File_Menu": "Fișier",
  "forecasting_top_level_title": "Previziuni",
  "graphics_top_level_title": "Grafică",
  "graphicspro_Graphics_Menu": "Grafică",
  "graphicspro_BoxPlots": "Diagrame cutie",
  "graphics_Distribution": "Distribuție",
  "graphicspro_Distribution": "Distribuție",
  "graphics_Line_Charts": "Diagrame liniare",
  "graphics_Maps": "Hărți",
  "graphics_Pie_Charts": "Diagrame circulare",
  "graphics_Scatter_Plot": "Diagramă de dispersie",
  "graphicspro_Scatter_Plot": "Diagramă de dispersie",
  "modelevaluation_top_level_title": "Evaluarea modelului",
  "contribution_Model_Evaluation_Menu": "Evaluarea modelului",
  "professional_Model_Evaluation_Menu": "Evaluarea modelului",
  "modelevaluation_Compare": "Compară",
  "modelevaluation_Fit": "Potrivește",
  "modelevaluation_IRT": "IRT",
  "modelevaluation_Predict": "Prezice",
  "modelevaluation_Summarize": "Rezumă",
  "modelfitting_top_level_title": "Potrivire model",
  "contribution_Model_Fitting_Menu": "Potrivire model",
  "modelfittingpro_Model_Fitting_Menu": "Potrivire model",
  "professional_Model_Fitting_Menu": "Potrivire model",
  "modelfitting_Contrasts": "Contraste",
  "modelfitting_IRT": "IRT",
  "modelfitting_KNN": "KNN",
  "modelfitting_Regression": "Regresie",
  "contribution_Regression": "Regresie",
  "professional_Regression": "Regresie",
  "modelfitting_Neural_Nets": "Rețele neurale",
  "modelfitting_Trees": "Arbori",
  "modelfitting_File_Model": "Model",
  "modelfitting_Nonlinear_Regression": "Regresie neliniară",
  "modeltuning_top_level_title": "Ajustare model",
  "projectspace_Open_Project": "Deschide proiect",
  "projectspace_Save_Project": "Salvează proiect",
  "projectspace_SaveAs_Project": "Salvează proiect ca",
  "sixsigma_top_level_title": "Six Sigma",
  "sixsigmapro_Six_Sigma_Menu": "Six Sigma",
  "sixsigma_Pareto_Chart": "Diagramă Pareto",
  "sixsigmapro_Pareto_Chart": "Diagramă Pareto",
  "sixsigma_MSA": "MSA",
  "sixsigmapro_MSA": "MSA",
  "sixsigma_Process_Capability": "Capacitate proces",
  "sixsigmapro_Process_Capability": "Capacitate proces",
  "sixsigma_Shewhart_Charts": "Diagrame Shewhart",
  "sixsigmapro_Shewhart_Charts": "Diagrame Shewhart",
  "variables_top_level_title": "Variabile",
  "contribution_Variables_Menu": "Variabile",
  "professional_Variables_Menu": "Variabile",
  "variables_Box_Cox": "Box-Cox",
  "variables_Compute": "Calculează",
  "contribution_Compute": "Calculează",
  "variables_Convert": "Convertire",
  "variables_Factor_Levels": "Niveluri factor",
  "contribution_Factor_Levels": "Niveluri factor",
  "analysis_Missing_Values": "Valori lipsă",
  "professional_Missing_Values": "Valori lipsă",
  "Note00": "=============Meniul de mai jos este diferit de cele 2 de mai sus===========",
  "variables_Missing_Values": "Valori lipsă"
}