{
  "title": "Scalare multidimensională",
  "navigation": "Scalare multidimensională",
  "betRows": "Între rânduri",
  "betVariables": "Între variabile",
  "textSize": "Dimensiunea textului",
  "textPos": "Poziția textului",
  "destination": "Selectați variabilele",
  "maxDimensions": "Dimensiuni maxime",
  "label1": "Matricea de distanță",
  "computationMethod": "Metoda de calcul",
  "power": "Puterea distanței Minkowski",
  "dispDist": "Afișați matricea de distanță",
  "saveDims": "Salvați dimensiunile într-un nou set de date",
  "datasetName": "Introduceți opțional un nume de set de date pentru a salva dimensiunile",
  "label2": "Opțiuni avansate",
  "scalingMethod": "Metoda de scalare",
  "maxIter": "Numărul maxim de iterații (*Nu se aplică pentru metrică clasică)",
  "plotResults": "Trasați rezultatele",
  "help": {
    "title": "Scalare multidimensională",
    "r_help": "ajutor(cmdscale, pachet=stats)",
    "body": "\n<b>Descriere</b></br>\nExistă diferite tipuri de algoritmi MDS, inclusiv</br>\n<b>Scalare multidimensională clasică</b></br>\nPăstrează metrica de distanță originală între puncte cât mai bine posibil. Asta înseamnă că distanțele ajustate pe harta MDS și distanțele originale sunt în aceeași metrică. MDS clasic aparține categoriei de scalare multidimensională metrică.</br>\nDe asemenea, este cunoscut sub numele de analiza coordonatelor principale. Este potrivit pentru date cantitative.</br></br>\n<b>Scalare multidimensională non-metrică</b></br>\nDe asemenea, este cunoscut sub numele de MDS ordinal. Aici, nu este metrica unei valori de distanță care este importantă sau semnificativă, ci valoarea sa în raport cu distanțele dintre alte perechi de obiecte.</br>\nMDS ordinal construiește distanțe ajustate care sunt în aceeași ordine de rang ca distanța originală. De exemplu, dacă distanța dintre obiectele 1 și 5 se clasează pe locul cinci în datele de distanță originale, atunci acestea ar trebui să se claseze și pe locul cinci în configurația MDS.</br>\nEste potrivit pentru date calitative.</br>\nFolosim următoarele funcții R</br>\ncmdscale() [pachet stats]: Calculează scalarea multidimensională clasică (metrică).</br>\nisoMDS() [pachet MASS]: Calculează scalarea multidimensională non-metrică a lui Kruskal (o formă de MDS non-metrică).</br>\nsammon() [pachet MASS]: Calculează harta non-liniară a lui Sammon (o formă de MDS non-metrică).</br>\nToate aceste funcții iau un obiect de distanță ca argument principal și k este numărul dorit de dimensiuni în ieșirea scalată. În mod implicit, ele returnează soluții cu două dimensiuni, dar putem schimba asta prin parametrul k care este implicit 2.</br>\n<br/>\nOpțiuni pentru a afișa matricea de distanță, a salva dimensiunile într-un nou set de date și a trasa dimensiunile pot fi selectate. </br>\nCând metoda de scalare metrică clasică este selectată, afișăm valorile proprii, statistica de bună potrivire și screeplotul. Pentru alte metode de scalare, afișăm valoarea stresului.\n<b>Ajutor</b></br>\nPentru ajutor detaliat, rulați următoarele comenzi ajutor(dist, pachet=\"stats\") sau ajutor(cmdscale, pachet ='stats') sau ajutor(isoMDS, pachet = \"MASS\") sau ajutor(sammon, pachet =\"MASS\") în editorul R BlueSky Statistics.           \n<br/>\n<br/>"
  }
}