{
  "title": "Logit multinomial",
  "navigation": "Logit multinomial",
  "modelname": "Introduceți numele modelului",
  "dependent": "Variabilă dependentă",
  "independent": "Variabilă(variabile) independent(e)",
  "generateplotchk": "Trasați reziduurile vs ajustate, Q-Q normal, scală-locație și reziduuri vs levier",
  "destination2": "Specificați o variabilă cu greutăți",
  "help": {
    "title": "Logit multinomial",
    "r_help": "ajutor(multinom, pachet=nnet)",
    "body": "\n            <b>Descriere</b></br>\n            Se ajustează modele log-lineare multinomiale prin rețele neuronale.\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code> \n            multinom(formulă, date, greutăți, subset, na.action,<br/>\n                     contraste = NULL, Hess = FALSE, summ = 0, cenzurat = FALSE,<br/>\n                     model = FALSE, ...)<br/>\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            formulă: o expresie de formulă ca pentru modelele de regresie, de forma răspuns ~ predictori. Răspunsul ar trebui să fie un factor sau o matrice cu K coloane, care va fi interpretată ca număr pentru fiecare dintre cele K clase. Se ajustează un model log-lineare, cu coeficienți zero pentru prima clasă. Un offset poate fi inclus: ar trebui să fie o matrice numerică cu K coloane dacă răspunsul este fie o matrice cu K coloane, fie un factor cu K >= 2 clase, sau un vector numeric pentru un factor de răspuns cu 2 niveluri. Consultați documentația funcției formula() pentru alte detalii.\n            </li>\n            <li>\n            date: un cadru de date opțional în care să interpreteze variabilele care apar în formulă.\n            </li>\n            <li>\n            greutăți: greutăți opționale pentru cazuri în ajustare.\n            </li>\n            <li>\n            subset: expresie care indică ce subset din rândurile datelor ar trebui utilizat în ajustare. Toate observațiile sunt incluse în mod implicit.\n            </li>\n            <li>\n            na.action: o funcție pentru filtrarea datelor lipsă.\n            </li>\n            <li>\n            contraste: o listă de contraste care să fie utilizate pentru unele sau toate factorii care apar ca variabile în formula modelului.\n            </li>\n            <li>\n            Hess: logic pentru a determina dacă Hessianul (matricea de informație observată/ așteptată) ar trebui să fie returnat.\n            </li>\n            <li>\n            summ: întreg; dacă este diferit de zero, rezumă prin ștergerea rândurilor duplicate și ajustarea greutăților. Metodele 1 și 2 diferă în viteză (2 folosește C); metoda 3 combină de asemenea rândurile cu același X și Y diferit, ceea ce schimbă linia de bază pentru devianță.\n            </li>\n            <li>\n            cenzurat: Dacă Y este o matrice cu K coloane, interpretează intrările ca unu pentru clase posibile, zero pentru clase imposibile, mai degrabă decât ca numere.\n            </li>\n            <li>\n            model: logic. Dacă este adevărat, cadrul modelului este salvat ca componentă a obiectului returnat.\n            </li>\n            <li>\n            ... argumente suplimentare pentru nnet\n            </li>\n            </ul>\n            <b>Detalii</b></br>\n            multinom apelează nnet. Variabilele de pe partea dreaptă a formulei ar trebui să fie aproximativ scalate la [0,1] sau ajustarea va fi lentă sau poate să nu conveargă deloc.</br>\n            <b>Valoare</b><br/>\n            Un obiect nnet cu componente suplimentare:<br/>\n            <li>\n            deviance: devianța reziduală, comparativ cu modelul saturat complet (care explică exact observațiile individuale). De asemenea, minus de două ori log-verosimilitudinea.\n            </li>\n            <li>\n            edf: numărul (efectiv) de grade de libertate utilizate de model\n            </li>\n            <li>\n            AIC: AIC pentru această ajustare.\n            </li>\n            <li>\n            Hessian: (dacă Hess este adevărat).\n            </li>\n            <li>\n            model: (dacă modelul este adevărat).\n            </li>\n            <b>Exemple</b><br/>\n            <code> \n            options(contrasts = c(\"contr.treatment\", \"contr.poly\"))<br/>\n            library(MASS)<br/>\n            example(birthwt)<br/>\n            (bwt.mu <- multinom(low ~ ., bwt))<br/>\n            </code>\n            <b>Pachet</b></br>\n            nnet</br>\n            <b>Ajutor</b></br>\n            Pentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă help(multinom, package=nnet) creând un bloc de cod R făcând clic pe + în fereastra de ieșire\n           "
  }
}