{
  "title": "Relații de șanse / Riscuri relative, M pe tabel de 2",
  "navigation": "Relații de șanse / Riscuri relative, M pe tabel de 2",
  "outcomevarlabel": "Variabilă de rezultat (factor binar)",
  "expvarlabel": "Variabilă de expunere/predictor (factor)",
  "statlabel": "Statistică",
  "orlabel": "Relații de șanse",
  "rrlabel": "Riscuri relative",
  "oresttypelabel": "Tip de estimare a relațiilor de șanse",
  "orestwaldlabel": "Wald",
  "orestfisherlabel": "Fisher",
  "orestmidplabel": "Mid-p",
  "orestsmalllabel": "Ajustat pentru eșantioane mici",
  "rresttypelabel": "Tip de estimare a riscurilor relative",
  "rrestwaldlabel": "Wald",
  "rrestsmalllabel": "Ajustat pentru eșantioane mici",
  "reversallabel": "Inversarea categoriei",
  "revnonelabel": "Fără inversare",
  "revexplabel": "Expunere",
  "revoutlabel": "Rezultat",
  "revbothlabel": "Ambele",
  "cilevellabel": "Nivel de încredere (0-1)",
  "help": {
    "title": "Relații de șanse / Riscuri relative, M pe tabel de 2",
    "r_help": "help(epitab, package ='epitools')",
    "body": "\nAceasta este utilizată pentru a compara probabilitățile de a avea o \"boală\" pentru un grup în raport cu altul, sub formă de raport de șanse (odds ratio) sau raport de probabilitate (riscul relativ).  \nProbabilitatea de \"boală\" este definită ca probabilitatea de \"boală\" împărțită la probabilitatea de \"fără boală\". Se oferă un tabel de contingență al frecvențelor de rezultat în fiecare grup.  \nÎn plus, se include un tabel al relațiilor de șanse sau riscurilor relative pentru fiecare grup în raport cu grupul de referință, cu intervale de încredere și o valoare p Wald Chi-pătrat. În cele din urmă, \nse afișează un tabel al valorilor p cu versiuni exacte mid-p, Fisher și Wald Chi-pătrat, comparând fiecare grup cu grupul de referință. \n<br/><br/>\n<b>Variabilă de rezultat:</b> Variabilă binară \"boală\" (da/nu) de interes.  În mod implicit, cea mai mare categorie din ordinea de sortare este definită ca \"boală da\".\n<br/><br/>\n<b>Variabilă de expunere/predictor:</b> Grupuri de comparat.  Poate avea mai mult de 2 grupuri.\n<br/><br/>\n<b>Statistică:</b> Ce statistică să se calculeze\n<br/><br/>\n<b>Tip de estimare a relațiilor de șanse / riscuri relative:</b> Wald (verosimilitate maximă necondiționată), Fisher (verosimilitate maximă condiționată), Mid-p (metoda medianei neîntârziate) sau ajustat pentru eșantioane mici\n<br/><br/>\n<b>Inversarea categoriei:</b>  Acest lucru controlează dacă să inversați sau nu ordinea categoriilor variabilei de expunere sau categoriile variabilei de rezultat.  Inversarea variabilei de expunere va schimba grupul de referință pentru relațiile de șanse.  Inversarea variabilei de rezultat va schimba categoria care corespunde „bolii”.\n<br/><br/>\n<b>Nivel de încredere:</b> nivel pentru intervalele de încredere; implicit este 0,95\n<br/><br/>\n<b>Pachete R necesare:</b> epitools\n\t\t\t"
  }
}