{
  "title": "Numărul Optim de Copaci",
  "navigation": "Optimizare",
  "dependentvar": "Variabilă dependentă",
  "independentvars": "Variabilă(e) independent(e)",
  "label1": "Setări de simulare a copacilor",
  "startval": "Valoare de început",
  "endval": "Valoare finală",
  "stepval": "Valoare pas",
  "mtry": "mtry",
  "help": {
    "title": "Numărul Optim de Copaci",
    "r_help": "ajutor(randomForest, pachet='randomForest')",
    "body": "\n                <b>Descriere</b></br>\nÎncepând cu valoarea implicită a mtry, căutați valoarea optimă (în raport cu estimarea erorii Out-of-Bag) a ntree (numărul de copaci de crescut) pentru randomForest. Funcția BSkyMultiRandomForest apelează funcția randomForest cu argumentele definite mai jos\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nBSkyMultiRandomForest(x , y=NULL, startval, endval, stepval, mtry)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx : un cadru de date sau o matrice de predictori, sau o formulă care descrie modelul de ajustat (pentru metoda de imprimare, un obiect randomForest).\n</li>\n<li>\ny :  Un vector de răspuns. Dacă este un factor, se presupune clasificare, altfel se presupune regresie. Dacă este omis, randomForest va funcționa în modul nesupravegheat.\n</li>\n<li>\nstartval : valoare de început pentru argumentul ntree în randomForest().\n</li>\n<li>\nendval : valoare finală pentru argumentul ntree în randomForest().\n</li>\n<li>\nstepval : numărul cu care startval ar trebui să fie incrementat în fiecare iterație până ajunge la valoarea endval.\n</li>\n<li>\nmtry : Numărul de variabile selectate aleatoriu ca și candidați la fiecare divizare. Rețineți că valorile implicite sunt diferite pentru clasificare (sqrt(p) unde p este numărul de variabile în x) și regresie (p/3).\n</li>\n</ul>\n<b>Valoare</b><br/>\nImprimă numărul optim de copaci. De asemenea, afișează un tabel cu ntree și eroarea Out-of-Bag corespunzătoare<br/>\n<b>Pachet</b></br>\nrandomForest​;BlueSky</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestei suprapuneri de dialog sau rulați următoarea comandă în editorul de sintaxă R: ajutor(randomForest, pachet='randomForest')\n                "
  }
}