{
  "title": "Estimările nivelului parametrilor",
  "navigation": "Estimările parametrilor",
  "label1": "Modelele din următoarele clase sunt acceptate, clasele sunt enumerate între paranteze mai jos",
  "label2": "Modele liniare (lm), Modele liniare generalizate (glm), Modele log-lineare multinomiale (multinom), Regresie cuantile (rq), Regresie liniară robustă (rlm), Obiect de curba de supraviețuire (survfit), Model de efecte mixte liniare (lme), Obiect de regresie a riscurilor proporționale (coxph), Model de regresie a supraviețuirii parametrice (survreg), Regresie logistică ordonată/Probit (polr), Analiză factorială (factanal), Modele liniare generalizate regularizate prin Lasso și Elastic-net (glmnet)",
  "modelselector1": "Selectați un model",
  "help": {
    "title": "Estimările nivelului parametrilor",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>Descriere</b></br>\nAfișează estimările parametrilor modelului selectat\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: model sau alt obiect R de convertit într-un cadru de date pe o singură linie\n</li>\n</ul>\n<b>Detalii</b></br>\nAfișează estimările parametrilor pentru următoarele modele</br>\nModele liniare (clasa modelului lm)</br>\nModele liniare generalizate (clasa modelului glm)</br>\nModele log-lineare multinomiale (clasa modelului multinom)</br>\nRegresie logistică ordonată sau Probit (clasa modelului polr)</br>\nModele liniare generalizate regularizate prin Lasso și Elastic-Net (clasa modelului glmnet)</br>\nRegresie liniară robustă (clasa modelului rlm)</br>\nRegresie cuantile (clasa modelului rq)</br>\nModel de efecte mixte liniare (lme)</br>\nObiect de regresie a riscurilor proporționale (coxph)</br>\nModel de regresie a supraviețuirii parametrice (survreg)</br>\nAnaliză factorială (factanal)</br>\n<b>Valoare</b></br>\nUn tibble::tibble() cu informații despre componentele modelului.</br>\nterm: Numele termenului de regresie.</br>\nestimate: Valoarea estimată a termenului de regresie.</br>\nstd.error: Eroarea standard a termenului de regresie.</br>\nstatistic: Valoarea unei statistici, aproape întotdeauna o statistică T, utilizată într-o ipoteză că termenul de regresie nu este zero.</br>\np.value: Valoarea p bilateral asociată cu statistica observată.</br>\nconf.low: Limita inferioară a unui interval de încredere pentru termenul de regresie. Inclusă doar dacă conf.int = TRUE.</br>\nconf.high: Limita superioară a unui interval de încredere pentru termenul de regresie. Inclusă doar dacă conf.int = TRUE.</br>\nDacă modelul liniar este un obiect mlm (model liniar multiplu), există o coloană suplimentară:</br>\nresponse: La ce coloană de răspuns corespund coeficienții (de obicei Y1, Y2 etc.)</br>\n<b>Pachet</b></br>\nbroom</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestei suprapuneri de dialog sau rulați următoarea comandă în editorul de sintaxă R help(tidy, package ='broom')\n"
  }
}