{
  "title": "Regresia de supraviețuire parametrică",
  "navigation": "Regresia de supraviețuire parametrică",
  "modelname": "Introduceți numele modelului",
  "timevar": "Timp până la eveniment sau cenzură",
  "eventvar": "Eveniment (1 sau mai mare = eveniment, 0 sau mai mic = cenzură)",
  "destvars": "Variabile independente",
  "weightvar": "Greutăți (opțional)",
  "rmstChk": "Calculați timpul mediu de supraviețuire restricționat (RMST)",
  "rmstSEChk": "Calculați eroarea standard pentru RMST folosind bootstrap (notă: va dura ceva timp)",
  "bootIter": "Iterație bootstrap",
  "HazardRatioChk": "Calculați rapoartele de hazard",
  "labelSurvival": "Tipul graficului de supraviețuire",
  "survivalradioCI": "Supraviețuire cu CI",
  "survivalradio": "Supraviețuire",
  "survivalradioKMCI": "Supraviețuire cu overlay Kaplan-Meier (nonparametric) cu CI",
  "survivalradioKM": "Supraviețuire cu overlay Kaplan-Meier (nonparametric)",
  "labelFailure": "Tipul graficului de eșec cumulativ",
  "inciradioCI": "Eșec cumulativ cu CI",
  "inciradio": "Eșec cumulativ",
  "inciradioKMCI": "Eșec cumulativ cu overlay Kaplan-Meier (nonparametric) cu CI",
  "inciradioKM": "Eșec cumulativ cu overlay Kaplan-Meier (nonparametric)",
  "spectimes": "Calculați probabilitatea de supraviețuire - specificați timpii ca time1, time2, time3, etc. sau ca seq (1,5,by=1)",
  "specprobs": "Calculați timpul de supraviețuire până la eveniment - specificați cuantila (probabilitate) ca 0.25, 0.50, 0.60, 0.75, etc. sau ca seq (0.2,0.9,by=0.1)",
  "coVarValues": "Dacă este lăsat gol, vor fi utilizate valorile medii ale variabilelor independente (covariate). În caz contrar, specificați valori separate prin virgulă care vor fi utilizate pentru estimarea probabilităților și pentru graficare",
  "labelDistribution": "Selectați o funcție de distribuție care se potrivește cel mai bine datelor",
  "selectDistFuncWeibullRad": "Weibull",
  "selectDistFuncExpRad": "Exponențială",
  "selectDistFuncGammaRad": "Gamma",
  "selectDistFuncLnormalRad": "Log Normal",
  "selectDistFuncPoissonRad": "Poisson",
  "selectDistFuncNBinomRad": "Binomial negativ",
  "selectDistFuncGeomRad": "Geometric",
  "selectDistFuncBetaRad": "Beta",
  "selectDistFuncUnifRad": "Uniform",
  "selectDistFuncLogisRad": "Logistic",
  "selectDistFuncLogLogisRad": "Log Logistic",
  "selectDistFuncCauchyRad": "Cauchy",
  "selectDistFuncNormRad": "Normal",
  "confidenceInterval": "Intervale de încredere pentru estimările de maximă verosimilitate",
  "help": {
    "title": "Regresia de supraviețuire parametrică",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n\t\t\tConsultați setul de date de exemplu în directorul de instalare, locația implicită este la litera unității:\\program files\\BioStat Prime\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. Variabila Followup_time ar trebui introdusă ca timpul până la eveniment sau cenzură, iar variabila Event ar trebui introdusă ca Eveniment (1 = eveniment, 0 = cenzură).<br/>\n            <br/>\n            <br/>\n\t\t\tSeturile de date de exemplu sunt lung, manufacturing_data și bulb reliability <br/><br/>\t\t\n            <b>Estimările parametrice ale regresiei de supraviețuire și graficele împreună cu curbele de supraviețuire Kaplan-Meier (model doar cu nul/intercept)</b>\n            <br/>\n            <br/>\n            Acestea sunt utilizate pentru a estima riscul cumulativ de a nu avea un anumit eveniment (sau, invers, de a avea un anumit eveniment) pe o perioadă de timp după începutul urmăririi pentru acel eveniment (sau timpul zero). Subiecții trebuie să fie expuși riscului pentru eveniment începând de la timpul zero.\n            <br/>\n            <br/>\n            <b>Timp:</b> Lungimea timpului până la un eveniment, dacă evenimentul a avut loc, sau ultima urmărire pentru acel eveniment, dacă evenimentul nu a avut loc, pentru fiecare subiect\n            <br/><br/>\n            <b>Eveniment:</b> Indicator numeric al faptului că evenimentul a avut loc sau nu (1=eveniment, 0=cenzură) pentru fiecare subiect\n            <br/><br/>\n            <b>Tip grafic:</b> Graficați probabilitatea de a nu avea evenimentul (supraviețuire) sau de a avea evenimentul (eșec)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Estimare tabel pentru timpi specifici sau probabilitate:</b> Opțiunea de a include un tabel care are probabilitățile estimate de supraviețuire pentru un set de timp selectat de utilizator.\n\t\t\t<br/><br/>\n\t\t\t<b>Specificați timpi ca time1, time2, time3, etc. sau ca seq(1,5,by=1):</b> Aceștia sunt timpii specifici care vor fi incluși în tabel pentru timpi specifici. Pot fi specificați individual cu virgule sau ca o secvență de valori uniform distribuite.\n\t\t\t<br/><br/>\n            Tabelele sunt generate cu dimensiunea eșantionului, numărul de subiecți cu evenimentul, timpul median de supraviețuire (dacă este definit), timpul mediu de supraviețuire restricționat și timpul median de urmărire. Timpul median de urmărire este calculat folosind estimatorul Kaplan-Meier invers, care tratează evenimentele adevărate ca observații cenzurate și observațiile cenzurate adevărate ca evenimente. Astfel, \"evenimentul\" în acest estimator este \"urmărirea subiecților cât mai mult timp posibil\".\n            <br/>\n            O tabelă de estimări parametrice de supraviețuire și eveniment pentru distribuția aleasă este furnizată la fiecare timp observat în setul de date, cu intervale de încredere date. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Opțiuni de stil</b>\n            <br/>\n            <br/>\n            <b>Titlu grafic:</b> Titlul graficului; ștergeți tot textul pentru a nu avea titlu\n            <br/><br/>\n\t\t\t<b>Dimensiunea titlului graficului:</b> Dimensiunea titlului graficului.\n\t\t\t<br/><br/>\n            <b>Tema graficului:</b> Stilul general al graficului\n            <br/><br/>\n            <b>Include numărul expus la risc:</b> Opțional, includeți un tabel pentru numărul de subiecți care sunt încă expuși riscului în timp, la baza graficului. <b>Poziția tabelului de risc</b> specifică dacă doriți tabelul în afara axelor sau în interiorul axelor. <b>Înălțimea tabelului de risc</b> controlează proporția zonei de grafic pe care o va ocupa tabelul. Această opțiune este ignorată atunci când poziția tabelului de risc este în interiorul axelor. \n\t\t\t<b>Dimensiunea valorii tabelului de risc</b> controlează dimensiunea numerelor expuse la risc. <b>Dimensiunea titlului tabelului de risc</b> controlează dimensiunea titlului pentru tabelul expus la risc.\n\t\t\t<b>Dimensiunea etichetei axei tabelului de risc</b> controlează dimensiunea etichetelor axei.\n\t\t\t<b>Dimensiunea etichetei de marcaj a axei tabelului de risc</b> controlează dimensiunea etichetelor de marcaj pentru timpii din tabelul expus la risc. Dacă se dorește eliminarea tuturor axelor și liniilor de grilă \n\t\t\tdin tabelul expus la risc, opțiunea <b>Eliminați axele și liniile de grilă din tabelul de risc</b> poate fi bifată. Aceasta va include doar numerele expuse la risc în tabel.\n            <br/>\n            <br/>\n            <b>Opțiuni pentru linii:</b>\n            <b>Dimensiunea</b> controlează grosimea și <b>Culoarea</b> controlează culoarea liniei desenate. Se poate include opțional un interval de încredere de 95% pentru estimări fie într-un format <b>ribbon</b> (zonă umbrită) sau <b>step</b> (linie). <b>Transparența</b> controlează cât de întunecată este panglica și este ignorată atunci când opțiunea pas este selectată. <b>Timpii cenzurați</b> (când subiecții nu mai sunt expuși riscului pentru eveniment) pot fi indicați pe linie cu simboluri \"+\". Dimensiunea simbolurilor \"+\" poate fi ajustată. Opțiunea <b>Indicați supraviețuirea mediană</b> va include linii orizontale sau verticale la momentul în care 50% dintre subiecți sunt estimați că au avut evenimentul. Timpul median este nedefinit dacă curba de supraviețuire nu traversează 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opțiuni pentru axă</b>\n            <br/> \n            <br/> \n            Opțiunea <b>Etichetă</b> specifică eticheta de text pentru axă. Opțiunea <b>Limitele axei</b> specifică valorile minime și maxime ale axei. Opțiunea <b>Incrementul marcajului de etichetă</b> controlează distanțarea marcajelor de etichetă pe axă. Incrementele pe axa de timp controlează, de asemenea, timpii pentru tabelul opțional expus la risc.\n            <br/> \n            Opțiunea <b>Scala</b> a axei de supraviețuire specifică dacă doriți ca estimările să fie pe o scară de proporție (0-1) sau procent (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea etichetei axei:</b>  Aceasta controlează dimensiunea atât a etichetelor axei de supraviețuire, cât și a axei de timp.\n\t\t\t<br/><br/>\n\t\t\t<b>Dimensiunea etichetei de marcaj a axei:</b>  Aceasta controlează dimensiunea atât a etichetelor de marcaj ale axei de supraviețuire, cât și a axei de timp."
  }
}