{
  "title": "Statistici Personfit și Testul de Raport de Verosimilitate Martin-Löf",
  "navigation": "Ajustare Persoană",
  "label1": "Selectați un model (modelele din clasa Rm, dRm și eRm sunt acceptate)",
  "label1b": "Dacă nu sunt disponibile modele, trebuie să creați mai întâi un model selectând Ajustare Model -> IRT -> Model Rasch Simplu și alegeți estimarea CML",
  "modelselector1": "Selectați un model",
  "chkbox": "Afișați statisticile Testului de Raport de Verosimilitate Martin-Löf",
  "lbl2": "Criterii de Împărțire pentru Testul de Raport de Verosimilitate",
  "rd1": "mediană",
  "rd2": "medie",
  "help": {
    "title": "Statistici Personfit și Testul de Raport de Verosimilitate Martin-Löf",
    "r_help": "help(personfit, package='eRm')",
    "body": "\n                <b>Descriere: statistici personfit</b></br>\n                Pentru modelele din clasa Rm, eRm sau dRm (create folosind IRT -> Model Rasch Simplu cu estimare CML) folosește funcția personfit pentru a afișa statistici personfit.\n\n                <br/><br/>\n                <b>Utilizare</b>\n                <br/>\n                <code>\n                eRm::personfit(object)\n                </code>\n                <br/><br/>\n                <b>Detalii</b>\n                <br/>  \n                object: Obiect din clasa ppar, derivat din person.parameter, rulați help(person.parameter) din editorul de sintaxă pentru ajutor.\n                <br/><br/>\n                <b>Valori</b>\n                <br/>\n                p.df: grade de libertate pentru statisticile personfit\n                <br/>\n                st.res: Reziduuri standardizate (din funcția personfit).\n                <br/>\n                p.outfitMSQ: Statistici medii pătrat ale outfit-ului (din funcția personfit).\n                <br/>\n                p.infitMSQ: Statistici medii pătrat ale infit-ului (din funcția personfit).\n                <br/><br/>\n                <b>Ajutor</b>\n                <br/>\n                Rulați următoarele din editorul de sintaxă BlueSky Statistics: help(personfit, package ='eRm')\n                <br/><br/>\n                <b>Pachete</b>\n                <br/>\n                eRm\n                <br/>\n\n                <b>Descriere: Testul de Raport de Verosimilitate Martin-Löf</b></br>\n                Acest Test de Raport de Verosimilitate se bazează pe împărțirea subgrupurilor de itemi.\n                <br/><br/>\n                <b>Utilizare</b>\n                <br/>\n                <code>\n                MLoef(robj, splitcr = \"mediană\")\n                </code>\n                <br/><br/>\n                <b>Detalii</b>\n                <br/>  \n                robj: Un obiect din clasa 'Rm'.\n                <br/>\n                splitcr: Criteriu de împărțire pentru a defini grupurile de itemi. \"mediană\" și \"medie\" împart itemii în două grupuri pe baza scorurilor brute ale acestora. splitcr poate fi de asemenea un vector de lungime k (unde k denotă numărul de itemi) care ia două sau mai multe valori distincte pentru a defini grupurile utilizate pentru Testul Martin-Löf.\n                <br/><br/>\n                <b>Valori</b>\n                <br/>\n                MLoef returnează un obiect din clasa MLoef care conține:\n                <br/><br/>\n                LR: valoarea LR\n                <br/>\n                df: grade de libertate\n                <br/>\n                p.value: p-valoarea testului\n                <br/>\n                fullModel: modelul Rasch general\n                <br/>\n                subModels: o listă care conține submodelele\n                <br/>\n                Lf: log-verosimilitatea modelului complet\n                <br/>\n                Ls: listă a log-verosimilitudinilor submodelelor\n                <br/>\n                i.groups: o listă a grupurilor de itemi\n                <br/>\n                splitcr: criteriul de împărțire trimis\n                <br/>\n                split.vector: alocarea binară a itemilor în grupuri\n                <br/>\n                warning: itemii care sunt egali cu mediana sau media pentru criteriile de împărțire respective\n                <br/><br/>\n                <b>Pachete</b>\n                <br/>\n                eRm                \n                <br/><br/>\n                <b>Ajutor</b>\n                <br/>\n                Rulați următoarele din editorul de sintaxă BlueSky Statistics: help(MLoef, package ='eRm')\n\n                "
  }
}