{
  "title": "Corelația Policorică",
  "navigation": "Policorică",
  "Target": "Selectați una sau mai multe variabile x",
  "textbox1": "Interval de încredere",
  "textbox2": "Ipoteza nulă (mu)",
  "Target2": "Selectați o singură variabilă de factor ordonat y",
  "label1": "Tipul estimării",
  "test1": "Aproximare în două etape",
  "test2": "Estimare prin maximă verosimilitate",
  "label2": "Eroare standard",
  "Missvals": "Afișați eroarea standard",
  "conflevel": "Corelația absolută maximă (pentru a asigura stabilitatea numerică).",
  "Seed": "Valoare(e) de start opțional(e)",
  "header": "Corelația este estimată între fiecare variabilă x și variabila y",
  "showEffectSizes": "Returnați pragurile estimate",
  "help": {
    "title": "Corelația Policorică",
    "r_help": "help(polychor, package ='polycor')",
    "body": "\n<b>Descriere</b></br>\nCalculează corelația policorică (și eroarea sa standard) între două variabile ordinale, sub presupunerea că variabilele ordinale disecă variabile latente continue care sunt bivariabile normale. Fie estimarea prin maximă verosimilitate, fie o aproximare \"în două etape\" (posibil mult) mai rapidă este disponibilă. Pentru estimarea ML, estimările pragurilor și matricea de covarianță a estimărilor sunt de asemenea disponibile.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \npolychor(x, y, ML = FALSE, control = list(), \n  std.err = FALSE, maxcor=.9999, start, thresholds=FALSE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: variabilă categorială ordonată; variabila poate fi numerică, logică, un factor, un factor ordonat sau o variabilă de caracter, dar dacă este un factor, nivelurile sale trebuie să fie în ordinea corectă, iar valorile unei variabile de caracter sunt ordonate alfabetic.\n</li>\n<li>\ny: o variabilă de factor ordonat\n</li>\n<li>\nML: dacă este TRUE, calculează estimarea prin maximă verosimilitate; dacă este FALSE, valoarea implicită, calculează o aproximare mai rapidă \"în două etape\".\n</li>\n<li>\nstd.err: dacă este TRUE, returnează varianța estimată a corelației (pentru estimarea în două etape) sau matricea de covarianță estimată (pentru estimarea ML) a corelației și pragurilor; valoarea implicită este FALSE. \n</li>\n<li>\nmaxcor: corelația absolută maximă (pentru a asigura stabilitatea numerică).\n</li>\n<li>\nstart:  valoare(e) de start opțional(e): dacă este un singur număr, valoare de start pentru corelație.\n</li>\n<li>\nthresholds:  dacă este TRUE (valoarea implicită este FALSE) returnează praguri estimate împreună cu corelația estimată chiar dacă erorile standard nu sunt calculate.\n</li>\n</ul>\n<b>Valori</b></br>\nValoare: Dacă std.err sau thresholds este TRUE, returnează un obiect de clasă \"polycor\" cu următoarele componente:</br>\ntype: setat pe \"policoric\".</br>\nrho: corelația policorică.</br>\nrow.cuts: praguri estimate pentru variabila de rând (x), pentru estimarea ML.</br>\ncol.cuts: praguri estimate pentru variabila de coloană (y), pentru estimarea ML.</br>\nvar: varianța estimată a corelației, sau, pentru estimarea ML, matricea de covarianță estimată a corelației și pragurilor.</br>\nn: numărul de observații pe care se bazează corelația.</br>\nchisq: test chi-pătrat pentru normalitate bivariată.</br>\ndf: grade de libertate pentru testul de normalitate bivariată.</br>\nML: TRUE pentru estimarea ML, FALSE pentru estimarea în două etape\n<b>Detalii</b></br>\nEstimarea ML se calculează maximizând verosimilitatea bivariată-normală în raport cu pragurile pentru cele două variabile (τ^x[i], i = 1,…, r - 1; τ^y[j], j = 1,…, c - 1) și corelația populațională (ρ). Aici, r și c sunt respectiv numărul de niveluri ale x și y. Verosimilitatea este maximizată numeric folosind funcția optim, iar matricea de covarianță a parametrilor estimați se bazează pe Hessianul numeric calculat de optim.</br>\nEstimarea în două etape se calculează mai întâi estimând pragurile (τ^x[i], i = 1,…, r - 1 și τ^y[j], i = j,…, c - 1) separat de distribuția marginală a fiecărei variabile. Apoi, verosimilitatea unidimensională pentru ρ este maximizată numeric, folosind optim dacă se solicită erori standard, sau optimise dacă nu se solicită. Eroarea standard calculată tratează pragurile ca fiind fixe.\n<br/>\n<b>Exemplu</b></br>\n<code> \nif(require(mvtnorm)){\n    set.seed(12345)\n    data <- rmvnorm(1000, c(0, 0), matrix(c(1, .5, .5, 1), 2, 2))\n    x <- data[,1]\n    y <- data[,2]\n    cor(x, y)  # corelația de eșantion\n    }\n\nif(require(mvtnorm)){\n    x <- cut(x, c(-Inf, .75, Inf))\n    y <- cut(y, c(-Inf, -1, .5, 1.5, Inf))\n    polychor(x, y)  # estimare în 2 etape\n    }\n\nif(require(mvtnorm)){\n    polychor(x, y, ML=TRUE, std.err=TRUE)  # estimare ML\n    }\n</code> <br/>\n<b>Pachet</b></br>\npolycor</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui dialog sau rulați următoarea comandă help(polycor, package ='polychor') creând un bloc de cod R făcând clic pe + în fereastra de ieșire           \n    "
  }
}