{
  "title": "Grafice P-P",
  "navigation": "P-P",
  "alpha": "Opacitate (0-1)",
  "x": "Axa X, specificați o variabilă numerică (s)",
  "y": "Formă, specificați o variabilă factor",
  "color": "Culoare, specificați o variabilă factor",
  "referenceline": "Linie de referință",
  "band": "Arată benzi",
  "detrend": "Detrend",
  "flip": "Răsturnați axa",
  "distribution": "Selectați o distribuție",
  "x_title": "Eticheta axei X",
  "y_title": "Eticheta axei Y",
  "label1": "Parametrii distribuției, de exemplu, pentru o distribuție normală, parametrii distribuției ar putea fi mean=2, sd=2, așa că introduceți mean=2, sd=2. Pentru o distribuție exponențială, parametrii ar putea fi rate=2, așa că introduceți rate=2.",
  "dparams": "Introduceți opțional parametrii distribuției",
  "specify_a_title": "Introduceți un titlu",
  "Facetrow": "Rând de fațete",
  "Facetcolumn": "Coloană de fațete",
  "Facetwrap": "Împachetare fațete",
  "Facetscale": "Scală fațete",
  "help": {
    "title": "Grafice P-P",
    "r_help": "help(stat_pp_point,package='qqplotr')",
    "body": "\n            <b>Descriere</b></br>\n            Un grafic P–P (grafic de probabilitate-probabilitate sau grafic de procent-procent sau grafic de valoare P) este un grafic de probabilitate pentru a evalua cât de aproape sunt două seturi de date, care trasează cele două funcții de distribuție cumulativă una față de cealaltă. În mod implicit, comparăm distribuția cumulativă a variabilei selectate cu distribuția normală, cu toate acestea, puteți compara cu mai multe alte distribuții, inclusiv beta, cauchy, chisq, exp, f, gamma... De asemenea, puteți specifica parametrii distribuției asociați cu distribuția cu care se compară. Faceți clic pe butonul opțiuni din dialogul principal pentru a selecta o distribuție și a specifica parametrii distribuției. Puteți selecta o variabilă factor pentru a grupa variabila selectată. În acest caz, se desenează un grafic P-P separat pentru fiecare grup.\n            <br/>\n            <b>Utilizare</b>\n            <br/>\n            <code> \n            ggplot(data = datasetname,mapping= aes(sample = var1 ,shape = var2 ))  +stat_pp_band() + stat_pp_line() + stat_pp_point()  +labs(x = \"Puncte de probabilitate\",y = \"Probabilitate cumulativă\",title =paste(\"Grafic PP pentru variabila \",var1,sep=''))+facet_grid(var3 ~.)\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            data: Setul de date implicit​\n            </li>\n            <li>\n            aes(): Generați mapări estetice care descriu modul în care variabilele din date sunt mapate la proprietăți vizuale (estetice) ale geoms.​\n            </li>\n            <li>\n            sample: variabila numerică pentru care se trasează graficul P-P\n            </li>\n            <li>\n            stat_pp_point: Trasează probabilitățile cumulative față de punctele de probabilitate. Funcția de probabilitate cumulativă este construită cu datele din eșantion și apoi evaluată la fiecare punct de probabilitate.\n            </li>\n            <li>\n            stat_pp_line: Trasează o linie de identitate de referință (x=y).\n            </li>\n            <li>\n            stat_pp_band: Trasează benzi de încredere. Deocamdată, este disponibilă doar versiunea bootstrap (\"boot\").\n            </li>\n            <li>\n            shape: O variabilă factor opțională care grupează valorile atribuite eșantionului. Se creează un grafic P-P separat pentru fiecare grup determinat de nivelurile variabilei factor​. Fiecare grup este indicat printr-o formă diferită\n            </li>\n            <li>\n            Labs(): Schimbați etichetele axelor și titlurile legendelor (aceasta este opțional)​\n            </li>\n            <li>\n            facet_grid(): Aranjați panourile într-o grilă (aceasta este opțional)​. Consultați help(facet_grid) pentru mai multe detalii.\n            </li>\n            <li>  ​\n            coord_flip(): Răsturnați axa (aceasta este opțional)​\n            </li>\n            </ul>\n            <b>Pachet</b></br>\n            ggplot2;ggthemes;qqplotr;</br>\n            <b>Ajutor</b></br>\n            help(stat_pp_point, package='qqplotr')</br>\n            Altceva: Faceți clic pe butonul Ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(labs), help(stat_pp_point), help(aes), help(facet_grid), help(coord_flip)</br>​\n            https://cran.r-project.org/web/packages/qqplotr/vignettes/introduction.html\n        "
  }
}