{
  "title": "Dimensiunea eșantionului, Precizia Kappa lui Cohen",
  "navigation": "Kappa lui Cohen",
  "howtouse": "Specificați fie dimensiunea eșantionului, fie lățimea intervalului de încredere, iar cealaltă va fi calculată",
  "n": "Dimensiunea Eșantionului",
  "width": "Lățimea Intervalului de Încredere",
  "kappa": "Kappa (0-1)",
  "conflevel": "Nivelul de Încredere (0-1)",
  "raters": "Numărul de Evaluatori (2-6)",
  "categories": "Numărul de Categorii (2-5)",
  "props": "Proporțiile din Fiecare Categorie; separați cu virgule, de exemplu .3, .7; trebuie să se potrivească cu numărul de categorii și să se adune la 1",
  "help": {
    "title": "Dimensiunea eșantionului, Precizia Kappa lui Cohen",
    "r_help": "help(prec_kappa, package ='presize')",
    "body": "\nAceasta este o evaluare a dimensiunii eșantionului pentru Kappa lui Cohen bazată pe lățimea intervalului de încredere.  Calculează dimensiunea eșantionului sau lățimea intervalului de încredere atunci când utilizatorul \nspecifice cealaltă.\n<br/><br/>\n<b>Dimensiunea Eșantionului:</b> Specificați numărul de subiecți din studiu\n<br/><br/>\n<b>Lățimea Intervalului de Încredere:</b> Specificați lățimea intervalului de încredere dorită.  Lățimea unui interval de încredere este o măsură a preciziei unei estimări și este limita superioară minus limita inferioară.\n<br/><br/>\n<b>Kappa:</b> Specificați valoarea kappa așteptată\n<br/><br/>\n<b>Nivelul de Încredere:</b> Specificați nivelul dorit al intervalului de încredere\n<br/><br/>\n<b>Numărul de Evaluatori:</b> Specificați numărul de evaluatori care vor oferi valori pentru fiecare subiect.\n<br/><br/>\n<b>Numărul de Categorii:</b> Specificați numărul de categorii în variabila de rezultat\n<br/><br/>\n<b>Proporțiile din Fiecare Categorie:</b> Specificați proporția așteptată a subiecților în fiecare categorie, separate prin virgule.  Rețineți că numărul valorilor specificate trebuie să se potrivească cu\tnumărul de categorii specificate și să se adune la 1.\n<br/><br/>\n<b>Pachete R Necesare:</b> presize\n\t\t\t"
  }
}