{
  "title": "Dimensiunea eșantionului, Precizia unui Odds Ratio",
  "navigation": "Odds Ratio",
  "howtouse": "Specificați fie dimensiunea eșantionului, fie lățimea intervalului de încredere, iar celălalt va fi calculat",
  "n1": "Dimensiunea eșantionului Grup 1",
  "width": "Lățimea intervalului de încredere",
  "ratio": "Raportul dimensiunii eșantionului Grup 2 la Grup 1",
  "prop1": "Proporția rezultatelor Grup 1",
  "prop2": "Proporția rezultatelor Grup 2",
  "conflevel": "Nivel de încredere (0-1)",
  "method": "Metoda intervalului de încredere",
  "help": {
    "title": "Dimensiunea eșantionului, Precizia unui Odds Ratio",
    "r_help": "help(prec_or, package ='presize')",
    "body": "\nAceasta este o evaluare a dimensiunii eșantionului pentru un odds ratio bazat pe lățimea intervalului de încredere. Calculează dimensiunea eșantionului sau lățimea intervalului de încredere atunci când utilizatorul \nspecificează cealaltă.\n<br/><br/>\n<b>Dimensiunea eșantionului Grup 1:</b> Specificați numărul de subiecți din grupul 1\n<br/><br/>\n<b>Lățimea intervalului de încredere:</b> Specificați lățimea dorită a intervalului de încredere. Lățimea unui interval de încredere este o măsură a preciziei unei estimări și este limita superioară minus limita inferioară.\n<br/><br/>\n<b>Raportul dimensiunii eșantionului Grup 2 la Grup 1:</b> Specificați raportul dimensiunii eșantionului grupului 2 la dimensiunea eșantionului grupului 1. O valoare de 1 înseamnă dimensiuni egale ale eșantionului.\n<br/><br/>\n<b>Proporția rezultatelor Grup 1:</b> Specificați proporția subiecților din grupul 1 cu rezultatul 'pozitiv'\n<br/><br/>\n<b>Proporția rezultatelor Grup 2:</b> Specificați proporția subiecților din grupul 2 cu rezultatul 'pozitiv'\n<br/><br/>\nRețineți că odds ratio va corespunde odds-urilor rezultatului 'pozitiv' în grupul 1 în raport cu odds-urile rezultatului 'pozitiv' în grupul 2.\n<br/><br/>\n<b>Nivel de încredere:</b> Specificați nivelul dorit al intervalului de încredere\n<br/><br/>\n<b>Metoda intervalului de încredere:</b> Specificați tipul de interval de încredere ajustat care trebuie utilizat. Woolf (woolf), Gart (gart) și logit netezit prin independență (indip_smooth) aparțin \nunui set general de intervale de încredere ajustate, adăugând 0 (woolf) la fiecare celulă, 0,5 (gart) la fiecare celulă sau o ajustare pentru fiecare celulă bazată pe datele observate \n(independence-smoothed). În gart și indip_smooth, estimarea CI nu este posibilă dacă p1 = 0, caz în care OR devine 0, dar limita inferioară a CI este > 0. În plus, \ndacă p1 = 1 și p2 < 1, sau dacă p1 > 0 și p2 = 0, OR devine ∞, dar limita superioară a CI este finită. Pentru intervalele aproximative, gart și indip_smooth sunt intervalele recomandate (Fagerland et al. 2011).\n<br/><br/>\n<b>Pachete R necesare:</b> presize\n\t\t\t"
  }
}