{
  "title": "Dimensiunea eșantionului, Precizia Kappa lui Cohen",
  "navigation": "Kappa lui Cohen",
  "howtouse": "Specificați fie dimensiunea eșantionului, fie lățimea intervalului de încredere, iar celălalt va fi calculat",
  "n": "Dimensiunea eșantionului",
  "width": "Lățimea intervalului de încredere",
  "kappa": "Kappa (0-1)",
  "conflevel": "Nivel de încredere (0-1)",
  "raters": "Numărul de evaluatori (2-6)",
  "categories": "Numărul de categorii (2-5)",
  "props": "Proporții în fiecare categorie; separați cu virgule, de exemplu .3, .7; trebuie să corespundă numărului de categorii și să se adune la 1",
  "help": {
    "title": "Dimensiunea eșantionului, Precizia Kappa lui Cohen",
    "r_help": "help(prec_kappa, package ='presize')",
    "body": "\nAceasta este o evaluare a dimensiunii eșantionului pentru Kappa lui Cohen bazată pe lățimea intervalului de încredere. Calculează dimensiunea eșantionului sau lățimea intervalului de încredere atunci când utilizatorul specifică cealaltă.\n<br/><br/>\n<b>Dimensiunea eșantionului:</b> Specificați numărul de subiecți din studiu\n<br/><br/>\n<b>Lățimea intervalului de încredere:</b> Specificați lățimea dorită a intervalului de încredere. Lățimea unui interval de încredere este o măsură a preciziei unei estimări și este limita superioară minus limita inferioară.\n<br/><br/>\n<b>Kappa:</b> Specificați valoarea kappa așteptată\n<br/><br/>\n<b>Nivel de încredere:</b> Specificați nivelul dorit al intervalului de încredere\n<br/><br/>\n<b>Numărul de evaluatori:</b> Specificați numărul de evaluatori care vor oferi valori pentru fiecare subiect.\n<br/><br/>\n<b>Numărul de categorii:</b> Specificați numărul de categorii din variabila de rezultat\n<br/><br/>\n<b>Proporții în fiecare categorie:</b> Specificați proporția așteptată a subiecților în fiecare categorie, separate prin virgule. Rețineți că numărul valorilor specificate trebuie să corespundă numărului de categorii specificate și să se adune la 1.\n<br/><br/>\n<b>Pachete R necesare:</b> presize\n\t\t\t"
  }
}