{
  "title": "Testul Proporției pentru un Singur Eșantion (Beta)",
  "navigation": "Eșantion unic (Beta)",
  "tvarbox1": "Numeric sau factor cu doar 2 niveluri/valori",
  "label1": "Ipoteza alternativă",
  "test1": "Proporție != Proporție ipotetizată",
  "test2": "Proporție > Proporție ipotetizată",
  "test3": "Proporție < Proporție ipotetizată",
  "txtbox1": "Nivel de încredere",
  "txtbox2": "Ipoteza nulă (Proporția ipotetizată în intervalul 0-1)",
  "chkbox1": "Cu corecție de continuitate",
  "dataInCols": "Unul sau mai multe variabile conțin eșantioane",
  "summarized": "Date rezumate",
  "noOfEvents": "Numărul de evenimente",
  "noOfTrials": "Numărul de încercări",
  "method": "Selectați metoda",
  "help": {
    "title": "Testul Proporției pentru un Singur Eșantion",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>Descriere</b></br>\nprop.test poate fi folosit pentru a testa nulitatea că proporțiile (probabilitățile de succes) în mai multe grupuri sunt aceleași, sau că acestea sunt egale cu anumite valori date.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: un vector de număr de succese, o tabelă unidimensională cu două intrări, sau o tabelă bidimensională (sau matrice) cu 2 coloane, care oferă numărul de succese și eșecuri, respectiv.\n</li>\n<li>\nn: un vector de număr de încercări; ignorat dacă x este o matrice sau o tabelă.\n</li>\n<li>\np: un vector de probabilități de succes. Lungimea lui p trebuie să fie aceeași cu numărul de grupuri specificate de x, iar elementele sale trebuie să fie mai mari decât 0 și mai mici decât 1.\n</li>\n<li>\nalternative: un șir de caractere care specifică ipoteza alternativă, trebuie să fie unul dintre \"two.sided\" (implicit), \"greater\" sau \"less\". Poți specifica doar litera inițială. Folosit doar pentru a testa nulitatea că o singură proporție este egală cu o valoare dată, sau că două proporții sunt egale; ignorat în alt mod.\n</li>\n<li>\nconf.level: nivelul de încredere al intervalului de încredere returnat. Trebuie să fie un singur număr între 0 și 1. Folosit doar când se testează nulitatea că o singură proporție este egală cu o valoare dată, sau că două proporții sunt egale; ignorat în alt mod.\n</li>\n<li>\ncorrect: un logic care indică dacă corecția de continuitate a lui Yates ar trebui aplicată acolo unde este posibil.\n</li>\n</ul>\n<b>Detalii</b></br>\nNumai grupurile cu numere finite de succese și eșecuri sunt utilizate. Numerele de succese și eșecuri trebuie să fie non-negative și, prin urmare, nu mai mari decât numerele corespunzătoare de încercări care trebuie să fie pozitive. Toate numerele finite trebuie să fie întregi.</br>\nDacă p este NULL și există mai mult de un grup, nulitatea testată este că proporțiile din fiecare grup sunt aceleași. Dacă există două grupuri, alternativele sunt că probabilitatea de succes în primul grup este mai mică decât, nu egală cu, sau mai mare decât probabilitatea de succes în al doilea grup, așa cum este specificat de alternative. Se returnează un interval de încredere pentru diferența de proporții cu un nivel de încredere specificat de conf.level și tăiat la [-1,1]. Corecția de continuitate este utilizată doar dacă nu depășește diferența proporțiilor de eșantion în valoare absolută. În caz contrar, dacă există mai mult de 2 grupuri, alternativa este întotdeauna \"two.sided\", intervalul de încredere returnat este NULL, iar corecția de continuitate nu este niciodată utilizată.</br>\nDacă există un singur grup, atunci nulitatea testată este că probabilitatea subiacente de succes este p, sau .5 dacă p nu este dat. Alternativa este că probabilitatea de succes este mai mică decât, nu egală cu, sau mai mare decât p sau 0.5, respectiv, așa cum este specificat de alternative. Se returnează un interval de încredere pentru proporția subiacente cu un nivel de încredere specificat de conf.level și tăiat la [0,1]. Corecția de continuitate este utilizată doar dacă nu depășește diferența dintre proporțiile de eșantion și nul în valoare absolută. Intervalul de încredere este calculat prin inversarea testului de scor.</br>\nÎn cele din urmă, dacă p este dat și există mai mult de 2 grupuri, nulitatea testată este că probabilitățile subiacente de succes sunt cele date de p. Alternativa este întotdeauna \"two.sided\", intervalul de încredere returnat este NULL, iar corecția de continuitate nu este niciodată utilizată.</br>\n<b>Valoare</b><br/>\nO listă cu clasa \"htest\" conținând următoarele componente:</br>\nstatistică: valoarea statisticii testului chi-pătrat Pearson.</br>\nparametru: gradele de libertate ale distribuției chi-pătrat aproximative a statisticii testului.</br>\np.valoare: valoarea p a testului.</br>\nestimare: un vector cu proporțiile de eșantion x/n.</br>\nconf.int: un interval de încredere pentru proporția adevărată dacă există un grup, sau pentru diferența în proporții dacă există 2 grupuri și p nu este dat, sau NULL în alt mod. În cazurile în care nu este NULL, intervalul de încredere returnat are un nivel de încredere asimptotic așa cum este specificat de conf.level, și este adecvat pentru ipoteza alternativă specificată.</br>\nnull.value: valoarea p dacă este specificată de nulitate, sau NULL în alt mod.</br>\nalternative: un șir de caractere care descrie alternativa.</br>\nmethod: un șir de caractere care indică metoda utilizată, și dacă s-a aplicat corecția de continuitate a lui Yates.</br>\ndata.name: un șir de caractere care oferă numele datelor.</br>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(prop.test, package ='stats')\n"
  }
}