{
  "title": "Împărțire aleatorie",
  "navigation": "Împărțire aleatorie",
  "traindataset": "Introduceți numele setului de date pentru antrenare",
  "testdataset": "Introduceți numele setului de date pentru testare",
  "split": "Introduceți procentajul de împărțire",
  "replace": "Samplingul trebuie să fie cu înlocuire?",
  "seed": "Setați semințele",
  "dependent": "Variabila din care se construiesc eșantioanele stratificate",
  "help": {
    "title": "Împărțire aleatorie",
    "r_help": "help(sample, package=\"base\")",
    "body": "\n<b>Descriere</b></br>\nsample ia un eșantion de dimensiunea specificată din elementele lui x folosind fie cu, fie fără înlocuire.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nsample(x, size, replace = FALSE, prob = NULL)\nsample.int(n, size = n, replace = FALSE, prob = NULL)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: Fie un vector de unul sau mai multe elemente din care să alegi, fie un număr întreg pozitiv. Vezi 'Detalii'.\n</li>\n<li>\nn: un număr pozitiv, numărul de elemente din care să alegi. Vezi 'Detalii'.\n</li>\n<li>\nsize: un număr întreg non-negativ care dă numărul de elemente de ales.\n</li>\n<li>\nreplace: Samplingul trebuie să fie cu înlocuire?\n</li>\n<li>\nprob: Un vector de greutăți de probabilitate pentru obținerea elementelor vectorului care este eșantionat.\n</li>\n</ul>\n<b>Detalii</b></br>\nDacă x are lungimea 1, este numeric (în sensul lui is.numeric) și x >= 1, samplingul prin sample are loc din 1:x. Rețineți că această caracteristică de comoditate poate duce la comportamente nedorite atunci când x are lungimi variate în apeluri precum sample(x). Vezi exemplele.<br/>\nÎn altă ordine de idei, x poate fi orice obiect R pentru care lungimea și subselectarea prin întregi au sens: metodele S3 sau S4 pentru aceste operații vor fi dispatchate corespunzător.<br/>\nPentru sample, valoarea implicită pentru size este numărul de elemente inferat din primul argument, astfel încât sample(x) generează o permutare aleatorie a elementelor lui x (sau 1:x).<br/>\nEste permis să ceri eșantioane de size = 0 cu n = 0 sau un x de lungime zero, dar în altă ordine de idei n > 0 sau lungimea pozitivă(x) este necesară.<br/>\nValorile numerice pozitive non-integre ale lui n sau x vor fi trunchiate la cel mai mic întreg, care nu trebuie să fie mai mare decât .Machine$integer.max.<br/>\nArgumentul opțional prob poate fi folosit pentru a oferi un vector de greutăți pentru obținerea elementelor vectorului care este eșantionat. Ele nu trebuie să se adune la unu, dar ar trebui să fie non-negative și nu toate zero. Dacă replace este adevărat, metoda alias a lui Walker (Ripley, 1987) este folosită atunci când există mai mult de 200 de valori rezonabil probabile: aceasta dă rezultate incompatibile cu cele din R < 2.2.0.<br/>\nDacă replace este fals, aceste probabilități sunt aplicate secvențial, adică probabilitatea de a alege următorul element este proporțională cu greutățile dintre elementele rămase. Numărul de greutăți non-zero trebuie să fie cel puțin size în acest caz.<br/>\nsample.int este o interfață simplă în care atât n cât și size trebuie să fie furnizate ca întregi.<br/>\nÎncepând cu R 3.0.0, n poate fi mai mare decât cel mai mare întreg de tip integer, până la cel mai mare întreg reprezentabil în tipul double. Numai samplingul uniform este suportat. Două numere aleatoare sunt folosite pentru a asigura samplingul uniform al numerelor întregi mari.<br/>\n<b>Pachet</b></br>\nbase\n<b>Ajutor</b></br>\nhelp(sample, package=\"base\")\n"
  }
}