{
  "title": "Împărțire Aleatorie",
  "navigation": "Împărțire Aleatorie",
  "traindataset": "Introduceți numele setului de date de antrenament",
  "testdataset": "Introduceți numele setului de date de test",
  "split": "Introduceți procentajul de împărțire",
  "replace": "Ar trebui să se facă eșantionare cu înlocuire?",
  "seed": "Setați semința",
  "dependent": "Variabila pentru construirea eșantioanelor stratificate",
  "help": {
    "title": "Împărțire Aleatorie",
    "r_help": "ajutor(eșantion, pachet=\"bază\")",
    "body": "\n<b>Descriere</b></br>\neșantion ia un eșantion de dimensiunea specificată din elementele lui x folosind fie cu, fie fără înlocuire.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \neșantion(x, dimensiune, înlocuire = FALS, prob = NULL)\neșantion.int(n, dimensiune = n, înlocuire = FALS, prob = NULL)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: Fie un vector de unul sau mai multe elemente din care să alegi, fie un număr întreg pozitiv. Vezi 'Detalii.'\n</li>\n<li>\nn: un număr pozitiv, numărul de elemente din care să alegi. Vezi 'Detalii.'\n</li>\n<li>\ndimensiune: un număr întreg non-negativ care dă numărul de elemente de ales.\n</li>\n<li>\nînlocuire: Ar trebui să se facă eșantionare cu înlocuire?\n</li>\n<li>\nprob: Un vector de greutăți de probabilitate pentru obținerea elementelor vectorului care este eșantionat.\n</li>\n</ul>\n<b>Detalii</b></br>\nDacă x are lungimea 1, este numeric (în sensul lui is.numeric) și x >= 1, eșantionarea prin eșantion se face din 1:x. Rețineți că această caracteristică de comoditate poate duce la un comportament nedorit atunci când x are lungimi variabile în apeluri precum eșantion(x). Vezi exemplele.<br/>\nÎn caz contrar, x poate fi orice obiect R pentru care lungimea și sub-setarea prin întregi au sens: metodele S3 sau S4 pentru aceste operațiuni vor fi dispatchate după cum este necesar.<br/>\nPentru eșantion, dimensiunea implicită este numărul de elemente dedus din primul argument, astfel încât eșantion(x) generează o permutare aleatorie a elementelor lui x (sau 1:x).<br/>\nEste permis să ceri eșantioane de dimensiune = 0 cu n = 0 sau un x de lungime zero, dar în caz contrar n > 0 sau lungime pozitivă(x) este necesară.<br/>\nValorile numerice pozitive non-integre ale lui n sau x vor fi trunchiate la următorul întreg mai mic, care nu trebuie să fie mai mare decât .Machine$integer.max.<br/>\nArgumentul opțional prob poate fi folosit pentru a oferi un vector de greutăți pentru obținerea elementelor vectorului care este eșantionat. Nu trebuie să se adune la unu, dar ar trebui să fie non-negative și nu toate zero. Dacă înlocuirea este adevărată, se folosește metoda alias a lui Walker (Ripley, 1987) atunci când există mai mult de 200 de valori rezonabil probabile: aceasta dă rezultate incompatibile cu cele din R < 2.2.0.<br/>\nDacă înlocuirea este falsă, aceste probabilități sunt aplicate secvențial, adică probabilitatea de a alege următorul element este proporțională cu greutățile dintre elementele rămase. Numărul de greutăți nenule trebuie să fie cel puțin dimensiunea în acest caz.<br/>\neșantion.int este o interfață simplă în care atât n cât și dimensiunea trebuie furnizate ca întregi.<br/>\nÎncepând cu R 3.0.0, n poate fi mai mare decât cel mai mare întreg de tip integer, până la cel mai mare întreg reprezentabil în tip double. Numai eșantionarea uniformă este acceptată. Se folosesc două numere aleatoare pentru a asigura o eșantionare uniformă a numerelor întregi mari.<br/>\n<b>Pachet</b></br>\nbază\n<b>Ajutor</b></br>\najutor(eșantion, pachet=\"bază\")\n"
  }
}