{
  "title": "Pădure Aleatoare",
  "label1": "Pădurea aleatoare poate fi rulată în modul supravegheat sau nesupravegheat. Pentru a rula în modul nesupravegheat, nu specificați o variabilă dependentă.",
  "navigation": "Pădure Aleatoare",
  "modelname": "Introduceți numele modelului",
  "dependentvar": "Variabilă dependentă",
  "independentvars": "Variabilă(e) independent(e)",
  "ntree": "Nr. de arbori",
  "mtry": "mtry",
  "proximity": "Proximitate:",
  "newds": "Specificați numele setului de date pentru a stoca proximitatea:",
  "predictor": "Salvați valorile prezise:",
  "newcolname": "Specificați noul nume de coloană pentru valorile prezise:",
  "help": {
    "title": "Pădure Aleatoare",
    "r_help": "help(randomForest,package='randomForest')",
    "body": "\n                <b>Descriere</b></br>\nrandomForest implementează algoritmul pădurii aleatoare al lui Breiman (bazat pe codul original Fortran al lui Breiman și Cutler) pentru clasificare și regresie. Poate fi folosit și în modul nesupravegheat pentru evaluarea proximităților între punctele de date.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nrandomForest(x, y=NULL,  ntree=500, importance=FALSE, proximity, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx : Un cadru de date sau o matrice de predictori, sau o formulă care descrie modelul care trebuie ajustat (pentru metoda de imprimare, un obiect randomForest).\n</li>\n<li>\ny: Un vector de răspuns. Dacă este un factor, se presupune clasificare, altfel se presupune regresie. Dacă este omis, randomForest va rula în modul nesupravegheat.\n</li>\n<li>\nntree : Numărul de arbori de crescut. Acesta nu ar trebui să fie setat la un număr prea mic, pentru a asigura că fiecare rând de intrare este prezis de cel puțin câteva ori.\n</li>\n<li>\nimportance : Ar trebui evaluată importanța predictorilor? \n</li>\n<li>\nproximity : Ar trebui calculată măsura de proximitate între rânduri?\n</li>\n<li>\n... : parametrii opționali care vor fi transmiși funcției de nivel inferior randomForest.default.\n</li>\n</ul>\n<b>Valoare</b><br/>\nUn obiect de clasă randomForest, care este o listă cu următoarele componente:<br/>\ncall: apelul original la randomForest<br/>\ntype: unul dintre regresie, clasificare sau nesupravegheat.<br/>\npredicted: valorile prezise ale datelor de intrare bazate pe mostrele din afara pachetului.<br/>\nimportance:\ta matrice cu nclass + 2 (pentru clasificare) sau două (pentru regresie) coloane. Pentru clasificare, primele nclass coloane sunt măsurile specifice clasei calculate ca scădere medie în precizie. Columna nclass + 1 este scăderea medie în precizie pe toate clasele. Ultima coloană este scăderea medie în indicele Gini. Pentru regresie, prima coloană este scăderea medie în precizie și a doua scăderea medie în MSE. Dacă importance=FALSE, ultima măsură este totuși returnată ca un vector.<br/>\nimportanceSD: „erorile standard” ale măsurii de importanță bazate pe permutare. Pentru clasificare, o matrice p pe nclass + 1 corespunzătoare primelor nclass + 1 coloane ale matricei de importanță. Pentru regresie, un vector de lungime p.<br/>\nlocalImp: o matrice p pe n care conține măsurile de importanță caz cu caz, elementul [i,j] al cărei este importanța variabilei i în cazul j. NULL dacă localImp=FALSE.<br/>\nntree: numărul de arbori crescuți.<br/>\nmtry: numărul de predictori selectați pentru a împărți la fiecare nod.<br/>\nforest: (o listă care conține întreaga pădure; NULL dacă randomForest este rulat în modul nesupravegheat sau dacă keep.forest=FALSE.<br/>\nerr.rate: (doar clasificare) vector de rate de eroare ale predicției pe datele de intrare, elementul i fiind rata de eroare (OOB) pentru toți arborii până la i.<br/>\nconfusion: (doar clasificare) matricea de confuzie a predicției (bazată pe date OOB).<br/>\nvotes: (doar clasificare) o matrice cu un rând pentru fiecare punct de date de intrare și o coloană pentru fiecare clasă, oferind fracția sau numărul de „voturi” (OOB) din pădurea aleatoare.<br/>\noob.times: numărul de ori când cazurile sunt „în afara pachetului” (și astfel utilizate în calcularea estimării erorii OOB)<br/>\nproximity: dacă proximity=TRUE când se apelează randomForest, o matrice de măsuri de proximitate între datele de intrare (bazată pe frecvența cu care perechile de puncte de date sunt în aceleași noduri terminale).<br/>\nmse\t: (doar regresie) vector de erori pătratice medii: suma pătratelor reziduurilor împărțită la n.<br/>\nrsq\t: (doar regresie) „pseudo R-pătrat”: 1 - mse / Var(y).<br/>\ntest: dacă se oferă un set de testare (prin argumentele xtest sau suplimentar ytest), acest component este o listă care conține predicțiile corespunzătoare, err.rate, confuzie, voturi (pentru clasificare) sau prezise, mse și rsq (pentru regresie) pentru setul de testare. Dacă proximity=TRUE, există de asemenea un component, proximitate, care conține proximitatea între setul de testare precum și proximitatea între datele de testare și cele de antrenament.<br/>\n<b>Pachet</b></br>\nrandomForest​;BlueSky</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui dialog sau rulați următoarea comandă în editorul de sintaxă R</br>\nhelp(randomForest,package='randomForest')\n                "
  }
}