{
  "title": "Modelul Scalei de Evaluare",
  "navigation": "Modelul Scalei de Evaluare",
  "modelname": "Introduceți numele modelului",
  "destinationvars": "Variabila(e) de destinație",
  "estimationlbl": "Estimare",
  "rad1": "Utilizați estimarea CML",
  "chk1": "Calculați eroarea standardizată",
  "chk2": "Normalizați parametrii pentru a suma (0)",
  "rad2": "Utilizați estimarea MML",
  "help": {
    "title": "Modelul Scalei de Evaluare",
    "r_help": "help(RSM, package='eRm')",
    "body": "\n            <b>Descriere</b>\n            <br/>\n            Generează estimări ale parametrilor pentru un model de scală de evaluare\n            <br/><br/>\n            Pentru estimarea CML, invocăm eRm::RSM pentru a calcula estimările parametrilor unui model de scală de evaluare pentru răspunsuri polihotomice\n            <br/><br/>\n            Pentru estimarea MML, invocăm tam.mml cu parametrii corespunzători, vezi mai jos\n            <br/><br/>\n            <b>Utilizare pentru estimarea CML</b>\n            <br/>\n            <code>\n            eRm::RSM(X,se=FALSE,sum0=FALSE) \n            </code>  \n            <br/><br/>\n            <b>Argumente</b>\n            <br/>                      \n            <ul>\n            <li>\n            X:  Matrice de date 0/1 sau cadru de date; rândurile reprezintă indivizi, coloanele reprezintă articole. Valorile lipsă sunt inserate ca NA.\n            </li>\n            <li>\n            W:  Matrice de design pentru modelul Rasch. Dacă este omis, funcția va calcula W automat.\n            </li>\n            <li>\n            se: Dacă este TRUE, erorile standard sunt calculate.\n            </li>\n            <li>\n            sum0: Dacă este TRUE, parametrii sunt normalizați pentru a suma-0 specificând un W corespunzător. Dacă este FALSE, primul parametru este restricționat la 0.\n            </li>\n            <li>\n            etaStart: O vector de valori de început pentru parametrii eta poate fi specificat. Dacă lipsește, se folosește vectorul 0.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>Utilizare pentru estimarea MML</b>\n            <br/>\n            <code>\n            tam.mml(resp,irtmodel=\"RSM\",verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Argumente</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Cadru de date cu răspunsuri polytomice k=0,...,K. Răspunsurile lipsă trebuie declarate ca NA.\n            </li>\n            <li>\n            irtmodel: Pentru pante fixe ale articolelor (în tam.mml) opțiunile includ PCM (model de credit parțial), PCM2 (model de credit parțial cu parametrizarea ConQuest 'item+item*step' și RSM (model de scală de evaluare; parametrizarea ConQuest 'item+step'). \n            <br/>\n            Pentru pante estimate ale articolelor (disponibile doar în tam.mml.2pl) opțiunile sunt 2PL (toate pantele categoriilor de articole sunt estimate; Modelul de Răspuns al Articolului Nominal), GPCM (modelul de credit parțial generalizat în care fiecare articol primește un singur și doar un parametru de pantă pe dimensiune) și 2PL.groups (subseturi de articole primesc aceleași estimări ale pantelor articolelor) și o matrice de design E pe pantelor articolelor în modelul de credit parțial generalizat (GPCM.design, vezi Exemple). Rețineți că pantele articolelor nu pot fi estimate cu designuri facete folosind funcția tam.mml.mfr. Cu toate acestea, este ușor să folosiți matrice de design pre-specificate și să aplicați unele restricții la tam.mml.2pl\n            </li>\n            <li>\n            verbose: Logic indicând dacă ieșirea ar trebui să fie imprimată în timpul iterațiilor. \n            </li>\n            </ul>\n            <br/><br/>\n            <b>Pachete</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>\n            <b>Ajutor</b>\n            <br/>\n            help(RSM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
  }
}