{
  "title": "Recode Variabile",
  "navigation": "Recode",
  "oldvars": "Variabile de recodat",
  "label1": "Opțiuni",
  "newvarradio": "Variabilă nouă(variabile)",
  "newvar": "Introduceți numele variabilelor noi separate prin , de exemplu newVar1, newVar2",
  "oldvarradio": "Suprascrie variabila(e) existentă(e)",
  "suffix": "Specificați un sufix pentru variabilele recodificate",
  "prefix": "Specificați un prefix pentru variabilele recodificate",
  "enterSuffix": "Introduceți un sufix",
  "enterPrefix": "Introduceți un prefix",
  "label3": "Când specificați mai multe criterii de recodare, folosiți ; ca separator.",
  "label4": "NOTĂ: VALORILE STRING TREBUIE SĂ FIE ÎNCHISE ÎN GHILIMELE DUBLE (\") ȘI NU ÎN GHILIMELE SIMPLE (').",
  "label5": "Introduceți valorile vechi și valorile noi separate prin ; de exemplu \"Masculin\"=\"Bărbat\";\"Fem\"=2;\"Houston, Texas\"=\"Texas\";\"Nu este disponibil\"=NA ",
  "label5a": "Pentru recodarea tipului numeric introduceți 70=100;71=101;99=NA",
  "label5b": "Intervalul de valori este acceptat, de exemplu 5:10=\"mediu\" Valorile speciale lo și hi pot apărea într-un interval, de exemplu lo:10=\"scăzut\";11:89=\"mediu\";90:hi=\"Ridicat\"",
  "label6": "Cuvântul cheie else poate fi folosit pentru tot ce nu se încadrează într-o specificație, de exemplu else =NA",
  "dontMakeFactor": "În mod implicit, variabila recodificată va fi un factor dacă variabila sursă este un factor. Pentru a anula, bifați caseta de selectare",
  "oldnewvals": "Introduceți criteriile de recodare",
  "help": {
    "title": "Recode Variabile",
    "r_help": "help(recode, package=car)",
    "body": "\n<b>Descriere</b></br>\nRecodifică unul sau mai multe vectori numerici, vectori de caractere sau factori conform specificațiilor de recodare. Puteți stoca rezultatele prin suprascrierea variabilelor existente, specificând nume noi de variabile pentru a stoca valorile recodificate sau alegând să stocați valorile recodificate în variabile noi cu un prefix sau sufix adecvat. prefixul sau sufixul va fi aplicat numelui variabilei existente.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nBSkyRecode(colNames,newColNames,OldNewVals,NewCol=TRUE,dataSetNameOrIndex='Dataset2')\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ncolNames: Un vector de caractere care conține una sau mai multe variabile din setul de date de recodat\n</li>\n<li>\nnewColNames:  Un vector de caractere care conține numele noilor coloane.\n</li>\n<li>\nOldNewVals: Un șir de caractere de specificații de recodare sub forma oldval1,newval1, oldval2,newval2\n</li>\n<li>\nNewCol: Un Boolean care indică dacă valorile recodificate sunt stocate în variabile noi (TRUE) sau variabilele existente sunt suprascrise (FALSE).\n</li>\n<li>\nprefixOrSuffix: Specificați dacă doriți să stocați valorile recodificate în variabile noi prefixate sau sufixate cu numele pe care îl specificați.  Introduceți prefix sau sufix.\n</li>\n<li>\nprefixOrSuffixString: Introduceți un șir pentru a folosi ca prefix sau sufix pentru numele variabilei existente. Valorile recodificate vor fi stocate în aceste variabile.\n</li>\n<li>\ndataSetNameOrIndex: Numele setului de date/dataframe\n</li>\n</ul>\nNotă: Nu vom converti din numeric în factor. Când un numeric este recodificat, va rămâne numeric, când o variabilă factor este recodificată va rămâne factor.<br/>\n<b>Pachet</b></br>\ncar</br>\n<b>Ajutor</b></br>\nTastați linia de mai jos în editorul de sintaxă R din BlueSky Statistics</br>\nhelp(recode, package=car)\n"
  }
}