{
  "title": "Analiza Fiabilității (Omega lui McDonald)",
  "navigation": "Omega lui McDonald",
  "tvarbox1": "Toate Elementele",
  "help": {
    "title": "Omega lui McDonald",
    "r_help": "help(omega, package=psych)",
    "body": "\n            <b>Descriere</b></br>\nCalculați estimările omega ale lui McDonald pentru saturația factorilor generali și total\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nomega(m,nfactors=3,fm=\"minres\",n.iter=1,p=.05,poly=FALSE,key=NULL,\n    flip=TRUE,digits=2, title=\"Omega\",sl=TRUE,labels=NULL,\nplot=TRUE,n.obs=NA,rotate=\"oblimin\",Phi=NULL,option=\"equal\",covar=FALSE, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nm​: O matrice de corelație, sau un data.frame/matrix de date, sau (dacă Phi) este specificat, o matrice de model de factor oblic\n</li>\n<li>\nnfactors: Numărul de factori grupați\n</li>\n<li>\nfm​: metoda factorului (valoarea implicită este minres) fm=\"pa\" pentru axe principale, fm=\"minres\" pentru o soluție de reziduuri minime (OLS), fm=\"pc\" pentru componente principale (vezi notă), sau fm=\"ml\" pentru maximă verosimilitate.\n</li>\n<li>\nn.iter: Câte replicări să facă în omega pentru estimări bootstrap​\n</li>\n<li>\np: probabilitatea limitelor de conferință bilaterale\n</li>\n<li>\ndigits​: dacă este specificat, rotunjiți ieșirea la digits​\n</li>\n<li>\npoly: ar trebui să se găsească matricea de corelație folosind corelații polichorice/tetrahorice sau corelații Pearson normale\n</li>\n<li>\nkey​: un vector de +/- 1s pentru a specifica direcția scorării elementelor. Valoarea implicită este de a presupune că toate elementele sunt notate pozitiv, dar dacă unele elemente sunt notate invers, atunci key ar trebui să fie specificat.​\n</li>\n</ul>\n<b>Valoare</b><br/>\nomega ierarhic: Coeficientul ω_h<br/>\nomega.lim: Limita lui ω_h pe măsură ce testul devine infinit de mare<br/>\nomega total: Coeficientul omega_t<br/>\nalpha: Alpha lui Cronbach<br/>\nschmid: Matricea de factori transformată Schmid Leiman și matricele asociate<br/>\nschmid$sl: Sarcinile factorului g, precum și factorii rezidualizați<br/>\nschmid$orthog: Soluția rotativă Varimax a factorilor originali<br/>\nschmid$oblique: Factorii transformați oblimin sau promax<br/>\nschmid$phi: matricea de corelație a factorilor oblici<br/>\nschmid$gloading: Sarcinile pe factorul de ordin superior, g, al factorilor oblimin<br/>\nkey: Un vector de -1 sau 1 care arată în ce direcție au fost notate elementele.<br/>\nmodel: o listă de două elemente, unul potrivit pentru a fi dat funcției sem pentru modele de ecuații structurale, celălalt, pentru a fi dat pachetului lavaan.<br/>\nsem: Ieșirea dintr-o analiză sem<br/>\nomega.group: Statisticile rezumative pentru omega total, omega ierarhic (general) și omega în fiecare grup.<br/>\nscores: Estimările scorurilor factorilor sunt găsite pentru soluția Schmid-Leiman. Pentru a obține scoruri pentru modelul ierarhic, consultați nota din ajutorul detaliat R.<br/>\nvarious fit statistics, see output<br/>\n<b>Pachet</b></br>\npsych​</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestei suprapuneri de dialog sau rulați următoarea comandă help(omega, package=psych) creând un bloc de cod R făcând clic pe + în fereastra de ieșire\n\t\t\t"
  }
}