{
  "helpText": "ANOVA cu măsurători repetate necesită ca datele să fie în format lung. Dacă datele dvs. nu sunt în format lung, consultați Seturi de date > Restructurare > Mai lung",
  "modelname": "Introduceți numele modelului",
  "title": "ANOVA cu Măsurători Repetate",
  "subjectID": "Variabilă de utilizat ca identificator de subiect",
  "dependentVariable": "Variabilă dependentă",
  "navigation": "ANOVA, Măsurători Repetate, Lung",
  "response": "Variabilă(variabile) în cadrul subiecților, de ex. Timp",
  "Fixed": "Factor(e) între subiecți",
  "covariates": "Covariate",
  "Summary": "Mediile marginale estimate",
  "Scatter_plot": "Posthocs",
  "Residual": "Rezidual vs. Grafic ajustat",
  "Histogram": "Grafic histogram al reziduurilor",
  "brownForsythe": "Testul Brown-Forsythe",
  "levenesTest": "Testul Levene",
  "plotMeansCI": "Graficul mediilor și intervalelor de încredere",
  "simpleEffectsTest": "Testul efectelor simple",
  "label2": "Opțiuni pentru posthocs și testul efectelor simple",
  "combon": "Compară mediile folosind:",
  "adjust": "Metodă de ajustare a valorilor p",
  "displayBoxMDetails": "Afișați detalii asociate cu testul Box (Notă: rezultatele testului Box sunt întotdeauna afișate)",
  "help": {
    "title": "ANOVA cu Măsurători Repetate",
    "r_help": "ajutor(aov_ez , pachet='afex')",
    "body": "\n<b>Descriere</b></br>\nCu ANOVA cu măsurători repetate, statisticile F sunt calculate pentru fiecare factor intra-subiect, factor între subiecți și termenul de interacțiune pentru ANOVA mixtă</br>\nCăutați tabelele de valori ANOVA suplimentare în ieșire care afișează MSE (media pătratelor erorilor) și pes (eta pătrat parțial)</br>\nÎn prezent, susținem un singur factor intra-subiect și între subiecți, factorul între subiecți este opțional.</br>\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"dependentVariable\", \n\tid = \"Identifier\", within = c(\"Time\"), \tbetween = c(\"Treatment\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndata: Un data.frame care conține datele. Obligatoriu\n</li>\n<li>\ndv: vector de caractere (de lungime 1) care indică coloana care conține variabila dependentă în date.\n</li>\n<li>\nbetween: vector de caractere care indică factorii/coloanele între subiecți în date. Implicit este NULL, ceea ce indică că nu există factori între subiecți.\n</li>\n<li>\nwithin: vector de caractere care indică factorii/coloanele intra-subiecți (sau măsurători repetate) în date. Implicit este NULL, ceea ce indică că nu există factori intra-subiecți.\n</li>\n<li>\ncovariate: vector de caractere care indică covariatele între subiecți (adică, coloanele) în date. Implicit este NULL, ceea ce indică că nu există covariate. Vă rugăm să rețineți că factorize trebuie să fie setat pe FALSE în cazul în care covariata este numerică și ar trebui tratată ca atare.\n</li>\n<li>\nanovatable: listă de alte argumente transmise funcției care produce tabela ANOVA. \n</li>\n</ul>\n<br/>\n<b>Detalii</b></br>\nConsultați ajutorul R detaliat</br>\n<b>Valoare</b><br/>\naov_car, aov_4 și aov_ez sunt wrapperi pentru Anova și aov, valoarea de returnare depinde de argumentul de returnare. În mod implicit, se returnează un obiect S3 de clasă \"afex_aov\" care conține următoarele sloturi:<br/>\n\"anova_table\": O tabelă ANOVA de clasă c(\"anova\", \"data.frame\").<br/>\n\"aov\": obiect aov returnat de aov (nu ar trebui folosit pentru a evalua semnificația efectelor, dar poate fi trecut la emmeans pentru teste post-hoc).<br/>\n\"Anova\": obiect returnat de Anova, un obiect de clasă \"Anova.mlm\" (dacă sunt prezente factori intra-subiecți) sau de clasă c(\"anova\", \"data.frame\").<br/>\n\"lm\": obiectul ajustat cu lm și trecut la Anova (adică, un obiect de clasă \"lm\" sau \"mlm\"). De asemenea, se returnează dacă return = \"lm\".<br/>\n\"data\": o listă care conține: (1) long (datele posibil agregate în format lung utilizate pentru aov), wide (datele utilizate pentru a ajusta obiectul lm) și idata (dacă sunt prezente factori intra-subiecți, argumentul idata trecut la car::Anova). De asemenea, se returnează dacă return = \"data\".<br/>\n<b>Pachet</b></br>\nafex</br>\n<b>Ajutor</b></br>\nhelp(aov_ez, package ='afex')\nFaceți clic pe butonul de ajutor R pentru a obține ajutor detaliat R. De asemenea, puteți introduce help(aov_ez, package ='afex') și apăsa CTRL Enter în editorul de sintaxă R pentru a obține ajutor\n    "
  }
}