{
  "title": "Reanalizați analiza pe seturi de date diferite",
  "navigation": "Reanalizați analiza",
  "helpText": "Reanalizați sau reproduceți analiza într-o filă de ieșire schimbând seturile de date originale cu seturi de date noi.\nUrmați pașii de mai jos.\n1. Filă de ieșire selectată trebuie să conțină analiza de reprodus sau de reanalizat.\n2. Seturile de date noi pe care doriți să le schimbați trebuie să fie deschise în grila de date.\n3. Specificați care set de date nou va fi schimbat cu originalul (din analiza din fila de ieșire activă).\n4. Pentru a face acest lucru, selectați setul de date original în prima listă și noul set de date în a doua listă și faceți clic pe butonul de mutare.\n5. Repetați pasul 4 pentru a schimba mai multe seturi de date.\n6. Apăsați butonul de execuție.\n",
  "allDatasets": "Seturi de date de schimbat",
  "datasetsFromOutput_BSky": "Seturi de date originale",
  "mapping": "Seturi de date mapate",
  "out": "Introduceți numele setului de date stivuit",
  "in1": "Selectați 2 sau mai multe seturi de date",
  "in2": "Selectați al 2-lea set de date",
  "label1": "Opțiuni de stivuire",
  "label2": "Toate opțiunile de mai jos necesită 2 seturi de date cu exact aceleași nume de variabile",
  "bindrows": "Leagă rânduri (stivează seturi de date așa cum sunt, poate duce la rânduri duplicate)",
  "union": "Uniune (stivează seturi de date și elimină duplicate exacte)",
  "intersect": "Intersecție (păstrează rândurile comune ambelor seturi de date)",
  "setdiff": "Diferență (păstrează doar rândurile din 1. set de date, dar nu în 2.)",
  "id": "Dacă doriți să urmăriți din ce set de date provine fiecare observație, specificați un nume pentru acea variabilă aici. NOTĂ: Noua variabilă este adăugată la începutul setului de date rezultat.",
  "help": {
    "title": "Stivuirea seturilor de date",
    "r_help": "ajutor(bind_rows, pachet=dplyr)",
    "body": "\n            <b>Descriere</b></br>\nAceastă fereastră de dialog vă va ajuta să stivuiți 2 sau mai multe seturi de date unul peste altul. Puteți selecta una dintre următoarele opțiuni.<br/>\n1. Leagă rânduri: stivează cele 2 sau mai multe seturi de date exact așa cum sunt. Dacă un nume de variabilă este comun ambelor seturi de date, valorile se vor completa așa cum vă așteptați. Dacă un set de date A conține o variabilă numită var1 care nu este prezentă în celălalt set de date B, vor apărea NA în variabila var1 pentru toate rândurile care corespund setului de date B.<br/>\nToate opțiunile de mai jos funcționează DOAR pe 2 seturi de date și necesită ca ambele seturi de date să împărtășească aceleași variabile.<br/>\n2. Uniune: stivează seturile de date și elimină duplicatele<br/>\n3. Intersecție: păstrează rândurile comune ambelor<br/>\n4. Diferență: păstrează rândurile din 1. set de date, nu în 2.<br/>\nÎn funcție de opțiunea selectată, se apelează funcțiile bind_rows, union, intersect și setdiff din pachetul dplyr.\nNOTĂ: puteți urmări opțional din ce set de date provine observația originală. ID-ul setului de date (1/2) este adăugat la începutul setului de date care conține rezultatele.<br/>\n<b>Pachet</b></br>\ndplyr</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestei suprapunerii de dialog sau rulați următoarea comandă ajutor(bind_rows, pachet=\"dplyr\") în fereastra de sintaxă R\n            "
  }
}