{
  "title": "Reformare, de la latime la lungime",
  "label2": "Alegeți variabilele de reformare sau, alternativ, alegeți variabilele pe care nu doriți să le reformati. În acest ultim caz, toate variabilele rămase vor fi reformate în coloană(e)",
  "navigation": "Mai lung",
  "label0": "Puteți alege să salvați rezultatele într-un nou set de date sau să suprascrieți setul de date existent",
  "label1": "Opțiuni",
  "advanced": "Avansat",
  "New": "Salvați rezultatele într-un nou set de date",
  "newdatasetname": "Introduceți un nume pentru setul de date",
  "Existing": "Suprascrieți setul de date existent",
  "label12": "Introduceți numele variabilelor pentru noua variabilă de factor repetat",
  "repeatedMeasure": "NOTĂ: Atunci când specificați mai multe nume de variabile care stochează factori repetati, separați-le prin virgulă, de exemplu, Lună, Zi. Trebuie să faceți clic pe avansat pentru a specifica cum se creează numele variabilelor.",
  "repeatedValue": "Numele variabilei pentru valoarea repetată, de exemplu, Număr",
  "labelChoice": "Selectați una dintre opțiunile de mai jos",
  "subsetvars": "Opțiunea1: Selectați variabilele pentru a le reformata într-o sau mai multe variabile",
  "names_sep": "Opțiunea2: Specificați un caracter sau o expresie regulată pentru a împărți numele coloanelor pentru a crea valori pentru numele variabilelor. Ia aceeași specificație ca separate(), și poate fi un vector numeric (specificând pozițiile de rupt) sau un singur șir (specificând o expresie regulată pentru a împărți)",
  "names_pattern": "Opțiunea1: O expresie regulată care conține grupuri de potrivire (()). Partea care se potrivește a expresiei regulate între () va fi utilizată pentru a crea nume de variabile.",
  "dontReshape": "Opțiunea2: Selectați variabilele pe care nu doriți să le reformati (toate celelalte variabile rămase vor fi reformate în coloană(e))",
  "removeNA": "Eliminați rândurile în care valoarea repetată este NA.",
  "makeString": "Faceți ca factorul repetat să fie un tip de șir R în loc de un factor",
  "label3": "Dacă se creează mai multe variabile noi pentru factorii repetati, opțiunile de mai jos controlează cum se împart numele coloanelor. Selectați una dintre cele 2 opțiuni de mai jos.",
  "help": {
    "title": "Reformare (de la latime la lungime)",
    "r_help": "help(pivot_longer, package=tidyr)",
    "body": "\n<b>Descriere</b></br>\nVedeți videoclipul la <a href=\" https://youtu.be/ypLXqmFp3jY\">Reformare de la latime la lungime</a></br>\nIa un set de date lat și îl convertește într-un set de date lung prin conversia coloanelor în perechi cheie-valoare\nPivot_longer ia mai multe coloane și le colapsează în perechi cheie-valoare, duplicând toate celelalte coloane după cum este necesar. Folosiți pivot_longer() atunci când observați că aveți coloane care nu sunt variabile.</br>\nTastați vignette(\"pivot\") în editorul R pentru a vedea ajutorul R. Dacă există mai multe coloane de creat, trebuie să specificați argumente pentru a specifica cum se construiesc numele coloanelor.</br>\nÎn acest caz, faceți clic pe avansat pentru a introduce o expresie regulată care specifică cum ar trebui să fie create variabilele din numele coloanelor.</br>\nNOTĂ: Atunci când specificați mai multe variabile pentru factorii repetati, separați-le prin ,\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \npivot_longer( cols=c(col1, col2...),names_to=\"key\",values_to=\"value\",values_drop_na = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ncols: Coloane de pivotat în format mai lung.\n</li>\n<li>\nvalues_to: O șir care specifică numele coloanei de creat din datele stocate în valorile celulelor. Dacă names_to este un caracter care conține sentinela specială .value, acest lucru va fi ignorat, iar numele coloanei de valori va fi derivat din parte a numelui coloanelor existente. Dacă este gol, toate variabilele sunt selectate, excludeți o variabilă y cu -y. Când excludeți variabile, toate celelalte variabile rămase sunt pivotate la lungime.\n</li>\n<li>\nvalues_drop_na: Dacă este TRUE, va elimina rândurile care conțin doar NAs în coloana value_to. Acest lucru transformă efectiv valorile lipsă explicite în valori lipsă implicite și ar trebui utilizat în general doar atunci când valorile lipsă din date au fost create de structura sa.\n</li>\n<li>\nnames_sep: ia aceeași specificație ca separate(), și poate fi un vector numeric (specificând pozițiile de rupt) sau un singur șir (specificând o expresie regulată pentru a împărți).</br>\nSă presupunem că coloanele sunt Height_1_1, Height_1_2, Weight_1_1, Weight_1_2, Sagur_1_1, Sagur_2_1 unde primul număr este luna și al doilea săptămâna, specificarea _ ca separator va rezulta în 3 variabile fiind create, prima variabilă cu valori Height, Weight, Sagur, a doua cu valori 1 și 2, iar a treia cu valori 1 și 2.</br>\nTastați help(regex) în editorul de cod R pentru mai multe detalii\n</li>\n<li>\nnames_pattern: ia aceeași specificație ca extract(), o expresie regulată care conține grupuri de potrivire (()).\naia aceeași specificație ca separate(), și poate fi un vector numeric (specificând pozițiile de rupt) sau un singur șir (specificând o expresie regulată pentru a împărți).</br>\nSă presupunem că coloanele sunt Height_33.1_1, Height_44.1_2, Weight_66.1_1, Weight_55.1_2, unde cele 2 cifre după primul underscore trebuie ignorate, cifra după . este luna și cifra după ultimul _ este săptămâna.</br>\nExpresiile regulate care extrag valorile noilor variabile trebuie să fie în (). Expresia regulată va fi (.*)_.*.(.*)_(.)</br> \nNotă: . într-o expresie regulată înseamnă orice caracter</br> \n* înseamnă 0 sau mai multe, așa că .* înseamnă 0 sau mai multe caractere</br> \nAșa că șirul poate fi interpretat ca căutând un model de</br> \n(.*) 0 sau mai multe caractere urmate de</br> \n _ un underscore urmat de</br> \n .*. unul sau mai multe caractere urmate de . (escapând . cu un  indică că este caracterul în sine urmat de</br> \n.* unul sau mai multe caractere urmate de</br> \n_ underscore urmat de</br> \n. un singur caracter</br> \nToate modelele între () formează valorile fiecărei dintre cele 3 noi variabile de factor</br> \n</li>\n</ul>\n<b>Valoare</b><br/>\nReturnează setul de date reformate\n<br/>\n<b>Pachet</b></br>\ntidyr</br>\n<b>Ajutor</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
  }
}