{
  "title": "Potrivirea setului de risc",
  "navigation": "Potrivirea setului de risc",
  "newdatasetnamelabel": "Numele setului de date pentru a stoca datele potrivite",
  "groupvarlabel": "Variabila de eveniment (1=eveniment, 0=cenzură)",
  "timevarlabel": "Variabila de timp",
  "calipervarslabel": "Variabile pentru potrivire (numerice)",
  "caliperslabel": "Specificați caliperele în ordinea variabilelor de potrivire separate prin virgule, de exemplu 5, 2; specificați 0 pentru potriviri exacte",
  "ratiolabel": "Numărul de controale pe caz",
  "repeatcontrolslabel": "Permiteți controalele să fie potrivite mai mult de o dată",
  "supercontrolslabel": "Nu permiteți cazurile să fie potrivite cu alte cazuri",
  "help": {
    "title": "Potrivirea setului de risc",
    "body": "\n            Efectuează potrivirea subiecților prin seturi de risc într-o cohortă. Cei cu evenimentul de rezultat (cazuri) sunt potriviți cu cei care nu au avut evenimentul (controale) și care se află în setul de risc la momentul evenimentului cazului. Acesta este un design de caz/control înnodat. Variabilele de bază cunoscute la intrarea în cohortă sunt, de asemenea, utilizate pentru a potrivi cazurile și controalele.\n\t\t\t<br/><br/>\n\t\t\tVariabilele de bază pentru care valorile trebuie să se potrivească exact și valorile care se potrivesc în cadrul caliperelor numerice sunt acceptate. Controalele sunt selectate aleatoriu dintre toate controalele eligibile pentru fiecare caz.\n\t\t\t<br/><br/>\n\t\t\tSetul de date de ieșire care conține datele potrivite va conține variabilele originale, indicatorul de eveniment (\"eșuat\") și o variabilă care identifică setul potrivit (\"match.num\").\n\t\t\t<br/><br/>\n\t\t\tObservațiile cu valori lipsă pentru variabilele implicate în procesul de potrivire sunt eliminate înainte de potrivire.\n\t\t\t<br/><br/>\n\t\t\tO scurtă introducere în designurile de caz/control înnodat poate fi găsită în:\n\t\t\tEssebag V, et al. Studiul de caz-control înnodat în cardiologie. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>Numele setului de date pentru a stoca datele potrivite:</b>\n\t\t\t<br/>Numele setului de date de ieșire care conține seturile de subiecți potrivite.\n\t\t\t<br/><br/>\n\t\t\t<b>Variabila de eveniment (1=eveniment, 0=cenzură):</b>\n\t\t\t<br/>Numele variabilei care indică cei cu evenimente. Trebuie să fie numeric cu 1=eveniment și 0=cenzură.\n\t\t\t</br><br/>\n\t\t\t<b>Variabile pentru potrivire:</b>\n\t\t\t<br/>Specificați variabilele de bază pentru care doriți ca seturile de caz/control să fie potrivite. Acestea trebuie să fie numerice.\n\t\t\t<br/><br/>\n\t\t\t<b>Specificați caliperele în ordinea variabilelor de potrivire:</b>\n\t\t\t<br/>Specificați valorile caliper numerice pentru fiecare dintre variabile, în ordinea variabilelor. Potrivirile exacte ar trebui să folosească un caliper de 0. \n\t\t\tDe exemplu, dacă vârsta (în ani) a fost specificată cu un caliper de 5, asta înseamnă că controalele trebuie să fie în intervalul +/- 5 ani de cazul lor potrivit.\n\t\t\tFiecare variabilă de potrivire trebuie să aibă o valoare de caliper specificată.\n\t\t\t<br/><br/>\n\t\t\t<b>Numărul de controale pe caz:</b>\n\t\t\t<br/>Aceasta este numărul maxim de controale care vor fi potrivite cu fiecare caz. Unele seturi potrivite pot avea mai puțin decât această valoare dacă nu se pot identifica potriviri adecvate.\n            <br/><br/>\n\t\t\t<b>Permiteți controalele să fie potrivite mai mult de o dată:</b>\n\t\t\t<br/>Specificați dacă doriți ca controalele să fie potrivite potențial cu mai mult de un caz. Recomandăm selectarea acestei opțiuni pentru a evita biasul.\n            <br/><br/>\n\t\t\t<b>Nu permiteți cazurile să fie potrivite cu alte cazuri:</b>\n\t\t\t<br/>Specificați dacă să permiteți cazurile să fie considerate ca controale înainte de momentul evenimentului cazului. Recomandăm să nu selectați această opțiune pentru a evita biasul. Neselectarea acestei opțiuni înseamnă că un caz se află în grupul de risc de control și este eligibil pentru a fi potrivit cu un alt caz, până la momentul evenimentului său.\n            <br/><br/>\n            <b>Pachete R necesare:</b> dplyr, tidyr\n"
  }
}