{
  "title": "Ajutor pentru pachetul R",
  "navigation": "Ajutor pentru pachetul R",
  "packageName": "Selectați un pachet R instalat",
  "help": {
    "title": "Ajutor pentru pachetul R",
    "r_help": "ajutor()",
    "body": "\n<b>Descriere</b></br>\naid este interfața principală pentru sistemele de ajutor.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \najutor(subiect, pachet = NULL, lib.loc = NULL,\n    verbose = getOption(\"verbose\"),\n    try.all.packages = getOption(\"help.try.all.packages\"),\n    help_type = getOption(\"help_type\"))\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nsubiect: de obicei, un nume sau un șir de caractere care specifică subiectul pentru care se caută ajutor. Un șir de caractere (încapsulat în ghilimele simple sau duble explicite) este întotdeauna considerat ca numind un subiect. Dacă valoarea subiectului este un vector de caractere de lungime unu, subiectul este considerat a fi valoarea singurului element. În caz contrar, subiectul trebuie să fie un nume sau un cuvânt rezervat (dacă este sintactic valid) sau un șir de caractere. \n</li>\n<li>\npachet: un nume sau un vector de caractere care oferă pachetele în care se caută documentația, sau NULL. În mod implicit, se folosesc toate pachetele ale căror spații de nume sunt încărcate. Pentru a evita ca un nume să fie descompus, folosiți de exemplu (pkg_ref).\n</li>\n<li>\nlib.loc: un vector de caractere de nume de directoare ale bibliotecilor R, sau NULL. Valoarea implicită NULL corespunde tuturor bibliotecilor cunoscute în prezent. Dacă se folosește valoarea implicită, pachetele și spațiile de nume încărcate sunt căutate înaintea bibliotecilor.\n</li>\n<li>\nverbose: logic; dacă este TRUE, numele fișierului este raportat.\n</li>\n<li>\ntry.all.packages: logic; vezi Notă.\n</li>\n<li>\nhelp_type: șir de caractere: tipul de ajutor solicitat. Valorile posibile sunt \"text\", \"html\" și \"pdf\". Cazul este ignorat, iar potrivirile parțiale sunt permise.\n</li>\n</ul>\n<b>Detalii</b></br>\nAjutorul pentru pachet</br>\n<b>Exemple</b><br/>\n<code> \najutor(pachet = \"splines\")\n</code> <br/>\n<b>Pachet</b></br>\nutils</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui dialog sau rulați următoarea comandă în editorul de sintaxă R: ajutor()\n                "
  }
}