{
  "title": "Ajutor Pachet R",
  "navigation": "Ajutor Pachet R",
  "packageName": "Selectați un pachet R instalat",
  "help": {
    "title": "Ajutor Pachet R",
    "r_help": "ajutor()",
    "body": "\n<b>Descriere</b></br>\najutor este interfața principală pentru sistemele de ajutor.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \najutor(topic, package = NULL, lib.loc = NULL,\n    verbose = getOption(\"verbose\"),\n    try.all.packages = getOption(\"help.try.all.packages\"),\n    help_type = getOption(\"help_type\"))\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ntopic: de obicei, un nume sau un șir de caractere care specifică subiectul pentru care se caută ajutor. Un șir de caractere (încapsulat în ghilimele simple sau duble explicite) este întotdeauna considerat ca numind un subiect. Dacă valoarea topic este un vector de caractere de lungime unu, subiectul este considerat a fi valoarea singurului element. În caz contrar, topicul trebuie să fie un nume sau un cuvânt rezervat (dacă este sintactic valid) sau un șir de caractere. \n</li>\n<li>\npachet: un nume sau un vector de caractere care oferă pachetele în care să se caute documentația, sau NULL. În mod implicit, toate pachetele a căror namespace-uri sunt încărcate sunt utilizate. Pentru a evita ca un nume să fie deparsat, folosiți de exemplu (pkg_ref).\n</li>\n<li>\nlib.loc: un vector de caractere cu numele directoarelor bibliotecilor R, sau NULL. Valoarea implicită NULL corespunde tuturor bibliotecilor cunoscute în prezent. Dacă se folosește implicitul, pachetele și namespace-urile încărcate sunt căutate înaintea bibliotecilor.\n</li>\n<li>\nverbose: logic; dacă este ADEVĂRAT, numele fișierului este raportat.\n</li>\n<li>\ntry.all.packages: logic; vezi Notă.\n</li>\n<li>\nhelp_type: șir de caractere: tipul de ajutor solicitat. Valorile posibile sunt \"text\", \"html\" și \"pdf\". Cazul este ignorat, iar potrivirea parțială este permisă.\n</li>\n</ul>\n<b>Detalii</b></br>\nAjutorul pentru pachet</br>\n<b>Exemple</b><br/>\n<code> \najutor(package = \"splines\")\n</code> <br/>\n<b>Pachet</b></br>\nutils</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă în editorul de sintaxă R ajutor()\n                "
  }
}