{
  "title": "Dimensiunea eșantionului, Testul a două proporții",
  "navigation": "Două proporții",
  "howtouse": "Pentru a calcula dimensiunea eșantionului: specificați ambele proporții ale grupurilor și puterea\nPentru a calcula puterea: specificați ambele proporții ale grupurilor și dimensiunea eșantionului\nPentru a calcula diferența proporțională detectabilă: specificați dimensiunea eșantionului, puterea și proporția grupului 2",
  "n": "Dimensiunea eșantionului",
  "power": "Putere (0-1)",
  "propgrp1": "Proporția Grupului 1",
  "propgrp2": "Proporția Grupului 2",
  "ratio": "Raportul dimensiunii eșantionului Grup 1 vs Grup 2",
  "siglevel": "Nivel de semnificație (0-1)",
  "alternativeopt": "Ipoteza alternativă",
  "twosided": "Bidirecțional",
  "onesided": "Unidirecțional",
  "help": {
    "title": "Dimensiunea eșantionului, Testul a două proporții",
    "r_help": "help(epi.sscohortc, package ='epiR')",
    "body": "\nAceasta este o evaluare a dimensiunii eșantionului pentru un test de proporții cu două eșantioane.  Calculează dimensiunea eșantionului, puterea sau dimensiunea efectului (diferența în proporții, raportul de rată, raportul de șanse) atunci când utilizatorul \nspecifice celelalte două.\n<br/><br/>\n<b>Dimensiunea eșantionului:</b> Specificați numărul de subiecți din studiu\n<br/><br/>\n<b>Putere:</b> Specificați puterea dorită a studiului, adică probabilitatea ca testul să respingă ipoteza nulă dacă ipoteza alternativă a fost adevărată.\n<br/><br/>\n<b>Proporția Grupului 1:</b> Specificați proporția în grupul 1\n<br/><br/>\n<b>Proporția Grupului 2:</b> Specificați proporția în grupul 2\n<br/><br/>\n<b>Raportul dimensiunii eșantionului Grup 1 vs Grup 2:</b> Specificați raportul dorit al dimensiunilor eșantionului (N grup 1 împărțit la N grup 2). Un raport de 1 înseamnă dimensiuni egale ale eșantionului.\n<br/><br/>\n<b>Nivel de semnificație:</b> Specificați nivelul de semnificație dorit (adică eroarea de tip I) a testului\n<br/><br/>\n<b>Ipoteza alternativă:</b> Specificați dacă testul este bidirecțional sau unidirecțional\n<br/><br/>\n<b>Pachete R necesare:</b> epiR\n\t\t\t"
  }
}