{
  "title": "Dimensiunea eșantionului, Testul a două proporții pereche",
  "navigation": "Două proporții pereche",
  "howtouse": "Pentru a calcula dimensiunea eșantionului (numărul de perechi): specificați puterea\nPentru a calcula puterea: specificați dimensiunea eșantionului (numărul de perechi)",
  "n": "Dimensiunea eșantionului (numărul de perechi)",
  "power": "Putere (0-1)",
  "pdisc": "Proporția perechilor discordante (PD) (0-1)",
  "pdiff": "Diferența în proporții, trebuie să fie între -PD și PD",
  "siglevel": "Nivel de semnificație (0-1)",
  "alternativeopt": "Ipoteza alternativă",
  "twosided": "Bidirecțional",
  "onesided": "Unidirecțional",
  "help": {
    "title": "Dimensiunea eșantionului, Testul a două proporții pereche",
    "r_help": "help(qnorm, package ='stats')",
    "body": "\nAceasta este o evaluare a dimensiunii eșantionului pentru un test pereche de proporții folosind Testul McNemar.  Calculează dimensiunea eșantionului (numărul de perechi) sau puterea atunci când utilizatorul \nspecificează cealaltă.  Calculele folosesc o aproximare normală condiționată de proporția perechilor discordante.  Vezi Connor R. J. 1987. Dimensiunea eșantionului pentru testarea \ndiferențelor în proporții pentru designul de eșantion pereche. Biometrics 43(1):207-211.\n<br/><br/>\n<b>Dimensiunea eșantionului (numărul de perechi):</b> Specificați dimensiunea eșantionului în studiu.  Acesta este numărul de subiecți care vor oferi valori de rezultat binar la ambele puncte de timp\nîntr-un design pre vs post sau numărul de perechi într-un design de subiecte potrivite (de exemplu, caz-control potrivit).\n<br/><br/>\n<b>Putere:</b> Specificați puterea dorită a studiului, adică probabilitatea ca testul să respingă ipoteza nulă dacă ipoteza alternativă a fost adevărată.\n<br/><br/>\n<b>Proporția perechilor discordante:</b> Specificați proporția așteptată de perechi care vor fi în dezacord, de exemplu, răspunsuri 'da'/'nu' sau 'nu'/'da', din numărul total de perechi.\n<br/><br/>\n<b>Diferența în proporții:</b> Specificați diferența în proporțiile de rezultat (adică proporția care este 'da') pe care doriți să o detectați.  De exemplu, într-un studiu de caz-control potrivit,\naceasta este diferența dintre proporția cazurilor care sunt 'da' și proporția martorilor care sunt 'da'.\n<br/><br/>\n<b>Nivel de semnificație:</b> Specificați nivelul de semnificație dorit (adică eroarea de tip I) a testului.\n<br/><br/>\n<b>Ipoteza alternativă:</b> Specificați dacă testul este bidirecțional sau unidirecțional.\n<br/><br/>\n<b>Pachete R necesare:</b> stats\n\t\t\t"
  }
}