{
  "title": "Probabilitățile de supraviețuire prezise",
  "label100": "Acest dialog afișează probabilitatea de supraviețuire prezisă la unul sau mai multe \ntimpuri de urmărire specificate. \nUrmătoarele cerințe trebuie să fie îndeplinite.\n1. Trebuie să fi construit un model de regresie Cox pe un set de date în care 1=eveniment, 0=cenzură. \n2. Setul de date pentru care doriți să generați predicții trebuie să aibă toate variabilele independente utilizate pentru a crea \nmodelul original. \n3. Scala de timp utilizată pentru timpul de urmărire trebuie să se potrivească cu scala de timp utilizată pentru a crea modelul original. \n4. Dacă doriți predicții pentru o singură observație, trebuie să creați un nou set de date cu acea observație.",
  "navigation": "Scorarea Cox",
  "filterModels": "Filtrați modelele după clasă",
  "modelSelection": "Selectați un model pentru a evalua un set de date",
  "label1": "Teste diagnostice",
  "followUpTime": "Specificați unul sau mai multe timpuri de urmărire, de exemplu 1200, 1250, probabilitățile de supraviețuire prezise vor fi generate pentru fiecare timp de urmărire",
  "levelOfInterest": "Când variabila de prezis are 2 niveluri, specificați nivelul de interes. Matricea de confuzie și statisticile aferente sunt afișate cu nivelul de interes specificat ca referință",
  "label12": "Rezultatele testelor: De îndată ce un model este selectat, vom rula teste pentru a vedea dacă variabilele dependente specificate în model sunt \navizibile în setul de date care trebuie evaluat. Rezultatele vor fi afișate aici",
  "label2": "Salvați probabilitățile de supraviețuire.",
  "label3": "Probabilitățile prezise sunt stocate ca noi variabile cu prefixul de mai jos adăugat la numele variabilei originale de eveniment",
  "label4": "**Pentru variabilele dependente cu 2 niveluri, al 2-lea nivel este tratat ca nivelul pozitiv. Consultați Date > Niveluri de factor > Reordonați nivelurile manual pentru a schimba ordinea nivelurilor de factor și a reconstrui modelul.",
  "conflevel": "Salvați intervalele de încredere pentru valorile prezise individuale **(Valabil doar pentru modele liniare (clasa lm))",
  "roctable": "Afișați tabelul ROC (**Numai pentru variabile dependente binare)",
  "colname": "Specificați prefixul numelui coloanei",
  "label5": "**Verificarea casetei de mai sus va genera o penalizare de performanță pentru seturi de date mari.",
  "level": "Specificați nivelul de încredere",
  "confusioncheck": "Generați matricea de confuzie",
  "help": {
    "title": "Evaluați un set de date folosind un model",
    "r_help": "help(predict, package='stats')",
    "body": "\n    CÂND SUNT SPECIFICATE PERIOADE DE TIMP MULTIPLE, O MATRICE DE CONFUZIE ȘI O CURBĂ ROC SUNT GENERATE DOAR PENTRU PRIMA PERIOADĂ DE TIMP\n    <b>Descriere</b></br>\n    Scorarea modelului face următoarele</br>\n    1. Evaluează setul de date curent folosind modelul preconstruit selectat. Stochează predicțiile cu intervalul de încredere specificat în setul de date curent folosind prefixul specificat.</br>\n    2. Opțional, creează o matrice de confuzie și o curbă ROC</br>\n    3. În cazul în care evaluați un set de date de antrenament care conține variabila dependentă/variabila de prezis și variabila dependentă are 2 niveluri, aveți opțiunea de a selecta nivelul de referință/nivelul de interes.<br/>\n    4. Matricea de confuzie și statisticile aferente sunt create folosind nivelul de interes specificat.<br/>\n    Consultați detalii despre funcția predict și matricea de confuzie mai jos\n    <br/>\n    <br/>\n    <b>Descriere</b></br>\n    predict este o funcție generică pentru a face predicții folosind modelul selectat. \n    <br/>\n    <b>Utilizare</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argumente</b><br/>\n    <ul>\n    <li>\n    modelname: un obiect model pentru care se dorește predicția.\n    </li>\n    <li>\n    prefix: șir de prefix care va fi folosit pentru a crea noi variabile conținând predicțiile.\n    </li>\n    <li>\n    datasetname: este setul de date curent pentru a evalua și salva predicțiile.\n    </li>\n    </ul>\n    <b>Detalii</b></br>\n    Stochează predicțiile cu intervalul de încredere specificat în setul de date curent folosind prefixul specificat.</br>\n    <b>Pachet</b></br>\n    stats</br>\n    <b>Ajutor</b></br>\n    Pentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă help(predict, package ='stats') în fereastra editorului R\n    </br>\n    </br>\n    <b>Descriere</b></br>\n    Creează o matrice de confuzie prin cross-tabulation a claselor observate și prezise cu statisticile asociate. \n    <br/>\n    <b>Utilizare</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argumente</b><br/>\n    <ul>\n    <li>\n    modelname : un obiect model pentru care se dorește matricea de confuzie.\n    </li>\n    <li>\n    showCofusionMatrix:  logic, dacă este ADEVĂRAT matricea de confuzie este generată (dacă se aplică), dacă este FALS, matricea de confuzie nu este generată.\n    </li>\n    <li>\n    predictions : un obiect care este returnat ca rezultat al apelului predict().\n    </li>\n    <li>\n    datasetname: este numele setului de date curent folosind care dorim să facem predicții.\n    </li>\n    </ul>\n    <b>Detalii</b></br>\n    Afișează matricea de confuzie folosind funcția confusionMatrix din pachetul caret</br>\n    <b>Pachet</b></br>\n    caret</br>\n    <b>Ajutor</b></br>\n    Pentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui overlay de dialog sau rulați următoarea comandă help(confusionMatrix, package ='caret') în fereastra editorului R\n                "
  }
}