{
  "title": "SEM",
  "residualCovHeatmap": "Hartă de căldură a deviației între matricele de covarianță observate și cele implicate de model",
  "observedCorr": "Corelații observate",
  "modelImpliedCorr": "Corelații implicate de model",
  "residualCorr": "Deviația între corelațiile observate și cele ajustate",
  "residualCorrHeatmap": "Hartă de căldură a deviației între matricele de corelații observate și cele implicate de model",
  "intercepts1": "Intercepturile variabilelor observate",
  "intercepts": "Afișați intercepturile",
  "means": "Intercepturile/mediile variabilelor latente",
  "residuals1": "Varianțele reziduale ale variabilelor observate",
  "residual_covariances": "Covarianțele reziduale ale variabilelor observate",
  "lv_variances": "Varianțele (reziduale) ale variabilelor latente",
  "lv_covariances": "Covarianțele (reziduale) ale variabilelor latente",
  "regressions": "Toți coeficientii de regresie din model",
  "loadings": "Încărcăturile variabilelor observate pe variabilele lor latente respective",
  "multiGrpOptions": "Opțiuni pentru grupuri multiple",
  "multiGrpSrc": "Variabile sursă",
  "multiGrpDependent": "Variabile de grupare",
  "modelname": "Introduceți un nume pentru model",
  "mediationSrcCtrl": "Relații sursă",
  "mediationDestCtrl": "Parametrii de mediere",
  "navigation": "SEM",
  "modelTermsDst": "Relație",
  "modelTerms": "Predictor",
  "modelTerms1": "Rezultat",
  "sem": "Variabile latente",
  "sem_model_terms": "Parametrii structurali",
  "semSuppCtrl": "Factori de ordinul întâi",
  "sem2": "Factori de ordinul doi",
  "label1": "Selectați un element din listele de predictor și rezultat și faceți clic pe butonul cu o săgeată pentru a muta elementele selectate în lista de relații",
  "label2": "Selectați un element din listele de predictor și rezultat și faceți clic pe butonul cu o săgeată pentru a muta elementele selectate în lista de relații",
  "label3": "Informații",
  "label4": "Ieșiri suplimentare",
  "label5": "Covarianțe și corelații (vezi ajutor)",
  "label6": "R-pătrat",
  "label7": "Salvați predicțiile",
  "label9": "Constrângeri",
  "coVarTerms": "1a variabilă/factor",
  "coVarTerms1": "2a variabilă/factor",
  "coVarDst": "Covarianțe selectate",
  "optionsCoVarTerms": "Covarianțe",
  "parameterizeFormula": "Afișați etichetele parametrilor",
  "modelOptions": "Opțiuni pentru model",
  "method": "Selectați o metodă și o abordare (dacă este cazul)",
  "approach": "Abordare de maximă verosimilitate",
  "missing": "Valori lipsă",
  "addFitMeasures": "Măsuri de ajustare suplimentare",
  "mardiaSkew": "Asimetria Mardia (doar cazuri complete)",
  "mardiaKurt": "Curtosis Mardia (doar cazuri complete)",
  "observed": "Covarianțe observate",
  "modelImplied": "Covarianțe implicate de model (ajustate)",
  "residual": "Deviația între covarianțele observate și cele ajustate",
  "r2squareNone": "Niciuna",
  "r2squareEndo": "Endogen",
  "factorScores": "Scoruri de factori (variabile salvate cu prefixul FS)",
  "indicators": "Indicatori (variabile salvate cu prefixul I)",
  "dependentVars": "Variabile dependente (variabile salvate cu prefixul DV)",
  "label8": "Indici de modificare",
  "modIndices": "Indici de modificare",
  "highLowIndices": "Ascunde indici scăzuți",
  "threshold": "Prag",
  "residuals": "Afișați reziduurile",
  "includeThresholds": "Afișați pragurile",
  "edgeLabels": "Selectați opțiuni pentru etichetele marginilor",
  "layout": "Opțiuni pentru modul în care ar trebui plasate nodurile",
  "rotate": "Poziția variabilelor exogene atunci când se utilizează layout-ul arbore sau arbore2",
  "abbNodeLabels": "Numărul de caractere pentru a abrevia etichetele nodurilor",
  "abbEdgeLabels": "Numărul de caractere pentru a abrevia etichetele marginilor",
  "label101": "Cărări",
  "label102": "Layout",
  "label103": "Noduri",
  "semPlotOptions": "Opțiuni de grafic",
  "manifestShapes": "Forme manifeste",
  "latentShapes": "Forme latente",
  "outputOptions": "Opțiuni de ieșire",
  "label104": "Soluții standardizate",
  "stdall": "Estimările standardizate se bazează pe varianțele atât ale variabilelor observate, cât și ale celor latente (continue)",
  "stdlv": "Estimările standardizate se bazează pe varianțele variabilelor latente (continue) doar",
  "stdnox": "Estimările standardizate se bazează pe varianțele atât ale variabilelor observate, cât și ale celor latente (continue), dar nu pe varianțele covariatelor exogene",
  "label105": "Erori standard",
  "label106": "Setări bootstrap",
  "automatic": "Automat",
  "standard": "Standard",
  "robust": "Robust",
  "pseudoML": "Pseudo ML",
  "bootstrap": "Bootstrap",
  "percentiles": "Percentile",
  "normal": "Normal",
  "adjustedBiasCorrected": "Corectat pentru bias ajustat",
  "basic": "de bază",
  "bootstratRep": "Repetiții bootstrap",
  "autoComputeCovar": "Calculați covarianțele automat",
  "equalityConstraints1": "Relații",
  "sem3": "Constrângeri de egalitate",
  "help": {
    "title": "SEM",
    "r_help": "ajutor(sem, pachet=lavaan)",
    "body": "\n<b>Descriere</b></br>\nModelarea Ecuațiilor Structurale (SEM) utilizează pachetul lavaan (0.6.16) pentru estimare și lucrează cu formularea tradițională LISREL sem (în loc de formulările Bentler-Weeks, RAMpath sau LISCOMP). Estimarea implicită este de maximă verosimilitate și folosește NLMINB (quasi-Newton) folosind abordarea de verosimilitate normală (în loc de metoda de verosimilitate Wishart). Erorile standard se bazează pe matricele de informație așteptate (în loc de observate), dar se pot examina matricele observate, așteptate și deviațiile folosind hărți de căldură. Se oferă screening de normalitate (adică asimetria și curtosisul Mardia). Utilizatorul poate specifica modele cu și fără variabile latente continue (adică modelare de măsurare) atât la ordine inferioare, cât și superioare, precum și modele structurale (adică modelare a căilor). Sunt posibile constrângeri de egalitate, mediere și analiză multigrup. O varietate de metode de estimare (de exemplu, variante de maximă verosimilitate, cele mai mici pătrate și James-Stein) sunt acceptate. Numeroase statistici de ajustare sunt disponibile la cerere (de exemplu, GFI, aGFI, ECVI etc.), iar un mic subset (adică CFI, TLI, SRMR, RMSEA, AIC, BC) este furnizat implicit. Intervalele de încredere utilizând diverse funcții de bootstrap pot fi, de asemenea, obținute. Diagramele modelelor sunt produse folosind semPlot (1.1.6).  \n</br>\n</br>\nCând faceți clic pe Covarianțe în dialog, veți vedea că caseta de selectare, a calcula covarianțele automat este bifată. Puteți șterge o covarianță calculată automat selectând covarianța și făcând clic pe pictograma de coș de gunoi. Când ștergeți o covarianță, o suprimăm în codul generat. Dacă doriți să anulați suprimarea, trebuie să o adăugați manual din nou sau să ștergeți și să recreați variabila latentă sau factorul de ordin superior care face parte din covarianța pentru care doriți să anulați suprimarea.\n</br>\n</br>\nCând se selectează o variabilă de grupare (faceți clic pe Opțiuni de grupuri multiple în dialog), trebuie să selectați caseta de selectare \"Intercepturile variabilelor observate\" și caseta de selectare \"Intercepturile/mediile variabilelor latente\"\nNumai marcarea primei casete vă oferă mai multă flexibilitate.\n</br>\nDescrierea funcțiilor de ajustare este mai jos</br>\n\"ML\" maximă verosimilitate</br>\n\"GLS\": cele mai mici pătrate generalizate. Numai pentru date complete.</br>\n\"WLS\": cele mai mici pătrate ponderate (uneori numită estimare ADF). Numai pentru date complete.</br>\n\"DWLS\": cele mai mici pătrate ponderate diagonal</br>\n\"ULS\": cele mai mici pătrate neponderate</br>\n\"DLS\": cele mai mici pătrate ponderate distribuitor</br>\n\"PML\": maximă verosimilitate pe perechi</br>\nMulți estimatori au variante robuste, ceea ce înseamnă că oferă erori standard robuste și o statistică de testare scalată. De exemplu, pentru estimarea de maximă verosimilitate, lavaan oferă următoarele variante robuste:</br>\n\"MLM\": estimare de maximă verosimilitate cu erori standard robuste și o statistică de testare scalată Satorra-Bentler. Numai pentru date complete.</br>\n\"MLMVS\": estimare de maximă verosimilitate cu erori standard robuste și o statistică de testare ajustată pe medie și varianță (cunoscută și sub numele de abordarea Satterthwaite). Numai pentru date complete.</br>\n\"MLMV\": estimare de maximă verosimilitate cu erori standard robuste și o statistică de testare ajustată pe medie și varianță (folosind o abordare de deplasare a scalei). Numai pentru date complete.</br>\n\"MLF\": pentru estimarea de maximă verosimilitate cu erori standard bazate pe derivatele de ordinul întâi și o statistică de testare convențională. Pentru date complete și incomplete.</br>\n\"MLR\": estimare de maximă verosimilitate cu erori standard robuste (Huber-White) și o statistică de testare scalată care este (asymptotic) egală cu statisticile de testare Yuan-Bentler. Pentru date complete și incomplete.</br>\n</br>\nTBD\nGestionați documentația etichetei vezi ajutor\nTrebuie să documentăm situația în jurul gradelor de libertate, practic atunci când se selectează o variabilă de grupare, trebuie să selectați\ny caseta de selectare \"Intercepturile variabilelor observate\" și caseta de selectare \"Intercepturile/mediile variabilelor latente\"\nNumai marcarea primei casete vă oferă mai multă flexibilitate.\n<b>Pachet</b></br>\nlavaan;semPlot;semTools</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui dialog sau rulați următoarea comandă în editorul de sintaxă R</br>\najutor(sem, pachet='lavaan')\n\n\n"
  }
}