{
  "title": "Potrivirea subiecților",
  "navigation": "Potrivirea subiecților",
  "newdatasetnamelabel": "Numele setului de date pentru a stoca datele potrivite",
  "groupvarlabel": "Variabila caz/control (control=valoare mai mică, caz=valoare mai mare)",
  "notelabel": "Notă: Trebuie să specificați cel puțin o variabilă pentru variabile exacte sau de caliper",
  "exactvarslabel": "Variabile pentru potrivire exactă",
  "calipervarslabel": "Variabile pentru potrivire prin caliper",
  "caliperslabel": "Specificați caliperele în ordinea variabilelor de caliper separate prin virgule, de exemplu, 5, 2",
  "idvarlabel": "Variabila ID subiect",
  "ratiolabel": "Numărul de controale pe caz",
  "help": {
    "title": "Potrivirea subiecților",
    "r_help": "ajutor(matchit, pachet = 'MatchIt')",
    "body": "\n            Efectuează potrivirea subiecților prin cel mai apropiat vecin, unde un set de cazuri este potrivit cu 1 sau mai multe controale. Acest lucru este potrivit pentru studii caz/control și studii de cohortă potrivite.\n\t\t\t<br/><br/>\n\t\t\tVariabilele pentru care valorile trebuie să se potrivească exact și valorile care se potrivesc în cadrul caliperelor numerice sunt acceptate.\n\t\t\tPotrivirea se face fără înlocuire (fiecare subiect poate fi potrivit o singură dată) și controalele dintre controalele potențiale vor fi selectate conform ordinii datelor pentru fiecare caz.\n\t\t\t<br/><br/>\n\t\t\tSetul de date de ieșire va conține datele originale și două variabile suplimentare: 1) subclasă: o variabilă care identifică setul potrivit și 2) greutăți: o variabilă de greutate a cazului potrivit care poate fi utilizată în analize ulterioare, dacă este dorit.\n\t\t\t<br/><br/>\n\t\t\t<b>Numele setului de date pentru a stoca datele potrivite:</b>\n\t\t\t<br/>Numele setului de date de ieșire care conține seturile de subiecți potrivite.\n\t\t\t<br/><br/>\n\t\t\t<b>Variabila caz/control (control=valoare mai mică, caz=valoare mai mare):</b>\n\t\t\t<br/>Numele variabilei care indică cazurile și controalele. Poate fi numeric, factor sau caracter.  \n\t\t\tDacă este o variabilă numerică, aceasta trebuie codificată ca 0=control, 1=caz. Dacă este o variabilă factor, nivelul de ordine inferior va fi controlul și nivelul de ordine superior va fi cazul.  \n\t\t\tDacă este o variabilă de caracter, valoarea de ordine inferioară (alfabetic) va fi controlul, iar valoarea de ordine superioară (alfabetic) va fi cazul.\n\t\t\tAșadar, pentru a fi mai siguri, recomandăm codificarea ca 0=control, 1=caz.\n\t\t\t</br><br/>\n\t\t\t<b>Variabile pentru potrivire exactă:</b>\n\t\t\t<br/>Specificați variabilele pentru care doriți ca seturile de caz/control să fie potrivite exact.  \n\t\t\tAceasta înseamnă că cazurile și controalele dintr-un set potrivit au exact aceleași valori pentru aceste variabile. Acestea pot fi variabile de caracter, dată, numerică, factor sau ordinală.\n\t\t\t<br/><br/>\n\t\t\t<b>Variabile pentru potrivire prin caliper:</b>\n\t\t\t<br/>Specificați variabilele pentru care doriți ca seturile de caz/control să fie potrivite pe baza valorilor numerice ale caliperelor. Controalele vor fi în cadrul unei lățimi de caliper specificate pentru fiecare dintre aceste variabile.\n\t\t\tAcestea pot fi variabile numerice sau de dată. Fiecare variabilă de caliper trebuie să aibă o valoare de caliper specificată.\n\t\t\t<br/><br/>\n\t\t\t<b>Specificați caliperele în ordinea variabilelor de caliper separate prin virgule:</b>\n\t\t\t<br/>Specificați valorile numerice ale caliperelor pentru fiecare dintre variabilele de caliper, în ordinea variabilelor de caliper.  \n\t\t\tDe exemplu, dacă vârsta (în ani) a fost specificată cu un caliper de 5, aceasta înseamnă că controalele trebuie să fie în +/- 5 ani de cazul lor potrivit.\n\t\t\tFiecare variabilă de caliper trebuie să aibă o valoare de caliper specificată. Dacă nu există variabile de caliper, acest câmp trebuie să fie gol.\n\t\t\t<br/><br/>\n\t\t\t<b>Numărul de controale pe caz:</b>\n\t\t\t<br/>Aceasta este numărul maxim de controale care vor fi potrivite cu fiecare caz. Unele seturi potrivite pot avea mai puțin decât această valoare dacă nu se pot identifica potriviri adecvate.\n            <br/><br/>\n            <b>Pachete R necesare:</b> dplyr, tidyr, MatchIt\n"
  }
}