{
  "title": "Subset Dataset by Logic",
  "navigation": "Subset Dataset by Logic",
  "label0": "Puteți alege să salvați rezultatele într-un nou set de date sau să suprascrieți setul de date existent",
  "label1": "Opțiuni",
  "New": "Salvați rezultatele într-un nou set de date",
  "newdatasetname": "Introduceți un nume pentru setul de date",
  "Existing": "Suprascrieți setul de date existent",
  "Output": "Afișați rezultatele în fereastra de ieșire",
  "distinct": "Selectați cazuri distincte",
  "chkbox2": "Eliminați nivelurile de factor neutilizate",
  "subsetvars": "Selectați variabilele de inclus în setul de date subsetat",
  "label12": "Criteriile de subsetare se aplică fiecărei linii, consultați exemplele de mai jos. \n1: Selectați liniile în care var 1 nu este gol și var2 este gol specificați:\n!is.na(var1) & is.na(var2) \n2: Selectați liniile în care var1 > 30 și var 2 este Masculin specificați:\nvar1>30 & var2=='Masculin' \n3: Criterii complexe și sau specificați:\n(var1 !=10 & var2>20) | var3==40 \n4: Potrivire de tip pattern (xxx) sau o potrivire exactă (abc) specificați:\n(grepl(\"xxx\",var1) ==TRUE) | var1==\"abc\" \n5: Potriviți un substring după poziție specificați: substr(var1,2,4) ==\"abc\"",
  "subsetexpression": "Introduceți criteriile de subsetare.",
  "help": {
    "title": "Subset Dataset",
    "r_help": "help(filter, package=dplyr)",
    "body": "\n            <b>Descriere</b></br>\nReturnează un subset al setului de date. Puteți specifica coloanele/variabilele pe care le doriți în setul de date mai mic. De asemenea, puteți specifica criterii de selecție care vor fi aplicate fiecărei linii a dataframe-ului.\n<br/><br/>\n<b>Salvați rezultatele într-un nou set de date:</b> Specificați un nou set de date pentru a stoca datele subsetate\n<br/><br/>\n<b>Suprascrieți setul de date existent:</b> Acest lucru salvează setul de date subsetat în numele setului de date existent\n<br/><br/>\n<b>Afișați rezultatele în fereastra de ieșire:</b> Acest lucru imprimă setul de date subsetat în fereastra de ieșire doar. Setul de date subsetat nu este salvat într-un set de date.\n<br/><br/>\n<b>Cazuri distincte selectate:</b> Acest lucru elimină duplicatele din setul de date subsetat. Toate variabilele trebuie să fie aceleași pentru a fi considerate duplicate.\n<br/><br/>\n<b>Eliminați nivelurile de factor neutilizate:</b> Acest lucru șterge nivelurile de factor care au fost excluse de subset (adică nu mai apar în date).\n<br/><br/>\n<b>Selectați variabilele de inclus în setul de date subsetat:</b> Acest lucru permite utilizatorului să selecteze coloanele specifice pe care dorește să le includă în setul de date. Dacă sunt specificate, atunci doar variabilele specificate vor apărea în setul de date subsetat. Dacă nu sunt specificate variabile, atunci toate variabilele vor fi păstrate.\n<br/><br/>\n<b>Introduceți criteriile de subsetare:</b> Specificați logica variabilei care va fi utilizată pentru a filtra liniile setului de date.\n<br/><br/>\n<b>Pachet R</b></br>\ndplyr<br/>  \n<b>Ajutor</b></br>\nhelp(filter, package=dplyr)\n"
  }
}