{
  "title": "Rezumați N Modele",
  "navigation": "Rezumați N Modele",
  "label1": "Rezumați N modele.",
  "label2": "Selectați modele din următoarele clase (clasa R este între paranteze mai jos)",
  "label3": "Modele liniare (lm), Model liniar generalizat (glm), Model de efecte mixte liniare (lme), Regresie logistică sau Probit ordonată (polr), Model de risc proporțional (coxph), Model liniar folosind cele mai mici pătrate generalizate (gls), Model de regresie de supraviețuire (survreg), Ajustare de regresie polinomială locală (loess), Model de cele mai mici pătrate neliniare (nls), Modele log-lineare multinomiale (multinom)",
  "label4": "**NOTĂ: Modelele create din Ajustarea Modelului (clasa train) nu sunt acceptate",
  "modelselector1": "Selectați unul sau mai multe modele pentru a compara:",
  "help": {
    "title": "Rezumați N Modele",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>\nComparați 2 modele închise folosind un test F sau Chi-pătrat în funcție de estimare. Testele F sunt utilizate pentru estimarea celor mai mici pătrate, testele chi-pătrat sunt utilizate pentru estimarea verosimilității maxime. Ambele modele ar trebui să fie create pe același set de date, deoarece diferențele în valorile lipsă pot cauza probleme</b></br>\n<b>Descriere</b></br>\nTabele Anova: Calculează tabele de analiză a varianței și efectuează teste de raport de verosimilitate pentru un obiect de model ajustat.  \n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject:  un obiect care conține rezultatele returnate de o funcție de ajustare a modelului (de exemplu, lm sau glm).\n</li>\n</ul>\n<b>Valoare</b><br/>\nAceastă funcție (generică) returnează un obiect de clasă anova. Aceste obiecte reprezintă tabele de analiză a varianței și a deviației. Când se dă un singur argument, produce o tabelă care testează dacă termenii modelului sunt semnificativi. Când se dă o secvență de obiecte, anova testează modelele între ele în ordinea specificată.<br/>\nMetoda de imprimare pentru obiectele anova imprimă tabele într-o formă 'frumoasă'.<br/>\n<b>Avertisment</b><br/>\nComparația între două sau mai multe modele va fi validă doar dacă sunt ajustate pe același set de date. Acest lucru poate fi o problemă dacă există valori lipsă și se folosește acțiunea implicită a R na.action = na.omit.<br/>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui dialog sau rulați următoarea comandă în editorul de sintaxă R help(anova,package='stats')</br></br>\n<b>Descriere</b></br>\nTest de raport de verosimilitate pentru modele închise: lrtest este o funcție generică pentru efectuarea testelor de raport de verosimilitate. Metoda implicită poate fi utilizată pentru compararea modelelor liniare (generalizate) închise (vezi detalii mai jos).\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Metodă implicită S3:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Metodă S3 pentru clasa 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: un obiect. Vezi detalii mai jos.\n</li>\n<li>\n...: specificații suplimentare de obiecte transmise metodelor. Vezi detalii mai jos.\n</li>\n<li>\nname: o funcție pentru extragerea unui nume/descriere adecvat dintr-un obiect de model ajustat. Implicit, numele este interogat apelând formula.\n</li>\n<li>\ndata: un cadru de date care conține variabilele din model.\n</li>\n</ul>\n<b>Detalii</b></br>\nlrtest este destinat să fie o funcție generică pentru comparații de modele prin teste de raport de verosimilitate asintotice. Metoda implicită compară consecutiv obiectul de model ajustat cu modelele transmise în .... În loc să se transmită obiectele de model ajustate în ..., sunt posibile mai multe alte specificații. Mecanismul de actualizare este același ca pentru waldtest: modelele din ... pot fi specificate ca întregi, caractere (ambele pentru termeni care ar trebui eliminați din modelul anterior), formule de actualizare sau obiecte de model ajustate. Cu excepția ultimului caz, se presupune existența unei metode de actualizare. Vedeți waldtest pentru detalii.<br/>\nUlterior, se efectuează un test de raport de verosimilitate asintotic pentru fiecare două modele consecutive: De două ori diferența în log-verosimilitudini (derivată de metodele logLik) este comparată cu o distribuție Chi-pătrat.<br/>\nMetoda \"formula\" ajustează un lm mai întâi și apoi apelează metoda implicită.<br/>\n<b>Valoare</b><br/>\nUn obiect de clasă \"anova\" care conține log-verosimilitudinea, gradele de libertate, diferența în gradele de libertate, statisticile Chi-pătrat de raport de verosimilitate și valoarea p corespunzătoare.\n<b>Exemple</b><br/>\n<code> \n## cu date de Greene (1993):<br/>\n## încărcați datele și calculați întârzierile<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## diverse specificații echivalente ale testului LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
  }
}