{
  "title": "Tabel, Avansat",
  "navigation": "Tabel, Avansat",
  "notelabel": "NOTĂ: Cel puțin o variabilă trebuie specificată în cel puțin una dintre următoarele: Test ANOVA, Test Kruskal-Wallis, Test Mediană, Test Chi-Cerc de Pearson, Test Exact Fisher, Test de Tendință Ordinală, sau Fără Test",
  "anovavarslabel": "Variabile pentru Test ANOVA",
  "kwvarslabel": "Variabile pentru Test Kruskal-Wallis",
  "medvarslabel": "Variabile pentru Test Mediană",
  "chisqvarslabel": "Variabile pentru Test Chi-Cerc de Pearson",
  "fishervarslabel": "Variabile pentru Test Exact Fisher",
  "ordvarslabel": "Variabile pentru Test de Tendință Ordinală",
  "notestvarslabel": "Variabile pentru Fără Test",
  "bygroupvarlabel": "Grupuri de Comparat",
  "stratavarlabel": "Strate (opțional)",
  "tabletitlelabel": "Titlul Tabelului",
  "totalcolchkboxlabel": "Include coloană totală",
  "groupvarchkboxlabel": "Include numele variabilei de grup",
  "digitslabel": "Cifre După Zecimal",
  "contdigitslabel": "Valori Continue",
  "pctdigitslabel": "Procente",
  "pvaluedigitslabel": "Valori p",
  "simplifylabel": "Simplifică Rezumatele Variabilelor cu Multe Rânduri într-un Singur Rând (dacă este posibil)",
  "numericsimplifylabel": "Variabile Numerice",
  "categorysimplifylabel": "Variabile Categoriale",
  "ordinalsimplifylabel": "Variabile Ordinale",
  "datesimplifylabel": "Variabile de Dată",
  "labelsimplifylabel": "Folosește Ultimul Nivel în Eticheta Variabilelor Categoriale",
  "conflevellabel": "Nivel de Încredere",
  "simchkboxlabel": "Simulează valori p pentru Pearson și Fisher",
  "simnumlabel": "Numărul de Simulări",
  "footnotechkboxlabel": "Notă de subsol pentru Numele Testelor",
  "sampsizelabel": "Dimensiunea Eșantionului",
  "meanlabel": "Medie",
  "quantileslabel": "Cuantile",
  "otherlabel": "Altceva",
  "nmissanylabel": "Număr Lipsă, dacă există",
  "nmissalwayslabel": "Număr Lipsă, întotdeauna",
  "meansdlabel": "Medie (SD)",
  "meancilabel": "Medie (CI)",
  "meanselabel": "Medie (SE)",
  "gmeanlabel": "Media Geometrică",
  "gmeansdlabel": "Media Geometrică (SD)",
  "gmeancilabel": "Media Geometrică (CI)",
  "trimmeancilabel": "Medie Tăiată (CI)",
  "trimpctlabel": "Specificați Procentul Mediei Tăiate",
  "medianlabel": "Mediana",
  "medianq1q3label": "Mediana (percentil 25, percentil 75)",
  "q1q3label": "(percentil 25, percentil 75)",
  "iqrlabel": "Interval Intercuartilic",
  "medianrangelabel": "Mediana (Interval)",
  "medianmadlabel": "Mediana (Devierea Absolută Mediană)",
  "rangelabel": "Interval",
  "minlabel": "Minim",
  "maxlabel": "Maxim",
  "pct1label": "1er percentil (CI)",
  "pct5label": "5to percentil (CI)",
  "pct10label": "10mo percentil (CI)",
  "pct25label": "25to percentil (CI)",
  "pct33label": "33 1/3 percentil (CI)",
  "pct50label": "Mediana (CI)",
  "pct66label": "66 2/3 percentil (CI)",
  "pct75label": "75to percentil (CI)",
  "pct90label": "90mo percentil (CI)",
  "pct95label": "95to percentil (CI)",
  "pct99label": "99no percentil (CI)",
  "custquantlabel": "Percentil Personalizat (CI)",
  "custquantvaluelabel": "Specificați percentil",
  "skewnesslabel": "Asimetrie",
  "kurtosislabel": "Curtosis",
  "sumlabel": "Sumă",
  "sdlabel": "SD",
  "varlabel": "Varianță",
  "gsdlabel": "SD Media Geometrică",
  "cvlabel": "Coeficient de Variabilitate",
  "freqlabel": "Frecvență",
  "freqtotallabel": "Frecvență/Total",
  "freqpctlabel": "Frecvență (%)",
  "propcilabel": "Proporție (CI)",
  "ciFootNote": "Notă de subsol pentru Nivelul de Încredere",
  "help": {
    "title": "Tabel, Avansat",
    "r_help": "help(tableby, package ='arsenal')",
    "body": "\nAcest lucru creează un tabel de statistici rezumative în cadrul grupurilor pentru a compara și o variabilă de stratificare pentru a face comparațiile în cadrul acestora. Se va crea o coloană pentru fiecare categorie de variabilă de grup.\n<br/><br/>\nNotă: Datele de orice clasă vor fi convertite în clasa Dată doar în scopuri de rezumare. Setul de date original nu va fi modificat. Acest lucru înseamnă, de asemenea, că datele rezumate vor fi precise doar până la zi.\n<br/><br/>\n<b>Grupuri de Comparat:</b> Variabilă care definește categoriile de comparat\n<br/><br/>\n<b>Variabile pentru Test ANOVA:</b> Specificați variabile numerice sau de dată pentru comparații de grup folosind testul de Analiză a Varianței (ANOVA)\n<br/><br/>\n<b>Variabile pentru Test Kruskal-Wallis:</b> Specificați variabile numerice, de dată sau de factor ordinal pentru comparații de grup folosind testul Kruskal-Wallis\n<br/><br/>\n<b>Variabile pentru Test Mediană:</b> Specificați variabile numerice sau de dată pentru comparații de grup folosind un test de mediane\n<br/><br/>\n<b>Variabile pentru Test Chi-Cerc de Pearson:</b> Specificați variabile de factor nominal sau de factor ordinal pentru comparații de grup folosind testul Chi-Cerc de Pearson\n<br/><br/>\n<b>Variabile pentru Test Exact Fisher:</b> Specificați variabile de factor nominal sau de factor ordinal pentru comparații de grup folosind testul Exact Fisher\n<br/><br/>\n<b>Variabile pentru Test de Tendință Ordinală:</b> Specificați variabile de factor nominal sau de factor ordinal pentru comparații de grup folosind un test de tendință. Pentru două grupuri, aceasta este esențialmente testul de tendință Cochran-Armitage.\n<br/><br/>\n<b>Variabile pentru Fără Test:</b> Specificați variabile pe care doriți să le rezumați doar în cadrul grupurilor. Nu se vor calcula teste statistice pentru aceste variabile.\n<br/><br/>\nNotă: Trebuie să specificați cel puțin o variabilă pentru a rezuma pentru a produce un tabel.\n<br/><br/>\n<b>Strate (opțional):</b> Variabilă care definește categoriile în cadrul cărora se vor face comparațiile\n<br/><br/>\n<b>Titlul Tabelului:</b> specificați titlul tabelului\n<br/><br/>\n<b>Include coloană totală:</b> dacă se include sau nu o coloană totală în tabel\n<br/><br/>\n<b>Include numele variabilei de grup:</b> dacă se include sau nu numele variabilei de grup în tabel\n<br/><br/>\n<b>Cifre După Zecimal:</b> specificați câte cifre să afișați după punctul zecimal pentru valori continue, procente și valori p\n<br/><br/>\n<b>Simplifică Rezumatele Variabilelor cu Multe Rânduri într-un Singur Rând (dacă este posibil):</b> Pentru variabile categoriale cu două categorii (factor/ordinal) sau rezumate unice ale variabilelor numerice sau de dată, puteți colapsa rândurile pentru a avea toate numele variabilelor și statisticile într-un singur rând. Rezumatele pentru ultima categorie pentru fiecare variabilă categorială vor fi afișate. Orice variabilă pentru care colapsarea nu este posibilă va ocupa mai multe rânduri. Activarea/dezactivarea acestei opțiuni se poate face pentru fiecare tip de variabilă în parte.\n<br/><br/>\n<b>Folosește Ultimul Nivel în Eticheta Variabilelor Categoriale:</b> Pentru tabele simplificate, aceasta include ultimul nivel al variabilelor de factor/ordinal în eticheta rândului.\n<br/><br/>\n<b>Nivel de Încredere:</b> Acesta stabilește nivelul de încredere al intervalelor de încredere.\n<br/><br/>\n<b>Opțiuni de Test Statistic</b>\n<br/><br/>\n<b>Teste Statistice:</b> Simulările Pearson și Fisher oferă capacitatea de a obține valori p simulate pentru testele chi-cerc de Pearson și testele Exact Fisher. Această procedură creează simulări Monte Carlo de un număr specificat de ori (Numărul de Simulări). Acest lucru poate fi util în cazurile în care calculele standard, în special pentru testul Exact Fisher, rezultă în erori de memorie a computerului.\n<br/><br/>\n<b>Notă de subsol pentru Numele Testelor:</b> dacă se include sau nu note de subsol pentru valorile p care listează testele statistice efectuate pentru fiecare variabilă\n<br/><br/>\n<b>Opțiuni de Statistici Numerice:</b>\n<br/>statistici care vor fi afișate pentru variabile numerice\n<br/><br/>\n<b>Opțiuni de Statistici Categoriale:</b> \n<br/>statistici care vor fi afișate atât pentru factori nominali cât și ordonați\n<br/><br/>\n<b>Statistici de Dată:</b>\n<br/>statistici care vor fi afișate pentru variabile de dată\n<br/><br/>\n<b>Notă:</b> Dacă doriți să rezumați o variabilă de un tip specific, se recomandă să selectați cel puțin o statistică în acea categorie care nu este \"Număr Lipsă, dacă există\". Dacă \"Număr Lipsă, dacă există\" este singura opțiune selectată și nicio variabilă nu are o valoare lipsă, atunci va rezulta o eroare.\n<br/><br/>\n<b>Pachete R Necesare:</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
  }
}