{
  "title": "Actualizare Fuzionare",
  "navigation": "Actualizare Fuzionare",
  "join": "Alăturare mapare",
  "description": "Actualizarea fuzionării actualizează un set de date cu valori dintr-un alt set de date.",
  "out": "Introduceți numele setului de date fuzionat",
  "in1": "Selectați primul set de date",
  "in2": "Selectați al doilea set de date",
  "label1": "Opțiuni de fuzionare",
  "upsert": "Actualizați variabilele din primul (stâng) set de date cu potrivirile din al doilea (drept) set de date, inserați necorespondențele",
  "update": "Actualizați variabilele din primul (stâng) set de date cu potrivirile din al doilea (drept) set de date, ignorați necorespondențele",
  "insert": "Inserare doar necorespondențe în primul (stâng) set de date",
  "patch": "Actualizați doar variabilele cu NAs în primul (stâng) set de date cu potrivirile din al doilea (drept) set de date",
  "delete": "Ștergeți rândurile din primul (stâng) set de date cu potrivirile din al doilea (drept) set de date",
  "help": {
    "title": "Actualizare Fuzionare",
    "r_help": "help(rows_upsert, package=dplyr)",
    "body": "\n            <b>Descriere</b></br>\n            Actualizarea fuzionării actualizează un set de date cu valori dintr-un al doilea set de date pe baza unei potriviri exacte a numelui variabilelor pentru observațiile cu valori de variabile de mapare a alăturării corespunzătoare. \n\t\t\t<br/>Trebuie să specificați una sau mai multe variabile în setul de date activ și în setul de date țintă selectat pe care doriți să se efectueze alăturarea.\n\t\t\t<br/>Rezultatele vor fi salvate într-un nou set de date.\n\t\t\t<br/><br/>\n\t\t\t<b>Opțiuni de fuzionare</b>\n\t\t\t<br/><br/>\n\t\t\t<b>Actualizați variabilele din primul (stâng) set de date cu potrivirile din al doilea (drept) set de date, inserați necorespondențele:</b> Aceasta este o combinație de actualizare a variabilelor din setul de date stâng pentru potriviri și crearea de rânduri noi pentru rândurile necorespunzătoare.\n\t\t\t<br/><br/>\n\t\t\t<b>Actualizați variabilele din primul (stâng) set de date cu potrivirile din al doilea (drept) set de date, ignorați necorespondențele:</b> Aceasta actualizează doar variabilele existente în seturile de date stângi pentru potriviri. Rândurile necorespunzătoare sunt ignorate.\n\t\t\t<br/><br/>\n\t\t\t<b>Inserare doar necorespondențe în primul (stâng) set de date:</b> Aceasta lasă intacte toate rândurile corespunzătoare din setul de date stâng. Numai rândurile necorespunzătoare din setul de date drept sunt adăugate la setul de date stâng.\n\t\t\t<br/><br/>\n\t\t\t<b>Actualizați doar variabilele cu NAs în primul (stâng) set de date cu potrivirile din al doilea (drept) set de date, ignorați necorespondențele:</b> Aceasta actualizează rândurile care se potrivesc, dar doar atunci când valorile din setul de date stâng sunt NA (adică sunt valori lipsă).\n\t\t\t<br/><br/>\n\t\t\t<b>Ștergeți rândurile din primul (stâng) set de date cu potrivirile din al doilea (drept) set de date:</b> Aceasta șterge doar rândurile din setul de date stâng care se potrivesc cu rândurile din setul de date drept.\n\t\t\t<br/><br/>\n            <b>Pachete R necesare:</b> dplyr\n"
  }
}