{
  "title": "Factorii de Inflatie a Variabilei",
  "navigation": "VIF",
  "modelselector1": "Selectați un model din una dintre următoarele clase (clasa între paranteze) Model liniar (lm) Modele liniare generalizate (glm) Regresie logistică ordonată sau Probit (polr) Modele log-lineare multinomiale (multinom), Modele de regresie Cox (coxph)",
  "help": {
    "title": "Factorii de Inflatie a Variabilei",
    "r_help": "help(vif, package='car')",
    "body": "\n                <b>Descriere</b></br>\nCalculează factorii de inflatie a variabilei și factorii de inflatie a variabilei generalizate pentru modele liniare, liniare generalizate și alte modele.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \nvif(mod, ...)\n## Metodă S3 implicită:\nvif(mod, ...)\n## Metodă S3 pentru clasa 'merMod'\nvif(mod, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmod: pentru metoda implicită, un obiect care răspunde la coef, vcov și model.matrix, cum ar fi un obiect lm sau glm.\n</li>\n<li>\n... neutilizat.\n</li>\n</ul>\n<b>Detalii</b></br>\nDacă toate termenii dintr-un model liniar neponderat au 1 df, atunci se calculează factorii de inflatie a variabilei obișnuiți.</br>\nDacă orice termen dintr-un model liniar neponderat are mai mult de 1 df, atunci se calculează factorii de inflatie a variabilei generalizate (Fox și Monette, 1992). Aceștia sunt interpretabili ca inflatia în dimensiunea elipsei de încredere sau a elipsoidului pentru coeficientii termenului în comparație cu ceea ce s-ar obține pentru date ortogonale.</br>\nFactorii VIF generați sunt invariabili în raport cu codificarea termenilor din model (atâta timp cât subspațiul coloanelor matricei modelului care se referă la fiecare termen este invariant). Pentru a ajusta dimensiunea elipsoidului de încredere, funcția imprimă de asemenea GVIF^[1/(2*df)], unde df sunt gradele de libertate asociate cu termenul.</br>\nPrintr-o generalizare suplimentară, implementarea de aici este de asemenea aplicabilă altor tipuri de modele, în special modele liniare ponderate, modele liniare generalizate și modele cu efecte mixte.</br>\n<b>Valoare</b><br/>\nUn vector de VIF-uri, sau o matrice care conține un rând pentru fiecare termen din model și coloane pentru GVIF, df și GVIF^[1/(2*df)].<br/>\n<b>Exemple</b><br/>\n<code> \n## Un exemplu ridicol...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>Pachet</b></br>\ncar</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, faceți clic pe pictograma R din colțul din dreapta sus al acestui dialog sau rulați următoarea comandă în editorul de sintaxă R: help(vif, package=\"car\")\n                "
  }
}