{
  "title": "Testul Wilcoxon pentru ranguri semnate, o mostră",
  "navigation": "Testul Wilcoxon, o mostră",
  "textbox1": "Interval de încredere",
  "textbox2": "Ipoteza nulă (mu)",
  "help": {
    "title": "Testul Wilcoxon, o mostră",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>Descriere</b></br>\nExecută teste Wilcoxon pentru o și două mostre pe vectori de date; ultima este cunoscută și sub numele de testul ‘Mann-Whitney’.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Metodă S3 implicită:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## Metodă S3 pentru clasa 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: vector numeric de valori de date. Valorile non-finite (de exemplu, infinite sau lipsă) vor fi omise.\n</li>\n<li>\ny: un vector numeric opțional de valori de date: la fel ca x, valorile non-finite vor fi omise.\n</li>\n<li>\nalternative: un șir de caractere care specifică ipoteza alternativă, trebuie să fie unul dintre \"two.sided\" (implicit), \"greater\" sau \"less\". Poți specifica doar litera inițială.\n</li>\n<li>\nmu: un număr care specifică un parametru opțional utilizat pentru a forma ipoteza nulă. Vezi ‘Detalii’.\n</li>\n<li>\npaired: un logic care indică dacă dorești un test asociat.\n</li>\n<li>\nexact: un logic care indică dacă ar trebui să se calculeze o valoare p exactă.\n</li>\n<li>\ncorrect: un logic care indică dacă se aplică o corecție de continuitate în aproximarea normală pentru valoarea p.\n</li>\n<li>\nconf.int: un logic care indică dacă ar trebui să se calculeze un interval de încredere.\n</li>\n<li>\nconf.level: nivelul de încredere al intervalului.\n</li>\n<li>\nformula: o formulă de forma lhs ~ rhs unde lhs este o variabilă numerică care dă valorile de date și rhs un factor cu două niveluri care dă grupurile corespunzătoare.\n</li>\n<li>\ndata: o matrice sau un cadru de date opțional (sau similar: vezi model.frame) care conține variabilele din formula formula. În mod implicit, variabilele sunt preluate din environment(formula).\n</li>\n<li>\nsubset: un vector opțional care specifică un subset de observații de utilizat.\n</li>\n<li>\nna.action: o funcție care indică ce ar trebui să se întâmple atunci când datele conțin NAs. Implicit, se utilizează getOption(\"na.action\").\n</li>\n<li>\n...: alte argumente care vor fi transmise către sau de la metode.\n</li>\n</ul>\n<b>Detalii</b></br>\nInterfața de formulă este aplicabilă doar pentru testele de 2 mostre.</br>\nDacă se dă doar x, sau dacă se dau atât x cât și y și paired este TRUE, se efectuează un test de rang semnat Wilcoxon al nul care afirmă că distribuția lui x (în cazul unei mostre) sau a lui x - y (în cazul a două mostre asociate) este simetrică în jurul lui mu.</br>\nÎn caz contrar, dacă se dau atât x cât și y și paired este FALSE, se efectuează un test de sumă a rangurilor Wilcoxon (echivalent cu testul Mann-Whitney: vezi Nota). În acest caz, ipoteza nulă este că distribuțiile lui x și y diferă printr-o deplasare de locație de mu și alternativa este că diferă printr-o altă deplasare de locație (iar alternativa unidirecțională \"greater\" este că x este deplasat la dreapta lui y).</br>\nImplicit (dacă exact nu este specificat), se calculează o valoare p exactă dacă mostrele conțin mai puțin de 50 de valori finite și nu există legături. În caz contrar, se folosește o aproximare normală.</br>\nOpțional (dacă argumentul conf.int este adevărat), se calculează un interval de încredere non-parametric și un estimator pentru pseudomediana (cazul unei mostre) sau pentru diferența parametrilor de locație x-y. (Pseudomediana unei distribuții F este mediana distribuției lui (u+v)/2, unde u și v sunt independente, fiecare având distribuția F. Dacă F este simetrică, atunci pseudomediana și mediana coincid. Vezi Hollander & Wolfe (1973), pagina 34.) Reține că în cazul a două mostre, estimatorul pentru diferența în parametrii de locație nu estimează diferența în mediane (o concepție greșită comună) ci mai degrabă mediana diferenței dintre o mostră din x și o mostră din y.</br>\nDacă valorile p exacte sunt disponibile, se obține un interval de încredere exact prin algoritmul descris în Bauer (1972), iar estimatorul Hodges-Lehmann este utilizat. În caz contrar, intervalul de încredere și estimarea punctului returnate se bazează pe aproximări normale. Acestea sunt corectate pentru continuitate pentru interval, dar nu pentru estimare (deoarece corecția depinde de alternativă).</br>\nCu mostre mici, poate să nu fie posibil să se obțină acoperiri foarte mari ale intervalului de încredere. Dacă se întâmplă acest lucru, se va da un avertisment și se va înlocui cu un interval cu o acoperire mai mică.</br>\n<b>Valoare</b><br/>\nO listă cu clasa \"htest\" care conține următoarele componente:\nstatistic: valoarea statisticii testului cu un nume care o descrie.</br>\nparameter: parametru(i) pentru distribuția exactă a statisticii testului.</br>\np.value: valoarea p pentru test.</br>\nnull.value: parametrul de locație mu.</br>\nalternative: un șir de caractere care descrie ipoteza alternativă.</br>\nmethod: tipul de test aplicat.</br>\ndata.name: un șir de caractere care dă numele datelor.</br>\nconf.int: un interval de încredere pentru parametrul de locație. (Prezent doar dacă argumentul conf.int = TRUE.)</br>\nestimate: o estimare a parametrului de locație. (Prezentă doar dacă argumentul conf.int = TRUE.)</br>\n<b>Pachet</b></br>\nstats</br>\n<b>Ajutor</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}