{
  "title": "Agregar una variable de número de muestra recalibrada",
  "navigation": "Recalibrar número de muestra",
  "sampleVariableToCalibrate": "Selecciona la variable de muestra a recalibrar",
  "sampleVarName": "Especifica el nombre de la nueva variable de muestra recalibrada a agregar (por ejemplo, sample_recal). Si el nombre de la variable ya está presente en el conjunto de datos, se actualizará",
  "help": {
    "title": "Agregar una variable de número de muestra recalibrada",
    "body": "\n\t\t\t\t<b>Descripción</b></br>\n\t\t\t\tOrganizando subgrupos (es decir, grupo de muestra) para la capacidad del proceso y otro análisis de subgrupos\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tEl análisis como el análisis de capacidad del proceso asume que los datos se ingresan en el orden en que fueron recolectados (orden cronológico). Esto significa que todas las observaciones del mismo subgrupo deben aparecer en filas consecutivas del conjunto de datos. Normalmente se utiliza una columna de ID de subgrupo para definir qué filas pertenecen al mismo subgrupo.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSi esta condición no se cumple (por ejemplo, si las filas del mismo subgrupo están dispersas a lo largo del conjunto de datos y no están colocadas una al lado de la otra), entonces los ID de subgrupo necesitan ser recalibrados.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa recalibración significa:\n\t\t\t\t<br/>\n\t\t\t\tSe asigna un nuevo número de subgrupo cada vez que el ID de subgrupo cambia de una fila a la siguiente.\n\t\t\t\t<br/>\n\t\t\t\tSi el mismo ID de subgrupo reaparece más tarde pero no está adyacente a su aparición anterior, se tratará como un nuevo subgrupo.\n\t\t\t\t<br/>\n\t\t\t\tEn otras palabras, solo se consideran parte del mismo subgrupo los valores idénticos que aparecen uno al lado del otro. Los valores idénticos separados por otros subgrupos se dividirán en subgrupos separados durante la recalibración.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa variable de número de muestra recalibrada en el conjunto de datos es necesaria para realizar muchos análisis, por ejemplo, capacidad del proceso, gráficos de Shewhart como xbar, R, S, etc.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}