{"title": "AIC", "navigation": "AIC", "modelselector1": "Seleccione un modelo de una de las siguientes clases (clase en paréntesis) Modelo lineal (lm) Modelos lineales generalizados (glm) Regresión logística o probit ordenada (polr) Modelos multinomiales de log-lineales (multinom)", "help": {"title": "AIC", "r_help": "help(AIC,package='stats')", "body": "\n                <b>Descripción</b></br>\nFunción genérica que calcula el 'Criterio de Información de Akaike' para uno o varios objetos de modelo ajustados para los cuales se puede obtener un valor de log-verosimilitud, de acuerdo con la fórmula -2*log-verosimilitud + k*npar, donde npar representa el número de parámetros en el modelo ajustado, y k = 2 para el AIC habitual, o k = log(n) (n siendo el número de observaciones) para el llamado BIC o SBC (Criterio bayesiano de Schwarz).\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nAIC(object, ..., k = 2)\nBIC(object, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: un objeto de modelo ajustado para el cual existe un método logLik para extraer la log-verosimilitud correspondiente, o un objeto que hereda de la clase logLik.\n</li>\n<li>\n... opcionalmente más objetos de modelo ajustados.\n</li>\n<li>\nk: numérico, la penalización por parámetro que se utilizará; el valor predeterminado k = 2 es el AIC clásico.\n</li>\n</ul>\n<b>Detalles</b></br>\nAl comparar modelos ajustados por máxima verosimilitud a los mismos datos, cuanto menor sea el AIC o BIC, mejor será el ajuste.\nLa teoría del AIC requiere que la log-verosimilitud haya sido maximizada: aunque el AIC se puede calcular para modelos no ajustados por máxima verosimilitud, sus valores de AIC no deben compararse.\n<br/>\nEjemplos de modelos no 'ajustados a los mismos datos' son aquellos donde la respuesta es transformada (modelos de vida acelerada se ajustan a log-tiempos) y donde se han utilizado tablas de contingencia para resumir datos.\n<br/>\nEstas son funciones genéricas (con genéricos S4 definidos en el paquete stats4): sin embargo, los métodos deben definirse para la función de log-verosimilitud logLik en lugar de estas funciones: la acción de sus métodos predeterminados es llamar a logLik en todos los objetos suministrados y ensamblar los resultados. Tenga en cuenta que en varios casos comunes logLik no devuelve el valor en el MLE: consulte su página de ayuda.\n<br/>\nLa log-verosimilitud y, por lo tanto, el AIC/BIC solo están definidos hasta una constante aditiva. Se han utilizado convencionalmente diferentes constantes para diferentes propósitos y, por lo tanto, extractAIC y AIC pueden dar diferentes valores (y lo hacen para modelos de clase "lm": consulte la ayuda para extractAIC). Se necesita especial cuidado al comparar ajustes de diferentes clases (con, por ejemplo, una comparación de un GLM de Poisson y gamma siendo sin sentido ya que uno tiene una respuesta discreta, el otro continua).\n<br/>\nEl BIC se define como AIC(object, ..., k = log(nobs(object))). Esto necesita que se conozca el número de observaciones: el método predeterminado busca primero un atributo "nobs" en el valor de retorno del método logLik, luego intenta el genérico nobs, y si ninguno tiene éxito, devuelve BIC como NA.\n<br/>\n<b>Valor</b><br/>\nSi solo se proporciona un objeto, un valor numérico con el AIC correspondiente (o BIC, o ..., dependiendo de k).\nSi se proporcionan múltiples objetos, un data.frame con filas correspondientes a los objetos y columnas que representan el número de parámetros en el modelo (df) y el AIC o BIC.<br/>\n<b>Ejemplos</b><br/>\n<code> \nlm1 <- lm(Fertilidad ~ . , data = suizo)</br>\nAIC(lm1)</br>\nstopifnot(all.equal(AIC(lm1),<br/>\n                    AIC(logLik(lm1))))<br/>\nBIC(lm1)</br>\nlm2 <- update(lm1, . ~ . -Examen)</br>\nAIC(lm1, lm2)</br>\nBIC(lm1, lm2)</br>\n</code> <br/>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nPara obtener ayuda detallada, haga clic en el icono de R en la parte superior derecha de este diálogo o ejecute el siguiente comando en el editor de sintaxis de R help(AIC,package='stats')\n                "}},{"title": "ANCOVA, análisis de covarianza", "navigation": "ANCOVA", "response": "Variable Dependiente", "Fixed": "Factor Fijo", "Block": "Covariable", "Summary": "Resumen del Modelo", "Scatter_plot": "Gráfico de dispersión para cada nivel de la variable factor", "Residual": "Gráfico de residuos vs. ajustados", "Histogram": "Gráfico de histograma de residuos", "help": {"title": "ANCOVA", "r_help": "help(Anova, package='car')", "body": "\n<b>Descripción</b></br>\nEl análisis de covarianza (ANCOVA) combina características de ANOVA y regresión. Aumenta el modelo ANOVA con una o más variables cuantitativas adicionales, llamadas covariables, que están relacionadas con la variable de respuesta. Las covariables se incluyen para reducir la varianza en los términos de error y proporcionar una medición más precisa de los efectos del tratamiento.</br> ANCOVA se utiliza para probar los efectos principales e interacción de los factores, mientras controla los efectos de la covariable.</br>\nPrimero generamos una tabla Anova con el término de interacción. El objetivo es examinar si el término de interacción no es significativo, es decir, las pendientes de la variable dependiente contra la covariable para cada nivel del factor fijo no son diferentes. Utilizamos el paquete Anova en el paquete car para generar esta tabla Anova.</br>\nLuego regeneramos la tabla Anova controlando el término de interacción para determinar si los interceptos de la variable dependiente contra la covariable para cada nivel del factor fijo son diferentes.</br> \nProporcionamos la opción de generar un gráfico de dispersión de la variable dependiente contra la variable covariable para cada nivel del factor fijo.</br>\nProporcionamos la opción de trazar los residuos vs. el gráfico ajustado para el modelo donde hemos controlado el término de interacción. Los residuos deben ser imparciales y homocedásticos.</br>\nProporcionamos la opción de generar un histograma para los residuos del modelo donde hemos controlado el término de interacción. (La distribución debe ser aproximadamente normal).</br>\nLe damos la opción de resumir el modelo</br>\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nlm(formula, data)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nformula: un objeto de clase "formula" (o uno que se puede convertir a esa clase): una descripción simbólica del modelo a ajustar. Los detalles de la especificación del modelo se dan en 'Detalles'.\n</li>\n<li>\ndata: un marco de datos opcional, lista o entorno (o un objeto coercible por as.data.frame a un marco de datos) que contiene las variables en el modelo. Si no se encuentra en los datos, las variables se toman del entorno (formula), típicamente el entorno desde el cual se llama a lm.\n</li>\n</ul>\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nAnova(mod, , type=c("II"))\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmod :lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm, o cualquier objeto de modelo adecuado.​\n</li>\n<li>\ntype: tipo de prueba, "II", "III", 2, o 3.\n</li>\n</ul>\n<b>Paquete</b></br>\nAnova</br>\n<b>Ayuda</b></br>\nhelp(Anova, package ='car')\n    "}},{"title": "ANOVA, N vías", "modelname": "Ingrese un nombre para el modelo", "label3": "Tamaño del efecto", "confInterval": "Intervalo de confianza para tamaños de efecto", "effectsizes": "Seleccionar medida de tamaño de efecto", "navigation": "ANOVA, N vías", "target": "Variable objetivo (numérica/escala)", "dest": "Especifique un máximo de 2 variables factor", "options": "Opciones", "type": "Seleccionar tipo I/II/III Sumas de cuadrados", "levene": "Prueba de Levene para homogeneidad de varianzas", "label1": "Post-hoc", "combon": "Comparar medias usando:", "adjust": "Método para ajustar valores p", "compactly": "Comparar medias de manera compacta", "alpha": "Ingrese un valor de alpha:", "label2": "Gráficos", "label4": "Gráficos", "diag": "Gráficos de diagnóstico", "plot1": "Trazar todas las comparaciones", "horizontalAxis": "Líneas separadas", "separateLines": "Eje horizontal", "separatePlots": "Gráficos separados", "labelSaveResiduals": "Guardar estadísticas del modelo en el conjunto de datos", "residuals": "Los residuos se guardan con un nombre de variable residuos con un prefijo opcional", "stuResiduals": "Los residuos estandarizados se guardan con un nombre de variable resStudentized con un prefijo opcional", "fittedVals": "Los valores ajustados se guardan con un nombre de variable ajustado con un prefijo opcional", "prefixForSavedStatistics": "Opcionalmente ingrese un prefijo para los valores guardados anteriores, el prefijo se agrega a los nombres de las variables anteriores", "help": {"title": "ANOVA, N vías", "r_help": "help(aov, package='stats')", "body": "\nNOTA:</br>\n1. Para obtener todas las medias marginales y post-hocs, necesita construir una fórmula con los efectos principales y todos los términos de interacción en el modelo.</br> \nEntonces, si está intentando analizar una interacción de 3 vías, debe especificar</br>\nA + B + C + A:B + B:C + A:C + A:B:C</br>\nSi en cambio especifica A*B*C, obtendrá la tabla ANOVA completa, NO obtendrá las medias marginales estimadas y post-hocs para todas las interacciones.</br>\n2. Las medias marginales estimadas Y POST-HOC se calculan para todos los efectos principales y las INTERACCIONES ESPECIFICADAS</br>\n<b>Descripción</b></br>\nAjusta un modelo de análisis de varianza, muestra las sumas de cuadrados tipo I, II, III, muestra las medias marginales y contrastes (usando medias marginales).</br> \nOpcionalmente realiza la prueba de Levene para homogeneidad de varianza entre grupos y traza gráficos.</br>\nLa prueba de Levene se ejecuta para todos los efectos principales</br></br>\nConstruye y resume un modelo anova utilizando la fórmula especificada usando la función aov</br>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nhelp(aov, package='stats')</br></br>\nMuestra la tabla Anova con sumas de cuadrados Tipo I/II/III</br>\nUtiliza la función Anova en el paquete car para las sumas de cuadrados Tipo II, III, la función anova en el paquete stats para Tipo I. Al calcular las sumas de cuadrados tipo III, se establecen contrastes apropiados (contr.sum) para las variables factoriales.</br>\n<b>Paquete</b></br>\ncar</br>\n<b>Ayuda</b></br>\nhelp(Anova, package='car')</br></br>\nMuestra medias marginales estimadas</br>\n<b>Paquete</b></br>\nemmeans</br>\n<b>Ayuda</b></br>\nhelp(emmeans, package='car')</br></br>\nCalcula la prueba de Levene para homogeneidad de varianza entre grupos. \n<b>Paquete</b></br>\ncar</br>\n<b>Ayuda</b></br>\nhelp(leveneTest, package='car')\n"}}]}},{