{
  "title": "Gráfico de Barras",
  "navigation": "Gráfico de Barras",
  "optionsLabels": "Opciones para etiquetas",
  "suppressLabels": "Suprimir todas las etiquetas para conteos y porcentajes",
  "suppressThreshold": "Suprimir etiquetas para conteos y porcentajes por debajo del porcentaje umbral especificado",
  "label1": "Haga clic en la pestaña a continuación para seleccionar conteo o media. Cuando se selecciona conteo, una variable Y es opcional. Cuando se selecciona conteo y no se especifica una variable Y, se muestran los conteos de la variable X. Cuando se especifica conteo y se especifica una variable Y, se suman los valores de la variable Y. Cuando se selecciona media, debe seleccionar una variable Y y una variable X. Se calculan las medias para la(s) variable(s) Y",
  "x": "Variable X, especifique una variable categórica",
  "y": "Variable(s) Y, especifique una(s) variable(s) numérica(s)",
  "fill": "Especifique una variable categórica para llenar las barras",
  "dropna": "Eliminar valores faltantes",
  "bottomlbl": "Seleccionar Gráfico de Barras",
  "meanlbl": "Media",
  "countlbl": " Conteo",
  "fill1": "Seleccione un color para las barras. Nota: Esto se ignora cuando se especifica una variable para llenar las barras",
  "legends": "Mostrar Leyendas y, de ser así, posición de las Leyendas (el valor predeterminado es a la derecha)",
  "digitsCountDisplay": "Dígitos - número de dígitos a mostrar para conteos y porcentajes",
  "barType": "Tipo de gráfico de barras",
  "stackedBar": "Gráfico de barras apiladas",
  "sideBySide": "Mostrar grupos uno al lado del otro",
  "fillPercent": "Llenar barras",
  "errorBarOptions": "Barras de error",
  "noErrBars": "Sin barras de error",
  "stderr": "Errores estándar",
  "stddev": "Desviaciones estándar",
  "cilevel": "Especifique el nivel de confianza:",
  "confidenceInterval": "Nivel de confianza:",
  "drawSignificance": "Agregar significancia (valores p) comparación de medias entre cada par de barras (seleccione faceta para análisis agrupado). Para tukey_hsd y games_howell_test, los valores p ya están ajustados. El método adicional de ajuste de valores p se ignora.",
  "methodForMeanDiffSignificance": "Método de prueba utilizado para comparar medias",
  "adjPvalue": "Ajustar valores p para comparar medias producidas por el método de prueba",
  "pValueFromatting": "Formato de valores p (significancia) mostrados",
  "alpha": "Opacidad (0-1)",
  "flipBox": "Voltear Eje",
  "specify_a_title": "Ingrese un título",
  "x_title": "Etiqueta del Eje X",
  "y_title": "Etiqueta del Eje Y",
  "showErrorBar": "Mostrar ambos extremos de la barra de error (predeterminado), solo arriba o solo abajo",
  "Facetrow": "Fila de Facetas",
  "Facetcolumn": "Columna de Facetas",
  "Facetwrap": "Envoltura de Facetas",
  "Facetscale": "Escala de Facetas",
  "relFreq": "Frecuencias relativas",
  "facets_lbl": "Facetas",
  "xyLimits": "Límites de los ejes X e Y",
  "label5": "Especifique un rango para los valores de los ejes X e Y",
  "rangeYValues": "Especifique el rango del eje Y, por ejemplo, 0,100",
  "help": {
    "title": "Ayuda del Gráfico de Barras",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Un gráfico de barras o gráfico de barras es un gráfico que presenta datos agrupados con barras rectangulares con longitudes proporcionales a los valores que representan. Las barras pueden ser trazadas vertical u horizontalmente. Las barras pueden ser agrupadas por una variable de factor opcional. Los grupos pueden ser apilados en una sola barra o mostrados uno al lado del otro. Las facetas pueden ser creadas opcionalmente especificando una variable de factor. También puede especificar temas opcionalmente, y especificar un título y etiquetas para los ejes x e y.\n        Puede crear un gráfico de barras para una sola variable de factor, las barras representarán los conteos de cada nivel de la variable de factor. Aquí la variable de factor estará en el eje x, vea el ejemplo a continuación. Cuando se selecciona la casilla de frecuencias relativas, mostramos la frecuencia relativa en lugar de los conteos en el eje y.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=0.4) +\n         labs(x =\"year\",y =\"Count\",title= \"Gráfico de barras para el eje X: year, eje Y: Count\")\n        </code>\n        <br />\n        Puede crear un gráfico de barras colocando una variable de escala/número en el eje y, y llenando las barras por una variable de factor. La barra se llenará sumando los valores de la variable y para cada nivel de la variable de factor, vea el ejemplo a continuación\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=0.4,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"Gráfico de barras para el eje X:, eje Y: weight, Llenar: origin\")\n        </code>\n        <br />\n        Puede especificar una variable x, variable y y llenar. La barra se llena por la suma de los valores de la variable y para cada nivel de la variable x, agrupada por el nivel de la variable especificada en el llenado.\n        Cuando especifica múltiples variables x, creamos un gráfico de barras separado para cada variable x. \n        <br />\n        Uso:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: El conjunto de datos predeterminado​\n        </li>\n        <li>\n        aes():    Generar mapeos estéticos que describen cómo las variables en los datos se mapean a propiedades visuales (estéticas) de los geoms.​\n        </li>\n        <li>\n        x: Una variable de factor/categórica. La longitud de la barra corresponde a los conteos de cada nivel de la variable de factor.​\n        </li>\n        <li>\n        fill: Una variable de factor/categórica opcional para agrupar los conteos de los niveles en x: (ver arriba)​\n        </li>\n        <li>\n        geom_bar(): Crea el gráfico de barras, position =”stack” apila los grupos en una sola barra, position =”dodge” apila los grupos uno al lado del otro, position =\"fill\" llena la barra con un porcentaje de cada nivel de agrupación.​\n        </li>\n        <li>\n        Labs(): Cambiar etiquetas de ejes y títulos de leyenda (esto es opcional)​\n        </li>\n        <li>\n        facet_grid(): Disponer paneles en una cuadrícula (esto es opcional)​\n        </li>\n        <li>\n        theme_calc(): Especifica el tema de la calculadora (esto es opcional)​\n        </li>\n        <li>\n        coord_flip(): Voltear eje (esto es opcional)​\n        </li>\n        <li>\n        alpha: Controla la opacidad, toma valores entre 0-1. 1 significa sin opacidad.\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tSi 'Agregar significancia (valores p) comparación de medias entre cada par de barras' está seleccionado bajo Media, los códigos para los valores p en el gráfico son los siguientes\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tMétodos de ajuste de valores p:\n\t\t<br/>\n\t\tLos métodos de ajuste de valores p incluyen la corrección de Bonferroni (\"bonferroni\") en la que los valores p se multiplican por \n\t\tnúmero de comparaciones. También se incluyen correcciones menos conservadoras de Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" o su alias \"fdr\"), y Benjamini & Yekutieli (2001) (\"BY\"), \n\t\trespectivamente. También se incluye una opción de paso (\"none\"). El conjunto de métodos se contiene en el vector p.adjust.methods \n\t\tpara el beneficio de los métodos que necesitan tener el método como una opción y pasarlo a p.adjust.\n\t\t<br/>\n\t\t<br/>\n\t\tLos primeros cuatro métodos están diseñados para dar un fuerte control de la tasa de error familiar. No parece haber razón para usar la \n\t\tcorrección de Bonferroni no modificada porque está dominada por el método de Holm, que también es válido bajo suposiciones arbitrarias.\n\t\t<br/>\n\t\t<br/>\n\t\tLos métodos de Hochberg y Hommel son válidos cuando las pruebas de hipótesis son independientes o cuando están asociadas no negativamente \n\t\t(Sarkar, 1998; Sarkar y Chang, 1997). El método de Hommel es más poderoso que el de Hochberg, pero la diferencia suele ser pequeña \n\t\ty los valores p de Hochberg son más rápidos de calcular.\n\t\t<br/>\n\t\t<br/>\n\t\tLos métodos \"BH\" (también conocido como \"fdr\") y \"BY\" de Benjamini, Hochberg y Yekutieli controlan la tasa de descubrimiento falso, la proporción esperada \n\t\tde descubrimientos falsos entre las hipótesis rechazadas. La tasa de descubrimiento falso es una condición menos estricta que \n\t\tla tasa de error familiar, por lo que estos métodos son más poderosos que los otros.\n\t\t<br/>\n\t\t<br/>\n\t\tVer también \n\t\t<br />\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br />\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br />\n\t\t<br />\n        Paquete: ggplot2,ggthemes​\n        <br />\n        Otro: Haga clic en el botón de Ayuda de R para obtener ayuda detallada de R. También puede ingresar help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n      "
  }
}