{
  "title": "Prueba de valores atípicos de Bonferroni",
  "navigation": "Prueba de valores atípicos",
  "label1": "Seleccione un modelo de una de las siguientes clases (clase entre paréntesis) - Modelo lineal (lm), Modelo lineal generalizado (glm)",
  "modelselector1": "Seleccione un modelo",
  "help": {
    "title": "Prueba de valores atípicos de Bonferroni",
    "r_help": "help(outlierTest, package='car')",
    "body": "\n                <b>Descripción</b></br>\nInforma los valores p de Bonferroni para probar cada observación por separado como un valor atípico de desplazamiento de media, basado en residuos studentizados en modelos lineales (pruebas t), modelos lineales generalizados (pruebas normales) y modelos mixtos lineales.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## Método S3 para la clase 'lm'<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## Método S3 para la clase 'lmerMod'<br/>\noutlierTest(model, ...)<br/>\n## Método S3 para la clase 'outlierTest'<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmodel: un objeto de modelo lm, glm o lmerMod; el método \"lmerMod\" llama al método \"lm\" y puede aceptar los mismos argumentos.\n</li>\n<li>\ncutoff: las observaciones con valores p de Bonferroni que superan el cutoff no se informan, a menos que no se nominen observaciones, en cuyo caso se informa la que tiene el mayor residuo studentizado.\n</li>\n<li>\nn.max: número máximo de observaciones a informar (por defecto, 10).\n</li>\n<li>\norder: ¿reportar residuos studentizados en orden descendente de magnitud? (por defecto, TRUE).\n</li>\n<li>\nlabels: un vector opcional de nombres de observación.\n</li>\n<li>\n...: argumentos pasados a funciones de métodos.\n</li>\n<li>\nx: objeto outlierTest.\n</li>\n<li>\ndigits: número de dígitos para los valores p informados.\n</li>\n</ul>\n<b>Detalles</b></br>\nPara un modelo lineal, los valores p informados utilizan la distribución t con un grado de libertad uno menos que el df residual para el modelo. Para un modelo lineal generalizado, los valores p se basan en la distribución normal estándar. El ajuste de Bonferroni multiplica el valor p habitual de dos lados por el número de observaciones. El método lm funciona para objetos glm. Para mostrar todas las observaciones, establezca cutoff=Inf y n.max=Inf.<br/>\n<b>Valor</b><br/>\nun objeto de clase outlierTest, que normalmente se imprime.<br/>\n<b>Ejemplos</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>Paquete</b></br>\ncar</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de esta superposición de diálogo o ejecute el siguiente comando en el editor de sintaxis R help(outlierTest, package=\"car\")\n                "
  }
}