{
  "title": "Diagrama de Cajas",
  "navigation": "Diagrama de Cajas",
  "x": "Variable X, especificar una variable de categoría",
  "y": "Variable(s) Y, especificar una(s) variable(s) numérica(s)",
  "Fill": "Especificar una variable de agrupamiento (categoría)",
  "flipaxis": "Invertir eje",
  "dataPoints": "Seleccionar una opción para trazar puntos de datos",
  "alpha": "Opacidad (0-1)",
  "notch": "Muesca",
  "outliers": "Mostrar valores atípicos (en rojo)",
  "barcolor": "Seleccionar un color para las líneas alrededor de las cajas (Después de seleccionar el color, haga clic fuera del control para aplicar)",
  "showCountsChk": "Mostrar valores en la caja (1Q, mediana, 3Q)",
  "drawSignificanceChk": "Agregar significancia (valores p) comparación de medias entre cada par de cajas (seleccionar faceta para agrupar análisis). Para tukey_hsd y games_howell_test, los valores p ya están ajustados. El método adicional de ajuste de valores p es ignorado.",
  "methodForMeanDiffSignificance": "Método de prueba utilizado para comparar medias",
  "adjPvalue": "Ajustar valores p de la comparación de medias",
  "pValueFromatting": "Formato de valores p (significancia) mostrados",
  "specify_a_title": "Ingrese un título",
  "x_title": "Etiqueta del eje X",
  "y_title": "Etiqueta del eje Y",
  "legends": "Mostrar leyendas y, si es así, posición de las leyendas (por defecto a la derecha)",
  "angleXaxis_text": "Ángulo para inclinar los valores de texto del eje x (por defecto 0 para no inclinar)",
  "angleYaxis_text": "Ángulo para inclinar los valores de texto del eje y (por defecto 0 para no inclinar)",
  "axisTickmarksCount": "Cuántos valores del eje (es decir, marcas de tick) mostrar (por defecto 10)",
  "positionJitterWidth": "Dispersión de puntos de jitter (elija un valor entre 0 y 1. Por defecto es 0.2)",
  "Facetrow": "Fila de facetas",
  "Facetcolumn": "Columna de facetas",
  "Facetwrap": "Envolver facetas (si se elige, cualquier selección de fila y columna de faceta será ignorada)",
  "Facetscale": "Escala de facetas",
  "label1": "Líneas horizontales",
  "connectMedianPointsChk": "Conectar los puntos medianos a través de las cajas",
  "connectMeanPointsChk": "Conectar los puntos medios a través de las cajas",
  "plotMedianLineChk": "Trazar una línea horizontal para la mediana general de la variable Y (numérica)",
  "plotMeanLineChk": "Trazar una línea horizontal para la media general de la variable Y (numérica)",
  "yIntercept": "Ingrese valores de intersección Y separados por comas para las líneas horizontales, por ejemplo, 100, 200, 300",
  "hLineColor": "Seleccionar un color para la(s) línea(s) y etiqueta(s) (Después de seleccionar el color, haga clic fuera del control para aplicar)",
  "lineType": "Seleccionar el tipo de línea",
  "horizontalLinelabel": "Especificar etiquetas separadas por comas (sin comillas) para la(s) línea(s) horizontal(es)",
  "horizontalLinelabel_angle_text": "Ángulo para inclinar el texto de la etiqueta de la línea horizontal (por defecto 0 para no inclinar)",
  "label2": "Nota: valores mayores mueven el texto más abajo, valores menores mueven el texto más arriba",
  "addHoriRefLines": "Agregar líneas de referencia",
  "xyLimits": "Límites de los ejes X e Y",
  "label5": "Especificar un rango para los valores de los ejes X e Y",
  "rangeYValues": "Especificar el rango del eje Y, por ejemplo, 0,100",
  "labelHori_HorizontalJustification": "Nota: valores mayores colocan el texto a la izquierda, valores menores mueven el texto a la derecha",
  "verticalJustification": "Controlar la justificación vertical de la etiqueta",
  "hori_HorizontalJustification": "Controlar la justificación horizontal de la etiqueta",
  "addlLabelHlineTextPositionOffset": "Ajustes adicionales para posicionar el texto de la etiqueta para líneas horizontales",
  "horiMovementHReflineLabel": "Mover texto horizontalmente a la izquierda o a la derecha - usar cualquier número con signo + o - (dejar 0 para eje categórico)",
  "nobreaklineHRefLabelandValueChk": "Marque esta casilla para eliminar el salto de línea entre el valor de la etiqueta y el texto de la etiqueta",
  "vertiMovementHReflineLabel": "Mover texto verticalmente hacia arriba o hacia abajo - usar cualquier número con signo + o - (dejar 0 para eje categórico)",
  "facets_lbl": "Facetas",
  "help": {
    "title": "Diagrama de Cajas",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descripción</b></br>\n        En estadística descriptiva, un diagrama de cajas o boxplot es una forma conveniente de representar gráficamente grupos de datos numéricos a través de sus cuartiles. Los diagramas de cajas también pueden tener líneas que se extienden verticalmente desde las cajas (bigotes) que indican la variabilidad fuera de los cuartiles superior e inferior, de ahí los términos diagrama de cajas y bigotes y diagrama de cajas y bigotes. Los valores atípicos pueden ser trazados como puntos individuales. Los diagramas de cajas y bigotes son uniformes en su uso de la caja: la parte inferior y superior de la caja son siempre el primer y tercer cuartil, y la banda dentro de la caja es siempre el segundo cuartil (la mediana). El bigote superior se extiende desde la bisagra hasta el valor más alto que está dentro de 1.5 * IQR de la bisagra, donde IQR es el rango intercuartílico, o distancia entre el primer y tercer cuartil. El bigote inferior se extiende desde la bisagra hasta el valor más bajo dentro de 1.5 * IQR de la bisagra. Los datos más allá del final de los bigotes son valores atípicos y se trazan como puntos (como lo especifica Tukey).​</br>\n        Las facetas se pueden crear opcionalmente especificando una variable de factor. También puede especificar temas opcionalmente, y especificar un título y etiquetas para los ejes x e y​</br>\n        Cuando selecciona la opción para trazar los puntos de datos, lo hacemos utilizando geom_dotplot</br>\n        Por defecto, los valores atípicos se muestran con puntos negros, cuando selecciona la opción para mostrar valores atípicos (en rojo) a través de la casilla de verificación, los valores atípicos se hacen más prominentes.\n        <br/>\n        <b>Uso</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumentos</b><br/>\n        <ul>\n        <li>\n        data: El conjunto de datos por defecto​\n        </li>\n        <li>\n        x: Una variable categórica/factor que define la agrupación de la variable y​\n        </li>\n        <li>\n        y: Una variable numérica para la cual se calcula el boxplot​\n        </li>\n        <li>\n        fill: Una variable categórica/factor opcional para agrupar aún más los grupos existentes. Cada subgrupo se mostrará en un color distinto.​\n        </li>\n        <li>\n        aes():    Generar mapeos estéticos que describen cómo las variables en los datos se asignan a propiedades visuales (estéticas) de los geoms.​\n        </li>\n        <li>\n        geom_boxplot():Crea el boxplot. Las \"bisagras\" superior e inferior corresponden a los primeros y terceros cuartiles (los percentiles 25 y 75).​\n        </li>\n        <li>\n        geom_dotplot: Traza los puntos de datos\n        </li>\n        <li>\n        Labs(): Cambia las etiquetas de los ejes y los títulos de las leyendas (esto es opcional)​\n        </li>\n        <li>\n        facet_grid(): Disponer paneles en una cuadrícula (esto es opcional)​\n        </li>\n        <li>\n        theme_calc(): Especifica el tema de la calculadora (esto es opcional)​\n        </li>\n        <li>\n        coord_flip(): Invertir eje (esto es opcional)​\n        </li>\n        <li>\n        notch: Los diagramas de cajas con muesca aplican una \"muesca\" o estrechamiento de la caja alrededor de la mediana. Las muescas son útiles para ofrecer una guía aproximada sobre la significancia de la diferencia de medianas; si las muescas de dos cajas no se superponen, esto ofrece evidencia de una diferencia estadísticamente significativa entre las medianas. En un diagrama de cajas con muesca, las muescas se extienden 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tSi se selecciona 'Agregar significancia (valores p) comparación de medias entre cada par de cajas', los códigos para los valores p en el gráfico son los siguientes\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tMétodos de ajuste de valores P:\n\t\t<br/>\n\t\tLos métodos de ajuste de valores P incluyen la corrección de Bonferroni (\"bonferroni\") en la que los valores p se multiplican por \n\t\tnúmero de comparaciones. También se incluyen correcciones menos conservadoras de Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" o su alias \"fdr\"), y Benjamini & Yekutieli (2001) (\"BY\"), \n\t\trespectivamente. También se incluye una opción de paso (\"none\"). El conjunto de métodos se contiene en el vector p.adjust.methods \n\t\tpara el beneficio de los métodos que necesitan tener el método como una opción y pasarlo a p.adjust.\n\t\t<br/>\n\t\t<br />\n\t\tLos primeros cuatro métodos están diseñados para dar un control fuerte de la tasa de error familiar. No parece haber razón para usar la \n\t\tcorrección de Bonferroni no modificada porque está dominada por el método de Holm, que también es válido bajo suposiciones arbitrarias.\n\t\t<br/>\n\t\t<br />\n\t\tLos métodos de Hochberg y Hommel son válidos cuando las pruebas de hipótesis son independientes o cuando están asociadas no negativamente \n\t\t(Sarkar, 1998; Sarkar y Chang, 1997). El método de Hommel es más poderoso que el de Hochberg, pero la diferencia suele ser pequeña \n\t\ty los valores p de Hochberg son más rápidos de calcular.\n\t\t<br/>\n\t\t<br />\n\t\tLos métodos \"BH\" (también conocido como \"fdr\") y \"BY\" de Benjamini, Hochberg y Yekutieli controlan la tasa de descubrimiento falso, la proporción esperada \n\t\tof falsos descubrimientos entre las hipótesis rechazadas. La tasa de descubrimiento falso es una condición menos estricta que \n\t\tla tasa de error familiar, por lo que estos métodos son más poderosos que los otros.\n\t\t<br/>\n\t\t<br />\n\t\tVer también \n\t\t<br />\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br />\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br/>\n\t\t<br />\n        <b>Paquete</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Ayuda</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Haga clic en el botón de ayuda de R para obtener ayuda detallada de R. También puede ingresar help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}