{
    "title": "Gráfico de Caja",
    "navigation": "Gráfico de Caja",
    "x": "Variable X, especifique una variable categórica",
    "y": "Variable(s) Y, especifique una(s) variable(s) numérica(s)",
    "Fill": "Especifique una variable de agrupación (categórica)",
    "flipaxis": "Invertir eje",
    "dataPoints": "Seleccione una opción para graficar los puntos de datos",
    "alpha": "Opacidad (0-1)",
    "notch": "Muesca",
    "outliers": "Mostrar valores atípicos (en rojo)",
    "barcolor": "Seleccione un color para los bordes de las cajas (después de seleccionar el color, haga clic fuera para aplicar)",
    "showCountsChk": "Mostrar valores en la caja (1Q, mediana, 3Q)",
    "drawSignificanceChk": "Agregar significancia (valores p) para comparar medias entre cada par de cajas (seleccione faceta para agrupar análisis)",
    "methodForMeanDiffSignificance": "Método de prueba para comparar medias",
    "adjPvalue": "Ajustar valores p de comparación de medias",
    "pValueFromatting": "Formatear los valores p (significancia) mostrados",
    "specify_a_title": "Ingrese un título",
    "x_title": "Etiqueta del eje X",
    "y_title": "Etiqueta del eje Y",
    "angleXaxis_text": "Ángulo de inclinación del texto del eje X (por defecto 0 sin inclinación)",
    "angleYaxis_text": "Ángulo de inclinación del texto del eje Y (por defecto 0 sin inclinación)",
    "axisTickmarksCount": "Cuántos valores del eje (marcas) mostrar (por defecto 10)",
	"positionJitterWidth": "Dispersión de puntos de jitter (elija un valor entre 0 y 1. El valor predeterminado es 0.2)",
    "facets_lbl": "Facetas",
    "Facetrow": "Fila de faceta",
    "Facetcolumn": "Columna de faceta",
    "Facetwrap": "Envolver faceta (si se selecciona, se ignorarán fila y columna de faceta)",
    "Facetscale": "Escala de faceta",
    "label1": "Líneas horizontales",
    "yIntercept": "Ingrese valores de intersección Y separados por comas, por ejemplo: 100, 200, 300",
    "hLineColor": "Seleccione un color para las líneas y etiquetas (después de seleccionar el color, haga clic fuera para aplicar)",
    "lineType": "Seleccione el tipo de línea",
    "horizontalLinelabel": "Especifique etiquetas separadas por comas (sin comillas) para las líneas horizontales",
    "horizontalLinelabel_angle_text": "Ángulo de inclinación del texto de la etiqueta de la línea horizontal (por defecto 0 sin inclinación)",
    "label2": "Nota: valores mayores bajan el texto, valores menores lo suben",
    "addHoriRefLines": "Agregar líneas de referencia",
    "xyLimits": "Límites de los ejes X e Y",
    "label5": "Especifique un rango para los valores de los ejes X e Y",
    "rangeXValues": "Especifique el rango del eje X, por ejemplo 0,100 (déjelo en blanco para eje categórico)",
    "rangeYValues": "Especifique el rango del eje Y, por ejemplo 0,100",
    "labelHori_HorizontalJustification": "Nota: valores mayores mueven el texto a la izquierda, menores a la derecha",
    "verticalJustification": "Controlar la alineación vertical de la etiqueta",
    "hori_HorizontalJustification": "Controlar la alineación horizontal de la etiqueta",
    "addlLabelHlineTextPositionOffset": "Ajustes adicionales a la posición de la etiqueta para las líneas horizontales",
    "horiMovementHReflineLabel": "Mover el texto horizontalmente a la izquierda o derecha (+ o -) (deje 0 para eje categórico)",
    "nobreaklineHRefLabelandValueChk": "Marque para eliminar el salto de línea entre el valor y el texto de la etiqueta",
    "vertiMovementHReflineLabel": "Mover el texto verticalmente arriba o abajo (+ o -) (deje 0 para eje categórico)",
    "help": {
        "title": "Gráfico de Caja",
        "r_help": "help(geom_boxplot, package=ggplot2)",
        "body": "En estadística descriptiva, el gráfico de caja permite representar grupos de datos numéricos según sus cuartiles. Puede mostrar bigotes (líneas verticales) que indican la variabilidad fuera de los cuartiles. Los valores atípicos se muestran como puntos individuales. El borde inferior y superior de la caja representan el primer y tercer cuartil, y la línea dentro de la caja es la mediana. Los bigotes se extienden hasta 1.5 × IQR. Se pueden crear facetas especificando variables categóricas. Si se selecciona la opción de graficar los puntos de datos, se utiliza geom_dotplot. Por defecto, los valores atípicos son puntos negros; si se selecciona la opción de mostrar en rojo, se destacan más."
    }
}
