{
  "title": "Diagrama de Caja",
  "navigation": "Diagrama de Caja",
  "x": "Variable X, especificar una variable de categoría",
  "y": "Variable(s) Y, especificar una(s) variable(s) numérica(s)",
  "Fill": "Especificar una variable de agrupamiento (categoría)",
  "flipaxis": "Invertir eje",
  "dataPoints": "Seleccionar una opción para trazar puntos de datos",
  "alpha": "Opacidad (0-1)",
  "notch": "Muesca",
  "outliers": "Mostrar valores atípicos (en rojo)",
  "barcolor": "Seleccionar un color para las líneas alrededor de las cajas (Después de seleccionar el color, haga clic fuera del control para aplicar)",
  "showCountsChk": "Mostrar valores en la caja (1Q, mediana, 3Q)",
  "specify_a_title": "Ingrese un título",
  "x_title": "Etiqueta del eje X",
  "y_title": "Etiqueta del eje Y",
  "angleXaxis_text": "Ángulo para inclinar los valores del texto del eje x (0 por defecto para no inclinar)",
  "angleYaxis_text": "Ángulo para inclinar los valores del texto del eje y (0 por defecto para no inclinar)",
  "axisTickmarksCount": "Cuántos valores del eje (es decir, marcas de tick) mostrar (10 por defecto)",
  "Facetrow": "Fila de facetas",
  "Facetcolumn": "Columna de facetas",
  "Facetwrap": "Envolver facetas (si se elige, cualquier selección de fila y columna de facetas será ignorada)",
  "Facetscale": "Escala de facetas",
  "label1": "Líneas horizontales",
  "yIntercept": "Ingrese valores de intersección Y separados por comas para las líneas horizontales, por ejemplo, 100, 200, 300",
  "hLineColor": "Seleccionar un color para la(s) línea(s) y etiqueta(s) (Después de seleccionar el color, haga clic fuera del control para aplicar)",
  "lineType": "Seleccionar el tipo de línea",
  "horizontalLinelabel": "Especificar etiquetas separadas por comas (sin comillas) para la(s) línea(s) horizontal(es)",
  "horizontalLinelabel_angle_text": "Ángulo para inclinar el texto de la etiqueta de la línea horizontal (0 por defecto para no inclinar)",
  "label2": "Nota: Valores mayores mueven el texto hacia abajo, valores menores mueven el texto hacia arriba",
  "addHoriRefLines": "Agregar líneas de referencia",
  "xyLimits": "Límites de los ejes X e Y",
  "label5": "Especificar un rango para los valores de los ejes X e Y",
  "rangeXValues": "Especificar el rango del eje X, por ejemplo, 0,100 (Déjelo en blanco para un eje categórico/factorial)",
  "rangeYValues": "Especificar el rango del eje Y, por ejemplo, 0,100",
  "labelHori_HorizontalJustification": "Nota: valores mayores colocan el texto a la izquierda, valores menores mueven el texto a la derecha",
  "verticalJustification": "Controlar la justificación vertical de la etiqueta",
  "hori_HorizontalJustification": "Controlar la justificación horizontal de la etiqueta",
  "addlLabelHlineTextPositionOffset": "Ajustes adicionales para posicionar el texto de la etiqueta para líneas horizontales",
  "horiMovementHReflineLabel": "Mover texto horizontalmente a la izquierda o derecha - usar cualquier número con signo + o - (dejar 0 para eje categórico)",
  "nobreaklineHRefLabelandValueChk": "Marque esta casilla para eliminar el salto de línea entre el valor de la etiqueta y el texto de la etiqueta",
  "vertiMovementHReflineLabel": "Mover texto verticalmente hacia arriba o hacia abajo - usar cualquier número con signo + o - (dejar 0 para eje categórico)",
  "help": {
    "title": "Diagrama de Caja",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descripción</b></br>\n        En estadística descriptiva, un diagrama de caja o boxplot es una forma conveniente de representar gráficamente grupos de datos numéricos a través de sus cuartiles. Los diagramas de caja también pueden tener líneas que se extienden verticalmente desde las cajas (bigotes) que indican la variabilidad fuera de los cuartiles superior e inferior, de ahí los términos diagrama de caja y bigote. Los valores atípicos pueden ser representados como puntos individuales. Los diagramas de caja y bigote son uniformes en su uso de la caja: la parte inferior y superior de la caja son siempre el primer y tercer cuartil, y la banda dentro de la caja es siempre el segundo cuartil (la mediana). El bigote superior se extiende desde la bisagra hasta el valor más alto que está dentro de 1.5 * IQR de la bisagra, donde IQR es el rango intercuartílico, o distancia entre el primer y tercer cuartil. El bigote inferior se extiende desde la bisagra hasta el valor más bajo dentro de 1.5 * IQR de la bisagra. Los datos más allá del final de los bigotes son valores atípicos y se representan como puntos (como lo especifica Tukey).​</br>\n        Las facetas pueden ser creadas opcionalmente especificando una variable de factor. También puede especificar temas opcionalmente, y especificar un título y etiquetas para los ejes x e y​</br>\n        Cuando selecciona la opción de trazar los puntos de datos, lo hacemos usando geom_dotplot</br>\n        Por defecto, los valores atípicos se muestran con puntos negros, cuando selecciona la opción de mostrar valores atípicos (en rojo) a través de la casilla de verificación, los valores atípicos se hacen más prominentes.\n        <br/>\n        <b>Uso</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumentos</b><br/>\n        <ul>\n        <li>\n        data: El conjunto de datos por defecto​\n        </li>\n        <li>\n        x: Una variable categórica/factor que define la agrupación de la variable y​\n        </li>\n        <li>\n        y: Una variable numérica para la cual se calcula el boxplot​\n        </li>\n        <li>\n        fill: Una variable categórica/factor opcional para agrupar aún más los grupos existentes. Cada subgrupo se mostrará en un color distinto.​\n        </li>\n        <li>\n        aes():    Generar mapeos estéticos que describen cómo las variables en los datos se mapean a propiedades visuales (estéticas) de los geoms.​\n        </li>\n        <li>\n        geom_boxplot():Crea el boxplot. Las \"bisagras\" superior e inferior corresponden a los primeros y terceros cuartiles (los percentiles 25 y 75).​\n        </li>\n        <li>\n        geom_dotplot: Representa los puntos de datos\n        </li>\n        <li>\n        Labs(): Cambiar etiquetas de ejes y títulos de leyenda (esto es opcional)​\n        </li>\n        <li>\n        facet_grid(): Disponer paneles en una cuadrícula (esto es opcional)​\n        </li>\n        <li>\n        theme_calc(): Especifica el tema de la calculadora (esto es opcional)​\n        </li>\n        <li>\n        coord_flip(): Invertir eje (esto es opcional)​\n        </li>\n        <li>\n        notch: Los diagramas de caja con muesca aplican una \"muesca\" o estrechamiento de la caja alrededor de la mediana. Las muescas son útiles para ofrecer una guía aproximada sobre la significancia de la diferencia de medianas; si las muescas de dos cajas no se superponen, esto ofrece evidencia de una diferencia estadísticamente significativa entre las medianas. En un diagrama de caja con muesca, las muescas se extienden 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n        <b>Paquete</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Ayuda</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Haga clic en el botón de ayuda de R para obtener ayuda detallada de R. También puede ingresar help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}