{
  "title": "Coeficiente de Correlación de Concordancia, múltiples evaluadores",
  "navigation": "Coeficiente de Correlación de Concordancia, múltiples evaluadores",
  "ratervars": "Variables de Evaluador, al menos 2",
  "cilevel": "Nivel de Confianza:",
  "bootsamp": "Número de muestras bootstrap",
  "plotoptionslabel": "Opciones de Gráfico",
  "plotchkbox": "Gráficos de dispersión para todos los pares de evaluadores",
  "plottitle": "Título",
  "varlabels": "Etiquetas de Variables (si se utilizan, deben especificar etiquetas para todas las variables, en orden, como 'etiqueta 1', 'etiqueta 2', etc.)",
  "plottheme": "Tema de Gráfico",
  "help": {
    "title": "Coeficiente de Correlación de Concordancia, múltiples evaluadores",
    "r_help": "help(epi.occc,package=epiR)",
    "body": "\nEl coeficiente de correlación de concordancia (CCC) mide el acuerdo entre observadores que miden los mismos sujetos en la misma escala para datos continuos. El CCC puede variar entre \n-1 y 1, siendo 1 un acuerdo perfecto y 0 sin acuerdo. Los valores negativos indican un acuerdo negativo, pero esto es raro en la práctica. El CCC general y los CCC por pares \n(todas las parejas de evaluadores) se calculan con intervalos de confianza bootstrap percentil y intervalos de confianza bootstrap percentil ajustados. Cualquier observación con un valor faltante para las variables de evaluador especificadas se elimina del análisis.\n<br/><br/>\n<b>Variables de Evaluador:</b> Variables que contienen los valores proporcionados por los observadores; deben ser numéricas\n<br/>\n<b>Nivel de Intervalo de Confianza:</b> Nivel de intervalo de confianza deseado para el CCC\n<br/>\n<b>Número de muestras bootstrap:</b> El número deseado de muestras bootstrap a extraer de los datos originales para calcular los intervalos de confianza. Se recomienda al menos 1000, \nsi es prácticamente factible.\n<br/>\n<b>Gráficos de dispersión para todos los pares de evaluadores:</b> Opción para crear gráficos de dispersión para todos los pares de evaluadores en un formato de matriz.   \n<br/><br/>\n<b>Paquetes R requeridos:</b> epiR, boot, GGally, ggthemes\n                "
  }
}