{
  "title": "Cuantiles Chi-cuadrado",
  "navigation": "Cuantiles Chi-cuadrado",
  "prob": "Ingrese probabilidades separadas por una coma. Ejemplo: 0.3,0.2,0.5",
  "degoffree": "Grados de libertad",
  "labelSig": "Nivel de significancia",
  "lowtail": "Cola inferior",
  "uptail": "Cola superior",
  "help": {
    "title": "Cuantiles Chi-cuadrado",
    "r_help": "help(qchisq, package=stats)",
    "body": "\n            ​​\n            <b>Descripción</b>\n            <br/>\n            Densidad, función de distribución, función cuantil y generación aleatoria para la distribución chi-cuadrado (chi^2) con df grados de libertad y parámetro de no centralidad opcional ncp.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code>\n                dchisq(x, df, ncp = 0, log = FALSE)\n                <br/>\n                pchisq(q, df, ncp = 0, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qchisq(p, df, ncp = 0, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rchisq(n, df, ncp = 0)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumentos</b>\n            <br/>\n            <ul>\n                <li>x, q : vector de cuantiles.</li>\n                \n                \n                <li>p : vector de probabilidades.</li>\n                \n                \n                <li>n : número de observaciones. Si length(n) > 1, se toma la longitud como la cantidad requerida.</li>\n                \n                \n                <li>df : grados de libertad (no negativos, pero pueden ser no enteros).</li>\n                \n                \n                <li>ncp : parámetro de no centralidad (no negativo).</li>\n                \n                \n                <li>log, log.p : lógico; si es TRUE, las probabilidades p se dan como log(p).</li>\n                \n                \n                <li>lower.tail : lógico; si es TRUE (por defecto), las probabilidades son P[X ≤ x], de lo contrario, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalles</b>\n            <br/>\n            La distribución chi-cuadrado con df= n ≥ 0 grados de libertad tiene densidad\n            <br/>\n            <code>f_n(x) = 1 / (2^(n/2) Γ(n/2)) x^(n/2-1) e^(-x/2)</code>\n            <br/>\n            para x > 0. La media y la varianza son n y 2n.\n            <br/>\n            La distribución chi-cuadrado no central con df= n grados de libertad y parámetro de no centralidad ncp = λ tiene densidad\n            <br/>\n            <code>f(x) = exp(-λ/2) SUM_{r=0}^∞ ((λ/2)^r / r!) dchisq(x, df + 2r)</code>\n            <br/>\n            para x ≥ 0. Para n entero, esta es la distribución de la suma de cuadrados de n normales cada una con varianza uno, λ siendo la suma de cuadrados de las medias normales; además, \n            <br/>\n             <code>E(X) = n + λ, Var(X) = 2(n + 2*λ), y E((X - E(X))^3) = 8(n + 3*λ).</code>\n             <br/>\n            Tenga en cuenta que los grados de libertad df= n, pueden ser no enteros, y también n = 0 lo cual es relevante para la no centralidad λ > 0, ver Johnson et al (1995, capítulo 29). En ese caso (no central, df cero), la distribución es una mezcla de una masa puntual en x = 0 (de tamaño pchisq(0, df=0, ncp=ncp)) y una parte continua, y dchisq() no es una densidad con respecto a esa medida de mezcla, sino más bien el límite de la densidad para df -> 0.\n            <br/>\n            Tenga en cuenta que los valores de ncp mayores que aproximadamente 1e5 pueden dar resultados inexactos con muchas advertencias para pchisq y qchisq.\n            <br/>\n            <br/><b>Valor</b>\n            <br/>\n            dchisq da la densidad, pchisq da la función de distribución, qchisq da la función cuantil, y rchisq genera desviaciones aleatorias.\n            <br/>\n            Argumentos inválidos resultarán en un valor de retorno NaN, con una advertencia.\n            <br/>\n            La longitud del resultado está determinada por n para rchisq, y es el máximo de las longitudes de los argumentos numéricos para las otras funciones.\n            <br/>\n            Los argumentos numéricos que no son n se reciclan a la longitud del resultado. Solo se utilizan los primeros elementos de los argumentos lógicos.\n            <br/>\n            <br/><b>Nota</b>\n            <br/>\n            Suministrar ncp = 0 utiliza el algoritmo para la distribución no central, que no es el mismo algoritmo utilizado si se omite ncp. Esto es para dar un comportamiento consistente en casos extremos con valores de ncp muy cercanos a cero.\n            <br/>\n            El código para ncp no cero está destinado principalmente a ser utilizado para valores moderados de ncp: no será altamente preciso, especialmente en las colas, para valores grandes.            \n"
  }
}