{
  "title": "Comparar Modelos",
  "navigation": "Comparar Modelos",
  "label1": "Compara 2 modelos anidados utilizando una prueba F o una prueba Chi-cuadrado dependiendo de la estimación y realiza una prueba de razón de verosimilitud.",
  "label2": "Selecciona modelos de las siguientes clases (la clase R está entre paréntesis a continuación)",
  "label3": "Modelos lineales (lm), Modelo lineal generalizado (glm), Modelo de efectos mixtos lineales (lme), Regresión logística o Probit ordenada (polr), Modelo de riesgo proporcional (coxph), Modelo lineal utilizando mínimos cuadrados generalizados (gls), Modelo de regresión de supervivencia (survreg), Ajuste de regresión polinómica local (loess), Modelo de mínimos cuadrados no lineales (nls), Modelos multinomiales de log-lineales (multinom)",
  "label4": "**NOTA: Los modelos creados a partir de la sintonización del modelo (clase train) no son compatibles",
  "modelselector1": "Selecciona el modelo completo:",
  "modelselector2": "Selecciona un modelo con menos predictores:",
  "help": {
    "title": "Comparar Modelos",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>\nCompara 2 modelos anidados utilizando una prueba F o una prueba Chi-cuadrado dependiendo de la estimación. Las pruebas F se utilizan para la estimación de mínimos cuadrados, las pruebas chi-cuadrado se utilizan para la estimación de máxima verosimilitud. Ambos modelos deben ser creados en el mismo conjunto de datos, ya que las diferencias en los valores faltantes pueden causar problemas</b></br>\n<b>Descripción</b></br>\nTablas Anova: Calcula tablas de análisis de varianza y realiza pruebas de razón de verosimilitud para un objeto de modelo ajustado.  \n<br/>\n<b>Uso</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject:  un objeto que contiene los resultados devueltos por una función de ajuste de modelo (por ejemplo, lm o glm).\n</li>\n</ul>\n<b>Valor</b><br/>\nEsta función (genérica) devuelve un objeto de clase anova. Estos objetos representan tablas de análisis de varianza y análisis de desviación. Cuando se le da un solo argumento, produce una tabla que prueba si los términos del modelo son significativos. Cuando se le da una secuencia de objetos, anova prueba los modelos entre sí en el orden especificado.<br/>\nEl método de impresión para los objetos anova imprime tablas en una forma 'bonita'.<br/>\n<b>Advertencia</b><br/>\nLa comparación entre dos o más modelos solo será válida si se ajustan al mismo conjunto de datos. Esto puede ser un problema si hay valores faltantes y se utiliza la acción predeterminada de R na.action = na.omit.<br/>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de este diálogo o ejecute el siguiente comando en el editor de sintaxis de R help(anova,package='stats')</br></br>\n<b>Descripción</b></br>\nPrueba de razón de verosimilitud de modelos anidados: lrtest es una función genérica para llevar a cabo pruebas de razón de verosimilitud. El método predeterminado se puede emplear para comparar modelos lineales (generalizados) anidados (ver detalles a continuación).\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Método S3 predeterminado:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Método S3 para la clase 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: un objeto. Ver detalles a continuación.\n</li>\n<li>\n...: especificaciones adicionales de objetos pasadas a los métodos. Ver detalles a continuación.\n</li>\n<li>\nname: una función para extraer un nombre/descripción adecuado de un objeto de modelo ajustado. Por defecto, el nombre se consulta llamando a formula.\n</li>\n<li>\ndata: un marco de datos que contiene las variables en el modelo.\n</li>\n</ul>\n<b>Detalles</b></br>\nlrtest está destinado a ser una función genérica para comparaciones de modelos a través de pruebas de razón de verosimilitud asintóticas. El método predeterminado compara consecutivamente el objeto de modelo ajustado con los modelos pasados en .... En lugar de pasar los objetos de modelo ajustados en ..., se pueden especificar varias otras especificaciones. El mecanismo de actualización es el mismo que para waldtest: los modelos en ... se pueden especificar como enteros, caracteres (ambos para términos que deben ser eliminados del modelo anterior), fórmulas de actualización u objetos de modelo ajustados. Excepto por el último caso, se asume la existencia de un método de actualización. Ver waldtest para más detalles.<br/>\nPosteriormente, se lleva a cabo una prueba de razón de verosimilitud asintótica para cada dos modelos consecutivos: Dos veces la diferencia en log-verosimilitudes (según lo derivado por los métodos logLik) se compara con una distribución Chi-cuadrada.<br/>\nEl método \"formula\" ajusta primero un lm y luego llama al método predeterminado.<br/>\n<b>Valor</b><br/>\nUn objeto de clase \"anova\" que contiene la log-verosimilitud, grados de libertad, la diferencia en grados de libertad, la estadística Chi-cuadrada de razón de verosimilitud y el valor p correspondiente.\n<b>Ejemplos</b><br/>\n<code> \n## con datos de Greene (1993):<br/>\n## cargar datos y calcular rezagos<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## varias especificaciones equivalentes de la prueba LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
  }
}