{
  "title": "Logística, Condicional",
  "navigation": "Logística, Condicional",
  "modelname": "Ingrese el nombre del modelo",
  "outcomevarlabel": "Variable Dependiente (numérica; 1 = evento, 0 = no evento)",
  "stratavarlabel": "Estratos",
  "methodgrplabel": "Método de Estimación",
  "exactlabel": "Exacto",
  "efronlabel": "Efron",
  "breslowlabel": "Breslow",
  "help": {
    "title": "Logística, Condicional",
    "r_help": "help(clogit, package = 'survival')",
    "body": "\nEsto ajusta un modelo de regresión logística condicional, que es similar a la regresión logística estándar, pero incorpora una variable de estratificación. Las aplicaciones comunes de este \nmodelo se encuentran en estudios de casos y controles emparejados, cohortes emparejadas y estudios de casos y controles anidados. La salida incluye el número de estratos utilizados en el análisis, patrones de frecuencia de resultados \ndentro de los estratos, varias estadísticas de resumen del modelo, estimaciones de parámetros y razones de probabilidades.\n<br/><br/>\n<b>Variable Dependiente:</b> Esta es la variable que indica el evento para cada sujeto, con 1 significando un evento, y 0 significando un no evento. Esta variable debe ser numérica.\n<br/><br/>\n<b>Constructor de Fórmula:</b> Especifique los términos del modelo deseados.\n<br/><br/>\n<b>Estratos:</b> Especifique la variable de estratificación. Puede ser numérica, carácter o un factor nominal/ordinal.\n<br/><br/>\n<b>Método de Estimación:</b> Especifique el método de estimación del modelo. El método \"Exacto\" es el predeterminado. Siempre que no haya demasiadas formas de seleccionar eventos dentro de los estratos, esta debería ser la opción elegida. La estimación puede tardar algún tiempo o provocar errores si muchas combinaciones pueden resultar dentro de algunos estratos, digamos 100 eventos de 500 sujetos. Las aproximaciones de Efron y Breslow son adecuadas en estos casos, siendo Efron la preferida. Consulte las referencias en la ayuda de R para más detalles.\n<br/><br/>\n<b>Paquetes R Requeridos:</b> survival, broom, arsenal, dplyr\n\t\t"
  }
}