{
  "title": "Cox, Básico",
  "navigation": "Cox, Básico",
  "helplabel": "Haga clic en el botón ? en la parte superior derecha del cuadro de diálogo para obtener detalles sobre conjuntos de datos de muestra y el formato de datos admitido.",
  "modelname": "Ingrese el nombre del modelo",
  "timevar": "Tiempo hasta el evento o censura",
  "eventvar": "Eventos (1 = evento 1, 0 = censura)",
  "destvars": "Variables Independientes",
  "weightvar": "Pesos (opcional)",
  "tiemethod": "Método de Tiempo Empatado",
  "forestplotbox": "Gráfico de Bosque",
  "diagnosticsbox": "Diagnósticos del Modelo",
  "martscalebox": "Valor Mínimo del Eje de Residuos de Martingale del Modelo Nulo (-Inf a 1):",
  "devbox": "Análisis de Desviación (Tipo II)",
  "devtype": "Estadística de Prueba",
  "help": {
    "title": "Cox, Básico",
    "r_help": "help(coxph, paquete = 'survival')",
    "body": "\n\t\t\tVea el conjunto de datos de muestra en el directorio de instalación, la ubicación predeterminada está en la unidad:&bsol;program files&bsol;BlueSky Statistics&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. La variable Followup_time debe ingresarse como el tiempo hasta el evento o censura y la variable Event debe ingresarse como los Eventos (1 = evento, 0 = censura). Sexo, edad y bmi pueden ser las variables independientes. \n\t\t\t<br/>\n            La variable de evento debe ser numérica, no se permiten factores. Si tiene una variable de evento que es de tipo factor con 2 valores, por ejemplo, 0 y 1, conviértala a numérica\n\t\t\tEste conjunto de datos es una versión actualizada del conjunto de datos mockstudy en el paquete arsenal.\n\t\t\t<br/><br/>\n            <b>Modelo de Riesgos Proporcionales de Cox</b>\n            <br/>\n            <br/>\n            Ajusta un modelo de riesgos proporcionales de Cox para datos de tiempo hasta el evento con observaciones censuradas. Se proporcionan estadísticas de ajuste del modelo, estimaciones de parámetros y razones de riesgo. Las opciones disponibles incluyen el método de tiempo empatado, diagnósticos del modelo como pruebas de riesgos proporcionales y evaluaciones de la forma funcional de covariables, y un gráfico de bosque de razones de riesgo con intervalos de confianza. El modelo se ajusta utilizando la función coxph en el paquete survival.\n            <br/>\n            <br/>\n            <b>Tiempo:</b> Tiempo hasta el evento para aquellos que experimentan el evento o tiempo hasta el último seguimiento para aquellos que no experimentan el evento\n            <br/><br/>\n            <b>Evento:</b> Indicador de evento numérico; 1=evento, 0=censura\n            <br/><br/>\n            <b>Variables Independientes:</b> Variables independientes a incluir en el modelo. Los factores, cadenas y variables lógicas se codificarán como variables ficticias.\n            <br/><br/>\n            <b>Pesos:</b> Variable numérica para pesos de observación. Útil en situaciones donde cada registro no debe contarse como una observación. \n            <br/>\n            <br/>\n            <b>Paquetes requeridos:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Haga clic en el botón Obtener ayuda de R para obtener ayuda detallada sobre la función coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opciones</b>\n            <br/>\n            <br/>\n            <b>Método de Tiempo Empatado:</b>\n            <br/>\n            Método para romper los tiempos observados empatados. Efron suele ser la mejor opción cuando no hay muchos tiempos empatados. El método exacto puede ser beneficioso si hay muchos tiempos empatados, como en situaciones de tiempo discreto, pero puede tardar un poco más en ajustar el modelo. \n            <br/>\n            <br/>\n            <b>Gráfico de Bosque:</b>\n            <br/>\n            Gráfico de razones de riesgo e intervalos de confianza para cada predictor en el modelo.\n            <br/>\n            <br/>\n            <b>Diagnósticos del Modelo:</b>\n            <br/>\n            Si se selecciona, se proporcionarán pruebas y gráficos de riesgos proporcionales, además de evaluaciones de la forma funcional para cada covariable en el modelo. La opción de valor mínimo del eje de residuos de Martingale del modelo nulo puede necesitar ser cambiada para que todos los residuos aparezcan en el gráfico. Para obtener evaluaciones de forma funcional, debe especificar solo predictores numéricos y no tener datos faltantes. Ver Variables > Valores Faltantes > Eliminar NAs.\n            <br/>\n            <br/>\n            <b>Análisis de Desviación (Tipo II):</b>\n            Prueba global de cada predictor en el modelo. Se proporcionarán pruebas de múltiples grados de libertad para efectos con más de 2 niveles. Se pueden obtener pruebas de Wald y de razón de verosimilitud, siendo las pruebas de razón de verosimilitud las que tienen mejores propiedades en muestras pequeñas.\n            \n      "
  }
}