{
    "title": "Cox, Avanzado",
    "navigation": "Cox, Avanzado",
    "helplabel": "Haga clic en el botón ? en la esquina superior derecha del cuadro de diálogo para obtener detalles sobre conjuntos de datos de muestra y el formato de datos compatible.",
    "modelname": "Ingrese el nombre del modelo",
    "timevar": "Tiempo hasta el evento o censura",
    "eventvar": "Eventos (1 = evento, 0 = censura)",
    "modelterms": "Constructor de expresión del modelo para variables independientes",
    "weightvar": "Pesos (opcional)",
    "tiemethod": "Método de Tiempos Iguales",
    "forestplotbox": "Diagrama de Bosque",
    "diagnosticsbox": "Diagnósticos del Modelo",
    "martscalebox": "Valor Mínimo del Eje de Residuales de Martingala del Modelo Nulo (-Inf a 1):",
    "devbox": "Análisis de Desviación (Tipo II)",
    "devtype": "Estadístico de Prueba",
    "help": {
        "title": "Cox, Avanzado",
        "r_help": "help(coxph, package = 'survival')",
        "body": "\n\t\t\tVea el conjunto de datos de muestra en el directorio de instalación; la ubicación predeterminada es en la letra de la unidad:&bsol;program files&bsol;BioStat Prime&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. La variable Followup_time debe ingresarse como el tiempo hasta el evento o censura, y la variable Event debe ingresarse como los Eventos (1 = evento, 0 = censura). Sexo, edad y bmi pueden ser las variables independientes.\n\t\t\t<br/>\n\t\t\tEste conjunto de datos es una versión actualizada del conjunto de datos mockstudy en el paquete arsenal.\n\t\t\t<br/><br/>\n            <b>Modelo de Riesgos Proporcionales de Cox</b>\n            <br/>\n            <br/>\n            Ajusta un modelo de riesgos proporcionales de Cox para datos de tiempo hasta el evento con observaciones censuradas. Se proporcionan estadísticas de ajuste del modelo, estimaciones de parámetros y razones de riesgo. Las opciones disponibles incluyen el método de tiempos iguales, diagnósticos del modelo como pruebas de riesgos proporcionales y evaluaciones de forma funcional de covariables, y un diagrama de bosque de razones de riesgo con intervalos de confianza. El modelo se ajusta utilizando la función coxph en el paquete survival.\n            <br/>\n            <br/>\n            <b>Tiempo:</b> Tiempo hasta el evento para aquellos que experimentan el evento o tiempo hasta el último seguimiento para aquellos que no experimentan el evento\n            <br/><br/>\n            <b>Evento:</b> Indicador numérico de evento; 1=evento, 0=censura\n            <br/><br/>\n            <b>Variables Independientes:</b> Variables independientes a incluir en el modelo. Los factores, cadenas y variables lógicas se codificarán como variables ficticias.\n            <br/><br/>\n            <b>Pesos:</b> Variable numérica para pesos de observación. Útil en situaciones donde cada registro no debe contarse como una sola observación.\n            <br/>\n            <br/>\n            <b>Paquetes requeridos:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Haga clic en el botón Obtener ayuda en R para obtener ayuda detallada en R sobre la función coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opciones</b>\n            <br/>\n            <br/>\n            <b>Método de Tiempos Iguales:</b>\n            <br/>\n            Método para descomponer tiempos observados iguales. Efron suele ser la mejor opción cuando no hay muchos tiempos iguales. El método exacto puede ser beneficioso si hay muchos tiempos iguales, como en situaciones de tiempo discreto, pero puede tardar un poco más en ajustar el modelo.\n            <br/>\n            <br/>\n            <b>Diagrama de Bosque:</b>\n            <br/>\n            Gráfico de razones de riesgo e intervalos de confianza para cada predictor en el modelo.\n            <br/>\n            <br/>\n            <b>Diagnósticos del Modelo:</b>\n            <br/>\n            Si se selecciona, se proporcionarán pruebas de riesgos proporcionales y gráficos, además de evaluaciones de forma funcional para cada covariable en el modelo. Es posible que deba cambiar el valor mínimo del eje de residuales de martingala del modelo nulo para que todos los residuales aparezcan en el gráfico. Para obtener evaluaciones de forma funcional, debe especificar solo predictores numéricos y no tener datos faltantes. Vea Variables > Valores Faltantes > Eliminar NAs.\n            <br/>\n            <br/>\n            <b>Análisis de Desviación (Tipo II):</b>\n            Prueba global de cada predictor en el modelo. Se proporcionarán pruebas de múltiples grados de libertad para efectos con más de 2 niveles. Las pruebas de Wald y de razón de verosimilitud pueden obtenerse, y las pruebas de razón de verosimilitud tienen mejores propiedades en muestras pequeñas.\n            \n"
    }
}
