{
  "title": "Crear una tabla de experimentos para un estudio de gage MSA",
  "navigation": "Diseñar estudio MSA",
  "datasetname": "Nombre de la tabla del estudio de gage MSA",
  "label1": "Detalles de las piezas",
  "label2": "Detalles de los operadores",
  "factor1": "Nombre de la variable de la pieza (por ejemplo, Parte como predeterminado)",
  "numOfFactorLevels1": "Número de piezas",
  "factorLevels1": "Deje en blanco para generar valores automáticamente o especifique valores - ejemplo: -1, 1, 'cadena1', 2, 0",
  "prefixForfactorLevels1": "Si se genera automáticamente, especifique cualquier prefijo. Si está en blanco, creará valores como 1,2,3,..",
  "factor2": "Nombre de la variable del operador (por ejemplo, Operador como predeterminado)",
  "numOfFactorLevels2": "Número de operadores",
  "factorLevels2": "Deje en blanco para generar valores automáticamente o especifique valores - ejemplo: -1, 1, 'cadena1', 2, 0",
  "prefixForfactorLevels2": "Si se genera automáticamente, especifique cualquier prefijo. Si está en blanco, creará valores como 1,2,3,..",
  "numOfBlocks": "Número de bloques",
  "replicationVarName": "si no se deja en blanco, nombre para la variable de iteración de replicación si la replicación > 1",
  "replications": "Replicaciones",
  "repeatOnlyChk": "Repetir solo (en lugar de replicación verdadera - no recomendado)",
  "randomizationChk": "Aleatorizar las ejecuciones",
  "selectRandomSeedRad": "Generar automáticamente semilla aleatoria (única cada vez)",
  "selectFixedRandomSeedRad": "Elegir como se muestra o cambiar manualmente la siguiente semilla aleatoria",
  "lbl1": "Es posible que no necesite cambiar el valor de la semilla de aleatorización",
  "randomseeds": "Semilla para la aleatorización",
  "sortByOperatorChk": "Ordenar por operador dentro de cada replicación",
  "help": {
    "title": "Generar automáticamente una tabla de experimentos para un estudio de gage MSA",
    "r_help": "help(fac.design, package=DoE.base)",
    "body": "\n\t\t\t\t<b>Descripción</b></br>\n\t\t\t\tGenera automáticamente una tabla de estudio MSA para configurar las ejecuciones del experimento con detalles de la pieza y el operador según los parámetros especificados. \n\t\t\t\tSi se utilizan valores no numéricos para la pieza y el operador, especifique entre comillas simples, por ejemplo, 1,-1,'nombre1',0,'cadena2'\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUna vez que los detalles de la ejecución del experimento se generan automáticamente, la tabla de ejecución aparecerá en la interfaz de usuario de la cuadrícula de datos. \n\t\t\t\tLa tabla de ejecución se puede guardar (o 'guardar como' desde el menú de archivo) para crear un archivo de Excel que se utilizará para configurar los experimentos\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}