{
  "title": "Lista de Crosstab",
  "navigation": "Lista de Crosstab",
  "destvarslabel": "Variables para la Tabla",
  "missinglabel": "Valores Faltantes",
  "removelabel": "Eliminar",
  "showexcludelabel": "Mostrar y Excluir de los Porcentajes",
  "includelabel": "Mostrar e Incluir en los Porcentajes",
  "sparseoptlabel": "Incluir Combinaciones con 0 Conteos",
  "toplistoptlabel": "Mostrar los N Valores Más Frecuentes",
  "topnumlabel": "N",
  "help": {
    "title": "Lista de Crosstab",
    "r_help": "help(freqlist, package ='arsenal')",
    "body": "\nEsto crea tablas de frecuencia en un formato de lista para combinaciones de una o más variables. Cada combinación de valores a través de todas las variables especificadas será tabulada, \ncon sus frecuencias observadas. Las variables especificadas pueden ser de cualquier clase, incluyendo variables numéricas y continuas. Aunque esto puede ser utilizado para frecuencias resumen y \nporcentajes, un uso principal es verificar los datos en busca de inconsistencias. Se debe tener cuidado sobre cuántas variables clasificar cruzadamente y cuántas posibilidades pueden resultar, ya que \nalguna tablas pueden tardar más en producirse. \n<br/><br/>\n<b>Variables para la Tabla:</b>  <br/>Variables que se incluirán en la tabla, que pueden ser de cualquier clase. La tabla se ordenará de acuerdo con el orden de las variables en esta lista.  \nEsto significa que si las variables A y B son el orden especificado, entonces la tabla se ordenará por niveles de A, luego niveles de B dentro de A.\n<br/><br/>\n<b>Valores Faltantes</b>\n<br/>\n<ul>\n\t<li><b>Eliminar:</b>  Combinaciones de valores de variable que tienen NA serán excluidas de la tabla.</li>\n\t<li><b>Mostrar y Excluir de los Porcentajes:</b>  Combinaciones de valores de variable que tienen NA serán incluidas en la tabla, pero no se incluirán en los cálculos de porcentaje.</li>\n\t<li><b>Mostrar e Incluir en los Porcentajes:</b>  Combinaciones de valores de variable que tienen NA serán incluidas en la tabla y se incluirán en los cálculos de porcentaje.</li> \n</ul>\n<br/><br/>\n<b>Incluir Combinaciones con 0 Conteos:</b>  <br/>Si incluir combinaciones de valores de variable que no existen en el conjunto de datos. Por ejemplo, si las variables A y B tienen valores observados de 1, 2 y 3, pero la combinación (A, B) (1, 3) no se observa en los datos, esta opción incluiría una fila para la combinación (1, 3) con una frecuencia de 0.\n<br/><br/>\n<b>Mostrar los N Valores Más Frecuentes:</b>  <br/>Si se marca, esto crearía una tabla separada con las N combinaciones de variables más frecuentes.\n<ul>\n\t<li><b>N:</b> Cuántas combinaciones de variables mostrar para la tabla de los N más frecuentes.</li>\n</ul>\n<b>Paquetes R Requeridos:</b> arsenal\n\t\t\t"
  }
}