{
  "title": "Ajuste de distribuciones univariantes a datos no censurados",
  "navigation": "Ajuste de Distribución",
  "variableSelcted": "Seleccione una variable que contenga la distribución",
  "label2": "Prueba de ajuste para varias distribuciones",
  "normDistChk": "Normal",
  "weibullDistChk": "Weibull",
  "lnormDistChk": "Log Normal",
  "poissonDistChk": "Poisson",
  "expDistChk": "Exponencial",
  "gammaDistChk": "Gamma",
  "nbinomDistChk": "Binomial Negativa",
  "geomDistChk": "Geométrica",
  "betaDistChk": "Beta",
  "unifDistChk": "Uniforme",
  "logisDistChk": "Logística",
  "cauchyDistChk": "Cauchy",
  "method": "Método de ajuste",
  "gof": "Bondad de ajuste (gof) - requerido solo cuando se elige el método 'mge' de ajuste arriba",
  "help": {
    "title": "Ajuste de distribuciones univariantes a datos no censurados",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descripción</b></br>\n\t\t\t\tAjuste de distribuciones univariantes a datos no censurados por máxima verosimilitud (mle), emparejamiento de momentos (mme), emparejamiento de cuantiles (qme) o maximización de la estimación de bondad de ajuste (mge) que también se conoce como minimización de la estimación de distancia.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara la ayuda detallada - use R help(fitdist, package = fitdistrplus) y help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLos cuatro métodos de ajuste posibles se describen a continuación:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCuando method=\"mle\" (predeterminado)\n\t\t\t\tLa estimación de máxima verosimilitud consiste en maximizar la log-verosimilitud. Se lleva a cabo una optimización numérica en mledist a través de optim para encontrar los mejores valores (ver mledist para más detalles).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCuando method=\"mme\"\n\t\t\t\tLa estimación de emparejamiento de momentos consiste en igualar momentos teóricos y empíricos. Los valores estimados de los parámetros de la distribución se calculan mediante una fórmula en forma cerrada para las siguientes distribuciones: \"norm\", \"lnorm\", \"pois\", \"exp\", \"gamma\", \"nbinom\", \"geom\", \"beta\", \"unif\" y \"logis\". De lo contrario, los momentos teóricos y empíricos se emparejan numéricamente, mediante la minimización de la suma de las diferencias al cuadrado entre los momentos observados y teóricos. En este último caso, se necesitan argumentos adicionales en la llamada a fitdist: order y memp (ver mmedist para más detalles).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCuando method = \"qme\"\n\t\t\t\tLa estimación de emparejamiento de cuantiles consiste en igualar cuantiles teóricos y empíricos. Se lleva a cabo una optimización numérica en qmedist a través de optim para minimizar la suma de las diferencias al cuadrado entre los cuantiles observados y teóricos. El uso de este método requiere un argumento adicional probs, definido como el vector numérico de las probabilidades para las cuales el(los) cuantile(s) debe(n) ser emparejado(s) (ver qmedist para más detalles).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCuando method = \"mge\"\n\t\t\t\tLa estimación de máxima bondad de ajuste consiste en maximizar una estadística de bondad de ajuste. Se lleva a cabo una optimización numérica en mgedist a través de optim para minimizar la distancia de bondad de ajuste. El uso de este método requiere un argumento adicional gof coding para la distancia de bondad de ajuste elegida. Se puede usar la clásica distancia de Cramer-von Mises (\"CvM\"), la clásica distancia de Kolmogorov-Smirnov (\"KS\"), la clásica distancia de Anderson-Darling (\"AD\") que da más peso a las colas de la distribución, o una de las variantes de esta última distancia propuesta por Luceno (2006) (ver mgedist para más detalles). Este método no es adecuado para distribuciones discretas.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tCuando method = \"mse\"\n\t\t\t\tLa estimación de máxima bondad de ajuste consiste en maximizar el espaciado logarítmico promedio. Se lleva a cabo una optimización numérica en msedist a través de optim.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa convergencia es \n\t\t\t\tun código entero para la convergencia de optim/constrOptim definido como a continuación o definido por el usuario en la función de optimización suministrada por el usuario. 0 indica convergencia exitosa. 1 indica que se ha alcanzado el límite de iteración de optim. 10 indica degeneración del simplex de Nealder-Mead. 100 indica que optim encontró un error interno.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLas estadísticas de bondad de ajuste se calculan mediante gofstat(). La estadística de Chi-cuadrado se calcula utilizando celdas definidas por el argumento chisqbreaks o celdas definidas automáticamente a partir de datos, con el fin de alcanzar aproximadamente el mismo número de observaciones por celda, aproximadamente igual al argumento meancount, o ligeramente más si hay algunos empates. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara distribuciones continuas, también se calculan las estadísticas de Kolmogorov-Smirnov, Cramer-von Mises y Anderson-Darling, como se define por Stephens (1986).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLas estadísticas de importancia son las estadísticas de Cramer-von Mises, Anderson-Darling y Kolmogorov para distribuciones continuas y las estadísticas de Chi-cuadrado para las discretas (\"binom\", \"nbinom\", \"geom\", \"hyper\" y \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Para una buena visión general del ajuste de distribuciones, consulte https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Para una buena visión general del ajuste de distribuciones, consulte https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}