{
  "title": "Gráfico de Cullen y Frey con descriptivos de una distribución empírica para datos no censurados",
  "navigation": "Análisis de distribución (gráfico de Cullen y Frey)",
  "variableSelcted": "Seleccione una variable que contenga la distribución",
  "boot": "(Opcional) Valores de bootstrap de asimetría y kurtosis. Si se especifica, debe ser un entero mayor que 10",
  "discreteChk": "Discreto - no marcado (predeterminado) para uniforme, normal, logístico, lognormal, beta y gamma. Marcado para poisson y binomial negativo",
  "method": "No sesgado (predeterminado) para valores estimados no sesgados de estadísticas o muestra para valores de muestra",
  "help": {
    "title": "Descripción de una distribución empírica para datos no censurados",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descripción</b></br>\n\t\t\t\tCalcula parámetros descriptivos de una distribución empírica para datos no censurados y proporciona un gráfico de asimetría-kurtosis\n\t\t\t\t<br/>\n\t\t\t\tPara la ayuda detallada - use R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMínimo, máximo, mediana, media, desviación estándar de la muestra y muestra (si método==\"sample\") o por defecto estimaciones no sesgadas de \n\t\t\t\tasimetría y valores de kurtosis de Pearson se imprimen (Sokal y Rohlf, 1995). Se proporciona un gráfico de asimetría-kurtosis como el \n\t\t\t\tpropuesto por Cullen y Frey (1999) para la distribución empírica. En este gráfico, los valores para distribuciones comunes \n\t\t\t\ntambién se muestran como herramientas para ayudar en la elección de distribuciones para ajustar a los datos. Para algunas \n\t\t\t\tdistribuciones (normal, uniforme, logística, exponencial por ejemplo), solo hay un valor posible para la asimetría \n\t\t\t\ty la kurtosis (por ejemplo, para una distribución normal, asimetría = 0 y kurtosis = 3), y la distribución se representa \n\t\t\t\tcomo un punto en el gráfico. Para otras distribuciones, se representan áreas de valores posibles, consistentes en \n\t\t\t\tlíneas (distribuciones gamma y lognormal por ejemplo), o áreas más grandes (distribución beta por ejemplo). \n\t\t\t\tLa distribución de Weibull no se representa en el gráfico, pero se indica en la leyenda que formas cercanas a \n\t\t\t\tdistribuciones lognormales y gamma pueden obtenerse con esta distribución.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara tener en cuenta la incertidumbre de los valores estimados de kurtosis y asimetría a partir de los datos, el conjunto de datos \n\t\t\t\tpuede ser bootstraped fijando el argumento boot a un entero mayor que 10. Los valores de bootstrap de asimetría y kurtosis \n\t\t\t\tcorrespondientes a las muestras bootstrap se calculan y se informan en color azul en el gráfico de asimetría-kurtosis.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSi discreto es TRUE, las distribuciones representadas son las distribuciones de Poisson, binomiales negativas y la distribución normal \n\t\t\t\tque las distribuciones discretas anteriores pueden converger. Si discreto es FALSE, estas son distribuciones uniformes, normales, \n\t\t\t\tlogísticas, lognormales, beta y gamma.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Para una buena visión general del ajuste de distribuciones, consulte https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}