{
  "title": "Gráfico de Cullen y Frey con descriptivos de una distribución empírica para datos no censurados",
  "navigation": "Análisis de Distribución (gráfico de Cullen y Frey)",
  "variableSelcted": "Seleccione una variable que contenga la distribución",
  "boot": "(Opcional) Valores de boot de asimetría y curtosis. Si se especifica, debe ser un entero mayor a 10",
  "discreteChk": "Discreto - desmarcado (predeterminado) para uniforme, normal, logístico, lognormal, beta y gamma. Marcado para poisson y binomial negativo",
  "method": "No sesgado (predeterminado) para valores estimados no sesgados de estadísticas o muestra para valores de muestra",
  "help": {
    "title": "Descripción de una distribución empírica para datos no censurados",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descripción</b></br>\n\t\t\t\tCalcula parámetros descriptivos de una distribución empírica para datos no censurados y proporciona un gráfico de asimetría-curtosis\n\t\t\t\t<br/>\n\t\t\t\tPara la ayuda detallada - use R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSe imprimen valores mínimos, máximos, mediana, media, desviación estándar de la muestra y estimaciones no sesgadas por defecto de \n\t\t\t\tvalores de asimetría y curtosis de Pearson (Sokal y Rohlf, 1995). Se proporciona un gráfico de asimetría-curtosis como el \n\t\t\t\tpropuesto por Cullen y Frey (1999) para la distribución empírica. En este gráfico, los valores para distribuciones comunes \n\t\t\t\ttambién se muestran como herramientas para ayudar en la elección de distribuciones que se ajusten a los datos. Para algunas \n\t\t\t\tdistribuciones (normal, uniforme, logístico, exponencial por ejemplo), solo hay un valor posible para la asimetría \n\t\t\t\ty la curtosis (por ejemplo, para una distribución normal, asimetría = 0 y curtosis = 3), y la distribución se representa \n\t\t\t\tcomo un punto en el gráfico. Para otras distribuciones, se representan áreas de valores posibles, consistentes en \n\t\t\t\tlíneas (distribuciones gamma y lognormal por ejemplo), o áreas más grandes (distribución beta por ejemplo). \n\t\t\t\tLa distribución de Weibull no se representa en el gráfico, pero se indica en la leyenda que formas cercanas a \n\t\t\t\tdistribuciones lognormal y gamma pueden obtenerse con esta distribución.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara tener en cuenta la incertidumbre de los valores estimados de curtosis y asimetría a partir de los datos, el conjunto de datos \n\t\t\t\tpuede ser bootstraped fijando el argumento boot a un entero mayor a 10. Los valores de boot de asimetría y curtosis \n\t\t\t\tcorrespondientes a las muestras bootstrap se calculan y se informan en color azul en el gráfico de asimetría-curtosis.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSi discreto es VERDADERO, las distribuciones representadas son las distribuciones de Poisson, binomial negativa y la normal \n\t\t\t\tdistribución a la que las distribuciones discretas anteriores pueden converger. Si discreto es FALSO, estas son distribuciones uniforme, normal, \n\t\t\t\tlogística, lognormal, beta y gamma.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Para una buena visión general del ajuste de distribuciones, consulte https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}