{
  "title": "Una visión rápida de la funcionalidad del Diseño de Experimentos (DoE)",
  "navigation": "Resumen de DoE",
  "lbl1": "1. Para crear cualquier Diseño bajo DoE -> menú crear diseño, primero necesitas un conjunto de datos con detalles de factores para crear el diseño a partir de",
  "lbl2": "2. Para comenzar, elige uno de los conjuntos de datos de muestra (archivo de excel) proporcionados en el directorio de conjuntos de datos de muestra en tu directorio de instalación de BioStat Prime o puedes crear una tabla/conjunto de datos de detalles de factores sobre la marcha con DoE -> Crear Detalles de Factores de DoE",
  "lbl3": "3. Una vez que un conjunto de datos esté abierto con el menú de abrir archivo o creado sobre la marcha en el paso 2 anterior, ve bajo DoE -> menú crear diseño para crear un diseño apropiado",
  "lbl4": "4. Después de que un diseño se haya creado con éxito, aparecerá en la cuadrícula de la interfaz de usuario del conjunto de datos. Puedes usar el menú DoE -> Inspeccionar Diseño para inspeccionar el diseño recién creado",
  "lbl5": "5. Vamos a exportar el diseño a un directorio del sistema de archivos con el menú DoE -> Exportar Diseño. Se crearán automáticamente tres archivos (.csv, .rda, .html) con los mismos nombres que el conjunto de datos de diseño en la ruta del directorio de archivos especificada",
  "lbl6": "6. El archivo csv exportado en el paso 5 está destinado a ser utilizado para configurar los experimentos en el mundo real según lo especificado en el diseño para recopilar/grabar resultados para un análisis posterior",
  "lbl7": "7. Los resultados se registran y se añaden como columnas separadas llamadas respuestas en el vocabulario de DoE en el archivo csv. No cambies la extensión del archivo csv a ningún otro formato de archivo. Consulta el directorio de conjuntos de datos de muestra para DoE, ejemplos de archivos csv etiquetados como conresp para obtener los valores de las columnas de resultado/respuesta para copiar y crear columnas de respuesta en tu propio archivo csv que fue exportado como parte de la exportación de diseño en el paso 5 anterior",
  "lbl8": "8. Vamos a importar el archivo de diseño csv con las columnas de respuesta añadidas de nuevo a la aplicación BioStat Prime con el menú DoE -> Importar Respuesta de Diseño",
  "lbl9": "9. Para importar el archivo csv de diseño en el paso 8, el diseño original (que fue exportado) debe estar disponible en la cuadrícula de la interfaz de usuario del conjunto de datos. Si no está disponible, usa el menú de abrir archivo para cargar el archivo .rda de diseño que fue creado como parte de la exportación de diseño en el paso 5",
  "lbl10": "10. Después de que el archivo csv se haya importado con éxito contra el conjunto de datos de diseño correcto/activo y se haya creado un nuevo diseño con las columnas de respuesta, puedes usar el menú DoE -> Inspeccionar Diseño para inspeccionar el diseño con las columnas de respuesta",
  "lbl11": "11. Ahora el diseño con las columnas de respuesta está listo para el análisis con el menú DoE -> Analizar Diseño con varios métodos de análisis, por ejemplo, modelo lineal, modelo de superficie de respuesta, etc."
}