{
  "title": "Una visión general rápida de la funcionalidad del Diseño de Experimentos (DoE)",
  "navigation": "Resumen de DoE",
  "lbl1": "1. Para crear cualquier diseño bajo DoE -> menú crear diseño, primero necesita un conjunto de datos con detalles de factores para crear el diseño.",
  "lbl2": "2. Para comenzar, elija uno de los conjuntos de datos de muestra (archivo de Excel) proporcionados en el directorio de conjuntos de datos de muestra en el directorio de instalación de su aplicación o puede crear una tabla/conjunto de datos de detalles de factores sobre la marcha con el menú DoE -> Crear detalles de factores de DoE.",
  "lbl3": "3. Una vez que se abre un conjunto de datos con el menú abrir archivo o se crea sobre la marcha en el paso 2 anterior, vaya a DoE -> menú crear diseño para crear un diseño apropiado.",
  "lbl4": "4. Después de que se crea un diseño con éxito, aparecerá en la cuadrícula de la interfaz de usuario del conjunto de datos. Puede usar el menú DoE -> Inspeccionar diseño para inspeccionar el diseño recién creado.",
  "lbl5": "5. Exportemos el diseño a un directorio del sistema de archivos con el menú DoE -> Exportar diseño. Se crearán automáticamente tres archivos (.csv, .rda, .html) con los mismos nombres que el conjunto de datos de diseño en la cuadrícula de la interfaz de usuario en la ruta del directorio de archivos especificada.",
  "lbl6": "6. El archivo CSV exportado en el paso 5 está destinado a ser utilizado para configurar los experimentos en el mundo real según lo especificado en el diseño para recopilar/grabar resultados para un análisis posterior.",
  "lbl7": "7. Los resultados se registran y se agregan como columna(s) separada(s) llamadas respuestas en el vocabulario de DoE en el archivo CSV. No cambie la extensión del archivo CSV a ningún otro formato de archivo. Consulte el directorio de conjuntos de datos de muestra para DoE, ejemplos de archivos CSV etiquetados como withresp para obtener los valores de las columnas de resultados/respuestas para copiar y crear columnas de respuesta en su propio archivo CSV que se exportó como parte de la exportación de diseño en el paso 5 anterior.",
  "lbl8": "8. Importemos el archivo de diseño CSV con las columnas de respuesta agregadas de nuevo a la aplicación con el menú DoE -> Importar respuesta de diseño.",
  "lbl9": "9. Para importar el archivo CSV de diseño en el paso 8, el diseño original (que fue exportado) debe estar disponible en la cuadrícula de la interfaz de usuario del conjunto de datos. Si no está disponible, use el menú abrir archivo para cargar el archivo .rda de diseño que se creó como parte de la exportación de diseño en el paso 5.",
  "lbl10": "10. Después de que el archivo CSV se importe correctamente contra el conjunto de datos de diseño activo correcto y se haya creado un nuevo diseño con las columnas de respuesta, puede usar el menú DoE -> Inspeccionar diseño para inspeccionar el diseño con las columnas de respuesta.",
  "lbl11": "11. Ahora el diseño con las columnas de respuesta está listo para el análisis con el menú DoE -> Analizar diseño con varios métodos de análisis, por ejemplo, modelo lineal, modelo de superficie de respuesta, etc."
}