{
  "title": "Igualdad de Varianzas",
  "navigation": "Igualdad de Varianzas",
  "label1": "Elegir pruebas",
  "bartlett": "Prueba de Bartlett",
  "levene": "Prueba de Levene",
  "fligner": "Prueba de Fligner–Killeen",
  "normal_distribution": "Prueba basada en la distribución normal",
  "pairwiseLeveneTest": "Prueba de Levene por pares",
  "label2": "Formato de datos",
  "wide": "Formato ancho",
  "long": "Formato largo",
  "label3": "Nivel de confianza",
  "label4": "Hipótesis alternativa",
  "alt1": "Bidireccional",
  "alt2": "Mayor",
  "alt3": "Menor",
  "label5": "Método de ajuste del valor p (para la prueba de Levene por pares)",
  "padj1": "Holm",
  "padj2": "Hochberg",
  "padj3": "Hommel",
  "padj4": "Bonferroni",
  "padj5": "BH",
  "padj6": "BY",
  "padj7": "FDR",
  "padj8": "Ninguno",
  "help": {
    "title": "Pruebas para la Igualdad de Varianzas",
    "r_help": "help(bartlett.test, package=stats); help(leveneTest, package=car); help(fligner.test, package=stats)",
    "body": "\n<b>Descripción</b></br>\nPruebas la igualdad de varianzas. Soporta datos en los siguientes formatos<br/>\nancho: Cada variable contiene mediciones, por ejemplo, la variable 1 contiene mediciones de la máquina A, la variable 2 contiene mediciones de la máquina B...<br/>\nlargo: Las mediciones en una variable están agrupadas por una o más variables, por ejemplo, las puntuaciones de las pruebas están agrupadas por género y clase. <br/>\nEl método de ajuste del valor p se aplica solo cuando se selecciona la prueba de Levene por pares.<br/>\n<b>Uso</b>\n<br/>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"ancho\" ),<br/>\n    cols_to_compare = c('A','B','C'),<br/>\n    response_col = NULL,<br/>\n    group_col = NULL,<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidireccional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n    Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"ConjuntoDeDatos1\"<br/>\n)<br/>\nBSky_variance_analysis (<br/>\n    data_format = c(\"largo\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Puntuación'),<br/>\n    group_col = c('Género','Clase'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidireccional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"ConjuntoDeDatos2\"<br/>\n)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ndata_format: Puede ser ancho o largo\n</li>\n<li>\ncols_to_compare: Las variables para comparar varianzas cuando el conjunto de datos está en formato ancho, NULL para datos en formato largo\n</li>\n<li>\nresponse_col: La variable de medición para comparar varianzas entre grupos. NULL para datos anchos\n</li>\n<li>\ngroup_col: Una o más variables utilizadas para agrupar la variable de medición, probamos la igualdad de varianzas entre grupos\n</li>\n<li>\nconf_level: Intervalo de confianza\n</li>\n<li>\nalt_hypothesis: Establecer en bidireccional\n</li>\n<li>\np_adjust_method: Método utilizado para ajustar el valor p\n</li>\n<li>\nnormal_distribution: si es VERDADERO, asumimos normalidad\n</li>\n<li>\nFligner_Killeen: si es VERDADERO, realiza una prueba de Fligner_Killeen\n</li>\n<li>\npairwiseComparison: Realizar una prueba de Levene por pares\n</li>\n<li>\ndatasetname: Nombre del conjunto de datos del cual se eligen x, y y capas (variables)\n</li>\n</ul>\n<b>Valor</b></br>\nIntervalos de confianza de Bonferroni para los intervalos de confianza especificados. Resultados de pruebas para pruebas de múltiples comparaciones (cuando no se asume normalidad) y resultados de otras pruebas\n<br/>\n<b>Ejemplo</b></br>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"largo\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Puntuación'),<br/>\n    group_col = c('Género','Clase'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidireccional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"ConjuntoDeDatos2\"<br/>\n)<br/>\n</code> <br/>\n\n<b>Detalles</b></br>\nPrueba de comparaciones múltiples</br>\nUtilizada cuando no seleccionas “Usar prueba basada en la distribución normal” – es decir, prefieres métodos robustos a distribuciones no normales. </br>\nSi tienes k > 2 grupos, calculamos los intervalos para las desviaciones estándar de tal manera que si dos intervalos no se superponen, las desviaciones estándar asociadas son \nsignificativamente diferentes.</br> \nPara k = 2 muestras, utiliza el método de Bonett para probar dos varianzas con una razón hipotetizada = 1. </br>\nCuando la prueba de comparaciones múltiples en general es significativa, las desviaciones estándar que corresponden a los intervalos no superpuestos son estadísticamente diferentes.</br>\nVentajas: Más potente que el método de Levene en muchas situaciones (para distribuciones continuas). Pero cuando los tamaños de muestra son pequeños (< 20) o las distribuciones son \nextremadamente sesgadas/o con colas pesadas, la tasa de error tipo I puede estar inflada.</br>\nValor p para la prueba</br>\nSi hay 2 muestras en el diseño, entonces calculamos el valor p para la prueba de comparaciones múltiples utilizando el método de Bonett para una prueba de 2 varianzas y una razón hipotetizada, Ρo, de 1.</br>\nSi hay k > 2 muestras en el diseño, entonces dejemos que Pij sea el valor p de la prueba para cualquier par (i, j ) de muestras. El valor p para el procedimiento de comparaciones múltiples como una prueba general de igualdad de varianzas se da por lo siguiente:</br>\nP =min{Pij, 1<=i<j<=k}\n</br>\nEstadístico de prueba de Levene</br>\nLa prueba de Levene se utiliza para probar la hipótesis nula de que las varianzas son iguales entre grupos (H₀: todas las varianzas son iguales) frente a la alternativa de que al menos \nuna varianza difiere. </br>\nEs más robusta a las desviaciones de la normalidad en comparación con pruebas que asumen normalidad (por ejemplo, la de Bartlett). </br>\nEspecíficamente, utilizamos la modificación de Brown-Forsythe (desviaciones absolutas de la mediana de la muestra en lugar de la media) para mejorar la robustez. </br>\nInterpretación: Si el valor p < α, rechazas H₀ y concluyes que las varianzas no son iguales. </br>\n</br>\nEstadístico de prueba de Bartlett</br>\nLa prueba de Bartlett está diseñada para probar la igualdad de varianzas cuando los datos están distribuidos normalmente. H₀: todas las varianzas son iguales. Cuando k > 2 grupos,\nutilizamos la prueba de Bartlett (si se selecciona “usar prueba basada en la distribución normal”). </br>\nEl estadístico de prueba (comúnmente denotado B) se basa en comparar la media aritmética ponderada y la media geométrica ponderada de las varianzas de la muestra. </br>\nEl estadístico sigue (aproximadamente) una distribución chi-cuadrado con k-1 grados de libertad. </br>\nDebido a que la prueba de Bartlett asume normalidad, es sensible a las desviaciones de la normalidad (es decir, distribuciones no normales o con colas pesadas pueden llevar a \nresultados engañosos)</br>\n</br>\nEstadístico de prueba F</br>\nCuando hay exactamente dos grupos (k = 2), utilizamos una prueba F en lugar de la de Bartlett (si se selecciona “usar prueba basada en la distribución normal”). </br>\nH₀: las varianzas son iguales (σ₁² = σ₂²). </br>\nEl estadístico F se calcula como la razón de las dos varianzas de muestra (mayor sobre menor). Luego, el valor p depende de la hipótesis alternativa\n (unilateral “menor que” o “mayor que”, o bidireccional). </br>\nInterpretación: Si el valor p < α, rechaza H₀ y concluye que las varianzas difieren. Es válido solo bajo la suposición de normalidad.</br>\n<b>Valor</b><br/>\n\n<b>Paquete</b></br>\nBlueSky</br>\n<b>Ayuda</b></br>\nPor favor contacta support@blueskystatistics.com para información adicional.\n    "
  }
}