{
  "title": "Explorar Conjunto de Datos",
  "navigation": "Explorar Conjunto de Datos",
  "destdatalabel": "Conjunto de Datos a Explorar",
  "htmloutlabel": "Mostrar Salida en una Página Web",
  "standardgraphlabel": "Incluir Gráficas en la Ventana de Salida",
  "maxdistvalueslabel": "Máximo de Valores Distintos",
  "rounddigitslabel": "Dígitos Significativos",
  "help": {
    "title": "Explorar Conjunto de Datos",
    "r_help": "help(dfSummary, package ='summarytools')",
    "body": "\nEsto crea una tabla que describe un conjunto de datos. Las descripciones incluyen el nombre del conjunto de datos, número de observaciones, número de variables, número de registros duplicados, \nnombres de variables, clases de variables, estadísticas resumidas de variables y gráficas. Esta herramienta está destinada más a la exploración y limpieza de datos, en lugar de propósitos de análisis de datos. \nUna versión de texto de la tabla se muestra por defecto, pero una versión html bonita se puede mostrar opcionalmente en el navegador web predeterminado.\n<br/><br/>  \n<b>Conjunto de Datos a Explorar:</b> Conjunto de datos que deseas describir\n<br/><br/>  \n<b>Mostrar Salida en una Página Web:</b> Marca si deseas mostrar una versión bonita de la tabla en el navegador web predeterminado. Esta versión incluirá gráficas.\n<br/><br/>\n<b>Incluir Gráficas en la Ventana de Salida:</b> Marca si deseas incluir versiones de texto de las gráficas en la ventana de salida de BlueSky\n<br/><br/>\n<b>Máximo de Valores Distintos:</b> El número máximo de valores para mostrar frecuencias. Si una variable tiene más valores distintos que este número, las frecuencias restantes se informarán \ncomo una categoría completa, junto con el número de valores distintos adicionales. Para variables de carácter, se muestran los valores más frecuentes, por lo que esto también controla cuántos mostrar en \neso caso. El valor predeterminado es 10.\n<br/><br/>\n<b>Dígitos Significativos:</b> Número de dígitos significativos a mostrar. El valor predeterminado es 2.\n<br/><br/>\n<b>Paquetes R Requeridos:</b> summarytools\n\t\t\t"
  }
}