{
  "exportpro_title": "Exportar la salida activa actual a HTML, DOCX o PDF",
  "exportpro_subtitle": "Por favor, espere después de hacer clic en el botón Exportar. El proceso puede tardar un tiempo dependiendo del tamaño de su salida que está exportando.",
  "exportPro_iconTooltip": "Exportar a HTML, DOCX, PDF",
  "exportpro_pandocHint": "Necesita tener Pandoc instalado por separado. Solo la primera vez necesita proporcionar la ruta ejecutable de Pandoc desde su ruta de instalación de Pandoc.",
  "exportpro_pandocPathLbl": "Ruta de Pandoc:",
  "exportpro_browsePandocPathBtn": "Elegir ruta del archivo Pandoc",
  "exportpro_outputFolderLbl": "Carpeta del documento exportado:",
  "exportpro_browseOutputPathBtn": "Elegir carpeta de exportación",
  "exportpro_outputFilenameLbl": "Ingrese el nombre del archivo exportado (sin extensión de archivo):",
  "exportpro_selExportFormatLbl": "Seleccione el formato de archivo para exportar:",
  "exportpro_HTMLradioLbl": "HTML",
  "exportpro_DOCXradioLbl": "DOCX",
  "exportpro_PDFradioLbl": "PDF",
  "exportpro_ExportBtn": "Exportar",
  "exportpro_CancelBtn": "Cancelar",
  "exportWaitMsg": "La generación de la salida puede tardar un tiempo. Por favor, verifique la carpeta de salida después de un tiempo.",
  "exportMissingFieldsMsg1": "Por favor, complete todos los campos requeridos (marcados con asterisco rojo)",
  "exportMissingFieldsMsg2": "Por favor, verifique si la ruta de Pandoc o la ruta de salida existen",
  "noPandocFoundMsg": "Pandoc no está instalado o la ruta es incorrecta. Por favor, ingrese la ruta correcta de Pandoc donde se encuentra el ejecutable de Pandoc y vuelva a intentarlo.",
  "exportOverwriteTitle": "¿Sobrescribir archivo existente?",
  "exportOverwriteMsg": "El(los) siguiente(s) archivo(s) ya existen. ¿Desea sobrescribir?",
  "exportOverwriteYes": "Sí",
  "exportOverwriteNo": "Cancelar",
  "exportFileLockedTitle": "El archivo está abierto en otra aplicación",
  "exportFileLockedMsg1": "El siguiente archivo está bloqueado",
  "exportFileLockedMsg2": " (posiblemente abierto en otra aplicación)",
  "exportFileLockedMsg3": " Por favor, cierre el archivo e intente nuevamente. O proporcione un nombre diferente para el archivo exportado.",
  "invalidOutputFilenameMsg":"El nombre del archivo de salida no puede contener espacios ni otros caracteres especiales. Por favor, introduzca un nombre de archivo de salida válido que contenga solo caracteres alfanuméricos."


}