{
  "title": "Gráfico de Distribución F",
  "navigation": "Gráfico de Distribución F",
  "dfnumerator": "Grados de libertad del numerador",
  "dfdenominator": "Grados de libertad del denominador",
  "pdenfun": "Graficar función de densidad",
  "pdstfun": "Graficar función de distribución",
  "lblregions": "Especificar opcionalmente regiones bajo la función de densidad por",
  "xvals": "valores de x",
  "quantiles": "cuantiles",
  "lblRegFill": "Regiones a llenar (especificar una o dos, o dejar en blanco)",
  "lblreg1": "Región 1 :",
  "lblreg2": "Región 2 :",
  "lblregfrm": "Desde",
  "lblregto": "Hasta",
  "lblregcol": "Color",
  "lblLegPos": "Posición de la leyenda",
  "toprt": "Arriba derecha",
  "toplt": "Arriba izquierda",
  "topmid": "Arriba centro",
  "help": {
    "title": "Gráfico de Distribución F",
    "r_help": "ayuda(qf, paquete=stats)",
    "body": "\n            ​​\n            <b>Descripción</b>\n            <br/>\n            Densidad, función de distribución, función cuantílica y generación aleatoria para la distribución F con df1 y df2 grados de libertad (y parámetro de no centralidad opcional ncp).\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code>\n                df(x, df1, df2, ncp, log = FALSE)\n                <br/>\n                pf(q, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qf(p, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rf(n, df1, df2, ncp)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumentos</b>\n            <br/>\n            <ul>\n                <li>x, q : vector de cuantiles.</li>\n                \n                \n                <li>p : vector de probabilidades.</li>\n                \n                \n                <li>n : número de observaciones. Si length(n) > 1, se toma la longitud como la cantidad requerida.</li>\n                \n                \n                <li>df1, df2 : grados de libertad. Inf está permitido.</li>\n                \n                \n                <li>ncp : parámetro de no centralidad. Si se omite, se asume la F central.</li>\n                \n                \n                <li>log, log.p : lógico; si es TRUE, las probabilidades p se dan como log(p).</li>\n                \n                \n                <li>lower.tail : lógico; si es TRUE (por defecto), las probabilidades son P[X ≤ x], de lo contrario, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalles</b>\n            <br/>\n            La distribución F con df1 = n1 y df2 = n2 grados de libertad tiene densidad\n            <br/>\n            <code>f(x) = Γ((n1 + n2)/2) / (Γ(n1/2) Γ(n2/2)) (n1/n2)^(n1/2) x^(n1/2 - 1) (1 + (n1/n2) x)^-(n1 + n2)/2</code>\n            <br/>\n            para x > 0.\n            <br/>\n            Es la distribución de la razón de los cuadrados medios de n1 y n2 normales estándar independientes, y por lo tanto de la razón de dos variables chi-cuadradas independientes cada una dividida por sus grados de libertad. Dado que la razón de una normal y la raíz cuadrada media de m normales independientes tiene una distribución t_m de Student, el cuadrado de una variable t_m tiene una distribución F en 1 y m grados de libertad.\n            <br/>\n            La distribución F no central es nuevamente la razón de los cuadrados medios de normales independientes de varianza unitaria, pero aquellos en el numerador pueden tener medias no nulas y ncp es la suma de los cuadrados de las medias. Consulte Chi-cuadrado para más detalles sobre distribuciones no centrales.\n            <br/>\n            <br/><b>Valor</b>\n            <br/>\n            df da la densidad, pf da la función de distribución, qf da la función cuantílica, y rf genera desviaciones aleatorias.\n            <br/>\n            Argumentos inválidos resultarán en un valor de retorno NaN, con una advertencia.\n            <br/>\n            La longitud del resultado está determinada por n para rf, y es el máximo de las longitudes de los argumentos numéricos para las otras funciones.\n            <br/>\n            Los argumentos numéricos distintos de n se reciclan a la longitud del resultado. Solo se utilizan los primeros elementos de los argumentos lógicos.\n            <br/>\n            <br/><b>Nota</b>\n            <br/>\n            Suministrar ncp = 0 utiliza el algoritmo para la distribución no central, que no es el mismo algoritmo utilizado si se omite ncp. Esto es para dar un comportamiento consistente en casos extremos con valores de ncp muy cercanos a cero.\n            <br/>\n            El código para ncp no cero está destinado principalmente a ser utilizado para valores moderados de ncp: no será altamente preciso, especialmente en los extremos, para valores grandes.            \n"
  }
}