{
  "title": "Encontrar duplicados",
  "navigation": "Encontrar duplicados",
  "keysnote": "NOTA: No especificar variables clave resultará en una búsqueda de duplicados de caso completo. Especificar variables clave solo buscará duplicados por valores de variables clave.",
  "keyvarslabel": "Variables clave (opcional)",
  "allduprowschecklabel": "Crear conjunto de datos con todas las filas asociadas a los duplicados",
  "allduprowsnamelabel": "Nombre del conjunto de datos",
  "alldatachecklabel": "Crear conjunto de datos con datos originales y columna que indica duplicados",
  "alldatanamelabel": "Nombre del conjunto de datos",
  "dupvarnamelabel": "Nombre de la variable duplicada",
  "nodupdatachecklabel": "Crear conjunto de datos con todos los duplicados eliminados",
  "nodupdatanamelabel": "Nombre del conjunto de datos",
  "help": {
    "title": "Encontrar duplicados",
    "r_help": "help(duplicated, package = 'base')",
    "body": "\nEste diálogo encontrará duplicados ya sea por casos completos o por variables clave. Los duplicados de casos completos son iguales para cada valor de cada variable. Los duplicados que utilizan variables clave son duplicados definidos solo por valores iguales para variables específicas, llamadas \"claves\". Los duplicados se buscan de arriba a abajo en el conjunto de datos. Por lo tanto, una fila duplicada significa que los valores son iguales a una fila anterior. Se proporcionan resúmenes de los duplicados.\n<br/><br/>\n<b>Variables clave:</b> Especifique variables clave opcionales que definan los duplicados. Si no se seleccionan variables clave, se buscarán duplicados de casos completos.\n<br/><br/>\n<b>Crear conjunto de datos con todas las filas asociadas a los duplicados:</b> Esto creará un conjunto de datos de todas las filas duplicadas y la primera instancia de cada fila correspondiente a cada duplicado. El conjunto de datos de salida se ordenará por todas las variables en el caso de duplicados completos y por las variables clave en el caso de variables clave. Las variables clave también se moverán al principio del conjunto de datos de salida. El campo <b>Nombre del conjunto de datos</b> se puede usar para nombrar este conjunto de datos de salida.\n<br/><br/>\n<b>Crear conjunto de datos con datos originales y columna que indica duplicados:</b> Esto creará un conjunto de datos que incluye todos los datos originales más una columna adicional que indica las filas duplicadas (0=no duplicado, 1=duplicado). El campo <b>Nombre del conjunto de datos</b> se puede usar para nombrar este conjunto de datos de salida. El campo <b>Nombre de la variable duplicada</b> se puede usar para nombrar esta columna adicional.\n<br/><br/>\n<b>Crear conjunto de datos con todos los duplicados eliminados:</b> Esto creará un conjunto de datos que elimina todas las filas duplicadas (ya sea caso completo o por variables clave) donde los duplicados se buscan de arriba a abajo en el conjunto de datos. Esto significa que todas las 2ª, 3ª, etc. instancias de las filas serán eliminadas. El campo </b>Nombre del conjunto de datos</b> se puede usar para nombrar este conjunto de datos de salida.\n<br/><br/>\n<b>Paquetes R requeridos:</b> dplyr, arsenal\n"
  }
}