{
  "title": "Prueba de Friedman",
  "navigation": "Prueba de Friedman",
  "tvarbox1": "Variables de Respuesta, 2 o más",
  "help": {
    "title": "Prueba de Friedman",
    "r_help": "help(friedman.test, package=stats)",
    "body": "\n<b>Descripción</b></br>\nRealiza una prueba de suma de rangos de Friedman con datos bloqueados no replicados.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## Método S3 por defecto:\nfriedman.test(y, groups, blocks, ...)\n## Método S3 para la clase 'formula'\nfriedman.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ny: ya sea un vector numérico de valores de datos, o una matriz de datos.\n</li>\n<li>\ngroups: un vector que da el grupo para los elementos correspondientes de y si este es un vector; ignorado si y es una matriz. Si no es un objeto de factor, se convierte en uno.\n</li>\n<li>\nblocks: un vector que da el bloque para los elementos correspondientes de y si este es un vector; ignorado si y es una matriz. Si no es un objeto de factor, se convierte en uno.\n</li>\n<li>\nformula: una fórmula de la forma a ~ b | c, donde a, b y c dan los valores de datos y los grupos y bloques correspondientes, respectivamente.\n</li>\n<li>\ndata: una matriz o marco de datos opcional (o similar: ver model.frame) que contiene las variables en la fórmula formula. Por defecto, las variables se toman del entorno(formula).\n</li>\n<li>\nsubset: un vector opcional que especifica un subconjunto de observaciones a utilizar.\n</li>\n<li>\nna.action: una función que indica qué debería suceder cuando los datos contienen NAs. Por defecto, se utiliza getOption(\"na.action\").\n</li>\n<li>\n...: argumentos adicionales que se pasarán a o desde métodos.\n</li>\n</ul>\n<b>Detalles</b></br>\nfriedman.test se puede utilizar para analizar diseños de bloques completos no replicados (es decir, hay exactamente una observación en y para cada combinación de niveles de grupos y bloques) donde la suposición de normalidad puede ser violada.</br>\nLa hipótesis nula es que, aparte de un efecto de bloques, el parámetro de ubicación de y es el mismo en cada uno de los grupos.\nSi y es una matriz, los grupos y bloques se obtienen de los índices de columna y fila, respectivamente. No se permiten NA en grupos o bloques; si y contiene NA, se eliminan los bloques correspondientes.</br>\n<b>Valor</b><br/>\nUna lista con clase \"htest\" que contiene los siguientes componentes:<br/>\nstatistic: el valor de la estadística chi-cuadrado de Friedman.<br/>\nparameter: los grados de libertad de la distribución chi-cuadrado aproximada de la estadística de prueba.<br/>\np.value: el valor p de la prueba.<br/>\nmethod: la cadena de caracteres \"Prueba de suma de rangos de Friedman\".<br/>\ndata.name: una cadena de caracteres que da los nombres de los datos.​<br/>\n<b>Ejemplos</b><br/>\n<code> \nDataframe <- data.frame(Expenses=c(20,23,19,25,26), Sales=c(48,50,55,51,49), Gender=c('m','f','f','m','m'), Deptt=c('Cuentas', 'RRHH', 'Ventas','Marketing','TI'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Sales,Expenses)))<br/>\nResult_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nhelp(friedman.test, package=stats)\n"
  }
}