{
  "title": "Mapa de Calor",
  "navigation": "Mapa de Calor",
  "rowVariables": "Variable objetivo",
  "columnVariables": "Variables de columna",
  "options": "Opciones",
  "title1": "Título del Mapa de Calor",
  "dendrogram": "Dendograma:",
  "label1": "Opciones de dendrograma de fila:",
  "plotRowYes": "Reordenar dendrograma basado en las medias de fila",
  "plotRowNo": "Sin reordenamiento (el dendrograma no se calculará)",
  "label2": "Opciones de dendrograma de columna",
  "plotColumnYes": "Reordenar dendrograma basado en las medias de columna",
  "plotColumnNo": "No",
  "symmetric": "En el caso de matriz simétrica, tratar columnas como filas",
  "trace": "Opciones para dibujar línea de traza sólida a través de filas, columnas, ambas o ninguna",
  "density": "Opciones de densidad:",
  "scale": "Los valores deben estar centrados en la dirección de la fila, dirección de la columna o ninguno",
  "label3": "Valores faltantes",
  "Remove": "Eliminar todas las filas que contienen un valor faltante",
  "Keep": "Mantener filas que contienen valores faltantes",
  "label4": "Colocar valores en la celda",
  "valuesNo": "Sí",
  "valuesYes": "No",
  "noteColors": "Elige un color para los valores de las celdas (Después de seleccionar el color, haz clic fuera del control para aplicar):",
  "help": {
    "title": "Mapa de Calor",
    "r_help": "help(heatmap.2,package='gplots')",
    "body": "\n            <b>Descripción</b></br>\n            Un mapa de calor es una representación gráfica de datos donde los valores individuales contenidos en una matriz se representan como colores. Se pueden crear facetas opcionalmente especificando una variable de factor. También puedes especificar temas, y especificar un título y etiquetas para los ejes x e y</br>\n            El conjunto de datos debe estar en el formato columna1, columna2…columnaN donde</br>\n            columna1: Identifica los sujetos, por ejemplo, nombres de personas cuyos valores de colesterol se grafican</br>\n            columna2: Identifica los valores de colesterol en el tiempo 1</br>\n            columna3: Identifica los valores de colesterol en el tiempo 2</br>\n            columna4: Identifica los valores de colesterol en el tiempo 3</br>\n            columna5: Identifica los valores de colesterol en el tiempo 4…</br>\n            La columna1 es una etiqueta para cada fila en el mapa de calor.</br>\n            Para la columna 2 en adelante, los valores en cada fila de la columna se representan como colores en el mapa de calor.</br>\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            BSkyHeatMap(rowVariable=c('Sujeto'),colVariables=c('chol1','chol2','chol3','chol4'),Colv=FALSE,Rowv=TRUE,dendrogram=c(\"fila\"),scale=c(\"ninguno\"),trace=c(\"ninguno\"),density.info=c(\"ninguno\"),na.rm=TRUE,noteForCells =FALSE,notecol =c(\"negro\"),dataset=\"Conjunto de Datos4\")<br/>\n            La función anterior está en el paquete BlueSky e invoca la función heatmap.2 en el paquete gplots.\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            data: El conjunto de datos predeterminado\n            </li>\n            <li>\n            rowVariable: La variable de columna que contiene información sobre los sujetos para los que se construye el gráfico, ver arriba\n            </li>\n            <li>\n            colVariables:  una lista de variables de columna que contienen valores que se representarán como colores en el mapa de calor\n            </li>\n            <li>\n            Colv: determina si y cómo se debe reordenar el dendrograma de columna. Tiene las opciones como el argumento Rowv anterior y adicionalmente cuando x es una matriz cuadrada, Colv=\"Rowv\" significa que las columnas deben ser tratadas de manera idéntica a las filas.\n            </li>\n            <li>\n            Rowv:   determina si y cómo se debe reordenar el dendrograma de fila. Por defecto, es TRUE, lo que implica que se calcula y reordena el dendrograma basado en las medias de fila. Si es NULL o FALSE, entonces no se calcula ningún dendrograma y no se realiza ningún reordenamiento. Si es un dendrograma, entonces se usa \"tal cual\", es decir, sin ningún reordenamiento. Si es un vector de enteros, entonces se calcula y reordena el dendrograma basado en el orden del vector.\n            </li>\n            <li>\n            na.rm: lógico que determina si se deben eliminar los NA’s\n            </li>\n            <li>\n            dendrogram: cadena de caracteres que indica si se deben dibujar dendrogramas 'ninguno', 'fila', 'columna' o 'ambos'. Por defecto es 'ambos'. Sin embargo, si Rowv (o Colv) es FALSE o NULL y el dendrograma es 'ambos', entonces se emite una advertencia y se honran los argumentos Rowv (o Colv).\n            </li>\n            <li>\n            scale: carácter que indica si los valores deben estar centrados y escalados en la dirección de la fila o la dirección de la columna, o ninguno. El valor predeterminado es \"ninguno\".\n            </li>\n            <li>\n            trace: carácter que indica si los valores deben estar centrados y escalados en la dirección de la fila o la dirección de la columna, o ninguno. El valor predeterminado es \"ninguno\".\n            </li>\n            <li>\n            density.info: cadena de caracteres que indica si se debe superponer un 'histograma', un gráfico de 'densidad', o ningún gráfico ('ninguno') en la clave de color.\n            </li>\n            <li>\n            noteForCells: lógico que indica si los valores deben colocarse en las celdas del mapa de calor.\n            </li>\n            <li>\n            notecol: color de las notas. Si se especifica, los valores se anotan en las celdas del mapa de calor en el color especificado..\n            </li>\n            </ul>\n            <b>Paquete</b></br>\n            BlueSky;gplots;</br>\n            <b>Ayuda</b></br>\n            help(heatmap.2,package='gplots')</br>\n            Otro: Haz clic en el botón de Ayuda de R para obtener ayuda detallada de R. También puedes ingresar help(labs), help(geom_histogram), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)</br>\n            Conjuntos de Datos de Muestra: Ver Heatmaps.Rdata en la carpeta de Conjuntos de Datos de Muestra de R</br>\n     "
  }
}