{
  "title": "Histograma con curvas normales superpuestas por faceta y grupo",
  "navigation": "Histograma",
  "x": "Eje X, especifique una(s) variable(s) numérica(s)",
  "bins": "Especifique el número de bins",
  "fill": "Especifique una variable de agrupación (categoría)",
  "binwidth": "Ancho del bin",
  "barcolor": "Seleccione opcionalmente un color de relleno (Después de seleccionar el color, haga clic fuera del control para aplicar)",
  "alpha": "Opacidad (0-1)",
  "flip": "Invertir eje",
  "specify_a_title": "Ingrese un título",
  "x_title": "Etiqueta del eje X",
  "y_title": "Etiqueta del eje Y",
  "Facetrow": "Fila de facetas",
  "Facetcolumn": "Columna de facetas",
  "Facetwrap": "Envoltura de facetas (si se elige, se ignorará cualquier selección de fila y columna de facetas)",
  "Facetscale": "Escala de facetas",
  "normalCurveColor": "Seleccione opcionalmente un color para la curva normal (Después de seleccionar el color, haga clic fuera del control para aplicar)",
  "rugPlot": "Mostrar un gráfico de alfombra (adecuado para conjuntos de datos pequeños)",
  "normalCurve": "Mostrar una curva normal (los valores faltantes se eliminan para que la curva se muestre)",
  "help": {
    "title": "Histograma",
    "r_help": "help(geom_histogram, package=ggplot2)",
    "body": "\n            <b>Descripción</b></br>\n            Un histograma es una representación gráfica de la distribución de datos numéricos. Es una estimación de la distribución de probabilidad de una variable continua (variable cuantitativa). Puede especificar un ancho de bin o usar el ancho predeterminado, vea a continuación. Las facetas se pueden crear opcionalmente especificando una variable de factor. También puede especificar temas opcionalmente y especificar un título y etiquetas para los ejes x e y.</br>\n            Cuando tiene múltiples variables seleccionadas para la variable del eje X, creamos un histograma separado para cada variable del eje X. Opcionalmente superponemos una curva normal y un gráfico de alfombra.</br>\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Counts\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            data: El conjunto de datos predeterminado​\n            </li>\n            <li>\n            aes(): Genera asignaciones estéticas que describen cómo las variables en los datos se asignan a propiedades visuales (estéticas) de geoms.​\n            </li>\n            <li>\n            x: Una variable numérica/escala para trazar el histograma.​\n            </li>\n            <li>\n            geom_histogram: Crea un histograma, por defecto, stat_bin usa 30 bins - este no es un buen valor predeterminado, pero la idea es que experimente con diferentes anchos de bin..\n            </li>\n            <li>\n            geom_rug: Crea un gráfico de alfombra    \n            </li>\n            <li>\n            stat_function: Crea una curva normal (Nota: se deben eliminar los valores faltantes para que la curva se muestre)    \n            </li>\n            <li>\n            Labs(): Cambia las etiquetas de los ejes y los títulos de la leyenda (esto es opcional)​\n            </li>\n            <li>\n            facet_grid(): Dispone los paneles en una cuadrícula (esto es opcional)​\n            </li>\n            <li>\n            theme_calc(): Especifica el tema de la calculadora (esto es opcional)​\n            </li>\n            <li>\n            coord_flip(): Invertir eje (esto es opcional)\n            </li>\n            <li>\n            alpha: Toma un valor entre 0-1, 1 significa ninguna opacidad. La opacidad se aplica al color de relleno del histograma\n            </li>\n            </ul>\n            <b>Paquete</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Ayuda</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Haga clic en el botón de ayuda de R para obtener ayuda detallada de R. También puede ingresar help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n           "
  }
}