{
  "title": "Distribución hipergeométrica",
  "navigation": "Distribución hipergeométrica",
  "m": "m (número de bolas blancas en la urna)",
  "n": "n (número de bolas negras en la urna)",
  "k": "k (número de bolas extraídas de la urna)",
  "labelSig": "Nivel de significancia",
  "plotProb": "Graficar la función de masa de probabilidad",
  "plotDistr": "Graficar la función de distribución",
  "help": {
    "title": "Distribución hipergeométrica",
    "r_help": "ayuda(qhyper, paquete=stats)",
    "body": "\n\n            <b>Descripción</b>\n            <br/>\n            Densidad, función de distribución, función cuantil y generación aleatoria para la distribución hipergeométrica.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code>\n                dhyper(x, m, n, k, log = FALSE)\n                <br/>\n                phyper(q, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qhyper(p, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rhyper(nn, m, n, k)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumentos</b>\n            <br/>\n            <ul>\n                <li>x, q : vector de cuantiles que representan el número de bolas blancas extraídas sin reemplazo de una urna que contiene tanto bolas negras como blancas.</li>\n                \n                \n                <li>m : el número de bolas blancas en la urna.</li>\n                \n                \n                <li>n : el número de bolas negras en la urna.</li>\n                \n                \n                <li>k : el número de bolas extraídas de la urna.</li>\n                \n                \n                <li>p : probabilidad, debe estar entre 0 y 1.</li>\n                \n                \n                <li>nn : número de observaciones. Si la longitud(nn) > 1, se considera que la longitud es el número requerido.</li>\n                \n                \n                <li>log, log.p : lógico; si TRUE, las probabilidades p se dan como log(p).</li>\n                \n                \n                <li>lower.tail : lógico; si TRUE (por defecto), las probabilidades son P[X ≤ x], de lo contrario, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalles</b>\n            <br/>\n            La distribución hipergeométrica se utiliza para el muestreo sin reemplazo. La densidad de esta distribución con parámetros m, n y k (denominados Np, N-Np y n, respectivamente en la referencia a continuación) se da por\n            <br/>\n            <code>\n                p(x) = choose(m, x) choose(n, k-x) / choose(m+n, k)\n                para x = 0, …, k.\n            </code>\n            <br/>\n            Tenga en cuenta que p(x) es diferente de cero solo para max(0, k-n) <= x <= min(k, m).\n            <br/>\n            Con p := m/(m+n) (por lo tanto, Np = N \times p en la notación de la referencia), los dos primeros momentos son la media\n            <br/>\n            <code>E[X] = μ = k p</code>\n            <br/>\n            y la varianza\n            <br/>\n            <code>Var(X) = k p (1 - p) * (m+n-k)/(m+n-1),</code>\n            <br/>\n            lo que muestra la cercanía a la Binomial(k,p) (donde la hipergeométrica tiene menor varianza a menos que k = 1).\n            <br/>\n            El cuantil se define como el valor más pequeño x tal que F(x) ≥ p, donde F es la función de distribución.\n            <br/>\n            Si uno de m, n, k, excede .Machine$integer.max, actualmente se utiliza el equivalente de qhyper(runif(nn), m,n,k), cuando una aproximación binomial puede ser considerablemente más eficiente.\n            <br/>\n            <br/><b>Valor</b>\n            <br/>\n            dhyper da la densidad, phyper da la función de distribución, qhyper da la función cuantil, y rhyper genera variables aleatorias.\n            <br/>\n            Argumentos inválidos darán como resultado un valor de retorno NaN, con una advertencia.\n            <br/>\n            La longitud del resultado está determinada por n para rhyper, y es el máximo de las longitudes de los argumentos numéricos para las otras funciones.\n            <br/>\n            Los argumentos numéricos distintos de n se reciclan a la longitud del resultado. Solo se utilizan los primeros elementos de los argumentos lógicos.            \n      "
  }
}