{
  "title": "Instalar paquete(s) de R",
  "navigation": "Instalar paquete(s) de R",
  "package_name": "Por favor, ingrese el nombre(s) de uno o más paquete(s) separados por comas",
  "instruction_text": "\nNOTA: Los nombres de los paquetes de R son sensibles a mayúsculas y minúsculas. Puede instalar múltiples nombres de paquetes utilizando , como separador\nEjemplo 1: foreign\nEjemplo 2: foreign, car, MASS",
  "instruction_text1": "\nNOTA: Debe tener acceso de escritura a la ruta seleccionada a continuación, de lo contrario, reinicie la aplicación seleccionando la opción ejecutar como \nadministrador",
  "repository": "Ingrese la URL del repositorio CRAN, el predeterminado https://cloud.r-project.org/ instala desde el espejo CRAN más cercano a usted.",
  "label1": "Ejemplo 1: foreign",
  "label2": "NOTA: El logo de R que se muestra en la barra de menú es propiedad de derechos de autor de la fundación R",
  "installPath": "Seleccione la ruta de la biblioteca R donde se instalará el paquete R",
  "help": {
    "title": "Instalar paquete(s) de R",
    "r_help": "help(install.packages)",
    "body": "\n            <b>Descripción</b></br>\n            Instalar o actualizar uno o más paquetes de R en la ruta de biblioteca seleccionada.</br>\n            NOTA:</br>\n            1. Instalaremos todos los paquetes de los que dependen, importan o se vinculan los paquetes especificados.</br>\n            2. Si está actualizando un paquete existente, debe reiniciar la aplicación BioStat Prime.</br>\n            3. Cargaremos el paquete recién instalado/actualizado después de la instalación.</br>\n            4. Por defecto, siempre instalaremos en la biblioteca personal de R del usuario en la máquina local.</br>\n            5. Si el mismo paquete de R está instalado en la ubicación de la biblioteca personal y del sistema (La ubicación de la biblioteca del sistema es la ubicación de instalación predeterminada que contiene los paquetes \n                que enviamos listos para usar con BioStat Prime), cargamos el paquete desde la ubicación personal.</br>\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Ruta a la biblioteca del usuario o del sistema\", repos = \"Ruta al repositorio que contiene el paquete\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            pkgs: vector de caracteres de los nombres de los paquetes cuyas versiones actuales deben descargarse del repositorio especificado.\n            </li>\n            <li>\n            lib: vector de caracteres que da la ruta de la biblioteca en la máquina local donde se instalarán el(los) paquete(s). Siempre predeterminamos a la ubicación de la biblioteca personal del usuario.\n            </li>\n            <li>\n            repos: vector de caracteres, la(s) URL(s) base de los repositorios a utilizar, por ejemplo, la URL de un espejo CRAN como \"https://cloud.r-project.org\".\n            </li>\n            <li>\n            BSkypackageinstall: Esta es una bandera que la aplicación BioStat Prime utiliza internamente para señalar que \n            el paquete se instala a través del menú y para pasarlo.\n            </li>\n            </ul>\n            <b>Valor</b><br/>\n            NULL invisible.<br/>\n            <b>Ejemplos</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Paquete</b></br>\n            broom</br>\n            <b>Ayuda</b></br>\n            Para ayuda detallada, haga clic en el ícono de R en la parte superior derecha de este diálogo."
  }
}