{
  "title": "Construir un modelo ajustado con validación cruzada k-Fold",
  "navigation": "Validación Cruzada K-Fold",
  "modelname": "Ingrese el nombre del modelo ajustado",
  "folds": "Ingrese el número de pliegues",
  "dependent": "Variable a predecir",
  "levelOfInterest": "Cuando la variable a predecir tiene 2 niveles, especifique el nivel de interés. La matriz de confusión y las estadísticas relacionadas se muestran con el nivel de interés especificado como referencia",
  "independent": "Variables independientes",
  "label1": "ALGUNOS MODELOS OBJETAN A VALORES FALTANTES O VARIABLES DEPENDIENTES QUE SON FACTORES. PARA MANEJAR VALORES FALTANTES, VEA [ VARIABLES > VALORES FALTANTES ] Y PARA CODIFICACIÓN DUMMY DE VARIABLES FACTOR, VEA [ VARIABLES > COMPUTAR > CODIFICAR DUMMY ]. Haga clic en el icono de ? en la esquina superior derecha del diálogo para más detalles.",
  "ModelSelection": "Seleccione una categoría de modelo y luego el tipo de modelo",
  "help": {
    "title": "Construir un modelo ajustado con validación cruzada k-Fold",
    "r_help": "help(train, package=caret)",
    "body": "\n<b>Descripción</b></br>\nLa validación cruzada k-Fold utiliza las funciones trainControl y train dentro del paquete caret para crear un modelo ajustado/optimizado.<br/>\nUn modelo ajustado se construye mediante la re-muestreo de resultados a través de parámetros de ajuste. Los resultados del ajuste se muestran debajo de las tablas al final de la salida<br/>\nUna vez que se construye el modelo ajustado, hacemos predicciones utilizando el modelo ajustado contra el conjunto de datos de entrenamiento (utilizado para construir el modelo) y mostramos la matriz de confusión y las estadísticas relacionadas.<br/>\nNOTA: vea la URL en https://www.blueskystatistics.com/Articles.asp?ID=330 para detalles sobre modelos que requieren que las variables dependientes sean codificadas como dummy y los requisitos correspondientes para las variables dependientes soportadas. Además, algunos modelos no soportan valores faltantes, si hay errores mostrados al construir el modelo, elimine los valores faltantes.<br/>\nEl modelo ajustado se almacena en el objeto de clase train con un nombre que usted especificó en el control de cuadro de texto.<br/>\nLos valores de parámetro seleccionados para el modelo ajustado final se muestran al final en la salida.<br/>\nEn el caso de predictores con 2 niveles, tiene la opción de seleccionar el nivel de referencia/nivel de interés.<br/>\nLa matriz de confusión y las estadísticas relacionadas se crean utilizando el nivel de interés especificado.<br/>\n<code> \ntrain_control <- caret::trainControl(method = \"cv\", number = Ingrese el número de pliegues)<br/>\n#Sintaxis general<br/>\ntunedModel <- caret::train(x = datos de muestra para entrenar el modelo, y = variable dependiente, trControl = train_control, method = \"el modelo a usar\", prob.model = TRUE )<br/>\n#Sintaxis de ejemplo poblada<br/>\ntunedModel <- caret::train(as.data.frame(TrainData), variableDependiente, trControl = train_control, method = \"adaboost\", preProcess = NULL, prob.model = TRUE )<br/>\n</code>\nGeneramos una matriz de confusión y estadísticas de precisión del modelo para el modelo ajustado. Esto se hace de la siguiente manera\n<ul>\n<li>\nGeneramos valores predichos del conjunto de datos de entrenamiento llamando a la función predict en el modelo optimizado de clase train (Internamente predict.train es la función en el paquete caret que R llama)<br/>\n<code> \nvaloresPredichos = predict(modeloAjustado devuelto por la función train)<br/>\n</code> <br/>\n</li>\n<li>\nCalculamos las estadísticas de precisión de la matriz de confusión generada como se muestra a continuación<br/>\n<code> \ncaret::confusionMatrix (predicciones = valoresPredichos, referencia = variable dependiente del modelo)<br/>\n</code> \n</li>\n</ul>\nPuede usar el modelo ajustado/optimizado final para puntuar un conjunto de datos. Para hacerlo, siga los pasos a continuación<br/>\n1.  Vaya al conjunto de datos que desea puntuar. Nota: Los nombres de las variables en el conjunto de datos a puntuar (también conocidas como variables independientes) deben coincidir con los nombres de las variables que utilizó en el conjunto de datos para crear originalmente el modelo ajustado. Si no, se mostrará un error. Este mensaje de error se mostrará en la sección de pruebas diagnósticas en el diálogo de puntuación del modelo, vea el punto 2 a continuación. <br/>\n2.\tAbra el diálogo de puntuación del modelo en Evaluación del Modelo>Predecir>Puntuación del Modelo. <br/>\n3.\tSeleccione un modelo que desea usar para puntuar el conjunto de datos. Puede filtrar los modelos que construyó por clase. <br/>\n4.\tUna vez que haya seleccionado el modelo, especifique un prefijo para usar para almacenar los valores predichos. Puede opcionalmente guardar intervalos de confianza para las predicciones y generar una matriz de confusión. Debe especificar un prefijo para la variable que contiene las predicciones/puntuaciones. Las predicciones y las probabilidades predichas, donde sea aplicable, se almacenan como nuevas variables al final del conjunto de datos. Por ejemplo, si el prefijo especificado es AA, las predicciones se almacenan en una variable AA_nombre de variable dependiente_original_Predicciones, las probabilidades predichas se almacenan en una variable AA_Nivel1_ProbabilidadesPredichas. <br/>\n5.  Haga clic en el botón Ejecutar para puntuar el conjunto de datos. <br/>\n<b>Paquete</b></br>\ncaret</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el icono de R en la esquina superior derecha de este diálogo o ejecute el siguiente comando help(train, package ='caret') en la ventana del editor de R\n"
  }
}