{
  "title": "Prueba de suma de rangos de Kruskal-Wallis",
  "navigation": "Prueba de Kruskal-Wallis",
  "tvarbox1": "Variable de respuesta",
  "tvarbox2": "Variable de factor",
  "label1": "Método de estimación",
  "default": "Asintótico",
  "exact": "Exacto NOTA: la variable de factor debe tener exactamente 2 niveles o de lo contrario se mostrará un error",
  "normal": "Monte Carlo",
  "header": "NOTA: Al seleccionar el método de estimación exacto, la variable de factor debe tener exactamente 2 niveles, de lo contrario se mostrará un error",
  "padjust": "Ajuste de comparación múltiple",
  "ties": "Opciones para manejar empates",
  "simulations": "Ingrese el número de simulaciones",
  "help": {
    "title": "Prueba de suma de rangos de Kruskal-Wallis",
    "r_help": "help(kruskal.test, package=stats)",
    "body": "\n<b>Descripción</b></br>\nRealiza una prueba de suma de rangos de Kruskal-Wallis.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nkruskal.test(x, ...)\n## Método S3 predeterminado:\nkruskal.test(x, g, ...)\n## Método S3 para la clase 'formula'\nkruskal.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nArgumentos\nx: un vector numérico de valores de datos, o una lista de vectores de datos numéricos. Los elementos no numéricos de una lista serán convertidos, con una advertencia.\n</li>\n<li>\ng: un vector u objeto de factor que da el grupo para los elementos correspondientes de x. Ignorado con una advertencia si x es una lista.\n</li>\n<li>\nformula: una fórmula de la forma respuesta ~ grupo donde respuesta da los valores de datos y grupo un vector o factor de los grupos correspondientes.\n</li>\n<li>\ndata: una matriz o marco de datos opcional (o similar: ver model.frame) que contiene las variables en la fórmula formula. Por defecto, las variables se toman del entorno(formula).\n</li>\n<li>\nsubset: un vector opcional que especifica un subconjunto de observaciones a utilizar.\n</li>\n<li>\nna.action: una función que indica qué debería suceder cuando los datos contienen NAs. Por defecto es getOption(\"na.action\").\n</li>\n<li>\n...: argumentos adicionales que se pasarán a o desde métodos.\n</li>\n</ul>\n<b>Detalles</b></br>\nkruskal.test realiza una prueba de suma de rangos de Kruskal-Wallis de la hipótesis nula de que los parámetros de localización de la distribución de x son los mismos en cada grupo (muestra). La alternativa es que difieren en al menos uno.</br>\nSi x es una lista, sus elementos se toman como las muestras a comparar, y por lo tanto deben ser vectores de datos numéricos. En este caso, g se ignora, y se puede simplemente usar kruskal.test(x) para realizar la prueba. Si las muestras aún no están contenidas en una lista, use kruskal.test(list(x, ...)).</br>\nDe lo contrario, x debe ser un vector de datos numéricos, y g debe ser un vector u objeto de factor de la misma longitud que x que da el grupo para los elementos correspondientes de x.</br>\n<b>Valor</b><br/>\nUna lista con clase \"htest\" que contiene los siguientes componentes:<br/>\nstatistic: la estadística de suma de rangos de Kruskal-Wallis<br/>\nparameter: los grados de libertad de la distribución chi-cuadrada aproximada de la estadística de prueba<br/>\np.value: el valor p de la prueba<br/>\nmethod: la cadena de caracteres \"prueba de suma de rangos de Kruskal-Wallis\"<br/>\ndata.name: una cadena de caracteres que da los nombres de los datos<br/>\n<b>Descripción</b></br>\nAjuste de comparación múltiple</br>\nLos métodos de ajuste incluyen la corrección de Bonferroni (\"bonferroni\") en la que los valores p se multiplican por el número de comparaciones. También se incluyen correcciones menos conservadoras de Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), Hommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" o su alias \"fdr\"), y Benjamini & Yekutieli (2001) (\"BY\"), respectivamente. También se incluye una opción de paso (\"none\"). El conjunto de métodos se contiene en el vector p.adjust.methods para el beneficio de los métodos que necesitan tener el método como una opción y pasarlo a p.adjust.</br>\nLos primeros cuatro métodos están diseñados para dar un control fuerte de la tasa de error familiar. No parece haber razón para usar la corrección de Bonferroni no modificada porque está dominada por el método de Holm, que también es válido bajo suposiciones arbitrarias.</br>\nLos métodos de Hochberg y Hommel son válidos cuando las pruebas de hipótesis son independientes o cuando están asociadas no negativamente (Sarkar, 1998; Sarkar y Chang, 1997). El método de Hommel es más poderoso que el de Hochberg, pero la diferencia suele ser pequeña y los valores p de Hochberg son más rápidos de calcular.</br>\nEl método \"BH\" (también conocido como \"fdr\") y el método \"BY\" de Benjamini, Hochberg y Yekutieli controlan la tasa de descubrimiento falso, la proporción esperada de descubrimientos falsos entre las hipótesis rechazadas. La tasa de descubrimiento falso es una condición menos estricta que la tasa de error familiar, por lo que estos métodos son más poderosos que los demás.</br>\n</br>\nMétodo de prueba para comparaciones grupales por pares:</br>\nPredeterminado: se calcula un valor p exacto si las muestras contienen menos de 50 valores finitos y no hay empates. De lo contrario, se utiliza una aproximación normal.</br>\nExacto: se calcula un valor p exacto; no se recomienda para tamaños de muestra grandes debido al tiempo de cálculo</br>\nAproximación normal: se calculan valores p utilizando una aproximación normal</br>\nCon corrección de continuidad: se calculan valores p utilizando una aproximación normal con una corrección de continuidad </br>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nhelp(kruskal.test, package=stats)\n"
  }
}