{
  "title": "Razones de Verosimilitud y Betas de Gráfico",
  "navigation": "Razones de Verosimilitud y Betas de Gráfico",
  "label1": "Selecciona un modelo (se admiten modelos de clase Rm, dRm y eRm)",
  "label1b": "Si no hay modelos disponibles, primero debes crear un modelo seleccionando Ajuste de Modelo -> IRT -> Modelo Rasch Simple y elegir la estimación CML",
  "modelselector1": "Selecciona un modelo",
  "spcr": "Criterios de división",
  "destination": "Selecciona variables para graficar betas",
  "help": {
    "title": "Razones de Verosimilitud y Betas de Gráfico",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>Descripción</b></br>\n                Esta prueba LR se basa en la división de subgrupos de sujetos.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \n## Método S3 para la clase 'Rm'\n<br/>\nLRtest(object, splitcr = \"mediana\", se = TRUE)\n<br/>\n## Método S3 para la clase 'LR'\n<br/>\nplotGOF(x, beta.subset = \"todos\", main = \"Verificación Gráfica del Modelo\", xlab, ylab,\n    tlab = \"ítem\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: Objeto de la clase \"Rm\".\n</li>\n<li>\nsplitcr: Criterio de división para la puntuación bruta del sujeto. \"all.r\" corresponde a una división completa de la puntuación bruta, \"mediana\" utiliza la mediana como criterio de división, \"media\" realiza una división media. Opcionalmente, splitcr también puede ser un vector que asigna a cada persona a un cierto subgrupo (por ejemplo, siguiendo un criterio externo). Este vector puede ser numérico, carácter o un factor.\n</li>\n<li>\nse: controla el cálculo de errores estándar en los submodelos (predeterminado: TRUE)\n</li>\n<li>\nx: Objeto de la clase \"LR\". También se utiliza para visualizar el ajuste de elementos individuales.\n</li>\n<li>\nbeta.subset: Si \"todos\", se grafican todos los ítems. De lo contrario, se puede especificar un vector de subconjunto numérico.\n</li>\n<li>\ntlab: Especificación de etiquetas de ítems: \"ítem\" imprime los nombres de los ítems, \"número\" da enteros correspondientes al orden de los parámetros beta, si \"ninguno\" no se imprimen etiquetas. \"identificar\" permite una etiquetado interactivo. Inicialmente no se imprimen etiquetas, después de hacer clic cerca de un punto de ítem, se agrega la etiqueta correspondiente. El proceso de identificación se termina haciendo clic en el segundo botón y seleccionando 'Detener' en el menú, o desde el menú 'Detener' en la ventana gráfica. Para más información y operación básica, consulta identificar.\n</li>\n<li>\nconf: para graficar elipses de confianza para los parámetros de ítem. Si conf = NULL (el predeterminado) no se dibujan elipses. De lo contrario, conf debe especificarse como una lista con elementos opcionales: gamma, es el nivel de confianza (numérico), col y lty, color y tipo de línea (ver par), que (vector de índice numérico) especifica para qué ítems se dibujan elipses (debe ser un subconjunto de beta.subset), y ia, lógico, si las elipses deben dibujarse interactivamente (cf., tlab = \"identificar\" arriba). Para detalles sobre el comportamiento predeterminado, si conf se especifica como una lista vacía, consulta Detalles y Ejemplos a continuación. Para usar conf, el objeto LR x debe generarse utilizando la opción se = TRUE en LRtest(). Consulta help(MLoef) para más detalles.\n</li>\n</ul>\n<b>Detalles</b></br>\nSi el conjunto de datos contiene valores faltantes y se especifica media o mediana como criterio de división, se calculan medias o medianas para cada subgrupo de valores faltantes y, en consecuencia, se utilizan para la división de puntuaciones brutas.\n<br/>\nAl usar selección interactiva tanto para etiquetar puntos individuales (tlab = \"identificar\" y dibujar elipses de confianza en ciertos puntos (ia = TRUE), primero se etiquetan todos los puntos graficados y después se generan todas las elipses. Ambos procesos de identificación pueden terminarse haciendo clic en el segundo (derecho) botón del mouse y seleccionando 'Detener' en el menú, o desde el menú 'Detener' en la ventana gráfica.\n<br/>\nUsando la especificación que permite dibujar elipses selectivamente para ciertos ítems solamente, por ejemplo, which = 1:3 dibuja elipses para los ítems 1 a 3 (siempre que estén incluidos en beta.subset). El predeterminado es dibujar elipses para todos los ítems. El elemento col en la lista conf puede ser una especificación de color única como \"azul\" o un vector con especificaciones de color para todos los ítems. La longitud debe ser la misma que el número de elipses a dibujar. Para la especificación de color, se puede configurar una paleta utilizando paletas estándar (por ejemplo, arcoíris) o paletas del paquete colorspace o RColorBrewer. Se da un ejemplo a continuación.\n<br/>\nLos métodos de resumen e impresión están disponibles para objetos de la clase LR.\n<br/><br/>\n<b>Valor</b><br/>\nLRtest devuelve un objeto de la clase LR que contiene:\n<br/><br/>\nLR: valor LR.\n<br/>\ndf: Grados de libertad de la estadística de prueba.\n<br/>\nChisq: valor de Chi-cuadrado con df correspondiente.\n<br/>\n<br/>\n<b>Paquete</b></br>\neRm\n<br/><br/>\n<b>Ayuda</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}