{
  "title": "Cargar modelos desde un archivo",
  "navigation": "Cargar modelos",
  "filterModels": "Filtrar modelos por clase",
  "modelSelection": "Seleccionar un modelo para guardar",
  "importResp": "Seleccionar un archivo para cargar modelos",
  "label1": "Todos los modelos en el archivo especificado se cargarán en memoria. Nota: Si tiene modelos existentes con el mismo nombre, se sobrescribirán.",
  "levelOfInterest": "Cuando la variable a predecir tiene 2 niveles, especifique el nivel de interés. La matriz de confusión y las estadísticas relacionadas se mostrarán con el nivel de interés especificado como referencia.",
  "label12": "Resultados de la prueba: Tan pronto como se seleccione un modelo, realizaremos pruebas para ver si las variables dependientes especificadas en el modelo están disponibles en el conjunto de datos a puntuar. Los resultados se mostrarán aquí.",
  "label2": "Guardar valores predichos y estadísticas de apoyo.",
  "label3": "Predicciones y probabilidades predichas, donde sea aplicable, se almacenan en el conjunto de datos que se puntúa como nuevas variables con el prefijo a continuación.",
  "label4": "**Para variables dependientes con 2 niveles, el 2º nivel se trata como el nivel positivo. Consulte Datos > Niveles de factores > Reordenar niveles manualmente para cambiar el orden de los niveles de factores y reconstruir el modelo.",
  "conflevel": "Guardar intervalos de confianza para valores predichos individuales **(Válido solo para modelos lineales (clase lm))",
  "roctable": "Mostrar tabla ROC (**Solo para variables dependientes binarias)",
  "colname": "Especificar prefijo del nombre de la columna",
  "label5": "**Marcar la casilla de verificación anterior incurrirá en una penalización de rendimiento para conjuntos de datos grandes.",
  "level": "Especificar el nivel de confianza",
  "confusioncheck": "Generar matriz de confusión",
  "help": {
    "title": "Cargar modelos",
    "r_help": "help(load, package='base')",
    "body": "\n<b>Descripción</b></br>\nLos objetos de modelo R guardados en el archivo seleccionado se cargarán.</br>\nCargaremos TODOS los objetos R guardados en el archivo seleccionado. Si existen objetos con el mismo nombre en el entorno global de R, se sobrescribirán.</br>\nMostraremos un mensaje confirmando los modelos construidos con la aplicación BlueSky que se cargaron.</br>\nDebe hacer clic en el botón de ejecutar (el botón de triángulo horizontal) para cargar los objetos R guardados en el archivo seleccionado. \n<br/>\n<b>Uso</b>\n<br/>\n<code> \ncargar(archivo =\"ruta del archivo\")\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\narchivo: nombre del archivo con ruta, los objetos de modelo seleccionados se guardarán en este archivo RData\n</li>\n</ul>\n<b>Paquete</b></br>\nbasico</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de este diálogo o ejecute el siguiente comando help(load, package = 'base') en la ventana del editor R\n</br>\n                "
  }
}