{"title": "Cargar un conjunto de datos desde un paquete R", "navigation": "Cargar conjunto de datos", "label1": "Si el paquete R no está disponible, vaya a Herramientas> Paquete> Instalar paquete R desde CRAN para instalarlo.", "label2": "Si no ve un conjunto de datos en el menú desplegable, el paquete seleccionado no contiene el conjunto de datos.", "selectAPackage": "Seleccione un paquete R del cual cargar un conjunto de datos", "selectADataset": "Seleccione un conjunto de datos para cargar en la cuadrícula", "help": {"title": "Cargar un conjunto de datos desde un paquete R", "r_help": "help(data,package='utils')", "body": {"descriptionTitle": "Descripción", "descriptionText": "Carga el conjunto de datos seleccionado en la cuadrícula de datos de BlueSky Statistics. Utiliza la función data que carga conjuntos de datos especificados o lista los conjuntos de datos disponibles.", "usageTitle": "Uso", "usageCode1": "#Carga el conjunto de datos en memoria", "usageCode2": "data(..., package = NULL, overwrite = TRUE)", "usageCode3": "#Carga el conjunto de datos en la cuadrícula de datos de BlueSky Statistics", "usageCode4": "BSkyLoadRefresh(\"nombre del conjunto de datos\")", "argumentsTitle": "Argumentos", "argumentsList": ["...: cadenas de caracteres literales o nombres de los conjuntos de datos a cargar", "package: un vector de caracteres que indica el(los) paquete(s) en el(los) que buscar conjuntos de datos, o NULL.", "overwrite: lógico: ¿deben reemplazarse los objetos existentes del mismo nombre en envir?"], "detailsTitle": "Detalles", "detailsText": "Carga el conjunto de datos especificado en la cuadrícula de datos", "valueTitle": "Valor", "valueText": "Un marco de datos.", "examplesTitle": "Ejemplos", "exampleCode": "## Un ejemplo ridículo...data(oil)BSkyLoadRefresh(\"oil\")", "packageTitle": "Paquete", "packageText": "utils", "helpTitle": "Ayuda", "helpText": "Para obtener ayuda detallada, haga clic en el ícono de R en la parte superior derecha de esta superposición de diálogo o ejecute el siguiente comando {{r_help}} creando un fragmento de código R haciendo clic en + en la ventana de salida"}}}