{
  "title": "Imputar Valores Faltantes (Usando una fórmula)",
  "navigation": "Usar una fórmula",
  "depVar": "Seleccione una variable para imputar valores faltantes (Esta es la variable dependiente en el modelo)",
  "label1": "Mueva las variables independientes al control del generador de fórmulas para construir una fórmula. Pase el mouse sobre los símbolos en el generador de fórmulas para obtener ayuda",
  "formula": "Mover múltiples variables con el botón de mover utiliza un separador predeterminado de +, indicando variables independientes sin términos de interacción. Haga clic en el símbolo para construir un modelo con términos de interacción.",
  "independent": "Variables Independientes (una o más)",
  "help": {
    "title": "Imputar Valores Faltantes (Usando una fórmula)",
    "r_help": "help(if_else,package='dplyr')",
    "body": "\n            <b>Descripción</b></br>\n            Construya una fórmula para reemplazar los valores faltantes. Por ejemplo, construya un modelo de regresión para desarrollar estimaciones para los valores faltantes, una vez que se genera la ecuación, puede introducir la ecuación en el diálogo y solo se calcularán los valores faltantes en la variable seleccionada.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            Dataset$var<-con (Dataset,dplyr::if_else(is.na(var),expresión,var))<br/>\n            # sustituyendo expresión por var2*4+1.32<br/>\n            Dataset$var<-con (Dataset,dplyr::if_else(is.na(var),var2*4+1.32,var))<br/>\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            var: El nombre de la variable en el conjunto de datos donde se deben reemplazar los valores faltantes, por ejemplo, var=c(\"ventas\"). La variable debe ser de clase numérica\n            </li>\n            <li>\n            Dataset: El conjunto de datos/dataframe que contiene la variable var\n            </li>\n            <li>\n            expresión: La expresión utilizada para reemplazar el valor faltante, en el ejemplo anterior es var2*4+ 1.32\n            </li>\n            </ul>\n            <b>Paquete</b></br>\n            dplyr</br>\n            <b>Ayuda</b></br>\n            Para obtener ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de este diálogo o ejecute el siguiente comando help(if_else, package ='dplyr') creando un bloque de código R haciendo clic en + en la ventana de salida\n            "
  }
}