{
  "title": "Estimaciones del Nivel de Parámetros",
  "navigation": "Estimaciones de Parámetros",
  "label1": "Se admiten modelos de las siguientes clases, las clases se enumeran entre paréntesis a continuación",
  "label2": "Modelos lineales (lm), Modelos lineales generalizados (glm), Modelos log-lineales multinomiales (multinom), Regresión cuantílica (rq), Regresión lineal robusta (rlm), Objeto de curva de supervivencia (survfit), Modelo de efectos mixtos lineales (lme), Objeto de regresión de riesgos proporcionales (coxph), Modelo de regresión de supervivencia paramétrica (survreg), Regresión logística/probit ordenada (polr), Análisis factorial (factanal), Modelos lineales generalizados regularizados por Lasso y Elastic-net (glmnet)",
  "modelselector1": "Seleccionar un modelo",
  "help": {
    "title": "Estimaciones del Nivel de Parámetros",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>Descripción</b></br>\nMuestra las estimaciones de parámetros del modelo seleccionado\n<br/>\n<b>Uso</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: modelo u otro objeto R que se convertirá en un marco de datos de una sola fila\n</li>\n</ul>\n<b>Detalles</b></br>\nMuestra las estimaciones de parámetros de los siguientes modelos</br>\nModelos lineales (clase de modelo lm)</br>\nModelos lineales generalizados (clase de modelo glm)</br>\nModelos log-lineales multinomiales (clase de modelo multinom)</br>\nRegresión logística ordenada o Probit (clase de modelo polr)</br>\nModelos lineales generalizados regularizados por Lasso y Elastic-Net (clase de modelo glmnet)</br>\nRegresión lineal robusta (clase de modelo rlm)</br>\nRegresión cuantílica (clase de modelo rq)</br>\nModelo de efectos mixtos lineales (lme)</br>\nObjeto de regresión de riesgos proporcionales (coxph)</br>\nModelo de regresión de supervivencia paramétrica (survreg)</br>\nAnálisis factorial (factanal)</br>\n<b>Valor</b></br>\nUn tibble::tibble() con información sobre los componentes del modelo.</br>\nterm: El nombre del término de regresión.</br>\nestimate: El valor estimado del término de regresión.</br>\nstd.error: El error estándar del término de regresión.</br>\nstatistic: El valor de una estadística, casi siempre una estadística T, que se utiliza en una hipótesis de que el término de regresión no es cero.</br>\np.value: El valor p bilateral asociado con la estadística observada.</br>\nconf.low: El extremo inferior de un intervalo de confianza para el término de regresión. Incluido solo si conf.int = TRUE.</br>\nconf.high: El extremo superior de un intervalo de confianza para el término de regresión. Incluido solo si conf.int = TRUE.</br>\nSi el modelo lineal es un objeto mlm (modelo lineal múltiple), hay una columna adicional:</br>\nresponse: A qué columna de respuesta corresponden los coeficientes (típicamente Y1, Y2, etc.)</br>\n<b>Paquete</b></br>\nbroom</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de esta superposición de diálogo o ejecute el siguiente comando en el editor de sintaxis R help(tidy, package ='broom')\n"
  }
}