{
  "title": "Trazar el mapa Persona-Ítem",
  "navigation": "Trazar el mapa Persona-Ítem",
  "label1": "Seleccione un modelo (modelos de clase Rm y dRm soportados)",
  "label1b": "Si no hay modelos disponibles, primero debe crear un modelo seleccionando Ajuste de Modelo -> IRT",
  "modelselector1": "Seleccione un modelo",
  "range1": "Rango para el eje X",
  "help": {
    "title": "Trazar el mapa Persona-Ítem",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>Descripción</b></br>\n                Un mapa persona-ítem muestra la ubicación de los parámetros de ítem (y umbral) así como la distribución de los parámetros de persona a lo largo de la dimensión latente. Los mapas persona-ítem son útiles para comparar el rango y la posición de la distribución de medida de ítem (panel inferior) con el rango y la posición de la distribución de medida de persona (panel superior). Los ítems deberían estar idealmente ubicados a lo largo de toda la escala para medir de manera significativa la ‘habilidad’ de todas las personas.\n\n                <br/><br/>\n                <b>Uso</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"Mapa Persona-Ítem\", latdim = \"Dimensión Latente\",\n                pplabel = \"Persona\nParámetro\nDistribución\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>Argumentos</b>\n                <br/>  \n                object: Objeto de clase Rm o dRm\n                <br/>\n                item.subset: Subconjunto de ítems a trazar. Puede ser un vector numérico que indica la columna en X o un vector de caracteres que indica el nombre de la columna. Si \"all\", se trazan todos los ítems. El número de ítems a trazar debe ser > 1.\n                <br/>\n                sorted: Si TRUE, los ítems se ordenan en orden ascendente según su ubicación en la dimensión latente.   \n                <br/>\n                main: Título principal del gráfico.\n                <br/>\n                latdim: Etiqueta del eje x, es decir, la dimensión latente.\n                <br/>\n                pplabel: Título para el panel superior que muestra la distribución de parámetros de persona\n                <br/>\n                cex.gen: cex como parámetro gráfico especifica un valor numérico que indica en qué medida el texto y los símbolos de trazado deben ampliarse en relación con el valor predeterminado. Aquí cex.gen se aplica a todas las etiquetas de texto. El valor predeterminado es 0.7.\n                <br/>\n                xrange: Rango para el eje x\n                <br/>\n                warn.ord: Si TRUE (por defecto), se muestran asteriscos en el margen derecho del panel inferior para indicar ubicaciones de umbral no ordinal para ítems polytomous.\n                <br/>\n                warn.ord.colour: Las ubicaciones de umbral no ordinal para ítems polytomous se colorean con este color para hacerlas más visibles. Esto es especialmente útil cuando hay muchos ítems, de modo que el gráfico es bastante denso. El valor predeterminado es \"negro\", por lo que no se hace distinción.\n                <br/>   \n                irug: Si TRUE (por defecto), todos los umbrales se trazan debajo de la distribución de personas para indicar dónde los ítems incluidos son más informativos.                \n                <br/>\n                pp: Si no es NULL, esto contiene los datos de parámetros de persona del objeto de datos, evitando la necesidad de recalcularlo.\n                <br/><br/>\n\n                <b>Paquetes</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>Ayuda</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}