{
  "correlationType": "Tipo de correlación",
  "Polychoric": "Policórico",
  "Polyserial": "Poliserial",
  "title": "Correlación policórica/poliserial",
  "bins": "Para correlaciones poliseriales - Número de bins para disecar x para la prueba de normalidad bivariada",
  "navigation": "Policórico, poliserial",
  "Target": "Selecciona una o más variables x",
  "textbox1": "Intervalo de confianza",
  "textbox2": "Hipótesis nula (mu)",
  "Target2": "Selecciona una única variable de factor ordenado y",
  "label1": "Tipo de estimación",
  "test1": "Aproximación de dos pasos",
  "test2": "Estimador de máxima verosimilitud",
  "label2": "Error estándar",
  "Missvals": "Mostrar error estándar",
  "conflevel": "Correlación máxima absoluta (para asegurar estabilidad numérica).",
  "Seed": "Valor(es) de inicio opcional(es)",
  "header": "La correlación se estima entre cada variable x y la variable y",
  "showEffectSizes": "Devolver umbrales estimados",
  "help": {
    "title": "Correlación policórica/poliserial",
    "r_help": "help(polychor, package ='polycor')",
    "body": "\n<b>Descripción</b></br>\nCalcula una correlación policórica o poliserial. La correlación se estima entre cada variable x y la variable y\n<br/>\n<br/>\n<b>Descripción-Policórica</b></br>\nCalcula la correlación policórica (y su error estándar) entre dos variables ordinales, bajo la suposición de que las variables ordinales disecan variables latentes continuas que son bivariadas normales. Está disponible el estimador de máxima verosimilitud o una aproximación \"de dos pasos\" (posiblemente mucho) más rápida. Para el estimador ML, también están disponibles las estimaciones de los umbrales y la matriz de covarianza de las estimaciones.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \npolychor(x, y, ML = FALSE, control = list(), \n  std.err = FALSE, maxcor=.9999, start, thresholds=FALSE)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: variable categórica ordenada; la variable puede ser numérica, lógica, un factor, un factor ordenado o una variable de carácter, pero si es un factor, sus niveles deben estar en el orden correcto, y los valores de una variable de carácter están ordenados alfabéticamente.\n</li>\n<li>\ny: una variable de factor ordenado\n</li>\n<li>\nML: si es VERDADERO, calcula la estimación de máxima verosimilitud; si es FALSO, por defecto, calcula una aproximación \"de dos pasos\" más rápida.\n</li>\n<li>\nstd.err: si es VERDADERO, devuelve la varianza estimada de la correlación (para el estimador de dos pasos) o la matriz de covarianza estimada (para el estimador ML) de la correlación y los umbrales; el valor por defecto es FALSO. \n</li>\n<li>\nmaxcor: correlación máxima absoluta (para asegurar estabilidad numérica).\n</li>\n<li>\nstart:  valor(es) de inicio opcional(es): si es un solo número, valor de inicio para la correlación.\n</li>\n<li>\nthresholds:  si es VERDADERO (el valor por defecto es FALSO) devuelve umbrales estimados junto con la correlación estimada incluso si no se calculan errores estándar.\n</li>\n</ul>\n<b>Valores</b></br>\nValor: Si std.err o thresholds es VERDADERO, devuelve un objeto de clase \"polycor\" con los siguientes componentes:</br>\ntipo: establecido en \"policórico\".</br>\nrho: la correlación policórica.</br>\nrow.cuts: umbrales estimados para la variable de fila (x), para la estimación ML.</br>\ncol.cuts: umbrales estimados para la variable de columna (y), para la estimación ML.</br>\nvar: la varianza estimada de la correlación, o, para la estimación ML, la matriz de covarianza estimada de la correlación y los umbrales.</br>\nn: el número de observaciones en las que se basa la correlación.</br>\nchisq: prueba de chi-cuadrado para la normalidad bivariada.</br>\ndf: grados de libertad para la prueba de normalidad bivariada.</br>\nML: VERDADERO para la estimación ML, FALSO para la estimación de dos pasos\n<b>Detalles</b></br>\nEl estimador ML se calcula maximizando la verosimilitud bivariada-normal con respecto a los umbrales para las dos variables (τ^x[i], i = 1,…, r - 1; τ^y[j], j = 1,…, c - 1) y la correlación poblacional (ρ). Aquí, r y c son respectivamente el número de niveles de x e y. La verosimilitud se maximiza numéricamente utilizando la función optim, y la matriz de covarianza de los parámetros estimados se basa en el Hessiano numérico calculado por optim.</br>\nEl estimador de dos pasos se calcula primero estimando los umbrales (τ^x[i], i = 1,…, r - 1 y τ^y[j], i = j,…, c - 1) por separado de la distribución marginal de cada variable. Luego, la verosimilitud unidimensional para ρ se maximiza numéricamente, utilizando optim si se solicitan errores estándar, o optimise si no se solicitan. El error estándar calculado trata los umbrales como fijos.\n<br/>\n<b>Ejemplo</b></br>\n<code> \nif(require(mvtnorm)){\n    set.seed(12345)\n    data <- rmvnorm(1000, c(0, 0), matrix(c(1, .5, .5, 1), 2, 2))\n    x <- data[,1]\n    y <- data[,2]\n    cor(x, y)  # correlación de muestra\n    }\n\nif(require(mvtnorm)){\n    x <- cut(x, c(-Inf, .75, Inf))\n    y <- cut(y, c(-Inf, -1, .5, 1.5, Inf))\n    polychor(x, y)  # estimación de 2 pasos\n    }\n\nif(require(mvtnorm)){\n    polychor(x, y, ML=TRUE, std.err=TRUE)  # estimación ML\n    }\n</code> <br/>\n<b>Paquete</b></br>\npolycor</br>\n<b>Ayuda</b></br>\nPara ayuda detallada haz clic en el ícono de R en la parte superior derecha de este diálogo o ejecuta el siguiente comando help(polycor, package ='polychor') creando un bloque de código R haciendo clic en + en la ventana de salida           \n<br/>\n<br/>\n<b>Descripción-Poliserial</b></br>\nCalcula la correlación poliserial (y su error estándar) entre una variable cuantitativa y una variable ordinal, basada en la suposición de que la distribución conjunta de la variable cuantitativa y una variable latente continua subyacente a la variable ordinal es bivariada normal. Está disponible el estimador de máxima verosimilitud o una aproximación \"de dos pasos\" más rápida. Para el estimador ML, también están disponibles las estimaciones de los umbrales y la matriz de covarianza de las estimaciones.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \npolyserial(x, y, ML = FALSE, control = list(), \n  std.err = FALSE, maxcor=.9999, bins=4, start, thresholds=FALSE)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: una variable numérica\n</li>\n<li>\ny: una variable categórica ordenada; puede ser numérica, lógica, un factor, un factor ordenado o una variable de carácter, pero si es un factor, sus niveles deben estar en el orden correcto, y los valores de una variable de carácter están ordenados alfabéticamente.\n</li>\n<li>\nML: si es VERDADERO, calcula la estimación de máxima verosimilitud; si es FALSO, por defecto, calcula una aproximación \"de dos pasos\" más rápida.\n</li>\n<li>\nstd.err: si es VERDADERO, devuelve la varianza estimada de la correlación (para el estimador de dos pasos) o la matriz de covarianza estimada (para el estimador ML) de la correlación y los umbrales; el valor por defecto es FALSO. \n</li>\n<li>\nbins: el número de bins en los que disecar x para una prueba de normalidad bivariada; el valor por defecto es 4.\n</li>\n<li>\nmaxcor: correlación máxima absoluta (para asegurar estabilidad numérica).\n</li>\n<li>\nstart:  valor(es) de inicio opcional(es): si es un solo número, valor de inicio para la correlación.\n</li>\n<li>\nthresholds:  si es VERDADERO (el valor por defecto es FALSO) devuelve umbrales estimados junto con la correlación estimada incluso si no se calculan errores estándar.\n</li>\n</ul>\n<b>Valores</b></br>\nValor: Si std.err o thresholds es VERDADERO, devuelve un objeto de clase \"polycor\" con los siguientes componentes:</br>\ntipo: establecido en \"poliserial\".</br>\nrho: la correlación poliserial.</br>\ncuts: umbrales estimados para la variable ordinal (y), para la estimación ML.</br>\nvar: la varianza estimada de la correlación, o, para la estimación ML, la matriz de covarianza estimada de la correlación y los umbrales.</br>\nn: el número de observaciones en las que se basa la correlación.</br>\nchisq: prueba de chi-cuadrado para la normalidad bivariada.</br>\ndf: grados de libertad para la prueba de normalidad bivariada.</br>\nML: VERDADERO para la estimación ML, FALSO para la estimación de dos pasos\n<b>Ejemplo</b></br>\n<code> \nif(require(mvtnorm)){\n    set.seed(12345)\n    data <- rmvnorm(1000, c(0, 0), matrix(c(1, .5, .5, 1), 2, 2))\n    x <- data[,1]\n    y <- data[,2]\n    cor(x, y)  # correlación de muestra\n    }\n\nif(require(mvtnorm)){\n    y <- cut(y, c(-Inf, -1, .5, 1.5, Inf))\n    polyserial(x, y)  # estimación de 2 pasos\n    }\n\nif(require(mvtnorm)){\n    polyserial(x, y, ML=TRUE, std.err=TRUE) # estimación ML\n    }\n\n</code> <br/>\n<b>Paquete</b></br>\npolycor</br>\n<b>Ayuda</b></br>\nPara ayuda detallada ejecuta el siguiente comando help(polyserial, package ='polychor') creando un bloque de código R haciendo clic en + en la ventana de salida           \n\n\t\t\t"
  },
  "ro": {
    "correlationType": "Tipul corelației",
    "Polychoric": "Policoric",
    "Polyserial": "Poliserial",
    "title": "Corelația policorică/poliserială",
    "bins": "Pentru corelații poliseriale - Numărul de bins pentru a diseca x pentru testul de normalitate bivariată",
    "navigation": "Policoric, poliserial",
    "Target": "Selectați una sau mai multe variabile x",
    "textbox1": "Interval de încredere",
    "textbox2": "Ipoteza nulă (mu)",
    "Target2": "Selectați o singură variabilă de factor ordonat y",
    "label1": "Tipul estimării",
    "test1": "Aproximare în două etape",
    "test2": "Estimare de maximă verosimilitate",
    "label2": "Eroare standard",
    "Missvals": "Afișați eroarea standard",
    "conflevel": "Corelație maximă absolută (pentru a asigura stabilitate numerică).",
    "Seed": "Valoare(e) de început opțional(e)",
    "header": "Corelația este estimată între fiecare variabilă x și variabila y",
    "showEffectSizes": "Returnați pragurile estimate",
    "help": {
      "title": "Corelația policorică/poliserială",
      "r_help": "help(polychor, package ='polycor')",
      "body": "\n<b>Descriere</b></br>\nCalculează o corelație policorică sau poliserială. Corelația este estimată între fiecare variabilă x și variabila y\n<br/>\n<br/>\n<b>Descriere-Policoric</b></br>\nCalculează corelația policorică (și eroarea sa standard) între două variabile ordinale, sub presupunerea că variabilele ordinale disecă variabile latente continue care sunt bivariată normale. Este disponibil estimarea de maximă verosimilitate sau o aproximare \"în două etape\" (posibil mult) mai rapidă. Pentru estimarea ML, estimările pragurilor și matricea de covarianță a estimărilor sunt de asemenea disponibile.\n<br/>\n<b>Utilizare</b>\n<br/>\n<code> \npolychor(x, y, ML = FALSE, control = list(), \n  std.err = FALSE, maxcor=.9999, start, thresholds=FALSE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: variabilă categorială ordonată; variabila poate fi numerică, logică, un factor, un factor ordonat sau o variabilă de caracter, dar dacă este un factor, nivelurile sale ar trebui să fie în ordinea corectă, iar valorile unei variabile de caracter sunt ordonate alfabetic.\n</li>\n<li>\ny: o variabilă de factor ordonat\n</li>\n<li>\nML: dacă este ADEVĂRAT, calculează estimarea de maximă verosimilitate; dacă este FALS, implicit, calculează o aproximare \"în două etape\" mai rapidă.\n</li>\n<li>\nstd.err: dacă este ADEVĂRAT, returnează varianța estimată a corelației (pentru estimarea în două etape) sau matricea de covarianță estimată (pentru estimarea ML) a corelației și pragurilor; valoarea implicită este FALS. \n</li>\n<li>\nmaxcor: corelație maximă absolută (pentru a asigura stabilitate numerică).\n</li>\n<li>\nstart:  valoare(e) de început opțional(e): dacă este un singur număr, valoare de început pentru corelație.\n</li>\n<li>\nthresholds:  dacă este ADEVĂRAT (valoarea implicită este FALS) returnează praguri estimate împreună cu corelația estimată chiar dacă erorile standard nu sunt calculate.\n</li>\n</ul>\n<b>Valori</b></br>\nValoare: Dacă std.err sau thresholds este ADEVĂRAT, returnează un obiect de clasă \"polycor\" cu următoarele componente:</br>\ntip: setat pe \"policoric\".</br>\nrho: corelația policorică.</br>\nrow.cuts: praguri estimate pentru variabila de rând (x), pentru estimarea ML.</br>\ncol.cuts: praguri estimate pentru variabila de coloană (y), pentru estimarea ML.</br>\nvar: varianța estimată a corelației, sau, pentru estimarea ML, matricea de covarianță estimată a corelației și pragurilor.</br>\nn: numărul de observații pe care se bazează corelația.</br>\nchisq: test chi-pătrat pentru normalitatea bivariată.</br>\ndf: grade de libertate pentru testul de normalitate bivariată.</br>\nML: ADEVĂRAT pentru estimarea ML, FALS pentru estimarea în două etape\n<b>Detalii</b></br>\nEstimarea ML este calculată maximizând verosimilitatea bivariată-normal în raport cu pragurile pentru cele două variabile (τ^x[i], i = 1,…, r - 1; τ^y[j], j = 1,…, c - 1) și corelația populațională (ρ). Aici, r și c sunt respectiv numărul de niveluri ale x și y. Verosimilitatea este maximizată numeric folosind funcția optim, iar matricea de covarianță a parametrilor estimați se bazează pe Hessianul numeric calculat de optim.</br>\nEstimarea în două etape se calculează mai întâi estimând pragurile (τ^x[i], i = 1,…, r - 1 și τ^y[j], i = j,…, c - 1) separat de distribuția marginală a fiecărei variabile. Apoi, verosimilitatea unidimensională pentru ρ este maximizată numeric, folosind optim dacă se solicită erori standard, sau optimise dacă nu se solicită. Eroarea standard calculată tratează pragurile ca fiind fixe.\n<br/>\n<b>Exemplu</b></br>\n<code> \nif(require(mvtnorm)){\n    set.seed(12345)\n    data <- rmvnorm(1000, c(0, 0), matrix(c(1, .5, .5, 1), 2, 2))\n    x <- data[,1]\n    y <- data[,2]\n    cor(x, y)  # corelația de probă\n    }\n\nif(require(mvtnorm)){\n    x <- cut(x, c(-Inf, .75, Inf))\n    y <- cut(y, c(-Inf, -1, .5, 1.5, Inf))\n    polychor(x, y)  # estimare în 2 pași\n    }\n\nif(require(mvtnorm)){\n    polychor(x, y, ML=TRUE, std.err=TRUE)  # estimare ML\n    }\n</code> <br/>\n<b>Pachet</b></br>\npolycor</br>\n<b>Ajutor</b></br>\nPentru ajutor detaliat, executați următoarea comandă help(polycor, package ='polychor') creând un bloc de cod R făcând clic pe + în fereastra de ieșire           \n\n\t\t\t"
    }
  }
}