{
  "title": "Tamaño de Muestra, Precisión del Kappa de Cohen",
  "navigation": "Kappa de Cohen",
  "howtouse": "Especifique el tamaño de la muestra o el ancho del intervalo de confianza y se calculará el otro",
  "n": "Tamaño de Muestra",
  "width": "Ancho del Intervalo de Confianza",
  "kappa": "Kappa (0-1)",
  "conflevel": "Nivel de Confianza (0-1)",
  "raters": "Número de Evaluadores (2-6)",
  "categories": "Número de Categorías (2-5)",
  "props": "Proporciones en Cada Categoría; separar con comas, por ejemplo .3, .7; debe coincidir con el número de categorías y sumar 1",
  "help": {
    "title": "Tamaño de Muestra, Precisión del Kappa de Cohen",
    "r_help": "help(prec_kappa, package ='presize')",
    "body": "\nEsta es una evaluación del tamaño de la muestra para el kappa de Cohen basado en el ancho del intervalo de confianza. Calcula el tamaño de la muestra o el ancho del intervalo de confianza cuando el usuario especifica el otro.\n<br/><br/>\n<b>Tamaño de Muestra:</b> Especifique el número de sujetos en el estudio\n<br/><br/>\n<b>Ancho del Intervalo de Confianza:</b> Especifique el ancho del intervalo de confianza deseado. El ancho de un intervalo de confianza es una medida de precisión de una estimación y es el límite superior menos el límite inferior.\n<br/><br/>\n<b>Kappa:</b> Especifique el valor de kappa esperado\n<br/><br/>\n<b>Nivel de Confianza:</b> Especifique el nivel deseado del intervalo de confianza\n<br/><br/>\n<b>Número de Evaluadores:</b> Especifique el número de evaluadores que proporcionarán valores para cada sujeto.\n<br/><br/>\n<b>Número de Categorías:</b> Especifique el número de categorías en la variable de resultado\n<br/><br/>\n<b>Proporciones en Cada Categoría:</b> Especifique la proporción esperada de sujetos en cada categoría, separada por comas. Tenga en cuenta que el número de valores especificados debe coincidir con el número de categorías especificadas y sumar 1.\n<br/><br/>\n<b>Paquetes R Requeridos:</b> presize\n\t\t\t"
  }
}