{
  "title": "Tamaño de Muestra, Precisión de una Diferencia de Riesgo",
  "navigation": "Diferencia de Riesgo",
  "howtouse": "Especifique el tamaño de la muestra o el ancho del intervalo de confianza y se calculará el otro",
  "n1": "Tamaño de Muestra del Grupo 1",
  "width": "Ancho del Intervalo de Confianza",
  "ratio": "Relación del Tamaño de Muestra del Grupo 1 al Grupo 2",
  "prop1": "Proporción de Resultados del Grupo 1",
  "prop2": "Proporción de Resultados del Grupo 2",
  "conflevel": "Nivel de Confianza (0-1)",
  "method": "Método del Intervalo de Confianza",
  "help": {
    "title": "Tamaño de Muestra, Precisión de una Diferencia de Riesgo",
    "r_help": "help(prec_riskdiff, package ='presize')",
    "body": "\nEsta es una evaluación del tamaño de la muestra para una diferencia en proporciones basada en el ancho del intervalo de confianza. Calcula el tamaño de la muestra o el ancho del intervalo de confianza cuando el usuario especifica el otro.\n<br/><br/>\n<b>Tamaño de Muestra del Grupo 1:</b> Especifique el número de sujetos en el grupo 1\n<br/><br/>\n<b>Ancho del Intervalo de Confianza:</b> Especifique el ancho del intervalo de confianza deseado. El ancho de un intervalo de confianza es una medida de la precisión de una estimación y es el límite superior menos el límite inferior.\n<br/><br/>\n<b>Relación del Tamaño de Muestra del Grupo 1 al Grupo 2:</b> Especifique la relación del tamaño de muestra del grupo 2 al tamaño de muestra del grupo 1. Un valor de 1 significa tamaños de muestra iguales.\n<br/><br/>\n<b>Proporción de Resultados del Grupo 1:</b> Especifique la proporción de sujetos en el grupo 1 con el resultado 'positivo'\n<br/><br/>\n<b>Proporción de Resultados del Grupo 2:</b> Especifique la proporción de sujetos en el grupo 2 con el resultado 'positivo'\n<br/><br/>\nTenga en cuenta que la diferencia de riesgo se calculará como la proporción en el grupo 1 menos la proporción en el grupo 2.\n<br/><br/>\n<b>Nivel de Confianza:</b> Especifique el nivel deseado del intervalo de confianza\n<br/><br/>\n<b>Método del Intervalo de Confianza:</b> Especifique el tipo de intervalo de confianza a utilizar. Newcombe (newcombe) propuso un intervalo de confianza basado en el método de puntuación de Wilson para la\nproporción única. El intervalo de confianza sin corrección de continuidad se implementa a partir de la ecuación 10 en Newcombe (1998). Miettinen-Nurminen (mn) proporciona una forma cerrada\necuación para la estimación de máxima verosimilitud restringida. La implementación se basa en el código proporcionado por Yongyi Min en https://users.stat.ufl.edu/~aa/cda/R/two-sample/R2/index.html.\nEl intervalo de confianza de Agresti-Caffo (ac) se basa en el intervalo de confianza de Wald, añadiendo 1 éxito a cada celda de la tabla 2 x 2 (ver Agresti y Caffo 2000).\n<br/><br/>\n<b>Paquetes R Requeridos:</b> presize\n\t\t\t"
  }
}