{
  "title": "División Aleatoria",
  "navigation": "División Aleatoria",
  "traindataset": "Ingrese el nombre del conjunto de datos de entrenamiento",
  "testdataset": "Ingrese el nombre del conjunto de datos de prueba",
  "split": "Ingrese el porcentaje de división",
  "replace": "¿Debería muestrear con reemplazo?",
  "seed": "Establecer semilla",
  "dependent": "Variable para construir muestras estratificadas",
  "help": {
    "title": "División Aleatoria",
    "r_help": "ayuda(muestra, paquete=\"base\")",
    "body": "\n<b>Descripción</b></br>\nmuestra toma una muestra del tamaño especificado de los elementos de x utilizando con o sin reemplazo.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nmuestra(x, tamaño, reemplazo = FALSO, prob = NULL)\nmuestra.int(n, tamaño = n, reemplazo = FALSO, prob = NULL)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: Un vector de uno o más elementos de los que elegir, o un entero positivo. Ver 'Detalles.'\n</li>\n<li>\nn: un número positivo, el número de elementos de los que elegir. Ver 'Detalles.'\n</li>\n<li>\ntamaño: un entero no negativo que da el número de elementos a elegir.\n</li>\n<li>\nreemplazo: ¿Debería muestrear con reemplazo?\n</li>\n<li>\nprob: Un vector de pesos de probabilidad para obtener los elementos del vector que se está muestreando.\n</li>\n</ul>\n<b>Detalles</b></br>\nSi x tiene longitud 1, es numérico (en el sentido de is.numeric) y x >= 1, el muestreo a través de muestra se realiza de 1:x. Tenga en cuenta que esta función de conveniencia puede llevar a un comportamiento no deseado cuando x tiene longitudes variables en llamadas como muestra(x). Ver los ejemplos.<br/>\nDe lo contrario, x puede ser cualquier objeto R para el cual la longitud y la subconfiguración por enteros tienen sentido: los métodos S3 o S4 para estas operaciones se despacharán según corresponda.<br/>\nPara muestra, el tamaño predeterminado es el número de elementos inferidos del primer argumento, de modo que muestra(x) genera una permutación aleatoria de los elementos de x (o 1:x).<br/>\nSe permite solicitar muestras de tamaño = 0 con n = 0 o un x de longitud cero, pero de lo contrario se requiere n > 0 o longitud positiva(x).<br/>\nLos valores numéricos positivos no enteros de n o x se truncarán al siguiente entero más pequeño, que no debe ser mayor que .Machine$integer.max.<br/>\nEl argumento opcional prob puede usarse para dar un vector de pesos para obtener los elementos del vector que se está muestreando. No es necesario que sumen uno, pero deben ser no negativos y no todos cero. Si reemplazo es verdadero, se utiliza el método de alias de Walker (Ripley, 1987) cuando hay más de 200 valores razonablemente probables: esto da resultados incompatibles con los de R < 2.2.0.<br/>\nSi reemplazo es falso, estas probabilidades se aplican secuencialmente, es decir, la probabilidad de elegir el siguiente elemento es proporcional a los pesos entre los elementos restantes. El número de pesos no cero debe ser al menos del tamaño en este caso.<br/>\nmuestra.int es una interfaz simple en la que tanto n como tamaño deben proporcionarse como enteros.<br/>\nA partir de R 3.0.0, n puede ser mayor que el mayor entero de tipo entero, hasta el mayor entero representable en tipo doble. Solo se admite el muestreo uniforme. Se utilizan dos números aleatorios para garantizar un muestreo uniforme de grandes enteros.<br/>\n<b>Paquete</b></br>\nbase\n<b>Ayuda</b></br>\nayuda(muestra, paquete=\"base\")\n"
  }
}