{
  "title": "Modelo de Escala de Calificación",
  "navigation": "Modelo de Escala de Calificación",
  "modelname": "Ingrese el nombre del modelo",
  "destinationvars": "Variable(s) de destino",
  "estimationlbl": "Estimación",
  "rad1": "Usar estimación CML",
  "chk1": "Calcular el error estándar",
  "chk2": "Normalizar parámetros para que sumen (0)",
  "rad2": "Usar estimación MML",
  "help": {
    "title": "Modelo de Escala de Calificación",
    "r_help": "ayuda(RSM, paquete='eRm')",
    "body": "\n            <b>Descripción</b>\n            <br/>\n            Genera estimaciones de parámetros para un modelo de escala de calificación\n            <br/><br/>\n            Para la estimación CML, invocamos eRm::RSM para calcular las estimaciones de parámetros de un modelo de escala de calificación para respuestas de ítems politómicos\n            <br/><br/>\n            Para la estimación MML, invocamos tam.mml con los parámetros apropiados, ver abajo\n            <br/><br/>\n            <b>Uso para la estimación CML</b>\n            <br/>\n            <code>\n            eRm::RSM(X,se=FALSE,sum0=FALSE) \n            </code>  \n            <br/><br/>\n            <b>Argumentos</b>\n            <br/>                      \n            <ul>\n            <li>\n            X:  Matriz de datos de entrada 0/1 o marco de datos; las filas representan individuos, las columnas representan ítems. Los valores faltantes se insertan como NA.\n            </li>\n            <li>\n            W:  Matriz de diseño para el modelo Rasch. Si se omite, la función calculará W automáticamente.\n            </li>\n            <li>\n            se: Si VERDADERO, se calculan los errores estándar.\n            </li>\n            <li>\n            sum0: Si VERDADERO, los parámetros se normalizan para sumar 0 especificando un W apropiado. Si FALSO, el primer parámetro se restringe a 0.\n            </li>\n            <li>\n            etaStart: Se puede especificar un vector de valores iniciales para los parámetros eta. Si falta, se utiliza el vector 0.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>Uso para la estimación MML</b>\n            <br/>\n            <code>\n            tam.mml(resp,irtmodel=\"RSM\",verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Argumentos</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Marco de datos con respuestas de ítems politómicos k=0,...,K. Las respuestas faltantes deben declararse como NA.\n            </li>\n            <li>\n            irtmodel: Para pendientes de ítems fijas (en tam.mml), las opciones incluyen PCM (modelo de crédito parcial), PCM2 (modelo de crédito parcial con parametrización de ConQuest 'item+item*step' y RSM (modelo de escala de calificación; la parametrización de ConQuest 'item+step'). \n            <br/>\n            Para pendientes de ítems estimadas (disponibles solo en tam.mml.2pl), las opciones son 2PL (todas las pendientes de las categorías de ítems son estimadas; Modelo de Respuesta de Ítem Nominal), GPCM (modelo de crédito parcial generalizado en el que cada ítem obtiene un y solo un parámetro de pendiente por dimensión) y 2PL.groups (subconjuntos de ítems obtienen las mismas estimaciones de pendiente de ítem) y una matriz de diseño E sobre las pendientes de ítems en el modelo de crédito parcial generalizado (GPCM.design, ver Ejemplos). Tenga en cuenta que las pendientes de ítems no se pueden estimar con diseños facetados utilizando la función tam.mml.mfr. Sin embargo, es fácil usar matrices de diseño predefinidas y aplicar algunas restricciones a tam.mml.2pl.\n            </li>\n            <li>\n            verbose: Lógico que indica si la salida debe imprimirse durante las iteraciones.\n            </li>\n            </ul>\n            <br/><br/>\n            <b>Paquetes</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>\n            <b>Ayuda</b>\n            <br/>\n            ayuda(RSM, paquete='eRm')\n            <br/>\n            ayuda(tam.mml, paquete='TAM')\n"
  }
}