{
  "helpText": "El ANOVA de medidas repetidas requiere que los datos estén en formato largo. Si sus datos no están en formato largo, consulte Conjuntos de datos > ReShape > Más largo",
  "repMeasuresConfig": "Configuración",
  "modelname": "Ingrese el nombre del modelo",
  "title": "ANOVA de Medidas Repetidas - Ancho",
  "subjectID": "Opcionalmente especifique una variable para usar como identificador de sujeto",
  "dependentVariable": "Variable dependiente",
  "navigation": "ANOVA, Medidas Repetidas, Ancho",
  "response": "Variable(s) dentro del sujeto e.g. Tiempo",
  "Fixed": "Factor entre sujetos",
  "covariates": "Covariables",
  "Summary": "Medias marginales estimadas",
  "Scatter_plot": "Posthocs",
  "Residual": "Gráfico de Residual vs. Ajustado",
  "Histogram": "Gráfico de histograma de residuos",
  "brownForsythe": "Prueba de Brown-Forsythe",
  "levenesTest": "Prueba de Levene",
  "plotMeansCI": "Gráfico de medias e intervalos de confianza",
  "simpleEffectsTest": "Prueba de efectos simples",
  "label2": "Opciones para posthocs y prueba de efectos simples",
  "combon": "Comparar medias usando:",
  "adjust": "Método para ajustar valores p",
  "displayBoxMDetails": "Mostrar detalles asociados con la prueba de Box's M (Nota: Los resultados de la prueba de Box's M siempre se muestran)",
  "help": {
    "title": "ANOVA de Medidas Repetidas",
    "r_help": "help(aov_ez , package='afex')",
    "body": "\n<b>Descripción</b></br>\nNOTA:<br/>\n1. Necesitamos reestructurar los datos al ejecutar un ANOVA de medidas repetidas en un conjunto de datos ancho<br/>\n2. Soportamos múltiples medidas repetidas para una sola variable e.g. Glucosa en sangre medida en pretest, posttest y en una visita de seguimiento<br/>\n3. Necesita especificar un nombre de factor repetido e.g. Glucosa en sangre y el número de niveles. Crearemos una variable de factor e.g. llamada Glucosa en sangre con niveles creados a partir de los nombres de las variables que contienen las medidas repetidas e.g. los niveles del factor serán pretest, posttest y seguimiento<br/>\n4. Necesita especificar un nombre de medida e.g. Valor. Crearemos una variable e.g. Valor con todos los valores de Glucosa en sangre correspondientes al pretest, posttest y seguimiento para cada sujeto.<br/>\n5. Soportamos un solo factor variable entre sujetos y dentro de sujetos.<br/>\n6. Las versiones futuras soportarán múltiples medidas así como múltiples variables de factores entre sujetos y dentro de sujetos.<br/>\n7. Por defecto, cada fila del conjunto de datos corresponde a un sujeto único, también puede especificar una variable para el ID del sujeto.</br>\n<br/>\nCon el ANOVA de medidas repetidas, se calculan estadísticas F para cada factor dentro de sujetos, factor entre sujetos y el término de interacción para ANOVA mixto</br>\nBusque las tablas de valores ANOVA adicionales en la salida que muestran MSE (media de la suma de cuadrados para el error) y pes (eta cuadrado parcial)</br>\nActualmente soportamos un solo factor dentro de sujetos y entre sujetos, el factor entre sujetos es opcional.</br>\n<br/>\n<b>Uso</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"variableDependiente\", \n\tid = \"Identificador\", within = c(\"Tiempo\"), \tbetween = c(\"Tratamiento\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ndata: Un data.frame que contiene los datos. Obligatorio\n</li>\n<li>\ndv: vector de caracteres (de longitud 1) que indica la columna que contiene la variable dependiente en los datos.\n</li>\n<li>\nbetween: vector de caracteres que indica los factores/columnas entre sujetos en los datos. El valor predeterminado es NULL, lo que indica que no hay factores entre sujetos.\n</li>\n<li>\nwithin: vector de caracteres que indica los factores/columnas dentro de sujetos (o medidas repetidas) en los datos. El valor predeterminado es NULL, lo que indica que no hay factores dentro de sujetos.\n</li>\n<li>\ncovariate: vector de caracteres que indica las covariables entre sujetos (es decir, columnas) en los datos. El valor predeterminado es NULL, lo que indica que no hay covariables. Tenga en cuenta que factorize debe establecerse en FALSE en caso de que la covariable sea numérica y deba ser tratada como tal.\n</li>\n<li>\nanovatable: lista de argumentos adicionales pasados a la función que produce la tabla ANOVA. \n</li>\n</ul>\n<br/>\n<b>Detalles</b></br>\nConsulte la ayuda detallada de R</br>\n<b>Valor</b><br/>\naov_car, aov_4 y aov_ez son envolturas para Anova y aov, el valor de retorno depende del argumento de retorno. Por defecto, se devuelve un objeto S3 de clase \"afex_aov\" que contiene los siguientes slots:<br/>\n\"anova_table\": Una tabla ANOVA de clase c(\"anova\", \"data.frame\").<br/>\n\"aov\": objeto aov devuelto de aov (no debe usarse para evaluar la significancia de los efectos, pero puede pasarse a emmeans para pruebas post-hoc).<br/>\n\"Anova\": objeto devuelto de Anova, un objeto de clase \"Anova.mlm\" (si hay factores dentro de sujetos presentes) o de clase c(\"anova\", \"data.frame\").<br/>\n\"lm\": el objeto ajustado con lm y pasado a Anova (es decir, un objeto de clase \"lm\" o \"mlm\"). También se devuelve si return = \"lm\".<br/>\n\"data\": una lista que contiene: (1) largo (los datos posiblemente agregados en formato largo utilizados para aov), ancho (los datos utilizados para ajustar el objeto lm), e idata (si hay factores dentro de sujetos presentes, el argumento idata pasado a car::Anova). También se devuelve si return = \"data\".<br/>\n<b>Paquete</b></br>\nafex</br>\n<b>Ayuda</b></br>\nhelp(aov_ez, package ='afex')\nHaga clic en el botón de ayuda de R para obtener ayuda detallada de R. También puede ingresar help(aov_ez, package ='afex') y presionar CTRL Enter en el editor de sintaxis de R para obtener ayuda\n    "
  }
}