{
  "title": "Reformar, de ancho a largo",
  "label2": "Elija las variables para reformar o, alternativamente, elija las variables que no desea reformar. En este último caso, todas las variables restantes se reformarán en columna(s)",
  "navigation": "Más largo",
  "label0": "Puede elegir guardar los resultados en un nuevo conjunto de datos o sobrescribir el conjunto de datos existente",
  "label1": "Opciones",
  "advanced": "Avanzado",
  "New": "Guardar resultados en un nuevo conjunto de datos",
  "newdatasetname": "Ingrese un nombre para el conjunto de datos",
  "Existing": "Sobrescribir conjunto de datos existente",
  "label12": "Ingrese el/los nombre(s) de variable(s) para nueva(s) variable(s) de factor repetido",
  "repeatedMeasure": "NOTA: Al especificar múltiples nombres de variables que almacenan factores repetidos, sepárelos por comas, por ejemplo, Mes, Día. También debe hacer clic en avanzado para especificar cómo se crean los nombres de las variables.",
  "repeatedValue": "Nombre de variable para el valor repetido, por ejemplo, Conteo",
  "labelChoice": "Seleccione una de las opciones a continuación",
  "subsetvars": "Opción1: Seleccione variable(s) para reformar en una o más variable(s)",
  "names_sep": "Opción2: Especifique un carácter o expresión regular para dividir los nombres de las columnas y crear valores para los nombres de las variables. Toma la misma especificación que separate(), y puede ser un vector numérico (especificando posiciones para romper) o una sola cadena (especificando una expresión regular para dividir)",
  "names_pattern": "Opción1: Una expresión regular que contiene grupos de coincidencia (()). La parte coincidente de la expresión regular entre los () se utilizará para crear nombres de variables.",
  "dontReshape": "Opción2: Seleccione variable(s) que no desea reformar (todas las variables restantes se reformarán en columna(s))",
  "removeNA": "Eliminar filas donde el valor repetido es NA.",
  "makeString": "Hacer que el factor repetido sea un tipo de cadena R en lugar de un factor",
  "label3": "Si se crean múltiples nuevas variables para factores repetidos, las opciones a continuación controlan cómo se dividen los nombres de las columnas. Seleccione una de las 2 opciones a continuación.",
  "help": {
    "title": "Reformar (de ancho a largo)",
    "r_help": "help(pivot_longer, package=tidyr)",
    "body": "\n<b>Descripción</b></br>\nVea el video en <a href=\" https://youtu.be/ypLXqmFp3jY\">Reformar de ancho a largo</a></br>\nToma un conjunto de datos ancho y lo convierte en un conjunto de datos largo convirtiendo columnas en pares clave-valor\nPivot_longer toma múltiples columnas y las colapsa en pares clave-valor, duplicando todas las demás columnas según sea necesario. Utiliza pivot_longer() cuando notes que tienes columnas que no son variables.</br>\nEscriba vignette(\"pivot\") en el editor R para ver la ayuda de R. Si hay múltiples columnas para crear, debes especificar argumentos para indicar cómo se construyen los nombres de las columnas.</br>\nEn este caso, haga clic en avanzado para ingresar una expresión regular que especifique cómo deben crearse las variables a partir de los nombres de las columnas.</br>\nNOTA: Al especificar múltiples variables para el/los factor(es) repetido(s), sepárelas por ,\n<br/>\n<b>Uso</b>\n<br/>\n<code> \npivot_longer( cols=c(col1, col2...),names_to=\"key\",values_to=\"value\",values_drop_na = TRUE)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ncols: Columnas para pivotar en formato más largo.\n</li>\n<li>\nvalues_to: Una cadena que especifica el nombre de la columna a crear a partir de los datos almacenados en los valores de las celdas. Si names_to es un carácter que contiene el centinela especial .value, este valor será ignorado, y el nombre de la columna de valores se derivará de parte de los nombres de las columnas existentes. Si está vacío, se seleccionan todas las variables, excluya una variable y con -y. Al excluir variables, todas las variables restantes se pivotan a largo.\n</li>\n<li>\nvalues_drop_na: Si es TRUE, eliminará filas que contengan solo NAs en la columna value_to. Esto convierte efectivamente los valores faltantes explícitos en valores faltantes implícitos, y generalmente debe usarse solo cuando los valores faltantes en los datos fueron creados por su estructura.\n</li>\n<li>\nnames_sep: toma la misma especificación que separate(), y puede ser un vector numérico (especificando posiciones para romper) o una sola cadena (especificando una expresión regular para dividir).</br>\nSupongamos que las columnas son Height_1_1, Height_1_2, Weight_1_1, Weight_1_2, Sagur_1_1, Sagur_2_1 donde el primer número es el mes y el segundo la semana, especificar _ como separador resultará en 3 variables siendo creadas, la primera variable con valores Height, Weight, Sagur, la segunda con valores 1 y 2, y la tercera con valores 1 y 2.</br>\nEscriba help(regex) en el editor de código R para más detalles\n</li>\n<li>\nnames_pattern: toma la misma especificación que extract(), una expresión regular que contiene grupos de coincidencia (()).\ntoma la misma especificación que separate(), y puede ser un vector numérico (especificando posiciones para romper) o una sola cadena (especificando una expresión regular para dividir).</br>\nSupongamos que las columnas son Height_33.1_1, Height_44.1_2, Weight_66.1_1, Weight_55.1_2, donde los 2 dígitos después del primer guion bajo deben ser ignorados, el dígito después del . es el mes y el dígito después del último _ es la semana.</br>\nLas expresiones regulares que extraen los valores de las nuevas variables deben estar en (). La expresión regular será (.*)_.*.(.*)_(.)</br> \nNota: . en una expresión regular significa cualquier carácter</br> \n* significa 0 o más, así que .* significa 0 o más caracteres</br> \nAsí que la cadena puede interpretarse como buscando un patrón de</br> \n(.*) 0 o más caracteres seguidos de</br> \n _ un guion bajo seguido de</br> \n .*. uno o más caracteres seguidos de la . (escapando el . con un  indica que es el carácter en sí seguido de</br> \n.* uno o más caracteres seguidos de</br> \n_ guion bajo seguido de</br> \n. un solo carácter</br> \nTodos los patrones entre los () forman valores de cada una de las 3 nuevas variables de factor</br> \n</li>\n</ul>\n<b>Valor</b><br/>\nDevuelve el conjunto de datos reformado\n<br/>\n<b>Paquete</b></br>\ntidyr</br>\n<b>Ayuda</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
  }
}