{
  "title": "Emparejamiento de Conjuntos de Riesgo",
  "navigation": "Emparejamiento de Conjuntos de Riesgo",
  "newdatasetnamelabel": "Nombre del conjunto de datos para almacenar datos emparejados",
  "groupvarlabel": "Variable de evento (1=evento, 0=censura)",
  "timevarlabel": "Variable de tiempo",
  "calipervarslabel": "Variables para emparejamiento (numéricas)",
  "caliperslabel": "Especifique los calipers en el orden de las variables de emparejamiento separadas por comas, por ejemplo 5, 2; especifique 0 para coincidencias exactas",
  "ratiolabel": "Número de controles por caso",
  "repeatcontrolslabel": "Permitir que los controles se emparejen más de una vez",
  "supercontrolslabel": "No permitir que los casos se emparejen con otros casos",
  "help": {
    "title": "Emparejamiento de Conjuntos de Riesgo",
    "body": "\n            Realiza el emparejamiento de sujetos por conjuntos de riesgo dentro de una cohorte. Aquellos con el evento de resultado (casos) se emparejan con aquellos que no han tenido el evento (controles) y que están en el conjunto de riesgo en el momento del evento del caso. Este es un diseño de caso/control anidado. Las variables de referencia conocidas al ingreso a la cohorte también se utilizan para emparejar casos y controles.\n\t\t\t<br/><br/>\n\t\t\tSe admiten variables de referencia cuyos valores deben coincidir exactamente y valores que coinciden dentro de calipers numéricos. Los controles se seleccionan al azar entre todos los controles elegibles para cada caso.\n\t\t\t<br/><br/>\n\t\t\tEl conjunto de datos de salida que contiene los datos emparejados contendrá las variables originales, el indicador de evento (\"fallido\") y una variable que identifica el conjunto emparejado (\"match.num\").\n\t\t\t<br/><br/>\n\t\t\tLas observaciones con valores faltantes para las variables involucradas en el proceso de emparejamiento se eliminan antes del emparejamiento.\n\t\t\t<br/><br/>\n\t\t\tUna breve introducción a los diseños de caso/control anidados se puede encontrar en:\n\t\t\tEssebag V, et al. El estudio de caso-control anidado en cardiología. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>Nombre del conjunto de datos para almacenar datos emparejados:</b>\n\t\t\t<br/>Nombre del conjunto de datos de salida que contiene los conjuntos de sujetos emparejados.\n\t\t\t<br/><br/>\n\t\t\t<b>Variable de evento (1=evento, 0=censura):</b>\n\t\t\t<br/>Nombre de la variable que indica aquellos con eventos. Debe ser numérico con 1=evento y 0=censura.\n\t\t\t</br><br/>\n\t\t\t<b>Variables para emparejamiento:</b>\n\t\t\t<br/>Especifique las variables de referencia para las que desea que se emparejen los conjuntos de casos/control. Estas deben ser numéricas.\n\t\t\t<br/><br/>\n\t\t\t<b>Especifique los calipers en el orden de las variables de emparejamiento:</b>\n\t\t\t<br/>Especifique los valores de caliper numéricos para cada una de las variables, en el orden de las variables. Las coincidencias exactas deben usar un caliper de 0. \n\t\t\tPor ejemplo, si la edad (en años) se especificó con un caliper de 5, eso significa que los controles deben estar dentro de +/- 5 años de su caso emparejado.\n\t\t\tCada variable de emparejamiento debe tener un valor de caliper especificado.\n\t\t\t<br/><br/>\n\t\t\t<b>Número de controles por caso:</b>\n\t\t\t<br/>Este es el número máximo de controles que se emparejarán a cada caso. Algunos conjuntos emparejados pueden tener menos que este valor si no se pueden identificar coincidencias adecuadas.\n            <br/><br/>\n\t\t\t<b>Permitir que los controles se emparejen más de una vez:</b>\n\t\t\t<br/>Especifique si desea que los controles puedan emparejarse potencialmente con más de un caso. Recomendamos seleccionar esta opción para evitar sesgos.\n            <br/><br/>\n\t\t\t<b>No permitir que los casos se emparejen con otros casos:</b>\n\t\t\t<br/>Especifique si se debe permitir que los casos sean considerados como controles antes del momento del evento del caso. Recomendamos no seleccionar esta opción para evitar sesgos. No seleccionar esta opción significa que un caso está en el grupo de riesgo de control y es elegible para ser emparejado con otro caso, hasta su momento de evento.\n            <br/><br/>\n            <b>Paquetes R requeridos:</b> dplyr, tidyr\n"
  }
}