{
  "title": "Ayuda del paquete R",
  "navigation": "Ayuda del paquete R",
  "packageName": "Seleccione un paquete R instalado",
  "help": {
    "title": "Ayuda del paquete R",
    "r_help": "ayuda()",
    "body": "\n<b>Descripción</b></br>\nhelp es la interfaz principal de los sistemas de ayuda.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nayuda(tópico, paquete = NULL, lib.loc = NULL,\n    verbose = getOption(\"verbose\"),\n    try.all.packages = getOption(\"help.try.all.packages\"),\n    help_type = getOption(\"help_type\"))\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ntópico: generalmente, un nombre o cadena de caracteres que especifica el tema para el cual se busca ayuda. Una cadena de caracteres (entre comillas simples o dobles explícitas) siempre se toma como un nombre de tema. Si el valor de tópico es un vector de caracteres de longitud uno, el tema se toma como el valor del único elemento. De lo contrario, el tema debe ser un nombre o una palabra reservada (si es sintácticamente válido) o una cadena de caracteres. \n</li>\n<li>\npaquete: un nombre o vector de caracteres que da los paquetes en los que buscar documentación, o NULL. Por defecto, se utilizan todos los paquetes cuyos espacios de nombres están cargados. Para evitar que un nombre sea descompuesto, use por ejemplo (pkg_ref).\n</li>\n<li>\nlib.loc: un vector de caracteres de nombres de directorios de bibliotecas R, o NULL. El valor predeterminado de NULL corresponde a todas las bibliotecas actualmente conocidas. Si se utiliza el valor predeterminado, se buscan primero los paquetes y espacios de nombres cargados antes de las bibliotecas.\n</li>\n<li>\nverbose: lógico; si es TRUE, se informa el nombre del archivo.\n</li>\n<li>\ntry.all.packages: lógico; ver Nota.\n</li>\n<li>\nhelp_type: cadena de caracteres: el tipo de ayuda requerida. Los valores posibles son \"texto\", \"html\" y \"pdf\". Se ignora la capitalización y se permiten coincidencias parciales.\n</li>\n</ul>\n<b>Detalles</b></br>\nLa ayuda sobre el paquete</br>\n<b>Ejemplos</b><br/>\n<code> \nayuda(paquete = \"splines\")\n</code> <br/>\n<b>Paquete</b></br>\nutils</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de este cuadro de diálogo o ejecute el siguiente comando en el editor de sintaxis R: ayuda()\n                "
  }
}