{
  "title": "Califica un conjunto de datos utilizando un Modelo de Supervivencia (Todas las variables deben",
  "navigation": "Supervivencia (Estándar)",
  "filterModels": "Filtrar modelos por clase",
  "modelSelection": "Selecciona un modelo para calificar un conjunto de datos",
  "label1": "Pruebas diagnósticas",
  "levelOfInterest": "Cuando la variable a predecir tiene 2 niveles, especifica el nivel de interés. La matriz de confusión y las estadísticas relacionadas se muestran con el nivel de interés especificado como referencia",
  "label12": "Resultados de la prueba: Tan pronto como se selecciona un modelo, realizaremos pruebas para ver si las variables dependientes especificadas en el modelo están disponibles en el conjunto de datos a calificar. Los resultados se mostrarán aquí",
  "label2": "Guardar valores predichos y estadísticas de apoyo.",
  "label3": "Predicciones y probabilidades predichas donde sea aplicable se almacenan en el conjunto de datos que se califica como nuevas variables con el prefijo a continuación",
  "label4": "**Para variables dependientes con 2 niveles, el 2º nivel se trata como el nivel positivo. Ver Datos > Niveles de Factor > Reordenar Niveles Manualmente para cambiar el orden de los niveles de factor y reconstruir el modelo.",
  "conflevel": "Guardar intervalos de confianza para valores predichos individuales **(Válido solo para modelos lineales (clase lm))",
  "roctable": "Mostrar tabla ROC (**Solo para variables dependientes binarias)",
  "colname": "Especificar prefijo del nombre de columna",
  "label5": "**Marcar la casilla anterior incurrirá en una penalización de rendimiento para conjuntos de datos grandes.",
  "level": "Especificar el nivel de confianza",
  "confusioncheck": "Generar Matriz de Confusión",
  "help": {
    "title": "Califica un Conjunto de Datos Usando un Modelo",
    "r_help": "help(predict, package='stats')",
    "body": "\n    <b>Descripción</b></br>\n    La calificación del modelo hace lo siguiente</br>\n    1. Califica el conjunto de datos actual utilizando el modelo preconstruido seleccionado. Almacena predicciones con el intervalo de confianza especificado en el conjunto de datos actual utilizando el prefijo especificado.</br>\n    2. Opcionalmente crea una matriz de confusión y una curva ROC</br>\n    3. En el caso de que estés calificando un conjunto de datos de entrenamiento que contiene la variable dependiente/variable a predecir y la variable dependiente tiene 2 niveles, tienes la opción de seleccionar el nivel de referencia/nivel de interés.<br/>\n    4. La matriz de confusión y las estadísticas relacionadas se crean utilizando el nivel de interés especificado.<br/>\n    Ver detalles sobre la función predict y la matriz de confusión a continuación\n    <br/>\n    <br/>\n    <b>Descripción</b></br>\n    predict es una función genérica para hacer predicciones utilizando el modelo seleccionado. \n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    modelname: un objeto de modelo para el cual se desea la predicción.\n    </li>\n    <li>\n    prefix: cadena de prefijo que se utilizará para crear nuevas variables que contengan las predicciones.\n    </li>\n    <li>\n    datasetname: es el conjunto de datos actual para calificar y guardar predicciones.\n    </li>\n    </ul>\n    <b>Detalles</b></br>\n    Almacena predicciones con el intervalo de confianza especificado en el conjunto de datos actual utilizando el prefijo especificado.</br>\n    <b>Paquete</b></br>\n    stats</br>\n    <b>Ayuda</b></br>\n    Para ayuda detallada, haz clic en el ícono de R en la parte superior derecha de este diálogo o ejecuta el siguiente comando help(predict, package ='stats') en la ventana del editor de R\n    </br>\n    </br>\n    <b>Descripción</b></br>\n    Crea una matriz de confusión mediante la tabulación cruzada de las clases observadas y predichas con estadísticas asociadas. \n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    modelname: un objeto de modelo para el cual se desea la matriz de confusión.\n    </li>\n    <li>\n    showCofusionMatrix: lógico, si es VERDADERO se genera la matriz de confusión (si aplica), si es FALSO, no se genera la matriz de confusión.\n    </li>\n    <li>\n    predictions: un objeto que se devuelve como resultado de la llamada a predict().\n    </li>\n    <li>\n    datasetname: es el nombre del conjunto de datos actual que queremos usar para hacer predicciones.\n    </li>\n    </ul>\n    <b>Detalles</b></br>\n    Muestra la matriz de confusión utilizando la función confusionMatrix en el paquete caret</br>\n    <b>Paquete</b></br>\n    caret</br>\n    <b>Ayuda</b></br>\n    Para ayuda detallada, haz clic en el ícono de R en la parte superior derecha de este diálogo o ejecuta el siguiente comando help(confusionMatrix, package ='caret') en la ventana del editor de R\n                "
  }
}