{
  "title": "Correlaciones parciales",
  "navigation": "Parcial",
  "tvarbox1": "Seleccionar variables",
  "statistic": "Seleccionar un método",
  "tvarbox2": "Seleccionar variables de control",
  "help": {
    "title": "Correlaciones parciales",
    "r_help": "help(pcor.test, package=ppcor)",
    "body": "\n<b>Descripción</b></br>\nCorrelación parcial para dos variables dadas una tercera variable. Calcularemos la correlación parcial por pares entre cada una de las variables especificadas en el control de variables seleccionadas, controlando las variables especificadas en el control de variables de control.<br/>\nHemos escrito un envoltorio alrededor de la función pcor.test que llama a pcor.test para cada par de las variables especificadas.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \npcor.test(x, y, z, method = c(\"pearson\", \"kendall\", \"spearman\"))</br>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nArgumentos\nx: un vector numérico.\n</li>\n<li>\ny: un vector numérico.\n</li>\n<li>\ny: un vector numérico.\n</li>\n<li>\nmethod: una cadena de caracteres que indica qué coeficiente de correlación parcial se debe calcular. Uno de \"pearson\" (predeterminado), \"kendall\" o \"spearman\" puede ser abreviado..\n</li>\n</ul>\n<b>Detalles</b></br>\nLa correlación parcial es la correlación de dos variables mientras se controla una tercera variable. Cuando el determinante de la matriz de varianza-covarianza es numéricamente cero, se utiliza la inversa generalizada de Moore-Penrose. En este caso, no se proporcionará ningún valor p ni estadística si el número de variables es mayor o igual al tamaño de la muestra.</br>\n<b>Valor</b><br/>\nestimación: el coeficiente de correlación parcial entre dos variables.<br/>\np.valor: el valor p de la prueba.<br/>\nn: El número de muestras.<br/>\n<b>Ejemplos</b><br/>\n<code> \npcor.test(y.data$hl,y.data$disp,y.data[,c(\"deg\",\"BC\")])\n</code> <br/>\n<b>Paquete</b></br>\nppcor</br>\n<b>Ayuda</b></br>\nhelp(pcor.test, package=ppcor)\n"
  }
}