{
  "title": "Emparejamiento de Sujetos",
  "navigation": "Emparejamiento de Sujetos",
  "newdatasetnamelabel": "Nombre del conjunto de datos para almacenar los datos emparejados",
  "groupvarlabel": "Variable de caso/control (control=valor bajo, caso=valor alto)",
  "notelabel": "Nota: Debe especificar al menos una variable para variables exactas o de caliper",
  "exactvarslabel": "Variables para emparejamiento exacto",
  "calipervarslabel": "Variables para emparejamiento por caliper",
  "caliperslabel": "Especifique los calipers en el orden de las variables de caliper separadas por comas, por ejemplo, 5, 2",
  "idvarlabel": "Variable ID de sujeto",
  "ratiolabel": "Número de controles por caso",
  "help": {
    "title": "Emparejamiento de Sujetos",
    "r_help": "ayuda(matchit, paquete = 'MatchIt')",
    "body": "\n            Realiza un emparejamiento por vecino más cercano donde un conjunto de casos se empareja con 1 o más controles. Esto es apropiado para estudios de caso/control y estudios de cohortes emparejadas.\n\t\t\t<br/><br/>\n\t\t\tSe admiten variables para las que los valores deben coincidir exactamente y valores que coinciden dentro de calipers numéricos.\n\t\t\tEl emparejamiento se realiza sin reemplazo (cada sujeto solo puede emparejarse una vez) y los controles entre los controles potenciales se seleccionarán de acuerdo con el orden de los datos para cada caso.\n\t\t\t<br/><br/>\n\t\t\tEl conjunto de datos de salida contendrá los datos originales y dos variables adicionales: 1) subclase: una variable que identifica el conjunto emparejado, y 2) pesos: una variable de peso de caso emparejado que se puede utilizar en análisis posteriores, si se desea.\n\t\t\t<br/><br/>\n\t\t\t<b>Nombre del conjunto de datos para almacenar los datos emparejados:</b>\n\t\t\t<br/>Nombre del conjunto de datos de salida que contiene los conjuntos de sujetos emparejados.\n\t\t\t<br/><br/>\n\t\t\t<b>Variable de caso/control (control=valor bajo, caso=valor alto):</b>\n\t\t\t<br/>Nombre de la variable que indica casos y controles. Puede ser numérica, factor o carácter.  \n\t\t\tSi es una variable numérica, debe codificarse como 0=control, 1=caso. Si es una variable de factor, el nivel de orden inferior será el control y el nivel de orden superior será el caso.  \n\t\t\tSi es una variable de carácter, el valor de orden inferior (por orden alfabético) será el control, y el valor de orden superior (por orden alfabético) será el caso.\n\t\t\tPor lo tanto, para estar más seguros, recomendamos codificar como 0=control, 1=caso.\n\t\t\t</br><br/>\n\t\t\t<b>Variables para emparejamiento exacto:</b>\n\t\t\t<br/>Especifique las variables para las que desea que los conjuntos de caso/control se emparejen exactamente.  \n\t\t\tEsto significa que los casos y controles en un conjunto emparejado tienen exactamente los mismos valores para estas variables. Estas pueden ser variables de carácter, fecha, numéricas, de factor o ordinales.\n\t\t\t<br/><br/>\n\t\t\t<b>Variables para emparejamiento por caliper:</b>\n\t\t\t<br/>Especifique las variables para las que desea que los conjuntos de caso/control se emparejen en valores de caliper numéricos. Los controles estarán dentro de un ancho de caliper especificado para cada una de estas variables.\n\t\t\tEstas pueden ser variables numéricas o de fecha. Cada variable de caliper debe tener un valor de caliper especificado.\n\t\t\t<br/><br/>\n\t\t\t<b>Especifique los calipers en el orden de las variables de caliper separadas por comas:</b>\n\t\t\t<br/>Especifique los valores de caliper numéricos para cada una de las variables de caliper, en el orden de las variables de caliper.  \n\t\t\tPor ejemplo, si la edad (en años) se especificó con un caliper de 5, eso significa que los controles deben estar dentro de +/- 5 años de su caso emparejado.\n\t\t\tCada variable de caliper debe tener un valor de caliper especificado. Si no hay variables de caliper, este campo debe estar vacío.\n\t\t\t<br/><br/>\n\t\t\t<b>Número de controles por caso:</b>\n\t\t\t<br/>Este es el número máximo de controles que se emparejarán con cada caso. Algunos conjuntos emparejados pueden tener menos que este valor si no se pueden identificar coincidencias adecuadas.\n            <br/><br/>\n            <b>Paquetes R requeridos:</b> dplyr, tidyr, MatchIt\n"
  }
}