{
  "title": "Conjunto de Datos por Lógica",
  "navigation": "Conjunto de Datos por Lógica",
  "label0": "Puedes elegir guardar los resultados en un nuevo conjunto de datos o sobrescribir el conjunto de datos existente",
  "label1": "Opciones",
  "New": "Guardar resultados en un nuevo conjunto de datos",
  "newdatasetname": "Ingresa un nombre para el conjunto de datos",
  "Existing": "Sobrescribir conjunto de datos existente",
  "Output": "Mostrar resultados en la ventana de salida",
  "distinct": "Seleccionar casos distintos",
  "chkbox2": "Eliminar niveles de factores no utilizados",
  "subsetvars": "Seleccionar variables para incluir en el conjunto de datos filtrado",
  "label12": "Los criterios de filtrado se aplican a cada fila, ver ejemplos a continuación. \n1: Seleccionar filas donde var 1 no está vacío y var2 está vacío especificar:\n!is.na(var1) & is.na(var2) \n2: Seleccionar filas donde var1 > 30 y var 2 es Hombre especificar:\nvar1>30 & var2=='Hombre' \n3: Criterios complejos y/o especificar:\n(var1 !=10 & var2>20) | var3==40 \n4: Coincidencia de patrón (xxx) o una coincidencia exacta (abc) especificar:\n(grepl(\"xxx\",var1) ==TRUE) | var1==\"abc\" \n5: Coincidir una subcadena por posición especificar: substr(var1,2,4) ==\"abc\"",
  "subsetexpression": "Ingresa criterios de filtrado.",
  "help": {
    "title": "Conjunto de Datos",
    "r_help": "help(filter, package=dplyr)",
    "body": "\n            <b>Descripción</b></br>\nDevuelve un subconjunto del conjunto de datos. Puedes especificar las columnas/variables que deseas en el conjunto de datos más pequeño. También puedes especificar criterios de selección que se aplicarán a cada fila del dataframe.\n<br/><br/>\n<b>Guardar resultados en un nuevo conjunto de datos:</b> Especifica un nuevo conjunto de datos para almacenar los datos filtrados\n<br/><br/>\n<b>Sobrescribir conjunto de datos existente:</b> Esto guarda el conjunto de datos filtrado con el nombre del conjunto de datos existente\n<br/><br/>\n<b>Mostrar resultados en la ventana de salida:</b> Esto imprime el conjunto de datos filtrado en la ventana de salida solamente. El conjunto de datos filtrado no se guarda en un conjunto de datos.\n<br/><br/>\n<b>Seleccionar casos distintos:</b> Esto elimina duplicados del conjunto de datos filtrado. Todas las variables deben ser las mismas para ser consideradas un duplicado.\n<br/><br/>\n<b>Eliminar niveles de factores no utilizados:</b> Esto elimina niveles de factores que fueron excluidos por el subconjunto (es decir, que ya no aparecen en los datos).\n<br/><br/>\n<b>Seleccionar variables para incluir en el conjunto de datos filtrado:</b> Esto permite al usuario seleccionar columnas específicas que desea incluir en el conjunto de datos. Si se especifican, solo las variables especificadas aparecerán en el conjunto de datos filtrado. Si no se especifican variables, se mantendrán todas las variables.\n<br/><br/>\n<b>Ingresa criterios de filtrado:</b> Especifica la lógica de variable que se utilizará para filtrar las filas del conjunto de datos.\n<br/><br/>\n<b>Paquete R</b></br>\ndplyr<br/>  \n<b>Ayuda</b></br>\nhelp(filter, package=dplyr)\n"
  }
}