{
  "title": "Tabla, Avanzada",
  "navigation": "Tabla, Avanzada",
  "notelabel": "NOTA: Al menos una variable debe especificarse en al menos una de las siguientes: Prueba ANOVA, Prueba de Kruskal-Wallis, Prueba de Mediana, Prueba Chi-Cuadrado de Pearson, Prueba Exacta de Fisher, Prueba de Tendencia Ordinal, o Ninguna Prueba",
  "anovavarslabel": "Variables para la Prueba ANOVA",
  "kwvarslabel": "Variables para la Prueba de Kruskal-Wallis",
  "medvarslabel": "Variables para la Prueba de Mediana",
  "chisqvarslabel": "Variables para la Prueba Chi-Cuadrado de Pearson",
  "fishervarslabel": "Variables para la Prueba Exacta de Fisher",
  "ordvarslabel": "Variables para la Prueba de Tendencia Ordinal",
  "notestvarslabel": "Variables para Ninguna Prueba",
  "bygroupvarlabel": "Grupos a Comparar",
  "stratavarlabel": "Estratos (opcional)",
  "tabletitlelabel": "Título de la Tabla",
  "totalcolchkboxlabel": "Incluir columna total",
  "groupvarchkboxlabel": "Incluir nombre de variable de grupo",
  "digitslabel": "Dígitos Después del Decimal",
  "contdigitslabel": "Valores Continuos",
  "pctdigitslabel": "Porcentajes",
  "pvaluedigitslabel": "Valores P",
  "simplifylabel": "Simplificar Resúmenes de Variables de Múltiples Filas a Una Fila (si es posible)",
  "numericsimplifylabel": "Variables Numéricas",
  "categorysimplifylabel": "Variables Categóricas",
  "ordinalsimplifylabel": "Variables Ordinales",
  "datesimplifylabel": "Variables de Fecha",
  "labelsimplifylabel": "Usar Último Nivel en la Etiqueta de Variables Categóricas",
  "conflevellabel": "Nivel de Confianza",
  "simchkboxlabel": "Simular valores p para Pearson y Fisher",
  "simnumlabel": "Número de Simulaciones",
  "footnotechkboxlabel": "Nota al pie de Nombres de Pruebas",
  "optvarStatistical": "Opciones de pruebas estadísticas",
  "optvarNumerical": "Opciones de estadísticas numéricas",
  "optvarCategorical": "Opciones de estadísticas numéricas",
  "optvarDate": "Opciones de estadísticas numéricas",  
  "sampsizelabel": "Tamaño de Muestra",
  "meanlabel": "Media",
  "quantileslabel": "Cuantiles",
  "otherlabel": "Otro",
  "nmissanylabel": "Número Faltante, si lo hay",
  "nmissalwayslabel": "Número Faltante, siempre",
  "meansdlabel": "Media (SD)",
  "meancilabel": "Media (CI)",
  "meanselabel": "Media (SE)",
  "gmeanlabel": "Media Geométrica",
  "gmeansdlabel": "Media Geométrica (SD)",
  "gmeancilabel": "Media Geométrica (CI)",
  "trimmeancilabel": "Media Recortada (CI)",
  "trimpctlabel": "Especificar Porcentaje de Media Recortada",
  "medianlabel": "Mediana",
  "medianq1q3label": "Mediana (percentil 25, percentil 75)",
  "q1q3label": "(percentil 25, percentil 75)",
  "iqrlabel": "Rango Intercuartílico",
  "medianrangelabel": "Mediana (Rango)",
  "medianmadlabel": "Mediana (Desviación Absoluta Mediana)",
  "rangelabel": "Rango",
  "minlabel": "Mínimo",
  "maxlabel": "Máximo",
  "pct1label": "1er percentil (CI)",
  "pct5label": "5to percentil (CI)",
  "pct10label": "10mo percentil (CI)",
  "pct25label": "25to percentil (CI)",
  "pct33label": "33 1/3 percentil (CI)",
  "pct50label": "Mediana (CI)",
  "pct66label": "66 2/3 percentil (CI)",
  "pct75label": "75to percentil (CI)",
  "pct90label": "90mo percentil (CI)",
  "pct95label": "95to percentil (CI)",
  "pct99label": "99no percentil (CI)",
  "custquantlabel": "Percentil Personalizado (CI)",
  "custquantvaluelabel": "Especificar percentil",
  "skewnesslabel": "Asimetría",
  "kurtosislabel": "Curtosis",
  "sumlabel": "Suma",
  "sdlabel": "SD",
  "varlabel": "Varianza",
  "gsdlabel": "SD de Media Geométrica",
  "cvlabel": "Coeficiente de Variación",
  "freqlabel": "Frecuencia",
  "freqtotallabel": "Frecuencia/Total",
  "freqpctlabel": "Frecuencia (%)",
  "propcilabel": "Proporción (CI)",
  "ciFootNote": "Nota al pie del Nivel de Confianza",
  "help": {
    "title": "Tabla, Avanzada",
    "r_help": "help(tableby, package ='arsenal')",
    "body": "\nEsto crea una tabla de estadísticas resumidas dentro de grupos para comparar y una variable de estratificación para hacer las comparaciones dentro. Se creará una columna para cada categoría de variable de grupo.\nLas categorías de la variable de estratificación formarán filas adicionales para la tabla. Se pueden especificar varias estadísticas resumidas y pruebas estadísticas.\n<br/><br/>\nNota: Las fechas de cualquier clase se convertirán a la clase de Fecha solo para fines de resumen. Su conjunto de datos original no se verá afectado. Esto también significa que las fechas resumidas serán precisas solo hasta el día.\n<br/><br/>\n<b>Grupos a Comparar:</b> Variable que define las categorías a comparar\n<br/><br/>\n<b>Variables para la Prueba ANOVA:</b> Especificar variables numéricas o de fecha para comparaciones de grupo utilizando la prueba de Análisis de Varianza (ANOVA)\n<br/><br/>\n<b>Variables para la Prueba de Kruskal-Wallis:</b> Especificar variables numéricas, de fecha o de factor ordinal para comparaciones de grupo utilizando la prueba de Kruskal-Wallis\n<br/><br/>\n<b>Variables para la Prueba de Mediana:</b> Especificar variables numéricas o de fecha para comparaciones de grupo utilizando una prueba de medianas\n<br/><br/>\n<b>Variables para la Prueba Chi-Cuadrado de Pearson:</b> Especificar variables de factor nominal o de factor ordinal para comparaciones de grupo utilizando la prueba Chi-Cuadrado de Pearson\n<br/><br/>\n<b>Variables para la Prueba Exacta de Fisher:</b> Especificar variables de factor nominal o de factor ordinal para comparaciones de grupo utilizando la prueba Exacta de Fisher\n<br/><br/>\n<b>Variables para la Prueba de Tendencia Ordinal:</b> Especificar variables de factor nominal o de factor ordinal para comparaciones de grupo utilizando una prueba de tendencia. Para dos grupos, esto es esencialmente la prueba de tendencia de Cochran-Armitage.\n<br/><br/>\n<b>Variables para Ninguna Prueba:</b> Especificar variables que desea resumir solo dentro de grupos. No se computarán pruebas estadísticas para estas variables.\n<br/><br/>\nNota: Debe especificar al menos una variable para resumir para que se produzca una tabla.\n<br/><br/>\n<b>Estratos (opcional):</b> Variable que define las categorías dentro de las cuales se realizarán las comparaciones\n<br/><br/>\n<b>Título de la Tabla:</b> especificar el título de la tabla\n<br/><br/>\n<b>Incluir columna total:</b> si se incluye o no una columna total en la tabla\n<br/><br/>\n<b>Incluir nombre de variable de grupo:</b> si se incluye o no el nombre de la variable de grupo en la tabla\n<br/><br/>\n<b>Dígitos Después del Decimal:</b> especificar cuántos dígitos mostrar después del punto decimal para valores continuos, porcentajes y valores p\n<br/><br/>\n<b>Simplificar Resúmenes de Variables de Múltiples Filas a Una Fila (si es posible):</b> Para variables categóricas de dos categorías (factor/ordinal) o resúmenes únicos de variables numéricas o de fecha, puede colapsar las filas para que todos los nombres de variables y estadísticas aparezcan en una sola fila. Los resúmenes para la última categoría de cada variable categórica se mostrarán. Cualquier variable para la cual el colapso no sea posible ocupará múltiples filas. Esta opción se puede activar/desactivar para cada tipo de variable por separado.\n<br/><br/>\n<b>Usar Último Nivel en la Etiqueta de Variables Categóricas:</b> Para tablas simplificadas, esto incluye el último nivel de variables de factor/ordinal en la etiqueta de fila.\n<br/><br/>\n<b>Nivel de Confianza:</b> Esto establece el nivel de confianza de los intervalos de confianza.\n<br/><br/>\n<b>Opciones de Prueba Estadística</b>\n<br/><br/>\n<b>Pruebas Estadísticas:</b> Las simulaciones de Pearson y Fisher proporcionan la capacidad de obtener valores p simulados para las pruebas chi-cuadrado de Pearson y las pruebas Exactas de Fisher. Este procedimiento crea simulaciones de Monte Carlo el número especificado de veces (Número de Simulaciones). Esto puede ser útil en casos donde los cálculos estándar, especialmente para la prueba Exacta de Fisher, resultan en errores de memoria de computadora.\n<br/><br/>\n<b>Nota al pie de Nombres de Pruebas:</b> si se incluye o no notas al pie de valores p que enumeran las pruebas estadísticas realizadas para cada variable\n<br/><br/>\n<b>Opciones de Estadísticas Numéricas:</b>\n<br/>estadísticas que se mostrarán para variables numéricas\n<br/><br/>\n<b>Opciones de Estadísticas Categóricas:</b> \n<br/>estadísticas que se mostrarán tanto para factores nominales como ordenados\n<br/><br/>\n<b>Estadísticas de Fecha:</b>\n<br/>estadísticas que se mostrarán para variables de fecha\n<br/><br/>\n<b>Nota:</b> Si desea resumir una variable de un tipo específico, se recomienda que seleccione al menos una estadística en esa categoría que no sea \"Número Faltante, si lo hay\". Si \"Número Faltante, si lo hay\" es la única opción seleccionada y ninguna variable tiene un valor faltante, entonces resultará en un error.\n<br/><br/>\n<b>Paquetes R Requeridos:</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
  }
}