{
  "title": "Gráfico de Series Temporales",
  "navigation": "Gráfico de Series Temporales",
  "x": "Variable de fecha para mostrar fechas en el eje x",
  "y": "Variable Y, selecciona una o más variable(s) para graficar",
  "Fill": "Especifica una variable de agrupamiento (Categoría)",
  "flipaxis": "Invertir eje",
  "jitterPointsChk": "Expandir (efecto de jitter) los puntos superpuestos/aglomerados para un grupo",
  "specify_a_title": "Ingresa un título",
  "x_title": "Etiqueta del eje X",
  "y_title": "Etiqueta del eje Y",
  "legends": "Mostrar leyendas y, de ser así, posición de las leyendas (por defecto a la derecha)",
  "angleXaxis_text": "Ángulo para inclinar los valores de texto del eje x (por defecto 0 para no inclinar)",
  "angleYaxis_text": "Ángulo para inclinar los valores de texto del eje y (por defecto 0 para no inclinar)",
  "labelDateAxisFormat": "Formato del valor de fecha si el eje x o el eje y tiene valores de fecha",
  "dateUnitStr": "Una unidad de fecha de agrupamiento (por ejemplo, día, semana, mes, año, etc.) para los valores de fecha, si se deja en blanco, los valores de fecha se calcularán automáticamente",
  "dateUnitInteger": "(Opcional) Un agrupamiento adicional para la unidad de fecha (por ejemplo, '1 día', '2 semanas', '3 meses', etc.)",
  "dateAxisFormat": "Elige un formato para el texto del valor de fecha",
  "timeAxisFormat": "Elige un formato para el texto del valor de tiempo",
  "subSecondsFormat": "Mostrar subsegundos en los valores de fecha y hora en el eje",
  "axisTickmarksCount": "Cuántos valores de eje (es decir, marcas de graduación) mostrar (por defecto 10)",
  "subSecondsFormatTickmarksLocationChk": "Mostrar el valor de subsegundos en las ubicaciones exactas cuando el total de puntos de datos es menor que el total de marcas de graduación elegidas (por defecto 10)",
  "Facetrow": "Fila de Facetas",
  "Facetcolumn": "Columna de Facetas",
  "Facetwrap": "Envolver Facetas (si se elige, cualquier selección de fila y columna de Facetas será ignorada)",
  "Facetscale": "Escala de Facetas",
  "label1": "Líneas horizontales",
  "yIntercept": "Ingresa valores de intersección Y separados por comas para las líneas horizontales, por ejemplo, 100, 200, 300, y para fechas 2024/01/15, 2025/03/15",
  "hLineColor": "Selecciona un color para las líneas y etiquetas (Después de seleccionar el color, haz clic fuera del control para aplicar)",
  "lineType": "Selecciona el tipo de línea",
  "horizontalLinelabel": "Especifica etiquetas separadas por comas (sin comillas) para las líneas horizontales",
  "horizontalLinelabel_angle_text": "Ángulo para inclinar el texto de la etiqueta de la línea horizontal (por defecto 0 para no inclinar)",
  "label2": "Nota: Valores mayores mueven el texto hacia abajo, valores más pequeños mueven el texto hacia arriba",
  "addHoriRefLines": "Agregar líneas de referencia",
  "label3": "Líneas verticales",
  "xIntercept": "Ingresa valores de intersección X separados por comas para las líneas verticales, por ejemplo, 100, 200, 300, y para fechas 2024/01/15, 2025/03/15",
  "vLineColor": "Selecciona un color para las líneas y etiquetas (Después de seleccionar el color, haz clic fuera del control para aplicar)",
  "vlineType": "Selecciona el tipo de línea",
  "verticalLinelabel": "Especifica etiquetas separadas por comas (sin comillas) para las líneas verticales",
  "verticalLinelabel_angle_text": "Ángulo para inclinar el texto de la etiqueta de la línea vertical (por defecto 0 para no inclinar)",
  "label4": "Nota: valores mayores colocan el texto a la izquierda, valores más pequeños mueven el texto a la derecha",
  "facets_lbl": "Facetas",
  "xyLimits": "Límites del eje X y Y",
  "label5": "Especifica un rango para los valores del eje X y Y",
  "rangeXValues": "Especifica el rango del eje X, por ejemplo, rangos de fecha 2024/01/15, 2025/03/15",
  "rangeYValues": "Especifica el rango del eje Y, por ejemplo, 0,100 o para rangos de fecha 2024/01/15, 2025/03/15",
  "labelHori_HorizontalJustification": "Nota: valores mayores colocan el texto a la izquierda, valores más pequeños mueven el texto a la derecha",
  "labelVeri_VerticalJustification": "Nota: Valores mayores mueven el texto hacia abajo, valores más pequeños mueven el texto hacia arriba",
  "verticalJustification": "Controla la justificación vertical de la etiqueta",
  "hori_HorizontalJustification": "Controla la justificación horizontal de la etiqueta",
  "horizontalJustification": "Controla la justificación horizontal de la etiqueta",
  "veri_VerticalJustification": "Controla la justificación vertical de la etiqueta",
  "addlLabelHlineTextPositionOffset": "Ajustes adicionales para posicionar el texto de la etiqueta para líneas horizontales",
  "horiMovementHReflineLabel": "Mover texto horizontalmente a la izquierda o a la derecha - usa cualquier número con signo + o -",
  "isHXaxisDateChk": "Marca esta casilla si el eje x está en fecha o fecha y hora (el número anterior se convertirá en número de días)",
  "nobreaklineHRefLabelandValueChk": "Marca esta casilla para eliminar la línea de ruptura entre el valor de la etiqueta y el texto de la etiqueta",
  "vertiMovementHReflineLabel": "Mover texto verticalmente hacia arriba o hacia abajo - usa cualquier número con signo + o - (deja 0 para eje categórico)",
  "isHYaxisDateChk": "Marca esta casilla si el eje y está en fecha o fecha y hora (el número anterior se convertirá en número de días)",
  "addlLabelVlineTextPositionOffset": "Ajustes adicionales para posicionar el texto de la etiqueta para líneas verticales",
  "horiMovementVReflineLabel": "Mover texto horizontalmente a la izquierda o a la derecha - usa cualquier número con signo + o -",
  "isVXaxisDateChk": "Marca esta casilla si el eje x está en fecha o fecha y hora (el número anterior se convertirá en número de días)",
  "nobreaklineVRefLabelandValueChk": "Marca esta casilla para eliminar la línea de ruptura entre el valor de la etiqueta y el texto de la etiqueta",
  "vertiMovementVReflineLabel": "Mover texto verticalmente hacia arriba o hacia abajo - usa cualquier número con signo + o - (deja 0 para eje categórico)",
  "isVYaxisDateChk": "Marca esta casilla si el eje y está en fecha o fecha y hora (el número anterior se convertirá en número de días)",
  "help": {
    "title": "Gráfico de Series Temporales",
    "r_help": "help(package='ggplot2')",
    "body": "\n          <b>Descripción</b></br>\n          Crea un gráfico, te permite agrupar opcionalmente puntos por una variable de factor, también puedes crear facetas, temas y especificar un título y etiquetas para los ejes x e y.\n          Cuando se especifican múltiples variables y, se dibuja un gráfico separado para cada variable Y contra la variable X.​\n          <br/>\n          <b>Uso</b>\n          <br/>\n          <code> \n          ggplot(data=Dataset,aes(x =var1,y=var2,color=var3,size=var4,alpha=var5,shape=var6)) +\n           geom_point( position=\"jitter\") +\n           labs(x =\"var1\",y =\"var2\",color =\"var3\",title= \"Gráfico de dispersión para ...\")\n           \n          </code> <br/>\n          <b>Argumentos</b><br/>\n          <ul>\n          <li>\n          data: El conjunto de datos por defecto​\n          </li>\n          <li>\n          aes(): Generar mapeos estéticos que describen cómo las variables en los datos se mapean a propiedades visuales (estéticas) de los geoms.\n          </li>\n          <li>\n          x: la variable numérica graficada en el eje x​\n          </li>\n          <li>\n          y: la variable numérica graficada en el eje y​\n          </li>\n          <li>\n          color: Una variable de factor para agrupar puntos. Cada grupo se muestra en un color diferente.​\n          </li>\n          <li>\n          size: una variable numérica que el tamaño del punto es proporcional a​\n          </li>\n          <li>\n          alpha: Una variable numérica que la transparencia de un punto es proporcional a​\n          </li>\n          <li>\n          geom_point(): El geom de punto se usa para crear gráficos.​\n          </li>\n          <li>\n          Labs(): Cambiar etiquetas de ejes y títulos de leyenda (esto es opcional)​\n          </li>\n          <li>\n          geom_smooth() : Agrega una media condicional suavizada (esto es opcional)​\n          </li>\n          <li>\n          facet_grid(): Disponer paneles en una cuadrícula (esto es opcional)​\n          </li>\n          </ul>\n          <b>Paquete</b></br>\n          ggplot2;ggthemes;</br>\n          <b>Ayuda</b></br>\n          help(geom_point, package=ggplot2)</br>\n          Otro: Haz clic en el botón de Ayuda de R para obtener ayuda detallada de R. También puedes ingresar help(geom_point), help(labs), help(geom_smooth), help(aes), help(facet_grid), help(theme_excel)​\n\t\t  </b></br>\n\t\t  </br>\n\t\t  Códigos de Formato de Fecha y Hora:\n\t\t  </br>\n\t\t  </br>\n\t\t\tAño:\n\t\t\t</br>\n\t\t\t%Y: Año completo (por ejemplo, 2024).\n\t\t\t</br>\n\t\t\t%y: Últimos dos dígitos del año (por ejemplo, 24 para 2024).\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tMes:\n\t\t\t</br>\n\t\t\t%m: Mes como un número decimal con ceros a la izquierda (por ejemplo, 01 para enero, 02 para febrero).\n\t\t\t</br>\n\t\t\t%b: Nombre del mes abreviado (por ejemplo, Ene, Feb, Mar).\n\t\t\t</br>\n\t\t\t%B: Nombre completo del mes (por ejemplo, enero, febrero, marzo).\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tDía del Mes:\n\t\t\t</br>\n\t\t\t%d: Día del mes como un número decimal con ceros a la izquierda (por ejemplo, 01, 02, 03).\n\t\t\t</br>\n\t\t\t%-d: Día del mes como un número decimal sin ceros a la izquierda (por ejemplo, 1, 2, 3).\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tDía de la Semana:\n\t\t\t</br>\n\t\t\t%a: Nombre del día de la semana abreviado (por ejemplo, Lun, Mar, Mié).\n\t\t\t</br>\n\t\t\t%A: Nombre completo del día de la semana (por ejemplo, Lunes, Martes, Miércoles).\n\t\t\t</br>\n\t\t\t%u: Día de la semana como un número decimal (1 = Lunes, 7 = Domingo).\n\t\t\t</br>\n\t\t\t%w: Día de la semana como un número decimal (0 = Domingo, 6 = Sábado).\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tSemana del Año:\n\t\t\t</br>\n\t\t\t%U: Número de semana del año (comenzando con el domingo como el primer día de la semana) como un número decimal con ceros a la izquierda (por ejemplo, 01, 02).\n\t\t\t</br>\n\t\t\t%W: Número de semana del año (comenzando con el lunes como el primer día de la semana) como un número decimal con ceros a la izquierda.\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tHora:\n\t\t\t</br>\n\t\t\t%H: Hora (00–23, con ceros a la izquierda).\n\t\t\t</br>\n\t\t\t%I: Hora (01–12, con ceros a la izquierda, reloj de 12 horas).\n\t\t\t</br>\n\t\t\t%p: Indicador AM o PM.\n\t\t\t</br>\n\t\t\tMinuto:\n\t\t\t</br>\n\t\t\t%M: Minuto como un número decimal con ceros a la izquierda (por ejemplo, 00, 01, 59).\n\t\t\t</br>\n\t\t\tSegundo:\n\t\t\t</br>\n\t\t\t%S: Segundo como un número decimal con ceros a la izquierda (por ejemplo, 00, 01, 59).\n\t\t\t</br>\n\t\t\tZona Horaria:\n\t\t\t</br>\n\t\t\t%Z: Abreviatura de la zona horaria (por ejemplo, UTC, EST).\n\t\t\t</br>\n\t\t\t%z: Desplazamiento de UTC (por ejemplo, +0000, -0500).\n\t\t\t</br>\n\t\t\tFecha/Hora Completa:\n\t\t\t</br>\n\t\t\t%c: Fecha y hora completas (por ejemplo, Jue Sep 7 10:34:24 2023).\n\t\t\t</br>\n\t\t\t%x: Representación de la fecha (por ejemplo, 09/07/23).\n\t\t\t</br>\n\t\t\t%X: Representación de la hora (por ejemplo, 10:34:24).\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tEjemplos:\n\t\t\t\"%Y-%m-%d\": Fecha completa con año, mes y día (por ejemplo, 2024-09-12).\n\t\t\t</br>\n\t\t\t\"%A, %B %d, %Y\": Día de la semana completo, nombre del mes, día y año (por ejemplo, Jueves, 12 de Septiembre de 2024).\n\t\t\t</br>\n\t\t\t\"%H:%M:%S\": Hora en formato de 24 horas (por ejemplo, 14:05:30).\n\t\t\t</br>\n\t\t\t</br>\n  "
  }
}