{
  "title": "Factores de Inflación de Varianza",
  "navigation": "VIF",
  "modelselector1": "Seleccione un modelo de una de las siguientes clases (clase entre paréntesis) Modelo lineal (lm), Modelos lineales generalizados (glm), Regresión logística ordenada o Probit (polr), Modelos log-lineales multinomiales (multinom), Supervivencia (coxph)",
  "help": {
    "title": "Factores de Inflación de Varianza",
    "r_help": "help(vif, package='car')",
    "body": "\n                <b>Descripción</b></br>\nCalcula factores de inflación de varianza y factores de inflación de varianza generalizados para modelos lineales, lineales generalizados y otros modelos.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nvif(mod, ...)\n## Método S3 por defecto:\nvif(mod, ...)\n## Método S3 para la clase 'merMod'\nvif(mod, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmod: para el método por defecto, un objeto que responde a coef, vcov y model.matrix, como un objeto lm o glm.\n</li>\n<li>\n... no utilizado.\n</li>\n</ul>\n<b>Detalles</b></br>\nSi todos los términos en un modelo lineal no ponderado tienen 1 df, se calculan los factores de inflación de varianza habituales.</br>\nSi algún término en un modelo lineal no ponderado tiene más de 1 df, se calculan factores de inflación de varianza generalizados (Fox y Monette, 1992). Estos son interpretables como la inflación en el tamaño de la elipse de confianza o el elipsoide para los coeficientes del término en comparación con lo que se obtendría para datos ortogonales.</br>\nLos VIFs generalizados son invariantes con respecto a la codificación de los términos en el modelo (siempre que el subespacio de las columnas de la matriz del modelo que pertenece a cada término sea invariante). Para ajustar la dimensión del elipsoide de confianza, la función también imprime GVIF^[1/(2*df)], donde df son los grados de libertad asociados con el término.</br>\nA través de una mayor generalización, la implementación aquí también es aplicable a otros tipos de modelos, en particular modelos lineales ponderados, modelos lineales generalizados y modelos de efectos mixtos.</br>\n<b>Valor</b><br/>\nUn vector de VIFs, o una matriz que contiene una fila para cada término en el modelo, y columnas para el GVIF, df y GVIF^[1/(2*df)].<br/>\n<b>Ejemplos</b><br/>\n<code> \n## Un ejemplo ridículo...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>Paquete</b></br>\ncar</br>\n<b>Ayuda</b></br>\nPara ayuda detallada, haga clic en el ícono de R en la esquina superior derecha de este cuadro de diálogo o ejecute el siguiente comando en el editor de sintaxis R: help(vif, package=\"car\")\n                "
  }
}