{
  "title": "Prueba de varianza, prueba F",
  "navigation": "Prueba de varianza, dos muestras",
  "tvarbox1": "Variable de respuesta",
  "tvarbox2": "Variable de factor, con solo dos niveles",
  "label1": "Hipótesis alternativa",
  "test1": "Diferencia != 1",
  "test2": "Diferencia > 1",
  "test3": "Diferencia < 1",
  "txtbox1": "Nivel de confianza",
  "help": {
    "title": "Prueba de varianza, prueba F",
    "r_help": "help(var.test, package=stats)",
    "body": "\n                <b>Descripción</b></br>\n                Realiza una prueba F para comparar las varianzas de dos muestras de poblaciones normales.\n                <br/>\n                <b>Uso</b>\n                <br/>\n                <code> \n                var.test(x, ...)</br>\n                ## Método S3 por defecto:</br>\n                var.test(x, y, ratio = 1,\n                         alternative = c(\"two.sided\", \"less\", \"greater\"),\n                         conf.level = 0.95, ...)</br>\n                ## Método S3 para clase 'formula'</br>\n                var.test(formula, data, subset, na.action, ...)\n                </code> <br/>\n                <b>Argumentos</b><br/>\n                <ul>\n                <li>\n                x, y: vectores numéricos de valores de datos, o objetos de modelo lineal ajustados (que heredan de la clase \"lm\").\n                </li>\n                <li>\n                ratio: el ratio hipotetizado de las varianzas de población de x e y.\n                </li>\n                <li>\n                alternative: una cadena de caracteres que especifica la hipótesis alternativa, debe ser uno de \"two.sided\" (por defecto), \"greater\" o \"less\". Puede especificar solo la letra inicial.\n                </li>\n                <li>\n                conf.level: nivel de confianza para el intervalo de confianza devuelto.\n                </li>\n                <li>\n                formula: una fórmula de la forma lhs ~ rhs donde lhs es una variable numérica que da los valores de datos y rhs un factor con dos niveles que da los grupos correspondientes.\n                </li>\n                <li>\n                data: una matriz o marco de datos opcional (o similar: ver model.frame) que contiene las variables en la fórmula. Por defecto, las variables se toman del entorno(formula).\n                </li>\n                <li>\n                subset: un vector opcional que especifica un subconjunto de observaciones a utilizar.\n                </li>\n                <li>\n                na.action: una función que indica qué debe suceder cuando los datos contienen NAs. Por defecto, se utiliza getOption(\"na.action\").\n                </li>\n                <li>\n                ...: otros argumentos que se pasarán a o desde métodos.\n                </li>\n                </ul>\n                <b>Detalles</b></br>\n                La hipótesis nula es que el ratio de las varianzas de las poblaciones de las que se extrajeron x e y, o en los datos a los que se ajustaron los modelos lineales x e y, es igual al ratio.</br>\n                <b>Valor</b><br/>\n                Una lista con clase \"htest\" que contiene los siguientes componentes:\n                statistic: el valor de la estadística de prueba F.\n                parameter: los grados de libertad de la distribución F de la estadística de prueba.\n                p.value: el valor p de la prueba.\n                conf.int: un intervalo de confianza para el ratio de las varianzas de población.\n                estimate: el ratio de las varianzas de muestra de x e y.\n                null.value: el ratio de varianzas de población bajo la hipótesis nula.\n                alternative: una cadena de caracteres que describe la hipótesis alternativa.\n                method: la cadena de caracteres \"Prueba F para comparar dos varianzas\".\n                data.name: una cadena de caracteres que da los nombres de los datos.\n                <b>Ejemplos</b><br/>\n                <code>\n                Dataframe <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))<br/>\n                Result_Variance_Test = var.test( Age ~Gender,alternative='two.sided',conf.level=0.95,data=Dataframe )\n                </code> <br/>\n                <b>Paquete</b></br>\n                stats</br>\n                <b>Ayuda</b></br>\n                help(var.test, package=stats)\n    "
  }
}