{
  "title": "Prueba de Wilcoxon de rango con signo, una muestra",
  "navigation": "Prueba de Wilcoxon, una muestra",
  "textbox1": "Intervalo de confianza",
  "textbox2": "Hipótesis nula (mu)",
  "help": {
    "title": "Prueba de Wilcoxon, una muestra",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>Descripción</b></br>\nRealiza pruebas de Wilcoxon de una y dos muestras en vectores de datos; la última también se conoce como prueba de ‘Mann-Whitney’.\n<br/>\n<b>Uso</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Método S3 por defecto:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## Método S3 para la clase 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: vector numérico de valores de datos. Los valores no finitos (por ejemplo, infinitos o faltantes) serán omitidos.\n</li>\n<li>\ny: un vector numérico opcional de valores de datos: al igual que x, los valores no finitos serán omitidos.\n</li>\n<li>\nalternative: una cadena de caracteres que especifica la hipótesis alternativa, debe ser una de \"two.sided\" (por defecto), \"greater\" o \"less\". Puedes especificar solo la letra inicial.\n</li>\n<li>\nmu: un número que especifica un parámetro opcional utilizado para formar la hipótesis nula. Ver ‘Detalles’.\n</li>\n<li>\npaired: un lógico que indica si deseas una prueba emparejada.\n</li>\n<li>\nexact: un lógico que indica si se debe calcular un valor p exacto.\n</li>\n<li>\ncorrect: un lógico que indica si se debe aplicar una corrección de continuidad en la aproximación normal para el valor p.\n</li>\n<li>\nconf.int: un lógico que indica si se debe calcular un intervalo de confianza.\n</li>\n<li>\nconf.level: nivel de confianza del intervalo.\n</li>\n<li>\nformula: una fórmula de la forma lhs ~ rhs donde lhs es una variable numérica que da los valores de datos y rhs un factor con dos niveles que da los grupos correspondientes.\n</li>\n<li>\ndata: una matriz o marco de datos opcional (o similar: ver model.frame) que contiene las variables en la fórmula formula. Por defecto, las variables se toman del entorno(formula).\n</li>\n<li>\nsubset: un vector opcional que especifica un subconjunto de observaciones a utilizar.\n</li>\n<li>\nna.action: una función que indica qué debe suceder cuando los datos contienen NAs. Por defecto, se utiliza getOption(\"na.action\").\n</li>\n<li>\n...: otros argumentos que se pasarán a o desde métodos.\n</li>\n</ul>\n<b>Detalles</b></br>\nLa interfaz de fórmula solo es aplicable para las pruebas de 2 muestras.</br>\nSi solo se da x, o si se dan tanto x como y y paired es TRUE, se realiza una prueba de rango con signo de Wilcoxon de la nula que la distribución de x (en el caso de una muestra) o de x - y (en el caso de dos muestras emparejadas) es simétrica alrededor de mu.</br>\nDe lo contrario, si se dan tanto x como y y paired es FALSE, se lleva a cabo una prueba de suma de rangos de Wilcoxon (equivalente a la prueba de Mann-Whitney: ver la Nota). En este caso, la hipótesis nula es que las distribuciones de x e y difieren por un desplazamiento de ubicación de mu y la alternativa es que difieren por algún otro desplazamiento de ubicación (y la alternativa unilateral \"greater\" es que x se desplaza a la derecha de y).</br>\nPor defecto (si no se especifica exact), se calcula un valor p exacto si las muestras contienen menos de 50 valores finitos y no hay empates. De lo contrario, se utiliza una aproximación normal.</br>\nOpcionalmente (si el argumento conf.int es verdadero), se calcula un intervalo de confianza no paramétrico y un estimador para la pseudomediana (caso de una muestra) o para la diferencia de los parámetros de ubicación x-y. (La pseudomediana de una distribución F es la mediana de la distribución de (u+v)/2, donde u y v son independientes, cada uno con distribución F. Si F es simétrica, entonces la pseudomediana y la mediana coinciden. Ver Hollander & Wolfe (1973), página 34.) Ten en cuenta que en el caso de dos muestras, el estimador para la diferencia en los parámetros de ubicación no estima la diferencia en las medianas (una concepción errónea común) sino más bien la mediana de la diferencia entre una muestra de x y una muestra de y.</br>\nSi los valores p exactos están disponibles, se obtiene un intervalo de confianza exacto mediante el algoritmo descrito en Bauer (1972), y se emplea el estimador de Hodges-Lehmann. De lo contrario, el intervalo de confianza y la estimación puntual devueltos se basan en aproximaciones normales. Estos están corregidos por continuidad para el intervalo pero no para la estimación (ya que la corrección depende de la alternativa).</br>\nCon muestras pequeñas puede no ser posible lograr coberturas de intervalo de confianza muy altas. Si esto sucede, se dará una advertencia y se sustituirá por un intervalo con menor cobertura.</br>\n<b>Valor</b><br/>\nUna lista con clase \"htest\" que contiene los siguientes componentes:\nstatistic: el valor de la estadística de prueba con un nombre que la describe.</br>\nparameter: el(los) parámetro(s) para la distribución exacta de la estadística de prueba.</br>\np.value: el valor p para la prueba.</br>\nnull.value: el parámetro de ubicación mu.</br>\nalternative: una cadena de caracteres que describe la hipótesis alternativa.</br>\nmethod: el tipo de prueba aplicada.</br>\ndata.name: una cadena de caracteres que da los nombres de los datos.</br>\nconf.int: un intervalo de confianza para el parámetro de ubicación. (Solo presente si el argumento conf.int = TRUE.)</br>\nestimate: una estimación del parámetro de ubicación. (Solo presente si el argumento conf.int = TRUE.)</br>\n<b>Paquete</b></br>\nstats</br>\n<b>Ayuda</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}