{
  "title": "ANCOVA, Analyse der Kovarianz",
  "navigation": "ANCOVA",
  "response": "Abhängige Variable",
  "Fixed": "Fester Faktor",
  "Block": "Kovariate",
  "Summary": "Mod Zusammenfassung",
  "Scatter_plot": "Streudiagramm für jede Stufe der Faktorvariablen",
  "Residual": "Residuen vs. Angepasster Plot",
  "Histogram": "Histogrammplot der Residuen",
  "help": {
    "title": "ANCOVA",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>Beschreibung</b></br>\nDie Analyse der Kovarianz (ANCOVA) kombiniert Merkmale sowohl der ANOVA als auch der Regression. Sie ergänzt das ANOVA-Modell um eine oder mehrere zusätzliche quantitative Variablen, die als Kovariaten bezeichnet werden und die mit der abhängigen Variablen in Beziehung stehen. Die Kovariaten werden einbezogen, um die Varianz in den Fehlertermen zu reduzieren und eine genauere Messung der Behandlungseffekte zu ermöglichen.</br> ANCOVA wird verwendet, um die Haupt- und Wechselwirkungen der Faktoren zu testen, während die Effekte der Kovariate kontrolliert werden.</br>\nZuerst erstellen wir eine Anova-Tabelle mit dem Wechselwirkungsterm. Das Ziel ist zu prüfen, ob der Wechselwirkungsterm nicht signifikant ist, d.h. die Steigungen der abhängigen Variablen gegenüber der Kovariate für jede Stufe des festen Faktors nicht unterschiedlich sind. Wir verwenden das Anova-Paket im car-Paket, um diese Anova-Tabelle zu erstellen.</br>\nDann regenerieren wir die Anova-Tabelle unter Kontrolle des Wechselwirkungsterms, um zu bestimmen, ob die Schnittpunkte der abhängigen Variablen gegenüber der Kovariate für jede Stufe des festen Faktors unterschiedlich sind.</br> \nWir bieten die Möglichkeit, ein Streudiagramm der abhängigen Variablen gegenüber der Kovariate für jede Stufe des festen Faktors zu erstellen.</br>\nWir bieten die Möglichkeit, den Residuen vs. angepassten Plot für das Modell zu erstellen, bei dem wir den Wechselwirkungsterm kontrolliert haben. Die Residuen sollten unverzerrt und homoskedastisch sein.</br>\nWir bieten die Möglichkeit, ein Histogramm für die Residuen des Modells zu erstellen, bei dem wir den Wechselwirkungsterm kontrolliert haben. (Die Verteilung sollte annähernd normal sein).</br>\nWir geben Ihnen die Möglichkeit, das Modell zusammenzufassen</br>\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nlm(formula, data)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nformel: ein Objekt der Klasse \"formel\" (oder eines, das in diese Klasse umgewandelt werden kann): eine symbolische Beschreibung des Modells, das angepasst werden soll. Die Einzelheiten der Modellspezifikation sind unter 'Details' angegeben.\n</li>\n<li>\ndaten: ein optionales Datenrahmen, Liste oder Umgebung (oder Objekt, das durch as.data.frame in einen Datenrahmen umgewandelt werden kann), das die Variablen im Modell enthält. Wenn nicht in den Daten gefunden, werden die Variablen aus der Umgebung(formula) entnommen, typischerweise der Umgebung, aus der lm aufgerufen wird.\n</li>\n</ul>\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nAnova(mod, , type=c(\"II\"))\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmod :lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm oder anderes geeignetes Modellobjekt.​\n</li>\n<li>\ntyp: Art des Tests, \"II\", \"III\", 2 oder 3.\n</li>\n</ul>\n<b>Paket</b></br>\nAnova</br>\n<b>Hilfe</b></br>\nhelp(Anova, package ='car')\n    "
  }
}