{
  "title": "ANOVA, ein Weg mit Blöcken",
  "navigation": "ANOVA, 1 Weg mit Blöcken",
  "tvarbox1": "Antwortvariable (eine)",
  "tvarbox2": "Fester Effekt",
  "blockVar": "Blockierungsvariable(n)",
  "chk1": "Histogramm der Residuen",
  "chk2": "Post-hoc-Analyse",
  "help": {
    "title": "ANOVA, ein Weg mit Blöcken",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>Beschreibung</b></br>\nAnova-Tabellen für verschiedene statistische Modelle​\nBerechnet Typ-II- oder Typ-III-Analyse-von-Varianz-Tabellen für Modellobjekte, die von lm, glm, multinom (im nnet-Paket), polr (im MASS-Paket), coxph (im Überlebenspaket), coxme (im coxme-Paket), svyglm (im Umfragepaket), rlm (im MASS-Paket), lmer im lme4-Paket, lme im nlme-Paket und (nach der Standardmethode) für die meisten Modelle mit einem linearen Prädiktor und asymptotisch normalen Koeffizienten erzeugt werden (siehe Details unten). Für lineare Modelle werden F-Tests berechnet; für verallgemeinerte lineare Modelle werden Likelihood-Ratio-Chi-Quadrat-, Wald-Chi-Quadrat- oder F-Tests berechnet; für multinomiale Logit- und proportionale Odds-Logit-Modelle werden Likelihood-Ratio-Tests berechnet. Verschiedene Teststatistiken werden für multivariate lineare Modelle bereitgestellt, die von lm oder manova erzeugt werden. Partielle Likelihood-Ratio-Tests oder Wald-Tests werden für Cox-Modelle bereitgestellt. Wald-Chi-Quadrat-Tests werden für feste Effekte in linearen und verallgemeinerten linearen gemischten Modellen bereitgestellt. Wald-Chi-Quadrat- oder F-Tests werden im Standardfall bereitgestellt.​\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmod: lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm oder anderes geeignetes Modellobjekt.​\n</li>\n<li>\ntyp: Art des Tests, \"II\", \"III\", 2 oder 3.​\n</li>\n</ul>\n<b>Details</b></br>\nDie Bezeichnungen \"Typ-II\" und \"Typ-III\" stammen von SAS, aber die hier verwendeten Definitionen entsprechen nicht genau denen, die von SAS verwendet werden. Typ-II-Tests werden nach dem Prinzip der Marginalität berechnet, wobei jeder Term nach allen anderen getestet wird, wobei die höheren Verwandten des Terms ignoriert werden; sogenannte Typ-III-Tests verletzen die Marginalität, indem sie jeden Term im Modell nach allen anderen testen. Diese Definition von Typ-II-Tests entspricht den von SAS für Analyse-von-Varianz-Modelle erzeugten Tests, bei denen alle Prädiktoren Faktoren sind, jedoch nicht allgemeiner (d.h. wenn es quantitative Prädiktoren gibt). Seien Sie sehr vorsichtig bei der Formulierung des Modells für Typ-III-Tests, da die getesteten Hypothesen keinen Sinn ergeben.​</br>\nWie hier implementiert, sind Typ-II-Wald-Tests eine Verallgemeinerung der linearen Hypothesen, die zur Erzeugung dieser Tests in linearen Modellen verwendet werden.​</br>\nFür Tests für lineare Modelle, multivariate lineare Modelle und Wald-Tests für verallgemeinerte lineare Modelle, Cox-Modelle, gemischte Modelle, verallgemeinerte lineare Modelle, die auf Umfragedaten angepasst sind, und im Standardfall findet Anova die Teststatistiken, ohne das Modell neu anzupassen. Die svyglm-Methode ruft einfach die Standardmethode auf und kann daher dieselben Argumente verwenden.​</br>\n<b>Wert</b><br/>\nEin Objekt der Klasse \"anova\" oder \"Anova.mlm\", das normalerweise gedruckt wird. Für Objekte der Klasse \"Anova.mlm\" gibt es auch eine Zusammenfassungsmethode, die viel mehr Details als die Druckmethode über die MANOVA bereitstellt, einschließlich traditioneller gemischter univariater F-Tests mit Greenhouse-Geisser- und Huynh-Feldt-Korrekturen.​​</br>\n<b>Paket</b></br>\nAnova</br>\n<b>Hilfe</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>Beschreibung</b></br>\nPost-hoc-Mitteltrennungstests. Um Post-hoc-Mitteltrennungstests für jede Hauptfaktorvariable durchzuführen, verwenden wir das emmeans-Paket. Das zu betrachtende lineare Modell wird als Modell bezeichnet, das mit der lm-Funktion oben erstellt wurde.  \n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>Paket</b></br>\nFSA;car;emmeans;ggplot2;multcomp</br>\n<b>Hilfe</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
  }
}