{
  "title": "Balkendiagramm",
  "navigation": "Balkendiagramm",
  "optionsLabels": "Optionen für Beschriftungen",
  "suppressLabels": "Alle Beschriftungen für Zählungen und Prozentsätze unterdrücken",
  "suppressThreshold": "Beschriftungen für Zählungen und Prozentsätze unter dem angegebenen Schwellenwertprozentsatz unterdrücken",
  "label1": "Klicken Sie auf die Registerkarte unten, um Zählung oder Mittelwert auszuwählen. Wenn Zählung ausgewählt ist, ist eine Y-Variable optional. Wenn Zählung ausgewählt ist und keine Y-Variable angegeben ist, werden die Zählungen der X-Variable angezeigt. Wenn Zählung angegeben ist und eine Y-Variable angegeben ist, werden die Werte der Y-Variable summiert. Wenn Mittelwert ausgewählt ist, müssen Sie eine Y- und eine X-Variable auswählen. Mittelwerte werden für die Y-Variable(n) berechnet.",
  "x": "X-Variable",
  "y": "Y-Variable(n), geben Sie eine numerische Variable(n) an",
  "fill": "Geben Sie eine Faktorvariable an, um die Balken zu füllen.",
  "dropna": "Fehlende Werte entfernen",
  "bottomlbl": "Balkendiagramm auswählen",
  "meanlbl": "Mittelwert",
  "countlbl": "Zählung",
  "fill1": "Wählen Sie eine Farbe für die Balken. Hinweis: Dies wird ignoriert, wenn eine Variable zum Füllen der Balken angegeben ist.",
  "barType": "Art des Balkendiagramms",
  "stackedBar": "Gestapeltes Balkendiagramm",
  "sideBySide": "Gruppen nebeneinander anzeigen",
  "fillPercent": "Balken füllen",
  "errorBarOptions": "Fehlerbalken",
  "noErrBars": "Keine Fehlerbalken",
  "stderr": "Standardfehler",
  "stddev": "Standardabweichung",
  "cilevel": "Vertrauensniveau angeben:",
  "confidenceInterval": "Vertrauensniveau:",
  "alpha": "Opazität (0-1)",
  "flipBox": "Achse umdrehen",
  "specify_a_title": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "hide": "Nur die Oberseite der Fehlerbalken anzeigen (Opazität muss auf 1 gesetzt werden)",
  "Facetrow": "Facet-Reihe",
  "Facetcolumn": "Facet-Spalte",
  "Facetwrap": "Facet-Wickel",
  "Facetscale": "Facet-Skala",
  "relFreq": "Relative Häufigkeiten",
  "facets_lbl" : "Facetten",
  "help": {
    "title": "Hilfe zum Balkendiagramm",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Ein Balkendiagramm oder Balkengrafik ist ein Diagramm, das gruppierte Daten mit rechteckigen Balken darstellt, deren Längen proportional zu den Werten sind, die sie darstellen. Die Balken können vertikal oder horizontal gezeichnet werden. Die Balken können nach einer optionalen Faktorvariable gruppiert werden. Die Gruppen können auf einem einzelnen Balken gestapelt oder nebeneinander angezeigt werden. Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die X- und Y-Achse festlegen.\n        Sie können ein Balkendiagramm für eine einzelne Faktorvariable erstellen, die Balken stellen die Zählungen jedes Niveaus der Faktorvariable dar. Hier wird die Faktorvariable auf der X-Achse angezeigt, siehe Beispiel unten. Wenn das Kontrollkästchen für relative Häufigkeiten ausgewählt ist, zeigen wir die relative Häufigkeit anstelle von Zählungen auf der Y-Achse an.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=1) +\n         labs(x =\"year\",y =\"Count\",title= \"Balkendiagramm für X-Achse: Jahr, Y-Achse: Zählung\")\n        </code>\n        <br />\n        Sie können ein Balkendiagramm erstellen, indem Sie eine Skala/numerische Variable auf der Y-Achse platzieren und die Balken nach einer Faktorvariable füllen. Der Balken wird gefüllt, indem die Werte der Y-Variable für jedes Niveau der Faktorvariable summiert werden, siehe Beispiel unten\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=1,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"Balkendiagramm für X-Achse:, Y-Achse: Gewicht, Füllung: Herkunft\")\n        </code>\n        <br />\n        Sie können eine X-Variable, Y-Variable und Füllung angeben. Der Balken wird gefüllt durch die Summe der Werte der Y-Variable für jedes Niveau der X-Variable, gruppiert nach dem Niveau der in der Füllung angegebenen Variable.\n        Wenn Sie mehrere X-Variablen angeben, erstellen wir ein separates Balkendiagramm für jede X-Variable. \n        <br />\n        Verwendung:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Das Standarddatenset​\n        </li>\n        <li>\n        aes():    Generiert ästhetische Zuordnungen, die beschreiben, wie Variablen in den Daten auf visuelle Eigenschaften (Ästhetik) von Geoms abgebildet werden.​\n        </li>\n        <li>\n        x: Eine Faktor-/kategorische Variable. Die Länge des Balkens entspricht den Zählungen jedes Niveaus der Faktorvariable.​\n        </li>\n        <li>\n        fill: Eine optionale Faktor-/kategorische Variable, um die Zählungen der Niveaus in x zu gruppieren: (siehe oben)​\n        </li>\n        <li>\n        geom_bar(): Erstellt das Balkendiagramm, position =”stack” stapelt die Gruppen auf einem einzelnen Balken, position =”dodge” stapelt die Gruppen nebeneinander, position =\"fill\" füllt den Balken mit einem Prozentsatz jedes Gruppierungsniveaus.​\n        </li>\n        <li>\n        Labs(): Ändert Achsenbeschriftungen und Legendentitel (dies ist optional)​\n        </li>\n        <li>\n        facet_grid(): Legt Panels in einem Raster an (dies ist optional)​\n        </li>\n        <li>\n        theme_calc(): Gibt das Rechnerdesign an (dies ist optional)​\n        </li>\n        <li>\n        coord_flip(): Achse umdrehen (dies ist optional)​\n        </li>\n        <li>\n        alpha: Steuert die Opazität, nimmt Werte zwischen 0-1 an. 1 bedeutet keine Opazität.\n        </li>\n        </ul>\n        Paket: ggplot2,ggthemes​\n        <br />\n        Sonstiges: Klicken Sie auf die Schaltfläche R-Hilfe, um detaillierte R-Hilfe zu erhalten. Sie können auch help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) eingeben.​\n        "
  }
}