{
  "title": "Bartletts Test",
  "navigation": "Bartletts Test",
  "tvarbox1": "Antwortvariable",
  "tvarbox2": "Numerische oder Faktorenvariablen",
  "help": {
    "title": "Bartletts Test",
    "r_help": "help(bartlett.test, package=stats)",
    "body": "\n<b>Beschreibung</b></br>\nFührt den Bartlett-Test der Nullhypothese durch, dass die Varianzen in jeder der Gruppen (Stichproben) gleich sind.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nbartlett.test(x, ...)</br>\n## Standard S3-Methode:</br>\nbartlett.test(x, g, ...)</br>\n## S3-Methode für die Klasse 'formel'</br>\nbartlett.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nArgumente\nx: ein numerischer Vektor von Datenwerten oder eine Liste von numerischen Datenvektoren, die die jeweiligen Stichproben darstellen, oder angepasste lineare Modellobjekte (die von der Klasse \"lm\" erben).\n</li>\n<li>\ng: ein Vektor oder Faktorobjekt, das die Gruppe für die entsprechenden Elemente von x angibt. Wird ignoriert, wenn x eine Liste ist.\n</li>\n<li>\nformel: eine Formel der Form lhs ~ rhs, wobei lhs die Datenwerte und rhs die entsprechenden Gruppen angibt.\n</li>\n<li>\ndata: eine optionale Matrix oder Datenrahmen (oder ähnlich: siehe model.frame), die die Variablen in der Formel enthält. Standardmäßig werden die Variablen aus der Umgebung(formula) entnommen.\n</li>\n<li>\nsubset: ein optionaler Vektor, der eine Teilmenge von Beobachtungen angibt, die verwendet werden sollen.\n</li>\n<li>\nna.action: eine Funktion, die angibt, was geschehen soll, wenn die Daten NAs enthalten. Standardmäßig wird getOption(\"na.action\") verwendet.\n</li>\n<li>\n...: weitere Argumente, die an Methoden übergeben werden sollen oder von diesen zurückgegeben werden.\n</li>\n</ul>\n<b>Details</b></br>\nWenn x eine Liste ist, werden ihre Elemente als die Stichproben oder angepassten linearen Modelle betrachtet, die auf Homogenität der Varianzen verglichen werden sollen. In diesem Fall müssen die Elemente entweder alle numerische Datenvektoren oder angepasste lineare Modellobjekte sein, g wird ignoriert, und man kann einfach bartlett.test(x) verwenden, um den Test durchzuführen. Wenn die Stichproben noch nicht in einer Liste enthalten sind, verwenden Sie bartlett.test(list(x, ...)).</br>\nAndernfalls muss x ein numerischer Datenvektor sein, und g muss ein Vektor oder Faktorobjekt der gleichen Länge wie x sein, das die Gruppe für die entsprechenden Elemente von x angibt.</br>\n<b>Wert</b><br/>\nEine Liste der Klasse \"htest\", die die folgenden Komponenten enthält:<br/>\nstatistic: Bartletts K-Quadrat-Teststatistik.<br/>\nparameter: die Freiheitsgrade der approximativen Chi-Quadrat-Verteilung der Teststatistik.<br/>\np.value: der p-Wert des Tests.<br/>\nmethod: der Zeichenfolgen \"Bartlett-Test der Homogenität der Varianzen\".<br/>\ndata.name: eine Zeichenfolge, die die Namen der Daten angibt.<br/>\n<b>Beispiele</b><br/>\n<code> \nDataset <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))\nResult_Bartlett_Test = bartlett.test(sales ~ interaction(Dataset$Gender),data=Dataset)\n</code> <br/>\n<b>Paket</b></br>\nstats</br>\n<b>Hilfe</b></br>\nhelp(bartlett.test, package=stats)\n"
  }
}