{
  "title": "Bonferroni-Ausreißer-Test",
  "navigation": "Ausreißer-Test",
  "label1": "Wählen Sie ein Modell einer der folgenden Klassen (Klasse in Klammern) - Lineares Modell (lm), Generalisiertes lineares Modell (glm)",
  "modelselector1": "Wählen Sie ein Modell",
  "help": {
    "title": "Bonferroni-Ausreißer-Test",
    "r_help": "help(outlierTest, package='car')",
    "body": "\n                <b>Beschreibung</b></br>\nBerichtet die Bonferroni-p-Werte für die Prüfung jeder Beobachtung nacheinander, um ein Mittelwertverschiebungs-Ausreißer zu sein, basierend auf studentisierten Residuen in linearen (t-Tests), generalisierten linearen Modellen (normalen Tests) und linearen gemischten Modellen.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## S3-Methode für Klasse 'lm'<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## S3-Methode für Klasse 'lmerMod'<br/>\noutlierTest(model, ...)<br/>\n## S3-Methode für Klasse 'outlierTest'<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmodel: ein lm-, glm- oder lmerMod-Modellobjekt; die \"lmerMod\"-Methode ruft die \"lm\"-Methode auf und kann die gleichen Argumente annehmen.\n</li>\n<li>\ncutoff: Beobachtungen mit Bonferroni-p-Werten, die den Cutoff überschreiten, werden nicht berichtet, es sei denn, es werden keine Beobachtungen nominiert, in diesem Fall wird die mit dem größten studentisierten Residuum berichtet.\n</li>\n<li>\nn.max: maximale Anzahl von zu berichtenden Beobachtungen (Standard, 10).\n</li>\n<li>\norder: studentisierte Residuen in absteigender Reihenfolge der Größe berichten? (Standard, TRUE).\n</li>\n<li>\nlabels: ein optionaler Vektor von Beobachtungsnamen.\n</li>\n<li>\n...: Argumente, die an Methodenfunktionen weitergegeben werden.\n</li>\n<li>\nx: outlierTest-Objekt.\n</li>\n<li>\ndigits: Anzahl der Ziffern für berichtete p-Werte.\n</li>\n</ul>\n<b>Details</b></br>\nFür ein lineares Modell verwenden die berichteten p-Werte die t-Verteilung mit einem Freiheitsgrad, der um eins geringer ist als der Residual-fdf für das Modell. Für ein generalisiertes lineares Modell basieren die p-Werte auf der Standardnormalverteilung. Die Bonferroni-Anpassung multipliziert den üblichen zweiseitigen p-Wert mit der Anzahl der Beobachtungen. Die lm-Methode funktioniert für glm-Objekte. Um alle Beobachtungen anzuzeigen, setzen Sie cutoff=Inf und n.max=Inf.<br/>\n<b>Wert</b><br/>\nein Objekt der Klasse outlierTest, das normalerweise einfach gedruckt wird.<br/>\n<b>Beispiele</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>Paket</b></br>\ncar</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl im R-Syntax-Editor aus help(outlierTest, package=\"car\")\n                "
  }
}