{
  "title": "Box Plot",
  "dropna": "Fehlende Werte entfernen",
  "navigation": "Box Plot",
  "x": "X-Variable, geben Sie eine Faktorvariable an",
  "y": "Y-Variable(n), geben Sie eine(n) numerische(n) Variable(n) an",
  "fill": "Füllung, geben Sie eine Faktorvariable an",
  "dataPoints": "Wählen Sie eine Option, um Datenpunkte darzustellen",
  "alpha": "Opazität (0-1)",
  "flip": "Achse umdrehen",
  "notch": "Einkerbung",
  "outliers": "Ausreißer anzeigen (In Rot)",
  "specify_a_title": "Geben Sie einen Titel ein",
  "x_title": "X-Achsenbeschriftung",
  "y_title": "Y-Achsenbeschriftung",
  "barcolor": "Wählen Sie eine Farbe für die Linien um die Kästen (Nach der Farbauswahl klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "Facetrow": "Facet-Reihe",
  "Facetcolumn": "Facet-Spalte",
  "Facetwrap": "Facet-Wicklung",
  "Facetscale": "Facet-Skala",
  "help": {
    "title": "Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Beschreibung</b></br>\n        In der deskriptiven Statistik ist ein Boxplot oder Box-Plot eine praktische Möglichkeit, Gruppen numerischer Daten grafisch durch ihre Quartile darzustellen. Boxplots können auch Linien haben, die vertikal von den Kästen (Schnurrhaare) ausgehen und die Variabilität außerhalb der oberen und unteren Quartile anzeigen, daher die Begriffe Box-and-Whisker-Plot und Box-and-Whisker-Diagramm. Ausreißer können als einzelne Punkte dargestellt werden. Box- und Whisker-Plots sind in ihrer Verwendung der Box einheitlich: Der Boden und die Oberseite der Box sind immer das erste und dritte Quartil, und das Band innerhalb der Box ist immer das zweite Quartil (der Median). Das obere Schnurrhaar erstreckt sich vom Gelenk bis zum höchsten Wert, der innerhalb von 1,5 * IQR des Gelenks liegt, wobei IQR der Interquartilsabstand oder der Abstand zwischen dem ersten und dritten Quartil ist. Das untere Schnurrhaar erstreckt sich vom Gelenk bis zum niedrigsten Wert innerhalb von 1,5 * IQR des Gelenks. Daten, die über das Ende der Schnurrhaare hinausgehen, sind Ausreißer und werden als Punkte dargestellt (wie von Tukey angegeben).​</br>\n        Facetten können optional erstellt werden, indem eine Faktorvariable angegeben wird. Sie können auch optional Themen angeben und einen Titel sowie Beschriftungen für die x- und y-Achse angeben​</br>\n        Wenn Sie die Option auswählen, die Datenpunkte darzustellen, tun wir dies mit geom_dotplot</br>\n        Standardmäßig werden Ausreißer mit schwarzen Punkten angezeigt. Wenn Sie die Option auswählen, Ausreißer (In Rot) über das Kontrollkästchen anzuzeigen, werden Ausreißer deutlicher hervorgehoben.\n        <br/>\n        <b>Verwendung</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumente</b><br/>\n        <ul>\n        <li>\n        data: Das Standarddatenset​\n        </li>\n        <li>\n        x: Eine Faktor-/kategorische Variable, die die Gruppierung der y-Variable definiert​\n        </li>\n        <li>\n        y: Eine numerische Variable, für die das Boxplot berechnet wird​\n        </li>\n        <li>\n        fill: Eine optionale Faktor-/kategorische Variable, um die bestehenden Gruppen weiter zu gruppieren. Jede Untergruppe wird in einer eigenen Farbe angezeigt.​\n        </li>\n        <li>\n        aes():    Generiert ästhetische Zuordnungen, die beschreiben, wie Variablen in den Daten auf visuelle Eigenschaften (Ästhetik) von Geoms abgebildet werden.​\n        </li>\n        <li>\n        geom_boxplot(): Erstellt das Boxplot. Die oberen und unteren \"Gelenke\" entsprechen den ersten und dritten Quartilen (den 25. und 75. Perzentilen).​\n        </li>\n        <li>\n        geom_dotplot: Stellt die Datenpunkte dar\n        </li>\n        <li>\n        Labs(): Ändert Achsenbeschriftungen und Legendentitel (dies ist optional)​\n        </li>\n        <li>\n        facet_grid(): Ordnet Panels in einem Raster an (dies ist optional)​\n        </li>\n        <li>\n        theme_calc(): Gibt das Rechner-Thema an (dies ist optional)​\n        </li>\n        <li>\n        coord_flip(): Achse umdrehen (dies ist optional)​\n        </li>\n        <li>\n        notch: Einkerbung Boxplots wenden eine \"Einkerbung\" oder Verengung der Box um den Median an. Einkerbungen sind nützlich, um einen groben Hinweis auf die Signifikanz des Unterschieds der Mediane zu geben; wenn sich die Einkerbungen von zwei Boxen nicht überlappen, bietet dies Hinweise auf einen statistisch signifikanten Unterschied zwischen den Mediane. In einem eingekerbten Boxplot erstrecken sich die Einkerbungen 1,58 * IQR / sqrt(n)\n        </li>\n        </ul>\n        <b>Pakete</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Hilfe</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Klicken Sie auf die R-Hilfe-Schaltfläche, um detaillierte R-Hilfe zu erhalten. Sie können auch help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot) eingeben\n        "
  }
}