{
  "title": "Kategorische Übereinstimmung",
  "navigation": "Kategorische Übereinstimmung",
  "ratervars": "Rater-Variablen:",
  "cilevel": "Konfidenzniveau:",
  "options": "Erweitert",
  "categLabels": "Optional alle möglichen Bewertungen angeben, getrennt durch , z.B. 1,2,3,4,5 oder \"niedrig\",\"mittel\",\"hoch\" ",
  "weightschkbox": "Kategoriengewichte anzeigen",
  "weights": "Kategoriengewichte auswählen",
  "N": "Endliche Populationsgröße (falls vorhanden)",
  "help": {
    "title": "Kategorische Übereinstimmung",
    "r_help": "hilfe(fleiss.kappa.raw, paket=irrCAC)",
    "body": "\n<b>Beschreibung</b></br>\nBerechnet den prozentualen Anteil der Übereinstimmung, Conger's/Cohen's Kappa, Fleiss' Kappa, Gwet's AC1/AC2, Krippendorff's Alpha und den Brennan-Prediger-Koeffizienten unter mehreren Bewertern (2, 3, +), wenn die Eingabedaten die rohen Bewertungen darstellen, die für jedes Subjekt und jeden Bewerter gemeldet werden. Ungewichtete und gewichtete Versionen dieser Statistiken sind verfügbar, mit verschiedenen Methoden zur Gewichtung der Kategorien.</br>\nFehlende Werte werden in die Berechnungen der Zufallsübereinstimmung gemäß Gwet (2014) einbezogen.</br>\nWir bieten auch die Möglichkeit, die Gewichtungen der Bewertungs-kategorien anzuzeigen.</br>\nFür weitere Informationen siehe: </br></br>Gwet, K.L. (2014, ISBN:978-0970806284). “Handbuch der Inter-Rater-Zuverlässigkeit,” 4. Auflage. Advanced Analytics, LLC\n</br></br>Klein, D. (2018) doi:https://doi.org/10.1177/1536867X1801800408. “Implementierung eines allgemeinen Rahmens zur Bewertung der Interrater-Übereinstimmung in Stata,” The Stata Journal Band 18, Nummer 4, S. 871-901.</br></br> \n<b>Verwendung</b>\n<br/>\n<br/>\n<ul>\n<li>\n<b>Rater-Variablen:</b>  Variablen, die jedem Bewerter entsprechen, wobei jede Spalte einen Bewerter und jede Zeile ein Subjekt darstellt. Sie können numerische, Faktor-, ordinale oder Zeichenvariablen sein.</br>\n</li>\n<li>\n<b>Konfidenzniveau:</b>  Das Konfidenzniveau, das mit dem Konfidenzintervall verbunden ist. Der Standardwert beträgt 0,95.</br>\n</li>\n<li>\n<b>Kategoriengewichte anzeigen:</b> zeigt die numerischen Gewichte für die Bewerterkategorien gemäß den ausgewählten Gewichten an. Die ausgewählte Gewichtung sollte der gewünschten Nähe zwischen den Kategorien entsprechen.\n</li>\n<li>\n<b>Kategoriengewichte auswählen:</b> Ein obligatorischer Parameter, der entweder eine Zeichenvariable oder eine Matrix ist. Die Zeichenbeschreibung beschreibt eines der vordefinierten Gewichte und muss einen der Werte (\"ungewichtet\",\"quadratisch\", \"ordinal\", \"linear\", \"radikal\", \"verhältnis\", \"zirkular\", \"bipolar\") annehmen. </br>\nWenn dieser Parameter eine Matrix ist, muss es sich um eine quadratische Matrix qxq handeln, wobei q die Anzahl der möglichen Kategorien ist, in die ein Subjekt klassifiziert werden kann. Wenn einige der q möglichen Kategorien nicht verwendet werden, wird dringend empfohlen, die vollständige Liste der möglichen Kategorien anzugeben. Andernfalls funktioniert das Programm möglicherweise nicht.</br>\nHINWEIS: Das Angeben einer Matrix wird in der Syntax NICHT unterstützt. Sie müssen den Code einfügen und bearbeiten, um eine Matrix anzugeben.</br>\n</li>\n<li>\n<b>Endliche Populationsgröße (falls vorhanden):</b> Optionaler Parameter, der die Populationsgröße (falls vorhanden) darstellt. Er kann verwendet werden, um eine Korrektur der endlichen Population zur Varianz durchzuführen. Der Standardwert ist Unendlichkeit.\n</li>\n<li>\n<b>Optional alle möglichen Bewertungen angeben:</b> Optionale Liste, die im Fall verwendet wird, wenn kein Bewerter eine mögliche Kategorie verwendet. Wenn nichts angegeben ist, wird davon ausgegangen, dass die beobachteten Kategorien die gesamte Kategorienmenge sind.\n</li>\n</ul>\n<b>R-Paket</b></br>\nirrCAC</br>\n<b>Hilfe</b></br>\nDieser Dialog verwendet die Funktionen pa.coeff.raw, conger.kappa.raw, fleiss.kappa.raw, gwet.ac1.raw, krippen.alpha.raw und bp.coeff.raw.\nFür detaillierte Hilfe siehe die irrCAC-Paket-Hilfe im Dreipunktmenü > Hilfe > R-Paket-Hilfe.\n"
  }
}