{
  "title": "Datum Reihenfolge Überprüfung",
  "navigation": "Datum Reihenfolge Überprüfung",
  "datevarslabel": "Datumsvariablen (geben Sie früheste bis späteste an; gleiche Klasse; mindestens 2)",
  "compgrplabel": "Vergleich",
  "compgrpnote": "Hinweis: Dies ist der Vergleich zwischen allen oben angegebenen Daten, die auf Reihenfolfehler überprüft werden, z.B. Werte sollten datum1<datum2<datum3 sein.",
  "ltlabel": "<",
  "ltelabel": "<=",
  "idvarslabel": "Reihenidentifikationsvariablen (optional)",
  "dateerrorboxlabel": "Datensatz mit Datumsfehlervariable erstellen",
  "dateerrordatanamelabel": "Datensatzname",
  "dateerrorvarlabel": "Name der Datumsfehlervariable",
  "help": {
    "title": "Datum Reihenfolge Überprüfung",
    "r_help": "hilfe('<', paket = 'basis')",
    "body": "\nDies erstellt eine Liste von Zeilen im aktiven Datensatz, in denen die Werte der Datumsvariablen nicht in einer bestimmten Reihenfolge sind. Dies hilft, potenzielle Fehler bei Datumsvariablen zu identifizieren, wenn Daten oder \nZeit für eine Analyse benötigt werden. Zum Beispiel, wenn drei Datums-Spalten in der Reihenfolge datum1 < datum2 < datum3 sein sollen, wird dieser Dialog alle Beobachtungen drucken, bei denen \ndie Werte dieser Variablen dieser Reihenfolge nicht folgen. Fehlende Datumswerte sind in den angegebenen Variablen erlaubt und werden für keine Vergleiche verwendet.\n<br/><br/>\n<b>Datumsvariablen (geben Sie früheste bis späteste an; gleiche Klasse; mindestens 2):</b> Geben Sie mindestens 2 Datumsvariablen in der Reihenfolge von früheste bis späteste an. Diese können jede Datums-Klasse \n(POSIXct, Datum) sein, aber alle angegebenen Variablen müssen die gleiche Datums-Klasse haben. Andernfalls tritt ein Fehler auf.\n<br/><br/>\n<b>Vergleich:</b> Geben Sie den Vergleichsoperator an, der verwendet wird, um die Datumswerte zu vergleichen. \"<\" bedeutet kleiner als und \"<=\" bedeutet kleiner oder gleich. Wenn \"<\" gewählt wird, werden Daten, die \ngleich sind, als Fehler markiert. Wenn \"<=\" gewählt wird, werden Daten, die gleich sind, nicht als Fehler markiert.\n<br/><br/>\n<b>Reihenidentifikationsvariablen (optional):</b> Geben Sie eine oder mehrere Variablen an, die nützlich sein könnten, um die Zeilen zu identifizieren. Zum Beispiel, die Identifikationsnummer des Subjekts. Diese werden \nin die Liste der Fehler aufgenommen. Wenn keine Variablen angegeben sind, wird die Zeilennummer des Datensatzes der einzige Identifikator sein.\n<br/><br/>\n<b>Datensatz mit Datumsfehlervariable erstellen:</b> Dies wird einen separaten Datensatz mit den ursprünglichen Daten und einer Variablen erstellen, die angibt, ob jede Beobachtung einen Datumsreihenfolge \nfehler hat (kodiert als 1=Datumsreihenfolge Fehler und 0=kein Datumsreihenfolge Fehler). Der <b>Datensatzname</b> ist der gewünschte Name dieses Datensatzes und <b>Name der Datumsfehlervariable</b> ist der gewünschte Name \nder Datumsreihenfolge Fehlervariable in diesem Datensatz.\n\t\t"
  }
}