{
  "title": "Diagnosetests",
  "navigation": "Diagnosetests",
  "outvar": "Ergebnisvariable (1=positiv, 0=negativ):",
  "testvar": "Testvariable (1=positiv, 0=negativ):",
  "cilevel": "Konfidenzniveau:",
  "help": {
    "title": "Diagnosetests",
    "r_help": "help(epi.tests,package=epiR)",
    "body": "\n<b>Beschreibung</b></br>\nDies berechnet verschiedene Maße, die in diagnostischen Teststudien für einen binären Test gegenüber einem binären Goldstandard-Ergebnis zur Erkennung einer \"Krankheit\" geeignet sind.<br/>\nErgebnisvariable: Variable, die die Werte für den Goldstandard enthält. Dies muss eine numerische Variable sein, die als 1 = \"Krankheit\" positiv und 0 = \"Krankheit\" negativ codiert ist, da die Berechnungen von dieser Reihenfolge abhängen.<br/>\nTestvariable: Variable, die die Werte für den in Betracht gezogenen Test enthält. Dies muss eine numerische Variable sein, die als 1 = \"Krankheit\" positiv und 0 = \"Krankheit\" negativ codiert ist, da die Berechnungen von dieser Reihenfolge abhängen.<br/>\nKonfidenzniveau: Gewünschtes Konfidenzintervallniveau<br/>\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nepi.tests(dat, conf.level = 0.95)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ndat: Ein Objekt der Klasse Tabelle, das die individuellen Zellfrequenzen enthält, die durch die Tabellierung der Ergebnis- und Testvariable erstellt wurden. Die Ergebnisvariable enthält die Werte für den Goldstandard. Dies muss eine numerische Variable sein, die als 1 = \"Krankheit\" positiv und 0 = \"Krankheit\" negativ codiert ist, da die Berechnungen von dieser Reihenfolge abhängen. Die Testvariable enthält die Werte für den in Betracht gezogenen Test. Dies muss eine numerische Variable sein, die als 1 = \"Krankheit\" positiv und 0 = \"Krankheit\" negativ codiert ist, da die Berechnungen von dieser Reihenfolge abhängen.\n</li>\n<li>\nKonfidenzniveau: Gewünschtes Konfidenzintervallniveau\n</li>\n</ul>\n<b>Details</b></br>\nExakte binomiale Konfidenzgrenzen werden für Testempfindlichkeit, Spezifität sowie positive und negative prädiktive Werte berechnet (siehe Collett 1999 für Details).</br>\nKonfidenzintervalle für positive und negative Wahrscheinlichkeitsverhältnisse basieren auf Formeln, die von Simel et al. (1991) bereitgestellt werden.</br>\nDiagnostische Genauigkeit wird definiert als der Anteil aller Tests, die ein korrektes Ergebnis liefern. Das diagnostische Odds-Verhältnis wird definiert als wie viel wahrscheinlicher der Test eine korrekte Diagnose als eine falsche Diagnose bei Patienten mit der Krankheit stellt (Scott et al. 2008). Die Anzahl der benötigten Diagnosen wird definiert als die Anzahl der Patienten, die getestet werden müssen, um einen korrekten positiven Test zu erhalten. Der Youden-Index ist die Differenz zwischen der wahren positiven Rate und der falschen positiven Rate. Der Youden-Index reicht von -1 bis +1, wobei Werte näher an 1 liegen, wenn sowohl Sensitivität als auch Spezifität hoch sind (d.h. nahe bei 1).</br>\n<b>Wert</b></br>\nSiehe detaillierte Hilfe unten, um auf die R-Hilfe zuzugreifen, die die zurückgegebenen Werte beschreibt</br>\n<b>Paket</b></br>\nepiR;DescTools</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl aus help(epi.tests,package=epiR), indem Sie einen R-Code-Chunk erstellen, indem Sie + im Ausgabefenster klicken\n\t\t\t"
  }
}