{
  "title": "Anzeige Regeln",
  "navigation": "Anzeige Regeln",
  "rulename": "Geben Sie ein vorhandenes Regelobjekt ein",
  "dosortingchk": "Die Regeln sortieren",
  "sortopt": "Sortieroptionen",
  "sortby": "Sortieren nach",
  "confchk": "Konfidenz",
  "liftchk": "Lift",
  "suppchk": "Unterstützung",
  "sortord": "Sortierreihenfolge",
  "increasing": "Aufsteigend",
  "decreasing": "Absteigend",
  "noofrules": "Anzahl der anzuzeigenden Regeln",
  "rulecount": "",
  "fromto": "Regeln anzeigen",
  "from": "Von",
  "to": "Bis",
  "help": {
    "title": "Anzeige Regeln",
    "r_help": "hilfe(inspect, paket='arules')",
    "body": "\n            <b>\n\t\t\tPaket : arulesViz\n\t\t\t</b>\n\t\t\t<br/><br/>\n            <b>\n            1.  inspect\n            </b>\n            <br/><br/>\n\t\t\t<b>\n\t\t\tBeschreibung\n\t\t\t</b>\n\t\t\t<br/><br/>\n            Bietet die generische Funktion inspect und S4-Methoden zur Anzeige von Assoziationen und Transaktionen sowie zusätzlichen Informationen, die für die Online-Inspektion formatiert sind.\n            <br/><br/>\n\t\t\t<b>\n\t\t\tVerwendung\n\t\t\t</b>\n\t\t\t<br/><br/>\n\t\t\t<code>\n            inspect(x, ...)\n            </code>\n            <br/><br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            x: eine Menge von Assoziationen oder Transaktionen oder eine itemMatrix.\n            </li>\n            <li>\n            ...: zusätzliche Argumente können verwendet werden, um die Ausgabe anzupassen: setStart, setEnd, itemSep und ruleSep. Elemente werden nur zeilenweise ausgegeben, falls die Ausgabelinien sehr lang werden. Dies kann auch direkt über linebreak gesteuert werden.\n            </li>\n            </ul>\n            <br/><br/>\n\n            <b>\n            2. sort\n            </b>\n            <br/><br/>\n\n\t\t\t<b>\n\t\t\tBeschreibung\n\t\t\t</b>\n\t\t\t<br/><br/>\n            Bietet die Methode sort, um Elemente in der Klasse Assoziationen (z. B. Itemsets oder Regeln) gemäß dem Wert der in der Slot-Qualität der Assoziation gespeicherten Maße (z. B. Unterstützung) zu sortieren.\n            <br/><br/>\n\t\t\t<b>\n\t\t\tVerwendung\n\t\t\t</b>\n\t\t\t<br/><br/>\n\t\t\t<code>\n            ## S4-Methode für die Signatur 'associations'\n            arules::sort(x, decreasing = TRUE, na.last = NA, \n            by = \"support\", order = FALSE, ...)\n            </code>\n            <br/><br/>\n\t\t\t<code>\n            ## S4-Methode für die Signatur 'associations'\n            head(x, n = 6L, by = NULL, decreasing = TRUE, ...)\n            </code>\n            <br/><br/>\n\t\t\t<code>\n            ## S4-Methode für die Signatur 'associations'\n            tail(x, n = 6L, by = NULL, decreasing = TRUE, ...)\n            </code>\n            <br/><br/>                        \n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            x: ein Objekt, das sortiert werden soll.\n            </li>\n            <li>\n            decreasing: ein logischer Wert. Soll die Sortierung aufsteigend oder absteigend sein? (Standard ist absteigend)\n            </li>\n            <li>\n            na.last: na.last wird für Assoziationen nicht unterstützt. NAs werden immer zuletzt gesetzt.\n            </li>\n            <li>\n            by: ein Zeichenfolgenwert, der das Qualitätsmaß angibt, das in x gespeichert ist und verwendet werden soll, um x zu sortieren. Wenn ein Vektor von Zeichenfolgen angegeben wird, werden die zusätzlichen Zeichenfolgen verwendet, um x im Falle von Bindungen zu sortieren.\n            </li>\n            <li>\n            order: Soll ein Ordnungsvektor anstelle der sortierten Assoziationen zurückgegeben werden?\n            </li>\n            <li>\n            n: eine einzelne Ganzzahl, die die Anzahl der zurückgegebenen Assoziationen angibt.\n            </li>\n            <li>\n            ... : Weitere Argumente werden ignoriert.\n            </li>                                    \n            </ul>\n            <br/><br/>     \n            <b> \n            Details\n            </b> \n            <br/>\n            sort ist relativ langsam für große Mengen von Assoziationen, da es eine große Datenstruktur kopieren und umsortieren muss. Beachten Sie, dass das Sortieren eine zweite Kopie der Menge von Assoziationen erstellt, was für große Mengen langsam und speicherintensiv sein kann. Mit order = TRUE wird ein ganzzahliger Vektor mit der Reihenfolge zurückgegeben, anstelle der umsortierten Assoziationen.\n            Wenn nur die obersten n Assoziationen benötigt werden, dann funktioniert head mit by schneller, als sort und dann head aufzurufen, da es dies ohne Kopieren und Umordnen aller Daten tut. tail funktioniert auf die gleiche Weise.\n            <br/><br/>  \n            <b> \n            Wert\n            </b> \n            <br/>\n            Ein Objekt derselben Klasse wie x.                  \n    "
  }
}