{
  "title": "EWMA-Diagramm",
  "navigation": "EWMA-Diagramm",
  "summaryPrintChk": "Zusammenfassung zusätzlich zu Diagrammen drucken",
  "label2": "Zwei Optionen - entweder eine Variable zum Diagramm auswählen (und eine Gruppierungsvariable nach Bedarf) oder die Variablen im Datensatz auswählen, wenn sie bereits gruppiert sind",
  "selectVariableRad": "Option 1: Wählen Sie eine Variable aus dem Datensatz aus, die gruppiert werden muss",
  "variableSelcted": "Variable (beobachtete Daten) zum Diagramm",
  "groupingVariable": "Gruppierungsvariable",
  "displayGroupsChk": "Die Gruppierungen im UI-Raster des Datensatzes anzeigen",
  "selectDatasetRad": "Option 2: Wählen Sie die Variablen aus dem Datensatz aus, wenn sie bereits gruppiert sind",
  "variablelistSelcted": "Wählen Sie eine oder mehrere gruppierte Variablen (beobachtete Daten) zum Diagramm aus",
  "nsigmas": "Sigma - Anzahl der Sigmas, die zur Berechnung der Kontrollgrenzen verwendet werden sollen",
  "lambda": "Der Glättungsparameter (zwischen 0 und 1)",
  "rowsTobeUsed": "Gruppierte Zeilen, die zum Diagramm verwendet werden sollen (z. B. 1:25 oder 1,4,5,7:12 angeben)",
  "rowsTobeUsedAsNewData": "Neue Daten - gruppierte Zeilen, die als neue Daten zum Diagramm verwendet werden sollen (z. B. 1:25 oder 1,4,5,7:12 angeben) - neue Daten zum Plotten, aber nicht in die Berechnungen einbezogen",
  "help": {
    "title": "EWMA-Diagramm",
    "r_help": "help(ewma, package = qcc)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tqcc-Funktion zur Durchführung statistischer Qualitätskontrollen und zum Zeichnen von Shewhart-Diagrammen\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür detaillierte Hilfe verwenden Sie R help(ewma, package = qcc) und help(qcc, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm dies auszuprobieren, können Sie den Datensatz namens pistonrings aus dem qcc-Paket mit dem Menü Datensatz laden, indem Sie das qcc-Paket auswählen und dann den Datensatz pistonrings auswählen\n\t\t\t\t<br/>\n\t\t\t\tWählen Sie Option 1, Durchmesser zur Variable (beobachtet..), Probe zur Gruppierungsvariable,\n\t\t\t\t<br/>\n\t\t\t\tGeben Sie 1:25 in die gruppierten Zeilen ein, die verwendet werden sollen, 30:40 in neue Daten\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tBefolgen Sie das qcc-Tutorial unter https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
  }
}