{
  "title": "Walddiagramm",
  "navigation": "Walddiagramm",
  "modelselectorlabel": "Modellnamen auswählen",
  "plotvarslabel": "Variablen zum Plotten (keine angegeben, plottet alle Variablen)",
  "varlabelslabel": "Variablenbezeichnungen (angeben als varname='label', durch Kommas getrennt, z.B. alter='Alter in Jahren', bmi='Body-Mass-Index'); \\n kann für Zeilenumbrüche innerhalb einer Bezeichnung verwendet werden",
  "notelabel": "HINWEIS: Das Ändern von Bezeichnungen erfordert ein erneutes Anpassen des Modells, sodass große Datenmengen Zeit in Anspruch nehmen können",
  "label3": "HINWEIS: MODELLE, DIE MIT MODELTUNING (TRAIN) ERSTELLT WURDEN, WERDEN NICHT UNTERSTÜTZT",
  "estimateoptlabel": "Schätzoptionen",
  "estimatelabellabel": "Bezeichnung",
  "exponentiatelabel": "Exponentiation der Parameterabschätzung erzwingen",
  "linecolorlabel": "Linienfarbe",
  "pointshapelabel": "Punktform",
  "pointsizelabel": "Punktgröße (0-10 mm)",
  "styleoptlabel": "Stiloptionen",
  "factorseplinelabel": "Faktornamen in separaten Zeilen",
  "plotbandslabel": "Plot-Bänder",
  "textsizelabel": "Textgröße (1-10 mm)",
  "estticklabelsizelabel": "Größe der Schätzmarkenbeschriftung (1-50)",
  "help": {
    "title": "Walddiagramm",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nDies erstellt ein Diagramm der Modellkoeffizienten oder exponentiierter Koeffizienten aus einem Regressionsmodell. Jede Variable wird in ihrer eigenen Zeile mit Summen, Parameterabschätzungen, \n95%-Konfidenzintervallen und p-Werten dargestellt. Variablen können beschriftet werden, um eine ansprechendere Präsentation zu ermöglichen. Derzeit werden Modelle der Klasse lm (lineare Modelle), glm (generalized linear models, \nzu denen logistische und Poisson-Modelle gehören), coxph (Cox-proportionale Gefahren) und rq (Quantilsregression) unterstützt.\n<br/><br/>\n<b>Modellnamen auswählen:</b> Wählen Sie den Namen des Modells, wie er beim Anpassen des Modells angegeben wurde. Dies ist ein erforderliches Feld.\n<br/><br/>\n<b>Variablen zum Plotten:</b> Wenn Sie Zugriff auf die Daten haben, die das Modell erstellt haben, können Sie eine Teilmenge der Variablen im Modell angeben, die im Diagramm enthalten sein sollen. Wenn keine Variablen \nangegeben sind, wird standardmäßig auf alle enthaltenen Variablen zurückgegriffen.\n<br/><br/>\n<b>Variablenbezeichnungen:</b> Geben Sie ansprechendere Bezeichnungen anstelle der Variablennamen an. Wenn eine Variable nicht beschriftet wird, wird der Variablenname oder die vorhandene Variablenbezeichnung verwendet, die beim Anpassen des Modells verwendet wurde (sofern vorhanden). Diese müssen im Format variablename=\"label\" angegeben werden, durch Kommas getrennt. Beachten Sie, dass die Verwendung von \\n in einer Bezeichnung einen Zeilenumbruch innerhalb der Bezeichnung erzwingt. Dies bedeutet, dass Sie mehrzeilige Bezeichnungen angeben können, was für lange Bezeichnungen vorteilhaft sein könnte, da lange Bezeichnungen auf einer Zeile weniger Platz für die Schätzungen lassen. Eine Zusammenfassung des Modells mit Modellbewertung -> Zusammenfassen -> Modell zusammenfassen wird die verwendeten Modellvariablen drucken, falls Sie keinen Zugriff auf den Datensatz haben. HINWEIS: Es gibt einen \naktuellen Fehler im forestmodel R-Paket, der keine Variablenbezeichnungen für Faktoren in Cox-Modellen verwendet - der Paketentwickler wurde benachrichtigt. Eine Alternative, bis das Paket \nbehoben ist, besteht darin, das Modell mit dummy-codierten Variablen anstelle von Faktoren neu anzupassen.\n<br/><br/><br/>\n<b>Schätzoptionen:</b>\n<br/><br/>\n<b>Bezeichnung:</b> Optionale Bezeichnung für die Schätzspalte im Diagramm. Logistische Regression und Cox-Modelle werden automatisch erkannt und die Schätzungen als \"Odds Ratio\" und \n\"Hazard Ratio\" bezeichnet. Andere Modelle verwenden standardmäßig \"Estimate\", wenn Sie nichts angeben.\n<br/><br/>   \n<b>Exponentiation der Parameterabschätzung erzwingen:</b> Wählen Sie dies, um die Werte von exp(Koeffizient) anzuzeigen, d.h. 2.718 hoch dem Koeffizienten. Exponentierte \nKoeffizienten werden häufig in Cox-proportionalen Gefahrenmodellen (für Hazard Ratios), logistischen Regressionen (für Odds Ratios), log-binomialen Modellen (für relative Risiken) und Poisson \nRegression (für Ratenverhältnisse) verwendet. Standardmäßig werden logistische Regression und Cox-Modelle automatisch erkannt und exp(Koeffizient) verwendet.\n<br/><br/>\n<b>Linienfarbe:</b> Linienfarbe für die Konfidenzintervalle.\n<br/><br/>\n<b>Punktform:</b> Die Form der Punkte für die Parameterabschätzungen im Diagramm.\n<br/><br/>\n<b>Punktgröße (0-10 mm):</b> Die Größe der Punkte in Millimetern für die Parameterabschätzungen im Diagramm. 0 mm würde die Punkte entfernen. Der Standardwert beträgt 4 mm.\n<br/><br/><br/>\n<b>Stiloptionen:</b>\n<br/><br/>\n<b>Faktornamen in separaten Zeilen:</b> Wählen Sie dies, um die Namen der Faktorvariablen in einer separaten Zeile von den Ebenen des Faktors anzuzeigen.\n<br/><br/>\n<b>Plot-Bänder:</b> Wählen Sie dies, um abwechselnd schattierte Bereiche für jede Zeile des Diagramms anzuzeigen.\n<br/><br/>\n<b>Textgröße (1-10 mm):</b> Größe des Textes in Millimetern im Diagramm. Der Standardwert beträgt 4 mm.\n<br/><br/>\nHinweis: Wenn Sie die Gesamtgröße des Diagramms ändern möchten, kann die Diagrammgröße über die Schaltfläche Themen im Menü mit den drei Punkten festgelegt werden.\n<br/><br/>\n<b>Größe der Schätzmarkenbeschriftung (1-50):</b> Größe der Beschriftungen der Schätzmarken für die Schätzachse.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b>  forestmodel, arsenal, survival, quantreg, insight\n"
  }
}