{
  "title": "Friedman-Test",
  "navigation": "Friedman-Test",
  "tvarbox1": "Antwortvariablen, 2 oder mehr",
  "help": {
    "title": "Friedman-Test",
    "r_help": "help(friedman.test, package=stats)",
    "body": "\n<b>Beschreibung</b></br>\nFührt einen Friedman-Rangsummentest mit nicht replizierten Blockdaten durch.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## Standard S3-Methode:\nfriedman.test(y, groups, blocks, ...)\n## S3-Methode für die Klasse 'formula'\nfriedman.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\ny: entweder ein numerischer Vektor von Datenwerten oder eine Datenmatrix.\n</li>\n<li>\ngroups: ein Vektor, der die Gruppe für die entsprechenden Elemente von y angibt, wenn dies ein Vektor ist; ignoriert, wenn y eine Matrix ist. Wenn es sich nicht um ein Faktorobjekt handelt, wird es in eines umgewandelt.\n</li>\n<li>\nblocks: ein Vektor, der den Block für die entsprechenden Elemente von y angibt, wenn dies ein Vektor ist; ignoriert, wenn y eine Matrix ist. Wenn es sich nicht um ein Faktorobjekt handelt, wird es in eines umgewandelt.\n</li>\n<li>\nformula: eine Formel der Form a ~ b | c, wobei a, b und c die Datenwerte und entsprechenden Gruppen und Blöcke angeben.\n</li>\n<li>\ndata: eine optionale Matrix oder Datenrahmen (oder ähnlich: siehe model.frame), die die Variablen in der Formel enthält. Standardmäßig werden die Variablen aus der Umgebung(formula) entnommen.\n</li>\n<li>\nsubset: ein optionaler Vektor, der eine Teilmenge von Beobachtungen angibt, die verwendet werden sollen.\n</li>\n<li>\nna.action: eine Funktion, die angibt, was geschehen soll, wenn die Daten NAs enthalten. Standardmäßig wird getOption(\"na.action\") verwendet.\n</li>\n<li>\n...: weitere Argumente, die an Methoden übergeben werden sollen oder von diesen stammen.\n</li>\n</ul>\n<b>Details</b></br>\nfriedman.test kann zur Analyse von nicht replizierten vollständigen Blockdesigns verwendet werden (d.h. es gibt genau eine Beobachtung in y für jede Kombination von Gruppen- und Blockebenen), bei denen die Normalitätsannahme möglicherweise verletzt ist.</br>\nDie Nullhypothese besagt, dass abgesehen von einem Effekt der Blöcke der Lageparameter von y in jeder der Gruppen gleich ist.\nWenn y eine Matrix ist, werden Gruppen und Blöcke aus den Spalten- und Zeilenindizes gewonnen. NAs sind in Gruppen oder Blöcken nicht erlaubt; wenn y NAs enthält, werden die entsprechenden Blöcke entfernt.</br>\n<b>Wert</b><br/>\nEine Liste mit der Klasse \"htest\", die die folgenden Komponenten enthält:<br/>\nstatistic: der Wert des Chi-Quadrat-Statistik von Friedman.<br/>\nparameter: die Freiheitsgrade der approximativen Chi-Quadrat-Verteilung der Teststatistik.<br/>\np.value: der p-Wert des Tests.<br/>\nmethod: der Zeichenfolgen \"Friedman-Rangsummentest\".<br/>\ndata.name: eine Zeichenfolge, die die Namen der Daten angibt.​<br/>\n<b>Beispiele</b><br/>\n<code> \nDataframe <- data.frame(Expenses=c(20,23,19,25,26), Sales=c(48,50,55,51,49), Gender=c('m','f','f','m','m'), Deptt=c('Accounts', 'HR', 'Sales','Marketing','IT'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Sales,Expenses)))<br/>\nResult_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>Pakete</b></br>\nstats</br>\n<b>Hilfe</b></br>\nhelp(friedman.test, package=stats)\n"
  }
}