{
  "title": "Generalisierte Lineare Modelle",
  "navigation": "GLZM",
  "modelname": "Modellname",
  "dependent": "Abhängige Variable",
  "offset": "Offset",
  "weights": "Gewichte",
  "formulaBuilder": "Formel-Builder",
  "family": "Wählen Sie eine Familie und Link-Funktion aus",
  "theta": "Geben Sie einen Wert für Theta an (nur für die negative Binomialfamilie angewendet)",
  "expCoefficients": "Exponentiieren Sie die Koeffizienten",
  "help": {
    "title": "Generalisierte Lineare Modelle",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>Beschreibung</b></br>\n            glm wird verwendet, um generalisierte lineare Modelle anzupassen, indem eine symbolische Beschreibung des linearen Prädiktors und eine Beschreibung der Fehlerverteilung angegeben werden.\n            <br/>\nHINWEIS 1: Ein Textfeld wird bereitgestellt, um den Anfangswert von Theta anzugeben, dies gilt nur für die negative Binomialfamilie. Wenn weggelassen, wird ein Momentenschätzer nach einer anfänglichen Anpassung mit einem Poisson-GLM verwendet.<br/>\nDer berechnete Anfangswert von Theta wird in der Ausgabe über der GLM-Zusammenfassungstabelle angezeigt.<br/>\nHINWEIS 2: Beim Angeben einer Variablen, die Gewichte enthält, beachten Sie, dass alle NA-Werte automatisch aus den abhängigen und unabhängigen Variablen entfernt werden, da wir die Option na.exclude verwenden, um das Modell zu erstellen.<br/> \nDies kann zu einer Diskrepanz führen, da NA-Werte NICHT automatisch aus der Gewichtungsvariablen entfernt werden. <br/>\nIn diesem Fall sehen Sie den Fehler, dass die Längen der Variablen unterschiedlich sind (gefunden für (Gewichte))<br/>\nUm diesen Fehler zu beheben, gehen Sie zu Variablen>Fehlende Werte>Entfernen von NAs und wählen Sie die abhängigen, unabhängigen Variablen und die Gewichtungsvariable aus, um fehlende Werte zu entfernen und das Modell neu zu erstellen.<br/>\nHINWEIS 3: Dummy-Code-Faktorvariablen, wenn Sie die negative Binomialfamilie verwenden, siehe Variablen > Berechnen > Dummy-Code.<br/>\nHINWEIS 4: Der Schnittpunkt ist standardmäßig enthalten. Um den Schnittpunkt zu entfernen, geben Sie -1 im Formel-Builder ein.\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code> \n            glm(formula, family = gaussian, data, weights, subset,\n                na.action, start = NULL, etastart, mustart, offset,\n                control = list(...), model = TRUE, method = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            formula: ein Objekt der Klasse \"formula\" (oder eines, das in diese Klasse umgewandelt werden kann): eine symbolische Beschreibung des Modells, das angepasst werden soll. Die Einzelheiten zur Modellspezifikation sind unter 'Details' angegeben.\n            </li>\n            <li>\n            family: eine Beschreibung der Fehlerverteilung und der Linkfunktion, die im Modell verwendet werden sollen. Für glm kann dies eine Zeichenfolge sein, die eine Familienfunktion benennt, eine Familienfunktion oder das Ergebnis eines Aufrufs an eine Familienfunktion. Für glm.fit wird nur die dritte Option unterstützt. (Siehe family für Einzelheiten zu Familienfunktionen.)\n            </li>\n            <li>\n            data: ein optionales Datenrahmen, eine Liste oder Umgebung (oder ein Objekt, das durch as.data.frame in einen Datenrahmen umgewandelt werden kann), das die Variablen im Modell enthält. Wenn nicht in den Daten gefunden, werden die Variablen aus der Umgebung(formula) entnommen, typischerweise der Umgebung, aus der glm aufgerufen wird.\n            </li>\n            <li>\n            weights: ein optionaler Vektor von 'Prior-Gewichten', die im Anpassungsprozess verwendet werden sollen. Sollte NULL oder ein numerischer Vektor sein.\n            </li>\n            <li>\n            subset: ein optionaler Vektor, der eine Teilmenge von Beobachtungen angibt, die im Anpassungsprozess verwendet werden sollen.\n            </li>\n            <li>\n            na.action: eine Funktion, die angibt, was geschehen soll, wenn die Daten NAs enthalten. Der Standardwert wird durch die na.action-Einstellung der Optionen festgelegt und ist na.fail, wenn dies nicht festgelegt ist. Der 'fabrikfrische' Standard ist na.omit. Ein weiterer möglicher Wert ist NULL, keine Aktion. Der Wert na.exclude kann nützlich sein.\n            </li>\n            </ul>\n            <b>Details</b><br/>\n            Ein typischer Prädiktor hat die Form response ~ terms, wobei response der (numerische) Antwortvektor und terms eine Reihe von Termen ist, die einen linearen Prädiktor für die Antwort spezifizieren. Für binomiale und quasibinomiale Familien kann die Antwort auch als Faktor angegeben werden (wenn die erste Ebene Misserfolg und alle anderen Erfolg bezeichnet) oder als zweispaltige Matrix, wobei die Spalten die Anzahl der Erfolge und Misserfolge angeben. Eine Terms-Spezifikation der Form first + second gibt alle Terme in first zusammen mit allen Termen in second an, wobei Duplikate entfernt werden.<br/>\n            <b>Wert</b><br/>\n            Ein Objekt der Klasse \"glm\" ist eine Liste, die mindestens die folgenden Komponenten enthält:\n            <ul>\n            <li>\n            coefficients: ein benannter Vektor von Koeffizienten\n            </li>\n            <li>\n            residuals: die Arbeitsresiduen, das heißt die Residuen in der letzten Iteration der IWLS-Anpassung. Da Fälle mit null Gewichten weggelassen werden, sind ihre Arbeitsresiduen NA.\n            </li>\n            <li>\n            fitted.values: die angepassten Mittelwerte, die durch Transformation der linearen Prädiktoren durch die Inverse der Linkfunktion erhalten werden.\n            </li>\n            <li>\n            rank: der numerische Rang des angepassten linearen Modells.\n            </li>\n            <li>\n            family: das verwendete Familienobjekt.\n            </li>\n            <li>\n            linear.predictors: die lineare Anpassung auf der Link-Skala.\n            deviance: bis auf eine Konstante minus zweimal die maximierte Log-Likelihood. Wo sinnvoll, wird die Konstante so gewählt, dass ein gesättigtes Modell eine Deviance von null hat.\n            </li>\n            <li>\n            aic\t: Eine Version von Akaikes Informationskriterium, minus zweimal die maximierte Log-Likelihood plus zweimal die Anzahl der Parameter, berechnet über die aic-Komponente der Familie. Für binomiale und Poisson-Familien ist die Dispersion auf eins festgelegt und die Anzahl der Parameter ist die Anzahl der Koeffizienten. Für gaussische, Gamma- und inverse gaussische Familien wird die Dispersion aus der Residuen-Deviance geschätzt, und die Anzahl der Parameter ist die Anzahl der Koeffizienten plus eins. Für eine gaussische Familie wird das MLE der Dispersion verwendet, sodass dies ein gültiger Wert für AIC ist, aber für Gamma- und inverse gaussische Familien ist dies nicht der Fall. Für Familien, die durch quasi-Likelihood angepasst werden, ist der Wert NA.\n            </li>\n            </ul>\n            <b>Paket</b></br>\nglm</br>\n<b>Hilfe</b></br>\nhelp(glm, package ='stats')\n"
  }
}