{
  "title": "R-Paket(e) installieren",
  "navigation": "R-Paket(e) installieren",
  "package_name": "Bitte geben Sie den Namen(e) eines oder mehrerer Pakete ein, getrennt durch Kommas",
  "instruction_text": "\nHINWEIS: R-Paketnamen sind groß- und kleinschreibungsempfindlich. Sie können mehrere Paketnamen verwenden, indem Sie , als Trennzeichen verwenden\nBeispiel 1: foreign\nBeispiel 2: foreign, car, MASS",
  "instruction_text1": "\nHINWEIS: Sie müssen Schreibzugriff auf den unten ausgewählten Pfad haben, andernfalls starten Sie die Anwendung erneut, indem Sie die Option als \nAdministrator ausführen auswählen",
  "repository": "Geben Sie die URL des CRAN-Repositorys ein, das Standard-https://cloud.r-project.org/ installiert vom CRAN-Spiegel, der Ihnen am nächsten ist.",
  "label1": "Beispiel 1: foreign",
  "label2": "HINWEIS: Das R-Logo, das in der Menüleiste angezeigt wird, ist Eigentum der R-Stiftung",
  "installPath": "Wählen Sie den R-Bibliothekspfad aus, in dem das R-Paket installiert wird",
  "help": {
    "title": "R-Paket(e) installieren",
    "r_help": "help(install.packages)",
    "body": "\n            <b>Beschreibung</b></br>\n            Installieren oder Aktualisieren Sie ein oder mehrere R-Pakete im ausgewählten Bibliothekspfad.</br>\n            HINWEIS:</br>\n            1. Wir installieren alle Pakete, von denen die angegebenen Pakete abhängen, importieren oder verlinken</br>\n            2. Wenn Sie ein vorhandenes Paket aktualisieren, müssen Sie die BlueSky Statistics-Anwendung neu starten.</br>\n            3. Wir laden das neu installierte/aktualisierte Paket nach der Installation.</br>\n            4. Standardmäßig installieren wir immer in die persönliche R-Bibliothek des Benutzers auf dem lokalen Computer.</br>\n            5. Wenn dasselbe R-Paket sowohl in der persönlichen als auch in der Systembibliotheksposition installiert ist (Die Systembibliotheksposition ist der Standardinstallationsort, der die Pakete enthält, \n                die wir standardmäßig mit BlueSky Statistics ausliefern), laden wir das Paket von der persönlichen Position.</br>\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Pfad zur Benutzer- oder Systembibliothek\", repos = \"Pfad zum Repository, das das Paket enthält\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            pkgs: Zeichenvektor der Namen von Paketen, deren aktuelle Versionen aus dem angegebenen Repository heruntergeladen werden sollen.\n            </li>\n            <li>\n            lib: Zeichenvektor, der den Bibliothekspfad auf dem lokalen Computer angibt, in den die Pakete installiert werden sollen. Wir standardisieren immer auf den persönlichen Bibliotheksstandort des Benutzers.\n            </li>\n            <li>\n            repos: Zeichenvektor, die Basis-URL(s) der zu verwendenden Repositories, z.B. die URL eines CRAN-Spiegels wie \"https://cloud.r-project.org\".\n            </li>\n            <li>\n            BSkypackageinstall: Dies ist ein Flag, das die BlueSky Statistics-Anwendung intern verwendet, um anzuzeigen, dass \n            das Paket über das Menü installiert wurde und um es weiterzugeben.\n            </li>\n            </ul>\n            <b>Wert</b><br/>\n            Unsichtbares NULL.<br/>\n            <b>Beispiele</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Paket</b></br>\n            broom</br>\n            <b>Hilfe</b></br>\n            Für detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerungsfensters\n\n"
  }
}