{
  "title": "Intervall-Diagramm",
  "navigation": "Intervall-Diagramm",
  "response": "Y-Variable, geben Sie eine numerische Variable an",
  "Fixed": "X-Variable - Geben Sie eine oder mehrere Gruppierungs-(Kategorien-)Variablen an",
  "confidenceInterval": "Geben Sie einen Konfidenzintervallwert zwischen 0 und 1 an, z.B. 0,95",
  "showIntervalValuesChk": "Mittelwert und Intervallwerte im Diagramm anzeigen",
  "showGroupValuesonXaxisChk": "Gruppenwerte auf der x-Achse anzeigen",
  "supressIntervalsChk": "Intervallbalken im Diagramm anzeigen",
  "priintStatTableChk": "Tabelle mit Mittelwert und Intervallwerten drucken",
  "facet_xChk": "Das Diagramm mit der ersten Gruppe segmentieren",
  "jitterPointsChk": "Überlappende/gedrängte Punkte für eine Gruppe streuen (Jitter-Effekt)",
  "groupColorLegendChk": "Farblegende pro Gruppen-Kombination anzeigen",
  "chartTitle": "Geben Sie einen Titel ein",
  "x_title": "Bezeichnung der x-Achse",
  "y_title": "Bezeichnung der y-Achse",
  "labelColor1": "Wählen Sie eine Farbe für den Streupunkt",
  "labelColor2": "Wählen Sie eine Farbe für den Intervallbalken",
  "angleXaxis_text": "Winkel zum Neigen der x-Achsentextwerte (Standard 0 für kein Neigen)",
  "angleYaxis_text": "Winkel zum Neigen der y-Achsentextwerte (Standard 0 für kein Neigen)",
  "label1": "Horizontale Linien",
  "yIntercept": "Geben Sie durch Kommas getrennte Y-Achsenabschnittswerte für die horizontalen Linien an, z.B. 100, 200, 300",
  "hLineColor": "Wählen Sie eine Farbe für Linie(n) und Beschriftung(en) (Nach Farbauswahl, klicken Sie außerhalb der Steuerung, um anzuwenden)",
  "lineType": "Wählen Sie den Linientyp",
  "horizontalLinelabel": "Geben Sie durch Kommas getrennte Beschriftungen (ohne umschließende Anführungszeichen) für die horizontalen Linie(n) an",
  "horizontalLinelabel_angle_text": "Winkel zum Neigen des Textes der horizontalen Linienbeschriftung (Standard 0 für kein Neigen)",
  "label2": "Hinweis: Größere Werte verschieben den Text nach unten, kleinere Werte verschieben den Text nach oben",
  "addHoriRefLines": "Referenzlinien hinzufügen",
  "xyLimits": "Y-Achsenbegrenzungen",
  "label5": "Geben Sie einen Bereich für Y-Achsenwerte an",
  "rangeYValues": "Geben Sie den Y-Achsenbereich an, z.B. 0,100",
  "labelHori_HorizontalJustification": "Hinweis: Größere Werte platzieren den Text nach links, kleinere Werte verschieben den Text nach rechts",
  "verticalJustification": "Steuern Sie die vertikale Ausrichtung der Beschriftung",
  "hori_HorizontalJustification": "Steuern Sie die horizontale Ausrichtung der Beschriftung",
  "addlLabelHlineTextPositionOffset": "Zusätzliche Anpassungen zur Positionierung des Beschriftungstextes für horizontale Linien",
  "horiMovementHReflineLabel": "Bewegen Sie den Text horizontal nach links oder rechts - verwenden Sie eine beliebige Zahl mit + oder - Zeichen",
  "nobreaklineHRefLabelandValueChk": "Aktivieren Sie dieses Kästchen, um die Trennlinie zwischen Beschriftungswert und Beschriftungstext zu entfernen",
  "vertiMovementHReflineLabel": "Bewegen Sie den Text vertikal nach oben oder unten - verwenden Sie eine beliebige Zahl mit + oder - Zeichen",
  "help": {
    "title": "Intervall-Diagramm",
    "r_help": "help(ggplot, package='ggplot2')",
    "body": "\n\t\t\t<b>Beschreibung</b></br>\n\t\t\tErstellt ein Streudiagramm, das es Ihnen ermöglicht, Punkte nach einer oder mehreren Kategorien (Faktoren) zu gruppieren.\n\t\t\tSie können optional Intervalle im Diagramm hinzufügen oder entfernen (Mittelwert und Intervallgrenzen des Mittelwerts pro Gruppe).\n\t\t\tSie können optional eine Tabelle hinzufügen oder entfernen, die den Mittelwert und die Intervallgrenzen des Mittelwerts pro Gruppe anzeigt.\n\t\t\tSie können mehrere horizontale Referenzlinien mit entsprechenden Beschriftungen pro Referenzlinie hinzufügen.\n\t\t\t<br/>\n    "
  }
}