{
  "title": "Kaplan-Meier-Schätzung, Gruppen vergleichen",
  "navigation": "Kaplan-Meier-Schätzung, Gruppen vergleichen",
  "timevar": "Zeit bis zum Ereignis oder Zensur",
  "eventvar": "Ereignis (1 = Ereignis, 0 = Zensur)",
  "groupvar": "Gruppe",
  "label1": "Diagrammtyp",
  "survivalradio": "Überleben",
  "inciradio": "Versagen",
  "allesttable": "Schätzungstabelle einschließlich aller Zeiten",
  "printspecest": "Schätzungstabelle für spezifische Zeiten",
  "spectimes": "Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an",
  "styleoptions": "Stiloptionen",
  "axisoptions": "Achsenoptionen",
  "label12": "Klicken Sie auf die ?-Schaltfläche oben rechts im Dialogfeld für Details zu Beispieldatensätzen und dem unterstützten Datenformat.",
  "titlebox": "Diagrammtitel",
  "plottitlesizelabel": "Größe des Diagrammtitels (5-50)",
  "themedropdown": "Diagrammthema",
  "label2": "Anzahl der Gefährdeten",
  "natriskchkbox": "Anzahl der Gefährdeten einbeziehen",
  "risktableprop": "Höhe der Risikotabelle (0-1)",
  "risktablepos": "Position der Risikotabelle",
  "risktabletext": "Stratifikationsbezeichnungen einbeziehen",
  "risktablevaluesize": "Größe der Werte in der Risikotabelle (1-15)",
  "risktabletitlesize": "Größe des Titels der Risikotabelle (5-50)",
  "risktableaxislabelsize": "Größe der Achsenbeschriftungen der Risikotabelle (5-50)",
  "risktableticklabelsize": "Größe der Tick-Beschriftungen der Risikotabelle (5-50)",
  "risktableclean": "Achsen und Gitterlinien aus der Risikotabelle entfernen",
  "label2b": "Legende",
  "legendpos": "Position",
  "legendtitle": "Titel",
  "legendlabels": "Wertbeschriftungen (Standard ist NULL; in der Reihenfolge der Strata angeben; z.B. c('Männlich', 'Weiblich')):",
  "legendfontsize": "Größe der Legendenbeschriftungen (5-50)",
  "label3": "Linienoptionen",
  "linesize": "Größe (0-5)",
  "linecolor": "Farbschema",
  "label4": "Konfidenzintervall",
  "cichkbox": "95% CI einbeziehen",
  "cistyle": "Stil",
  "citransparency": "Transparenz (0-1)",
  "label5": "Zensierte Zeiten",
  "censorchkbox": "Zensierte Zeiten einbeziehen",
  "censorsize": "Größe (0-10)",
  "medsurvivalline": "Medianüberleben anzeigen (h=horizontal, v=vertikal)",
  "label5b": "P-Wert",
  "pvaluechkbox": "P-Wert einbeziehen",
  "label5c": "Typ",
  "logrank": "Log-Rank",
  "gehanbreslow": "Gehan-Breslow (Wilcoxon)",
  "taroneware": "Tarone-Ware",
  "petopeto": "Peto-Peto",
  "modpetopeto": "Modifiziertes Peto-Peto",
  "flemharr": "Flemington-Harrington",
  "pvaluelocation": "Standort ((x,y), z.B. c(Zeit, Anteil)):",
  "pvaluesize": "Größe",
  "label6": "Überlebensachse",
  "survaxislabel": "Bezeichnung",
  "label7": "Skala",
  "defbutton": "Anteil",
  "pctbutton": "Prozent",
  "survaxislimits": "Achsenlimits auf Anteilsmaßstab (0-1) - geben Sie 'c(min, max)' ein",
  "survtickinc": "Tick-Mark-Inkremente (0-1)",
  "label8": "Zeitachse",
  "timeaxislabel": "Bezeichnung",
  "timeaxislimits": "Achsenlimits (NULL ist Standard, geben Sie 'c(min,max)' ein, um zu ändern, z.B. 'c(0,20)'",
  "timetickinc": "Tick-Mark-Inkremente (NULL ist Standard, geben Sie eine Zahl ein, um zu ändern, min=0",
  "axislabelsize": "Größe der Achsenbeschriftungen (5-50)",
  "ticklabelsize": "Größe der Achsen-Tick-Mark-Beschriftungen (5-50)",
  "help": {
    "title": "Kaplan-Meier-Schätzung, Gruppen vergleichen",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tSiehe Beispieldatensatz im Installationsverzeichnis, der Standardstandort befindet sich auf Laufwerk:\\Program Files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\survival\\mockstudy_upd.RData. Die Variable Followup_time sollte als Zeit bis zum Ereignis oder zur Zensur eingegeben werden und die Variable Event sollte als Ereignis (1 = Ereignis, 0 = Zensur) eingegeben werden. Die Variable sex sollte die Gruppenvariable sein.<br/>\n            Dieser Datensatz ist eine aktualisierte Version des mockstudy-Datensatzes im Arsenal-Paket.<br/><br/>\t\t\t\n            <b>Vergleich der Kaplan-Meier-Überlebenskurven</b>\n            <br/>\n            <br/>\n            Diese werden verwendet, um das kumulative Risiko zu schätzen, kein Ereignis (oder umgekehrt, ein Ereignis) über einen Zeitraum nach Beginn der Nachverfolgung für dieses Ereignis (oder Zeit null) zu haben. Probanden müssen ab Zeit null dem Risiko für das Ereignis ausgesetzt sein.\n            <br/>\n            <br/>\n            <b>Zeit:</b> Dauer bis zu einem Ereignis, falls das Ereignis eingetreten ist, oder letzte Nachverfolgung für dieses Ereignis, falls das Ereignis nicht eingetreten ist, für jeden Probanden\n            <br/><br/>\n            <b>Ereignis:</b> Numerischer Indikator dafür, ob das Ereignis eingetreten ist oder nicht (1=Ereignis, 0=Zensur) für jeden Probanden\n            <br/><br/>\n            <b>Gruppe:</b> Gruppen, die Sie vergleichen möchten\n            <br/><br/>\n            <b>Diagrammtyp:</b> Ob Sie die Wahrscheinlichkeit des Nicht-Eintretens des Ereignisses (Überleben) oder des Eintretens des Ereignisses (Versagen) darstellen möchten\n            <br/><br/>\n            <b>Schätzungstabelle einschließlich aller Zeiten:</b> Option zur Einbeziehung einer Tabelle, die die Überlebens- und Ereignisschätzungswahrscheinlichkeiten für jede beobachtete Zeit im Datensatz enthält\n            <br/>\n            <br/>\n\t\t\t<b>Schätzungstabelle für spezifische Zeiten:</b> Option zur Einbeziehung einer Tabelle, die die Überlebensschätzungswahrscheinlichkeiten für eine benutzerdefinierte Menge von Zeiten enthält.\n\t\t\t<br/><br/>\n\t\t\t<b>Geben Sie Zeiten als time1, time2, time3 usw. oder als seq(1,5,by=1) an:</b> Dies sind die spezifischen Zeiten, die in die Tabelle für spezifische Zeiten aufgenommen werden. Sie können einzeln mit Kommas oder als Sequenz gleichmäßig verteilter Werte angegeben werden.\n\t\t\t<br/><br/>\n            Eine Tabelle wird ausgegeben mit der Stichprobengröße, der Anzahl der Probanden mit dem Ereignis, der medianen Überlebenszeit (falls definiert) und der medianen Nachverfolgungszeit nach Gruppe und insgesamt. Die mediane Nachverfolgungszeit ist eine Schätzung der \"typischen\" Nachverfolgungszeit. Sie wird mit dem umgekehrten Kaplan-Meier-Schätzer berechnet, der wahre Ereignisse als zensierte Beobachtungen und wahre zensierte Beobachtungen als Ereignisse behandelt. Daher ist das \"Ereignis\" in diesem Schätzer \"die Probanden so lange zu verfolgen, wie die Studie es zuließ\".\n            <br/>\n            Die Überlebenskurven werden mit mehreren verschiedenen Methoden verglichen, wobei der Log-Rank und Gehan-Breslow (Wilcoxon) die am häufigsten berichteten sind.\n            Eine Tabelle mit Kaplan-Meier-Überlebens- und Ereignisschätzungen wird zu jeder beobachteten Zeit im Datensatz bereitgestellt, mit 95% Konfidenzintervallen. \n            <br/>\n            <br/>\n            <b>Erforderliche Pakete:</b> survival, broom, survminer, dplyr, arsenal, ggthemes, RColorBrewer, ggsci\n            <br/>\n            <br/>\n            <br/>\n            <b>Stiloptionen</b>\n            <br/>\n            <br/>\n            <b>Diagrammtitel:</b> Titel des Diagramms; löschen Sie allen Text für keinen Titel\n            <br/><br/>\n\t\t\t<b>Größe des Diagrammtitels:</b> Größe des Diagrammtitels.\n\t\t\t<br/><br/>\t\t\t\n            <b>Diagrammthema:</b> Allgemeiner Stil des Diagramms\n            <br/><br/>\n            <b>Anzahl der Gefährdeten:</b> Optional, eine Tabelle für die Anzahl der Probanden, die über die Zeit noch gefährdet sind, am unteren Rand des Diagramms einfügen.  <b>Position der Risikotabelle</b> gibt an, ob Sie die Tabelle außerhalb oder innerhalb der Achsen möchten.  Die <b>Höhe der Risikotabelle</b> steuert den Anteil des Zeichenbereichs, den die Tabelle einnimmt.  Die Option <b>Stratifikationsbezeichnungen einbeziehen</b> steuert, ob die Stratifikationsbezeichnungen einbezogen werden oder nicht. Wenn nicht, werden die Strata nur durch Farbe unterschieden. Die Optionen für die Tabellenposition und die Stratifikationsbezeichnungen werden ignoriert, wenn die Risikotabelle innerhalb der Achsen positioniert ist.\n\t\t\tDie <b>Größe der Risikotabelle-Werte</b> steuert die Größe der Zahlen der Gefährdeten. Die <b>Größe des Titels der Risikotabelle</b> steuert die Größe des Titels für die Risikotabelle.\n\t\t\tDie <b>Größe der Achsenbeschriftungen der Risikotabelle</b> steuert die Größe der Achsenbeschriftungen. \n\t\t\tDie <b>Größe der Tick-Beschriftungen der Risikotabelle</b> steuert die Größe der Tick-Mark-Beschriftungen. Wenn gewünscht, können alle Achsen und Gitterlinien \n\t\t\taus der Risikotabelle entfernt werden, indem die Option <b>Achsen und Gitterlinien aus der Risikotabelle entfernen</b> aktiviert wird. Dies wird nur die Zahlen der Gefährdeten in der Tabelle enthalten.           \n            <br/><br/>\n            <b>Legendenoptionen:</b>\n            <br/>\n            Die <b>Position</b>-Option steuert den Standort der Legende (oben, unten, links, rechts).  Der <b>Titel</b> ist der Titel der Legende.  Um den Titel zu entfernen, löschen Sie allen Text aus dem Textfeld.  <b>Wertbeschriftungen</b> bestimmen die Beschriftungen, mit denen die Strata in der Legende angezeigt werden.  Wichtig: Wenn Sie das Standardverhalten ändern möchten, müssen sie in der Reihenfolge des Erscheinens in der Legende angegeben werden. Das Wechseln der Beschriftungen ändert NICHT die Farbe, die mit jedem Stratum verbunden ist.\n\t\t\tDie <b>Größe der Legendenbeschriftungen</b> steuert die Größe aller Texte in der Legende.\n            <br/>\n            <br/>\n            <b>Linienoptionen:</b>\n            <br/>\n            <b>Größe</b> steuert die Dicke und <b>Farbschema</b> steuert die Farben der gezeichneten Linien. Wählen Sie eine der \"grauen\" Optionen, um ein Graustufenfarbschema zu erhalten. Farbskalen, die wissenschaftlichen Zeitschriften nachempfunden sind, werden ebenfalls bereitgestellt. Man kann optional ein 95%-Konfidenzintervall für die Schätzungen in entweder einem <b>Ribbon</b> (schattierter Bereich) oder <b>Step</b> (Linie) Format einbeziehen.  <b>Transparenz</b> steuert, wie dunkel das Ribbon ist und wird ignoriert, wenn die Step-Option ausgewählt ist.  <b>Zensierte Zeiten</b> (wenn Probanden nicht mehr dem Risiko für das Ereignis ausgesetzt sind) können mit \"+\"-Symbolen auf der Linie angezeigt werden. Die Größe der \"+\"-Symbole kann angepasst werden.  Die Option <b>Medianüberleben anzeigen</b> wird horizontale oder vertikale Linien zu dem Zeitpunkt einfügen, an dem 50% der Probanden geschätzt werden, das Ereignis gehabt zu haben. Die mediane Zeit ist undefiniert, wenn die Überlebenskurve 50% nicht überschreitet.\n            <br/>\n            <br/>\n            <b>P-Wert-Optionen:</b>\n            <br/>\n            Man kann optional den P-Wert, der die Kurven im Diagramm vergleicht, einbeziehen.  Der <b>Typ</b> steuert, welcher P-Wert gewünscht ist, wobei der Log-Rank und Gehan-Breslow (Wilcoxon) die am häufigsten berichteten sind.  Der <b>Standort</b> steuert, wo der P-Wert im Diagramm platziert wird, an der Position (x,y)=(Zeit,Anteil).  Die <b>Größe</b> bestimmt die Größe des gezeichneten P-Werts.\n            <br/>\n            <br/>\n            <br/>      \n            <b>Achsenoptionen</b>\n            <br/>\n            <br/>\n            Die <b>Bezeichnungs</b>-Option gibt den Textbezeichner für die Achse an.  Die <b>Achsenlimits</b> geben die minimalen und maximalen Werte der Achse an.  Die <b>Tick-Mark-Inkremente</b>-Option steuert den Abstand der Tick-Markierungen auf der Achse.  Die Inkremente auf der Zeitachse steuern auch die Zeiten für die optionale Risikotabelle.\n            <br/>\n            Die Überlebensachse <b>Skala</b>-Option gibt an, ob Sie die Schätzungen auf einem Anteil (0-1) oder Prozent (0-100) Maßstab haben möchten.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Achsenbeschriftungen:</b>  Dies steuert die Größe sowohl der Überlebens- als auch der Zeitachsenbeschriftungen.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Tick-Mark-Beschriftungen der Achsen:</b>  Dies steuert die Größe sowohl der Überlebens- als auch der Zeitachsen-Tick-Mark-Beschriftungen.\t\t\t\n      "
  }
}