{
  "title": "Wahrscheinlichkeitsverhältnisse und Plot-Betas",
  "navigation": "Wahrscheinlichkeitsverhältnisse und Plot-Betas",
  "label1": "Wählen Sie ein Modell (Modelle der Klassen Rm, dRm und eRm werden unterstützt)",
  "label1b": "Wenn keine Modelle verfügbar sind, müssen Sie zuerst ein Modell erstellen, indem Sie Modellanpassung -> IRT -> Einfaches Rasch-Modell auswählen und die CML-Schätzung wählen",
  "modelselector1": "Wählen Sie ein Modell",
  "spcr": "Teilungskriterien",
  "destination": "Wählen Sie Variablen aus, um Betas zu plotten",
  "help": {
    "title": "Wahrscheinlichkeitsverhältnisse und Plot-Betas",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>Beschreibung</b></br>\n                Dieser LR-Test basiert auf der Teilung von Subgruppen von Probanden.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \n## S3-Methode für die Klasse 'Rm'\n<br/>\nLRtest(object, splitcr = \"median\", se = TRUE)\n<br/>\n## S3-Methode für die Klasse 'LR'\n<br/>\nplotGOF(x, beta.subset = \"all\", main = \"Grafische Modellprüfung\", xlab, ylab,\n    tlab = \"item\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nobject: Objekt der Klasse \"Rm\".\n</li>\n<li>\nsplitcr: Teilungskriterium für die Teilung der Rohwerte der Probanden. \"all.r\" entspricht einer vollständigen Rohwertteilung, \"median\" verwendet den Median als Teilungskriterium, \"mean\" führt eine Mittelwertteilung durch. Optional kann splitcr auch ein Vektor sein, der jede Person einer bestimmten Untergruppe zuweist (z.B. nach einem externen Kriterium). Dieser Vektor kann numerisch, charakterlich oder ein Faktor sein.\n</li>\n<li>\nse: steuert die Berechnung der Standardfehler in den Untermodellen (Standard: TRUE)\n</li>\n<li>\nx: Objekt der Klasse \"LR\". Wird auch zur Visualisierung der Anpassung einzelner Elemente verwendet.\n</li>\n<li>\nbeta.subset: Wenn \"all\", werden alle Elemente geplottet. Andernfalls kann ein numerischer Teilvektor angegeben werden.\n</li>\n<li>\ntlab: Spezifikation der Elementbezeichnungen: \"item\" druckt die Elementnamen, \"number\" gibt ganze Zahlen entsprechend der Reihenfolge der Beta-Parameter an, wenn \"none\" keine Bezeichnungen gedruckt werden. \"identify\" ermöglicht eine interaktive Beschriftung. Zunächst werden keine Bezeichnungen gedruckt, nach dem Klicken in die Nähe eines Punktes wird die entsprechende Bezeichnung hinzugefügt. Der Identifikationsprozess wird beendet, indem die zweite Schaltfläche angeklickt und 'Stop' aus dem Menü ausgewählt wird, oder aus dem 'Stop'-Menü im Grafikfenster. Für weitere Informationen und grundlegende Operationen siehe identify.\n</li>\n<li>\nconf: zum Plotten von Konfidenzellipsen für die Elementparameter. Wenn conf = NULL (Standard) werden keine Ellipsen gezeichnet. Andernfalls muss conf als Liste mit optionalen Elementen angegeben werden: gamma, ist das Konfidenzniveau (numerisch), col und lty, Farbe und Linienstil (siehe par), welche (numerischer Indexvektor) angeben, für welche Elemente Ellipsen gezeichnet werden (muss eine Teilmenge von beta.subset sein), und ia, logisch, ob die Ellipsen interaktiv gezeichnet werden sollen (vgl. tlab = \"identify\" oben). Für Details zum Standardverhalten, wenn conf als leere Liste angegeben wird, siehe Details und Beispiele unten. Um conf zu verwenden, muss das LR-Objekt x mit der Option se = TRUE in LRtest() generiert werden. Siehe help(MLoef) für weitere Details.\n</li>\n</ul>\n<b>Details</b></br>\nWenn der Datensatz fehlende Werte enthält und der Mittelwert oder Median als Teilungskriterium angegeben ist, werden Mittelwerte oder Mediane für jede fehlende Wertuntergruppe berechnet und entsprechend für die Rohwertteilung verwendet.\n<br/>\nBei der Verwendung der interaktiven Auswahl sowohl für die Beschriftung einzelner Punkte (tlab = \"identify\" und Zeichnen von Konfidenzellipsen an bestimmten Punkten (ia = TRUE) werden zunächst alle geplotteten Punkte beschriftet und anschließend alle Ellipsen generiert. Beide Identifikationsprozesse können beendet werden, indem die zweite (rechte) Maustaste angeklickt und 'Stop' aus dem Menü ausgewählt wird, oder aus dem 'Stop'-Menü im Grafikfenster.\n<br/>\nMit der Spezifikation, die es ermöglicht, Ellipsen nur für bestimmte Elemente zu zeichnen, z.B. welche = 1:3 zeichnet Ellipsen für die Elemente 1 bis 3 (solange sie in beta.subset enthalten sind). Der Standard ist das Zeichnen von Ellipsen für alle Elemente. Das Element col in der conf-Liste kann entweder eine einzelne Farbspezifikation wie \"blau\" oder einen Vektor mit Farbspezifikationen für alle Elemente sein. Die Länge muss der Anzahl der zu zeichnenden Ellipsen entsprechen. Für die Farbspezifikation kann eine Palette mit Standardpaletten (z.B. Regenbogen) oder Paletten aus dem colorspace- oder RColorBrewer-Paket eingerichtet werden. Ein Beispiel ist unten angegeben.\n<br/>\nZusammenfassungs- und Druckmethoden sind für Objekte der Klasse LR verfügbar.\n<br/><br/>\n<b>Wert</b><br/>\nLRtest gibt ein Objekt der Klasse LR zurück, das enthält:\n<br/><br/>\nLR: LR-Wert.\n<br/>\ndf: Freiheitsgrade der Teststatistik.\n<br/>\nChisq: Chi-Quadrat-Wert mit entsprechenden df.\n<br/>\n<br/>\n<b>Paket</b></br>\neRm\n<br/><br/>\n<b>Hilfe</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}