{
  "ProjectTitleStr": "Projekt",
  "Source_variables": "Quellvariablen",
  "Source_Datasets" : "Quell-Datensätze",
  "Source_Datasets_rerun" : "Quell-Datensätze",
  "jsoncomment000" : "=======Formula Builder below this line=======",
  "FBStr0":"Formel-Generator",
  "FBStr1":"Klicken Sie auf eine Schaltfläche unten und ziehen Sie Variablen per Drag & Drop, um einen Ausdruck zu erstellen.",
  "FBStr2":"Ein Klick auf eine ausgewählte Schaltfläche wechselt ihren Status.",
  "FBStr3":"Um an einer bestimmten Stelle einzufügen, platzieren Sie den Cursor an dieser Stelle und ziehen & legen Sie die Variable(n) ab.",
  "FBStr4":"Bewegen Sie die Maus über eine Schaltfläche, um Hilfe zu erhalten.",
  "FBStr5":"Sie können die Schaltfläche 'All N-way' nicht umschalten.",
  "FBttip1" : "Klicken Sie auf die Schaltfläche + und ziehen Sie dann die Variablen, die Sie mit + trennen möchten. Um nur + einzufügen, doppelklicken Sie darauf",
  "FBttip2" : "Klicken Sie auf die Schaltfläche - und ziehen Sie dann die Variablen, die Sie mit - trennen möchten. Um nur - einzufügen, doppelklicken Sie darauf",
  "FBttip3" : "Klicken Sie auf die Schaltfläche * und ziehen Sie dann die Variablen, die Sie mit * trennen möchten. Um nur * einzufügen, doppelklicken Sie darauf",
  "FBttip4" : "Klicken Sie auf die Schaltfläche / und ziehen Sie dann die Variablen, die Sie mit / trennen möchten. Um nur / einzufügen, doppelklicken Sie darauf",
  "FBttip5" : "Klicken Sie auf die Schaltfläche (, um sie einzufügen",
  "FBttip6" : "Klicken Sie auf die Schaltfläche ), um sie einzufügen",
  "FBttip7" : "Klicken Sie auf die Schaltfläche %in%, um %in% einzufügen",
  "FBttip8" : "Klicken Sie auf die Schaltfläche |, um sie einzufügen",
  "FBttip9" : "Klicken Sie auf die Schaltfläche :, und ziehen Sie dann die Variablen, die Sie mit : trennen möchten. Um nur : einzufügen, doppelklicken Sie darauf",
  "FBbtnlbl10a" : "Alle 2 Wege",  
  "FBbtnlbl10b" : "Alle 3 Wege",
  "FBbtnlbl10c" : "Alle 4 Wege",
  "FBbtnlbl10d" : "Alle 5 Wege",
  "FBbtnlbl10e" : "Alle 6 Wege",
  "FBbtnlbl10f" : "Alle 7 Wege",
  "FBbtnlbl10g" : "Alle 8 Wege",
  "FBbtnlbl10h" : "Alle 9 Wege",
  "FBbtnlbl10i" : "Alle 10 Wege",   
  "FBttip10" : "Klicken Sie auf die Option All N-way und ziehen Sie dann die Variablen, um N-way-Interaktionen zu erstellen. Um sie zu deaktivieren, klicken Sie auf eine andere Schaltfläche.",
  "FBbtnlbl11" : "Polynomiale Terme",
  "FBttip11" : "Wählen Sie eine Zahl, klicken Sie auf die Schaltfläche und ziehen Sie die Variablen, um polynomiale Terme vom Grad N hinzuzufügen",
  "FBbtnlbl12" : "df für Splines",
  "FBttip12" : "Geben Sie einen Freiheitsgrad für Splines an",
  "FBbtnlbl13" : "Polynomgrad",
  "FBttip13" : "Geben Sie einen Polynomgrad an",
  "FBbtnlbl14" : "B-Spline",
  "FBttip14" : "Klicken Sie auf B-Spline und ziehen Sie dann eine oder mehrere Variablen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "FBbtnlbl15" : "Natürlicher Spline",
  "FBttip15" : "Klicken Sie auf natürlichen Spline und ziehen Sie dann eine oder mehrere Variablen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "FBbtnlbl16" : "Orthogonales Polynom",
  "FBttip16" : "Klicken Sie auf die Schaltfläche orthogonales Polynom und ziehen Sie dann eine oder mehrere Variablen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "FBbtnlbl17" : "Rohes Polynom",
  "FBttip17" : "Klicken Sie auf die Schaltfläche rohes Polynom und ziehen Sie dann eine oder mehrere Variablen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "jsoncomment001" : "=======Compute Builder below this line=======",
  "CBStr1":"Klicken Sie auf eine Schaltfläche unten und ziehen Sie Variablen per Drag & Drop, um einen Ausdruck zu erstellen.",
  "CBStr2":"Ein Klick auf eine ausgewählte Schaltfläche wechselt ihren Status.",
  "CBStr3":"Um an einer bestimmten Stelle einzufügen, platzieren Sie den Cursor an dieser Stelle und ziehen & legen Sie die Variable(n) ab.",
  "CBStr4":"Bewegen Sie die Maus über eine Schaltfläche, um Hilfe zu erhalten.",
  "CBtabArithmetic":"Arithmetik",
  "CBtabLogical" : "Logisch",
  "CBtabMath": "Mathematik",
  "CBtabString1" : "String(1)",
  "CBtabString2" : "String(2)",
  "CBtabConversion" : "Konversion",
  "CBtabStatistical" : "Statistisch",
  "CBtabRandomNumbers" : "Zufallszahlen",
  "CBtabDate1" : "Datum(1)",
  "CBtabDate2" : "Datum(2)",
  "CBtabDate3" : "Datum(3)",
  "CBtabDate4" : "Datum(4)",
  "CBttip1" : "Klicken Sie auf die Schaltfläche + und ziehen Sie dann die Variablen, die Sie mit + trennen möchten. Um nur + einzufügen, doppelklicken Sie darauf",
  "CBttip2" : "Klicken Sie auf die Schaltfläche - und ziehen Sie dann die Variablen, die Sie mit - trennen möchten. Um nur - einzufügen, doppelklicken Sie darauf",
  "CBttip3" : "Klicken Sie auf die Schaltfläche * und ziehen Sie dann die Variablen, die Sie mit * trennen möchten. Um nur * einzufügen, doppelklicken Sie darauf",
  "CBttip4" : "Klicken Sie auf die Schaltfläche / und ziehen Sie dann die Variablen, die Sie mit / trennen möchten. Um nur / einzufügen, doppelklicken Sie darauf",
  "CBttip5" : "Klicken Sie auf ^ und ziehen Sie Variablen, um sie zu potenzieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl6" : "sqrt",
  "CBttip6" : "Klicken Sie auf SQRT und ziehen Sie Variablen, um eine Quadratwurzel zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl7" : "log",
  "CBttip7" : "Klicken Sie auf LOG und ziehen Sie Variablen, um einen natürlichen Logarithmus zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl8" : "log10",
  "CBttip8" : "Klicken Sie auf LOG10 und ziehen Sie Variablen, um einen Logarithmus zur Basis 10 zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl9" : "log2",
  "CBttip9" : "Klicken Sie auf LOG2 und ziehen Sie Variablen, um einen Logarithmus zur Basis 2 zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl10" : "mod",
  "CBttip10" : "Klicken Sie auf MOD und ziehen Sie Variablen, um die Division durchzuführen und den Rest zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl11" : "abs",
  "CBttip11" : "Klicken Sie auf abs und ziehen Sie Variablen, um den Absolutwert zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl12" : "exp",
  "CBttip12" : "Klicken Sie auf exp und ziehen Sie Variablen, um eine Exponentialfunktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl13" : "",
  "CBttip13" : "Klicken Sie, um das Symbol > einzufügen",
  "CBbtnlbl14" : "",
  "CBttip14" : "Klicken Sie, um das Symbol < einzufügen",
  "CBbtnlbl15" : "",
  "CBttip15" : "Klicken Sie, um das Symbol >= einzufügen",
  "CBbtnlbl16" : "",
  "CBttip16" : "Klicken Sie, um das Symbol <= einzufügen",
  "CBbtnlbl17" : "",
  "CBttip17" : "Klicken Sie, um das Symbol == einzufügen (Test auf Gleichheit)",
  "CBbtnlbl18" : "",
  "CBttip18" : "Klicken Sie, um das Symbol !- (nicht gleich) einzufügen",
  "CBbtnlbl19" : "",
  "CBttip19" : "Klicken Sie, um das Symbol | (logisches oder) einzufügen",
  "CBbtnlbl20" : "",
  "CBttip20" : "Klicken Sie, um das Symbol & (logisches und) einzufügen",
  "CBbtnlbl21" : "%/%",
  "CBttip21" : "Klicken Sie, um das Symbol für Ganzzahldivision (%/%) einzufügen",
  "CBbtnlbl22" : "isTRUE",
  "CBttip22" : "Klicken Sie auf isTRUE, um die Variable auszuwählen und zu verschieben, um nach TRUE-Werten zu prüfen. Gibt TRUE/FALSE zurück, um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl23" : "is.na",
  "CBttip23" : "Klicken Sie auf is.na, um die Variable auszuwählen und zu verschieben, um nach NA-Werten zu prüfen. Gibt TRUE/FALSE zurück, um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl24" : "%in%",
  "CBttip24" : "Klicken Sie auf die %in%-Schaltfläche, um %in% einzufügen",
  "CBbtnlbl25" : "round",
  "CBttip25" : "Klicken Sie auf round und ziehen Sie Variablen, um zu runden. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl26" : "ceiling",
  "CBttip26" : "Klicken Sie auf ceiling und ziehen Sie Variablen, um die obere Grenze zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl27" : "floor",
  "CBttip27" : "Klicken Sie auf floor und ziehen Sie Variablen, um die untere Grenze zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl28" : "signif",
  "CBttip28" : "Klicken Sie auf signif und ziehen Sie Variablen, um auf eine bestimmte Anzahl signifikanter Stellen zu runden. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl29" : "gamma",
  "CBttip29" : "Klicken Sie auf gamma und ziehen Sie Variablen, um eine Gamma-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl30" : "lgamma",
  "CBttip30" : "Klicken Sie auf lgamma und ziehen Sie Variablen, um eine lgamma-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl31" : "beta",
  "CBttip31" : "Klicken Sie auf beta und ziehen Sie Variablen, um eine Beta-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl32" : "lbeta",
  "CBttip32" : "Klicken Sie auf lbeta und ziehen Sie Variablen, um eine lbeta-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl33" : "fakultativ",
  "CBttip33" : "Klicken Sie auf Fakultät und ziehen Sie Variablen, um Fakultäten zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl34" : "pigamma",
  "CBttip34" : "Klicken Sie auf pigamma und ziehen Sie Variablen, um eine pigamma-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl35" : "toupper",
  "CBttip35" : "Klicken Sie auf toupper und ziehen Sie Variablen, um in Großbuchstaben umzuwandeln. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl36" : "tolower",
  "CBttip36" : "Klicken Sie auf tolower und ziehen Sie Variablen, um in Kleinbuchstaben umzuwandeln. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl37" : "Pad",
  "CBttip37" : "Klicken Sie auf Pad und ziehen Sie Variablen, um mit einem Zeichen aufzufüllen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl38" : "Trim",
  "CBttip38" : "Klicken Sie auf Trim und ziehen Sie Variablen, um Leerzeichen von der linken, rechten oder beiden Enden zu entfernen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl39" : "Länge",
  "CBttip39" : "Klicken Sie auf Länge und ziehen Sie Variablen, um die Anzahl der Zeichen im String zurückzugeben. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl40" : "Count(matches)",
  "CBttip40" : "Klicken Sie auf Count(matches) und ziehen Sie Variablen, um Übereinstimmungen eines Musters/Teilstrings zu zählen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl41" : "Substring extrahieren",
  "CBttip41" : "Klicken Sie auf Substring extrahieren und ziehen Sie Variablen, um einen Teilstring zu extrahieren (Start- und Endposition durch Zahlen ersetzen). Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl42" : "Verketten",
  "CBttip42" : "Klicken Sie auf Verketten und ziehen Sie Variablen, um mit einem optionalen Trennzeichen zu verketten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl43" : "Muster ersetzen",
  "CBttip43" : "Klicken Sie auf Muster ersetzen und ziehen Sie Variablen, um ein Muster zu ersetzen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl44" : "Muster ersetzen(ALLE)",
  "CBttip44" : "Klicken Sie auf Muster ersetzen(ALLE) und ziehen Sie Variablen, um alle Muster zu ersetzen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl45" : "Zahl extrahieren",
  "CBttip45" : "Klicken Sie auf 'Zahl extrahieren' und ziehen Sie Variablen, um eine Zahl zu extrahieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl46" : "ToNumeric",
  "CBttip46" : "Klicken Sie auf 'ToNumeric' und ziehen Sie Variablen, um in numerische Werte zu konvertieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl47" : "ToCharacter",
  "CBttip47" : "Klicken Sie auf 'ToCharacter' und ziehen Sie Variablen, um in einen Zeichenwert zu konvertieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl48" : "ToFactor",
  "CBttip48" : "Klicken Sie auf 'ToFactor' und ziehen Sie Variablen, um in einen Faktor zu konvertieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl49" : "ToOrdered",
  "CBttip49" : "Klicken Sie auf 'ToOrdered' und ziehen Sie Variablen, um in einen geordneten Faktor zu konvertieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl50" : "ToLogical",
  "CBttip50" : "Klicken Sie auf 'ToLogical' und ziehen Sie Variablen, um in einen logischen Wert zu konvertieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl51" : "MAX",
  "CBttip51" : "Klicken Sie auf MAX und ziehen Sie Variablen, um den maximalen Wert zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl52" : "MIN",
  "CBttip52" : "Klicken Sie auf MIN und ziehen Sie Variablen, um den minimalen Wert zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl53" : "Mittelwert",
  "CBttip53" : "Klicken Sie auf 'Mittelwert' und ziehen Sie Variablen, um den Mittelwert zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl54" : "Median",
  "CBttip54" : "Klicken Sie auf 'Median' und ziehen Sie Variablen, um den Median zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl55" : "SD",
  "CBttip55" : "Klicken Sie auf SD und ziehen Sie Variablen, um die Standardabweichung zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl56" : "SUMME",
  "CBttip56" : "Klicken Sie auf SUMME und ziehen Sie Variablen, um die Summe zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl57" : "VARIANZ",
  "CBttip57" : "Klicken Sie auf VARIANZ und ziehen Sie Variablen, um die Varianz zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl58" : "runif",
  "CBttip58" : "Doppelklicken Sie auf RUNIF, um Zufallszahlen aus einer gleichmäßigen Verteilung mit min und max zu generieren.",
  "CBbtnlbl59" : "sample",
  "CBttip59" : "Klicken Sie auf SAMPLE und ziehen Sie Variablen, um Zufallsstichproben mit/ohne Ersatz zu erzeugen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl60" : "rnorm",
  "CBttip60" : "Doppelklicken Sie auf rnorm, um Variablen aus einer Normalverteilung mit angegebenem Mittelwert und Standardabweichung zu generieren",
  "CBbtnlbl61" : "Wochentag",
  "CBttip61" : "Klicken Sie auf 'Wochentag' und ziehen Sie eine Datumsvariable, aus der Sie den Wochentag (Montag..) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl62" : "Tag des Monats",
  "CBttip62" : "Klicken Sie auf 'Tag des Monats' und ziehen Sie eine Datumsvariable, aus der Sie den Tag des Monats (1-31) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl63" : "Tag des Jahres",
  "CBttip63" : "Klicken Sie auf 'Tag des Jahres' und ziehen Sie eine Datumsvariable, aus der Sie den Tag des Jahres (001-366) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl64" : "Woche des Jahres",
  "CBttip64" : "Klicken Sie auf 'Woche des Jahres' und ziehen Sie eine Datumsvariable, aus der Sie die Woche des Jahres (00-53) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl65" : "Monat",
  "CBttip65" : "Klicken Sie auf 'Monat' und ziehen Sie eine Datumsvariable, aus der Sie den Monat (Januar..) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl66" : "Monat (dezimal)",
  "CBttip66" : "Klicken Sie auf 'Monat (dezimal)' und ziehen Sie eine Datumsvariable, aus der Sie den Monat (01-12) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl67" : "Quartale",
  "CBttip67" : "Klicken Sie auf 'Quartale' und ziehen Sie eine Datumsvariable, aus der Sie die Quartale (Q1, Q2..) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl68" : "Jahr (XXXX)",
  "CBttip68" : "Klicken Sie auf 'Jahr (XXXX)' und ziehen Sie eine Datumsvariable, aus der Sie das Jahr (1980) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl69" : "Jahr (XX)",
  "CBttip69" : "Klicken Sie auf 'Jahr (XX)' und ziehen Sie eine Datumsvariable, aus der Sie das Jahr (80) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl70" : "Stunde (00-12)",
  "CBttip70" : "Klicken Sie auf 'Stunde (00-12)' und ziehen Sie eine Datumsvariable, aus der Sie die Stunde (00) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl71" : "Stunde (00-23)",
  "CBttip71" : "Klicken Sie auf 'Stunde (00-23)' und ziehen Sie eine Datumsvariable, aus der Sie die Stunde extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl72" : "Minuten",
  "CBttip72" : "Klicken Sie auf 'Minuten' und ziehen Sie eine Datumsvariable, aus der Sie die Minuten extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl73" : "Sekunden",
  "CBttip73" : "Klicken Sie auf 'Sekunden' und ziehen Sie eine Datumsvariable, aus der Sie die Sekunden extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl74" : "Datum aus String",
  "CBttip74" : "Klicken Sie auf 'Datum aus String' und ziehen Sie eine Zeichenfolgenvariable, die Sie in ein Datum konvertieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl75" : "Datumsdifferenz",
  "CBttip75" : "Klicken Sie auf 'Datumsdifferenz' und ziehen Sie eine Datumsvariable, die Sie von einer anderen Datumsvariable subtrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl76" : "Numeric zu Datum",
  "CBttip76" : "Klicken Sie auf 'Numeric zu Datum' und ziehen Sie eine numerische Variable, die Sie in ein Datum konvertieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "CBbtnlbl77" : "String zu Datum",
  "CBttip77" : "Klicken Sie auf 'String zu Datum' und ziehen Sie eine Zeichenfolgenvariable, die Sie in ein Datum konvertieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "jsoncomment002" : "=======switchCase below this line=======",
  "SCStr0": "Mehrfachbedingungs-Builder",
  "SCStr1": "Klicken Sie auf einen Button und ziehen Sie Variablen per Drag & Drop, um einen Ausdruck zu erstellen.",
  "SCStr2": "Ein Klick auf einen ausgewählten Button wechselt seinen Zustand.",
  "SCStr3": "Um an einer bestimmten Position einzufügen, ziehen Sie direkt dorthin.",
  "SCStr4": "Fahren Sie mit der Maus über einen Button, um Hilfe zu erhalten.",
  "SCifthenbtn": "WENN DANN",
  "SCelsebtn": "SONST",
  "SCIFlbl" : "WENN",
  "SCTHENlbl": "DANN",
  "SCELSElbl": "SONST",
  "SCtabArithmetic": "Arithmetik",
  "SCtabLogical" : "Logisch",
  "SCtabMath": "Mathematik",
  "SCtabString1" : "Zeichenfolge(1)",
  "SCtabString2" : "Zeichenfolge(2)",
  "SCtabConversion" : "Konvertierung1",
  "SCtabStatistical" : "Statistisch",
  "SCtabRandomNumbers" : "Zufallszahlen",
  "SCtabDate1" : "Datum(1)",
  "SCtabDate2" : "Datum(2)",
  "SCtabDate3" : "Datum(3)",
  "SCtabDate4" : "Datum(4)",
  "SCttip1" : "Klicken Sie auf das + Symbol und ziehen Sie die Variablen, die Sie mit + trennen möchten. Um nur + einzufügen, doppelklicken Sie darauf",
  "SCttip2" : "Klicken Sie auf das - Symbol und ziehen Sie die Variablen, die Sie mit - trennen möchten. Um nur - einzufügen, doppelklicken Sie darauf",
  "SCttip3" : "Klicken Sie auf das * Symbol und ziehen Sie die Variablen, die Sie mit * trennen möchten. Um nur * einzufügen, doppelklicken Sie darauf",
  "SCttip4" : "Klicken Sie auf das / Symbol und ziehen Sie die Variablen, die Sie mit / trennen möchten. Um nur / einzufügen, doppelklicken Sie darauf",
  "SCttip5" : "Klicken Sie auf ^ und ziehen Sie Variablen, um zu exponentieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl6" : "sqrt",
  "SCttip6" : "Klicken Sie auf SQRT und ziehen Sie Variablen, um eine Quadratwurzel zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl7" : "log",
  "SCttip7" : "Klicken Sie auf LOG und ziehen Sie Variablen, um einen natürlichen Logarithmus zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl8" : "log10",
  "SCttip8" : "Klicken Sie auf LOG10 und ziehen Sie Variablen, um einen Logarithmus zur Basis 10 zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl9" : "log2",
  "SCttip9" : "Klicken Sie auf LOG2 und ziehen Sie Variablen, um einen Logarithmus zur Basis 2 zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl10" : "mod",
  "SCttip10" : "Klicken Sie auf MOD und ziehen Sie Variablen, um zu dividieren und den Rest zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl11" : "abs",
  "SCttip11" : "Klicken Sie auf abs und ziehen Sie Variablen, um den absoluten Wert zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl12" : "exp",
  "SCttip12" : "Klicken Sie auf exp und ziehen Sie Variablen, um eine Exponentialfunktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl13" : "",
  "SCttip13" : "Klicken Sie, um das >-Symbol einzufügen",
  "SCbtnlbl14" : "",
  "SCttip14" : "Klicken Sie, um das <-Symbol einzufügen",
  "SCbtnlbl15" : "",
  "SCttip15" : "Klicken Sie, um das >=-Symbol einzufügen",
  "SCbtnlbl16" : "",
  "SCttip16" : "Klicken Sie, um das <=-Symbol einzufügen",
  "SCbtnlbl17" : "",
  "SCttip17" : "Klicken Sie, um das ==-Symbol (Gleichheitsprüfung) einzufügen",
  "SCbtnlbl18" : "",
  "SCttip18" : "Klicken Sie, um das !=-Symbol (ungleich) einzufügen",
  "SCbtnlbl19" : "",
  "SCttip19" : "Klicken Sie, um das |-Symbol (logisches Oder) einzufügen",
  "SCbtnlbl20" : "",
  "SCttip20" : "Klicken Sie, um das &-Symbol (logisches Und) einzufügen",
  "SCbtnlbl21" : "%/%",
  "SCttip21" : "Klicken Sie, um das Symbol für Ganzzahldivision (%/%) einzufügen",
  "SCbtnlbl22" : "isTRUE",
  "SCttip22" : "Klicken Sie auf isTRUE, um die Variable auszuwählen und zu verschieben, um auf TRUE-Werte zu prüfen. Gibt TRUE/FALSE zurück. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl23" : "is.na",
  "SCttip23" : "Klicken Sie auf is.na, um die Variable auszuwählen und zu verschieben, um auf NA-Werte zu prüfen. Gibt TRUE/FALSE zurück. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl24" : "%in%",
  "SCttip24" : "Klicken Sie auf %in%, um es einzufügen. %in% wird verwendet, um zu prüfen, ob eine Variable Werte enthält, z.B. var1 %in% c(1,2)",
  "SCbtnlbl25" : "round",
  "SCttip25" : "Klicken Sie auf round und ziehen Sie Variablen, um zu runden. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl26" : "ceiling",
  "SCttip26" : "Klicken Sie auf ceiling und ziehen Sie Variablen, um die obere Grenze zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl27" : "floor",
  "SCttip27" : "Klicken Sie auf floor und ziehen Sie Variablen, um die untere Grenze zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl28" : "signif",
  "SCttip28" : "Klicken Sie auf signif und ziehen Sie Variablen, um auf eine angegebene Anzahl signifikanter Stellen zu runden. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl29" : "gamma",
  "SCttip29" : "Klicken Sie auf gamma und ziehen Sie Variablen, um eine Gamma-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl30" : "lgamma",
  "SCttip30" : "Klicken Sie auf lgamma und ziehen Sie Variablen, um eine lgamma-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl31" : "beta",
  "SCttip31" : "Klicken Sie auf beta und ziehen Sie Variablen, um eine Beta-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl32" : "lbeta",
  "SCttip32" : "Klicken Sie auf lbeta und ziehen Sie Variablen, um eine lbeta-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl33" : "fakultät",
  "SCttip33" : "Klicken Sie auf factorial und ziehen Sie Variablen, um Fakultäten zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl34" : "pigamma",
  "SCttip34" : "Klicken Sie auf pigamma und ziehen Sie Variablen, um eine pigamma-Funktion zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl35" : "toupper",
  "SCttip35" : "Klicken Sie auf toupper und ziehen Sie Variablen, um in Großbuchstaben zu konvertieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl36" : "tolower",
  "SCttip36" : "Klicken Sie auf tolower und ziehen Sie Variablen, um in Kleinbuchstaben zu konvertieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl37" : "Pad",
  "SCttip37" : "Klicken Sie auf Pad und ziehen Sie Variablen, um mit einem Zeichen aufzufüllen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl38" : "Trim",
  "SCttip38" : "Klicken Sie auf Trim und ziehen Sie Variablen, um Leerzeichen von der linken, rechten oder beiden Enden zu entfernen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl39" : "Länge",
  "SCttip39" : "Klicken Sie auf Length und ziehen Sie Variablen, um die Anzahl der Zeichen im String zurückzugeben. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl40" : "Count(matches)",
  "SCttip40" : "Klicken Sie auf Count(matches) und ziehen Sie Variablen, um Übereinstimmungen eines Musters/Teilstrings zu zählen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl41" : "Substring extrahieren",
  "SCttip41" : "Klicken Sie auf Extract Substring und ziehen Sie Variablen, um einen Teilstring zu extrahieren (Start- und Endposition durch Ganzzahlen ersetzen). Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl42" : "Verketten",
  "SCttip42" : "Klicken Sie auf Concatenate und ziehen Sie Variablen, um mit einem optionalen Trennzeichen zu verketten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl43" : "Muster ersetzen",
  "SCttip43" : "Klicken Sie auf Replace Pattern und ziehen Sie Variablen, um ein Muster zu ersetzen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl44" : "Muster ersetzen(ALLE)",
  "SCttip44" : "Klicken Sie auf Replace Pattern(ALL) und ziehen Sie Variablen, um alle Muster zu ersetzen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl45" : "Zahl extrahieren",
  "SCttip45" : "Klicken Sie auf Extract a Number und ziehen Sie Variablen, um eine Zahl zu extrahieren. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl46" : "ToNumeric",
  "SCttip46" : "Klicken Sie auf ToNumeric und ziehen Sie Variablen, um in numerische Werte umzuwandeln. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl47" : "ToCharacter",
  "SCttip47" : "Klicken Sie auf ToCharacter und ziehen Sie Variablen, um in einen Zeichenwert umzuwandeln. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl48" : "ToFactor",
  "SCttip48" : "Klicken Sie auf ToFactor und ziehen Sie Variablen, um in einen Faktor umzuwandeln. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl49" : "ToOrdered",
  "SCttip49" : "Klicken Sie auf ToOrdered und ziehen Sie Variablen, um in einen geordneten Faktor umzuwandeln. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl50" : "ToLogical",
  "SCttip50" : "Klicken Sie auf ToLogical und ziehen Sie Variablen, um in einen logischen Wert umzuwandeln. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl51" : "MAX",
  "SCttip51" : "Klicken Sie auf MAX und ziehen Sie Variablen, um den maximalen Wert zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl52" : "MIN",
  "SCttip52" : "Klicken Sie auf MIN und ziehen Sie Variablen, um den minimalen Wert zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl53" : "MITTELWERT",
  "SCttip53" : "Klicken Sie auf MEAN und ziehen Sie Variablen, um den Mittelwert zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl54" : "MEDIAN",
  "SCttip54" : "Klicken Sie auf MEDIAN und ziehen Sie Variablen, um den Median zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl55" : "SD",
  "SCttip55" : "Klicken Sie auf SD und ziehen Sie Variablen, um die Standardabweichung zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl56" : "SUMME",
  "SCttip56" : "Klicken Sie auf SUM und ziehen Sie Variablen, um die Summe zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl57" : "VARIANZ",
  "SCttip57" : "Klicken Sie auf VARIANCE und ziehen Sie Variablen, um die Varianz zu berechnen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl58" : "runif",
  "SCttip58" : "Doppelklicken Sie auf RUNIF, und es werden Zufallszahlen aus einer gleichmäßigen Verteilung mit Min und Max generiert",
  "SCbtnlbl59" : "sample",
  "SCttip59" : "Klicken Sie auf SAMPLE und ziehen Sie Variablen, um zufällige Stichproben mit/ohne Ersetzung zu erzeugen. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl60" : "rnorm",
  "SCttip60" : "Doppelklicken Sie auf rnorm, um Variablen aus einer Normalverteilung mit einem angegebenen Mittelwert und einer Standardabweichung zu generieren",
  "SCbtnlbl61" : "Wochentag",
  "SCttip61" : "Klicken Sie auf Day of Week und ziehen Sie eine Datumsvariable, aus der Sie den Wochentag (Montag..) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl62" : "Tag des Monats",
  "SCttip62" : "Klicken Sie auf Day of Month und ziehen Sie eine Datumsvariable, aus der Sie den Tag des Monats (1-31) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl63" : "Tag des Jahres",
  "SCttip63" : "Klicken Sie auf Day of Year und ziehen Sie eine Datumsvariable, aus der Sie den Tag des Jahres (001-366) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl64" : "Woche des Jahres",
  "SCttip64" : "Klicken Sie auf Week of Year und ziehen Sie eine Datumsvariable, aus der Sie die Woche des Jahres (00-53) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl65" : "Monat",
  "SCttip65" : "Klicken Sie auf Month und ziehen Sie eine Datumsvariable, aus der Sie den Monat (Januar..) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl66" : "Monat(Dezimal)",
  "SCttip66" : "Klicken Sie auf Month(decimal) und ziehen Sie eine Datumsvariable, aus der Sie den Monat (01-12) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl67" : "Quartale",
  "SCttip67" : "Klicken Sie auf Quarters und ziehen Sie eine Datumsvariable, aus der Sie die Quartale (Q1, Q2..) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl68" : "Jahr(XXXX)",
  "SCttip68" : "Klicken Sie auf Year(XXXX) und ziehen Sie eine Datumsvariable, aus der Sie das Jahr (1980) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl69" : "Year(XX)",
  "SCttip69" : "Klicken Sie auf Year(XX) und ziehen Sie eine Datumsvariable, aus der Sie das Jahr (80) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl70" : "Stunde(00-12)",
  "SCttip70" : "Klicken Sie auf Hour(00-12) und ziehen Sie eine Datumsvariable, aus der Sie die Stunde (00) extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl71" : "Stunde(00-23)",
  "SCttip71" : "Klicken Sie auf Hour(00-23) und ziehen Sie eine Datumsvariable, aus der Sie die Stunde extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl72" : "Minuten",
  "SCttip72" : "Klicken Sie auf Minutes und ziehen Sie eine Datumsvariable, aus der Sie die Minuten extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl73" : "Sekunden",
  "SCttip73" : "Klicken Sie auf Secs und ziehen Sie eine Datumsvariable, aus der Sie die Sekunden extrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl74" : "Datum aus Zeichenfolge",
  "SCttip74" : "Klicken Sie auf Date from String und ziehen Sie eine Zeichenfolgenvariable, die Sie in ein Datum umwandeln möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl75" : "Datumsdifferenz",
  "SCttip75" : "Klicken Sie auf Date Difference und ziehen Sie eine Datumsvariable, die Sie von einer anderen Datumsvariable subtrahieren möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl76" : "Numeric zu Datum",
  "SCttip76" : "Klicken Sie auf Numeric to date und ziehen Sie eine numerische Variable, die Sie in ein Datum umwandeln möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "SCbtnlbl77" : "Zeichenfolge zu Datum",
  "SCttip77" : "Klicken Sie auf String to date und ziehen Sie eine Zeichenfolgenvariable, die Sie in ein Datum umwandeln möchten. Um generischen Code einzufügen, doppelklicken Sie darauf",
  "jsoncomment003" : "=======Rep Measures CTRL below this line=======",
  "RMstr0" : "Klicken Sie, um die Konfiguration für den Within-Subject-Faktor und die Messung anzuzeigen/zu verbergen",
  "RMstr0a" : "Hinweis",
  "RMstr1" : "1. Die Anwendung muss die Daten umformen, wenn eine wiederholte Messung ANOVA auf einem breiten Datensatz ausgeführt wird",
  "RMstr2" : "2. Wir unterstützen mehrere wiederholte Messungen für eine einzelne Variable, z. B. Blutzucker, der beim Pretest, Posttest und bei einem Follow-up-Besuch gemessen wird",
  "RMstr3" : "3. Damit die Anwendung die Daten umformen kann, müssen Sie einen wiederholten Faktorname angeben, z. B. Blutzucker, und die Anzahl der Ebenen. Wir erstellen eine Faktorvariable, z. B. genannt Blutzucker, mit Ebenen, die aus den Namen der Variablen bestehen, die die wiederholten Messungen enthalten, z. B. die Ebenen des Faktors sind Pretest, Posttest und Follow-up",
  "RMstr4" : "4. Sie müssen einen Messnamen angeben, z. B. Wert. Wir erstellen eine Variable, z. B. Wert, mit allen Blutzuckerwerten, die dem Pretest, Posttest und Follow-up für jedes Subjekt entsprechen.",
  "RMstr5" : "5. Wir unterstützen eine einzelne Between-Subject- und Within-Subject-Faktorvariable.",
  "RMstr6" : "6. Zukünftige Versionen werden mehrere Messungen sowie mehrere Between-Subject- und Within-Subject-Faktorvariablen unterstützen.",
  "RMlbl1" : "Name des Within-Subject-Faktors",
  "RMlbl2" : "Anzahl der Ebenen",
  "RMaddbtn" : "Hinzufügen",
  "RMlbl3" : "Neue Within-Subject-Faktorvariable",
  "RMdelbtn" : "Löschen",
  "RMlbl4" : "Messname",
  "RMlbl5" : "Neue Messvariable",
  "RMdefinebtn" : "Definieren",
  "RMmsgboxTitle1" : "Unrichtige Ebenen für den Faktor",
  "RMmsgboxMsg1" : "Sie müssen einen Faktor mit mehr als einer Ebene angeben.",
  "RMmsgboxTitle2" : "Mehr als 1 Within-Subject-Faktor angegeben",
  "RMmsgboxMsg2" : "Derzeit unterstützen wir einen einzelnen Within-Subject-Faktor. In einer zukünftigen Version werden mehrere Within-Subject-Faktorvariablen unterstützt.",
  "RMmsgboxTitle3" : "Mehr als 1 Messung angegeben",
  "RMmsgboxMsg3" : "Derzeit unterstützen wir eine einzelne Messung. In einer zukünftigen Version werden mehrere Messungen unterstützt.",
  "RMmsgboxTitle4" : "Messvariable nicht angegeben",
  "RMmsgboxMsg4" : "Der Name der Messvariable ist nicht angegeben. Sie müssen einen Messnamen angeben und auf Hinzufügen klicken.",
  "RMmsgboxTitle5" : "Within-Subject-Faktorvariable nicht angegeben",
  "RMmsgboxMsg5" : "Sie müssen auf die Schaltfläche Definieren klicken, nachdem Sie einen Namen für die wiederholte Faktorvariable und den Messnamen eingegeben haben.",
  "jsoncomment004" : "=======SelectDataset below this line=======",
  "SelDSsrclbl1" : "Variablen aus dem ",
  "SelDSsrclbl2" : "aktiven (links) ",
  "SelDSsrclbl3" : "ausgewählten (rechts)",
  "SelDSsrclbl4" : " Datensatz",
  "SelDSsrclbl5" : "Wählen Sie einen Datensatz zum Verbinden aus ",
  "SelDSsrclbl6" : " mit",
  "jsoncomment005" : "=======mergejoin below this line=======",
  "MJlbl1" : "Wählen Sie eine Variable aus dem aktiven Datensatz und eine Variable im ausgewählten Datensatz aus und klicken Sie auf Hinzufügen",
  "MJbtn1" : "Hinzufügen",
  "MJbtn2" : "Löschen",
  "jsoncomment006" : "=======options below this line=======",
  "OptVarDefaultLbl" : "Optionen",
  "jsoncomment007" : "=======Choose file/folder below this line=======",
  "fileOpenLbl" : "Wählen",
  "fileSaveLbl" : "Geben Sie an oder wählen Sie ein",
  "jsoncomment008" : "=======wrap-control below this line=======",
  "wrapCtrllabel1":"Anzeigen von Zählungen im aggregierten Datensatz",
  "wrapCtrllabel2":"Optional Namen für Zählungen und aggregierte Variablen eingeben, getrennt durch Komma (,)",  
  "colpickerttip1" : "Klicken, um eine Farbe auszuwählen",
  "jsoncomment0010" : "=======Top level menus and sub-menu dropdown below this line=======",
  "agreement_top_level_title": "Vereinbarung",
  "agreement_Method": "Methode",
  "agreement_Scale": "Skala",
  "analysis_top_level_title": "Analyse",
  "analysis_Association_Rules": "Assoziationsregeln",
  "analysis_Cluster": "Cluster",
  "analysis_Correlations": "Korrelationen",
  "analysis_Crosstab": "Kreuztabelle",
  "analysis_Distribution_Analysis": "Verteilungsanalyse",
  "analysis_Factor_Analysis": "Faktorenanalyse",
  "analysis_Means": "Mittelwerte",
  "analysis_Missing_Values": "Fehlende Werte",
  "analysis_Moments": "Momente",
  "analysis_Non_Parametric": "Nicht-parametrisch",
  "analysis_Proportions": "Anteile",
  "analysis_Summary": "Zusammenfassung",
  "analysis_Survival": "Überlebensanalyse",
  "analysis_Tables": "Tabellen",
  "analysis_Variance": "Varianz",
  "contribution_Sample_Size_Menu": "Stichprobengröße",
  "contribution_Precision": "Präzision",
  "contribution_Tests": "Tests",
  "contribution_Datasets_Menu": "Datensätze",
  "contribution_Subset": "Teilmenge",
  "contribution_Analysis_Menu": "Analyse",
  "contribution_Survival": "Überleben",
  "contribution_Tables": "Tabellen",
  "contribution_Variables_Menu": "Variablen",
  "contribution_Compute": "Berechnen",
  "contribution_Factor_Levels": "Faktorstufen",
  "contribution_Model_Fitting_Menu": "Modellanpassung",
  "contribution_Regression": "Regression",
  "contribution_Model_Evaluation_Menu": "Modellbewertung",
  "datasets_top_level_title": "Datensätze",
  "datasets_group_by": "Gruppieren nach",
  "datasets_Matching": "Abgleichen",
  "datasets_Merge": "Zusammenführen",
  "datasets_ReShape": "Umformen",
  "datasets_Sampling": "Stichprobe",
  "datasets_Sort": "Sortieren",
  "datasets_Subset": "Teilmenge",
  "datasets_Transpose": "Transponieren",
  "datasetspro_Datasets_Menu": "Datensätze",
  "distribution_top_level_title": "Verteilung",
  "distribution_Beta": "Beta",
  "distribution_Binomial": "Binomial",
  "distribution_Cauchy": "Cauchy",
  "distribution_Chi_squared": "Chi-Quadrat",
  "distribution_Exponential": "Exponentiell",
  "distribution_F": "F",
  "distribution_Gamma": "Gamma",
  "distribution_Geometric": "Geometrisch",
  "distribution_Gumbel": "Gumbel",
  "distribution_Hypergeometric": "Hypergeometrisch",
  "distribution_Logistic": "Logistisch",
  "distribution_Lognormal": "Lognormal",
  "distribution_Negative_Binomial": "Negative Binomialverteilung",
  "distribution_Normal": "Normal",
  "distribution_Poisson": "Poisson",
  "distribution_t": "t",
  "distribution_Uniform": "Gleichmäßig",
  "distribution_Weibull": "Weibull",
  "doe_top_level_title": "Versuchsplanung",
  "doe_Create_DoE_Factor_Table": "DoE-Faktortabelle erstellen",
  "doe_Create_Design": "Design erstellen",
  "doe_Inspect_Design": "Design überprüfen",
  "doe_Modify_Design": "Design ändern",
  "doe_Analyze_Design": "Design analysieren",
  "file_top_level_title": "Datei",
  "forecasting_top_level_title": "Prognose",
  "graphics_top_level_title": "Grafiken",
  "graphics_Distribution": "Verteilung",
  "graphics_Line_Charts": "Liniendiagramme",
  "graphics_Maps": "Karten",
  "graphics_Pie_Charts": "Kreisdiagramme",
  "graphics_Scatter_Plot": "Streudiagramm",
  "graphicspro_Graphics_Menu": "Grafiken",
  "graphicspro_Distribution": "Verteilung",
  "graphicspro_Scatter_Plot": "Streudiagramm",
  "modelevaluation_top_level_title": "Modellbewertung",
  "modelevaluation_Compare": "Vergleichen",
  "modelevaluation_Fit": "Anpassen",
  "modelevaluation_IRT": "IRT",
  "modelevaluation_Predict": "Vorhersagen",
  "modelevaluation_Summarize": "Zusammenfassen",
  "modelfitting_top_level_title": "Modellanpassung",
  "modelfitting_Contrasts": "Kontraste",
  "modelfitting_IRT": "IRT",
  "modelfitting_KNN": "KNN",
  "modelfitting_Regression": "Regression",
  "modelfitting_Neural_Nets": "Neuronale Netze",
  "modelfitting_Trees": "Bäume",
  "modelfitting_File": "Datei",
  "modelfitting_File_Model" : "Modell",
  "modelfitting_Nonlinear_Regression": "Nichtlineare Regression",
  "modelfittingpro_Model_Fitting_Menu": "Modellanpassung",
  "modeltuning_top_level_title": "Modellabstimmung",
  "outputpro_File_Menu": "Datei",
  "professional_Datasets_Menu": "Datensätze",
  "professional_Matching": "Abgleichen",
  "professional_Merge": "Zusammenführen",
  "professional_Sort": "Sortieren",
  "professional_Subset": "Teilmenge",
  "professional_Survival": "Überleben",
  "professional_Analysis_Menu": "Analyse",
  "professional_Crosstab": "Kreuztabelle",
  "professional_Summary": "Zusammenfassung",
  "professional_Variables_Menu": "Variablen",
  "professional_Missing_Values": "Fehlende Werte",
  "professional_Model_Fitting_Menu": "Modellanpassung",
  "professional_Regression": "Regression",
  "professional_Model_Evaluation_Menu": "Modellbewertung",
  "professional_Agreement_Menu": "Vereinbarung",
  "professional_Method": "Methode",
  "projectspace_File_Menu": "Datei",
  "projectspace_Open_Project" : "Projekt Öffnen",
  "projectspace_Save_Project" : "Projekt Speichern",
  "projectspace_SaveAs_Project" : "Projekt Speichern Unter",
  "sixsigma_top_level_title": "Six Sigma",
  "sixsigma_Pareto_Chart": "Pareto-Diagramm",
  "sixsigma_MSA": "MSA",
  "sixsigma_Process_Capability": "Prozessfähigkeit",
  "sixsigma_Shewhart_Charts": "Shewhart-Diagramme",
  "sixsigmapro_Analysis_Menu": "Analyse",
  "sixsigmapro_Distribution_Analysis": "Verteilungsanalyse",
  "sixsigmapro_Means": "Mittelwerte",
  "sixsigmapro_Summary": "Zusammenfassung",
  "sixsigmapro_Distribution_Menu": "Verteilung",
  "sixsigmapro_Normal": "Normal",
  "sixsigmapro_Six_Sigma_Menu": "Six Sigma",
  "sixsigmapro_Pareto_Chart": "Pareto-Diagramm",
  "sixsigmapro_MSA": "MSA",
  "sixsigmapro_Process_Capability": "Prozessfähigkeit",
  "sixsigmapro_Shewhart_Charts": "Shewhart-Diagramme",
  "utility_File_Menu": "Datei",
  "utilitypro_File_Menu": "Datei",
  "variables_top_level_title": "Variablen",
  "variables_Box_Cox": "Box-Cox",
  "variables_Compute": "Berechnen",
  "variables_Convert": "Umwandeln",
  "variables_Factor_Levels": "Faktorstufen",
  "variables_Missing_Values": "Fehlende Werte"
}
