{
  "title": "Datensätze zusammenführen",
  "join": "Join-Zuordnung",
  "navigation": "Zusammenführen",
  "description": "Das Zusammenführen von Datensätzen hilft Ihnen, 2 Datensätze zusammenzuführen. Standardmäßig sucht dieser Dialog nach gemeinsamen Variablennamen in den 2 Datensätzen und führt sie auf der Grundlage des vollständigen Satzes gemeinsamer Variablen zusammen.",
  "out": "Geben Sie den Namen des zusammengeführten Datensatzes ein",
  "in1": "Wählen Sie den 1. Datensatz aus",
  "in2": "Wählen Sie den 2. Datensatz aus",
  "label1": "Zusammenführungsoptionen",
  "leftjoin": "Linker Join (Nur Zeilen im ersten (linken) Datensatz beibehalten)",
  "rightjoin": "Rechter Join (Nur Zeilen im zweiten (rechten) Datensatz beibehalten)",
  "innerjoin": "Innerer Join (Zeilen beibehalten, die in beiden Datensätzen gemeinsam sind)",
  "fulljoin": "Vollständiger Join (Alle Zeilen in beiden Datensätzen beibehalten)",
  "semijoin": "Semi-Join (Alle Zeilen im ersten (linken) Datensatz mit einer Übereinstimmung im zweiten (rechten) Datensatz beibehalten)",
  "antijoin": "Anti-Join (Alle Zeilen im ersten (linken) Datensatz ohne Übereinstimmung im zweiten (rechten) Datensatz beibehalten)",
  "label2": "Überschreiben Sie die Zusammenführung, die auf allen gemeinsamen Spaltennamen durchgeführt wird",
  "by": "Um die Standardeinstellung der Zusammenführung, die auf allen gemeinsamen Spaltennamen durchgeführt wird, zu überschreiben, geben Sie eine Teilmenge der gemeinsamen Spaltennamen unten durch Kommas getrennt ein. Zum Beispiel: land,region. Die Zusammenführung wird nur auf den eingegebenen gemeinsamen Spaltennamen durchgeführt. Formatieren Sie diese Liste als durch Kommas getrennte Werte, z.B. A,B,C.",
  "label3": "Wenn die Spaltennamen, auf denen die Zusammenführung erfolgt, in jedem Datensatz unterschiedlich sind",
  "byDiffNames": "Geben Sie die übereinstimmenden Spaltennamen durch Kommas getrennt ein, z.B. 'C'='D', 'B'='A'. Bitte verwenden Sie hier einfache Anführungszeichen ( ' ).",
  "label4": "Wenn es gemeinsame Spaltennamen in beiden Datensätzen gibt",
  "suffix": "Standardmäßig werden .x und .y als Suffixe für gemeinsame Variablen verwendet. Wenn Sie diese ändern möchten, geben Sie sie hier durch Kommas getrennt ein, z.B. 1,2. Beachten Sie, dass jedes . durch ein _ im Ausgabedatensatz ersetzt wird.",
  "advOptions": "Erweiterte Optionen",
  "help": {
    "title": "Datensätze zusammenführen",
    "r_help": "hilfe(join, paket=dplyr)",
    "body": "\n            <b>Beschreibung</b></br>\n            Das Zusammenführen von Datensätzen hilft Ihnen, 2 Datensätze zusammenzuführen.<br/>Sie müssen eine oder mehrere Variablen im aktiven Datensatz und im ausgewählten Ziel-Datensatz angeben, auf denen die Zusammenführung durchgeführt werden soll.<br/>\n            Die Ergebnisse werden in einem neuen Datensatz gespeichert.<br/>\n            inner_join: gibt alle Zeilen von x zurück, bei denen es übereinstimmende Werte in y gibt, und alle Spalten von x und y. Wenn es mehrere Übereinstimmungen zwischen x und y gibt, werden alle Kombinationen der Übereinstimmungen zurückgegeben.</br>\n            left_join: gibt alle Zeilen von x zurück und alle Spalten von x und y. Zeilen in x ohne Übereinstimmung in y haben NA-Werte in den neuen Spalten. Wenn es mehrere Übereinstimmungen zwischen x und y gibt, werden alle Kombinationen der Übereinstimmungen zurückgegeben.</br>\n            right_join: gibt alle Zeilen von y zurück und alle Spalten von x und y. Zeilen in y ohne Übereinstimmung in x haben NA-Werte in den neuen Spalten. Wenn es mehrere Übereinstimmungen zwischen x und y gibt, werden alle Kombinationen der Übereinstimmungen zurückgegeben.</br>\n            full_join: gibt alle Zeilen und alle Spalten aus sowohl x als auch y zurück. Wo es keine übereinstimmenden Werte gibt, wird NA für das fehlende zurückgegeben.</br>\n            semi_join: Behalten Sie alle Zeilen im ersten Datensatz mit einer Übereinstimmung im zweiten Datensatz</br>\n            anti_join: Behalten Sie alle Zeilen im ersten Datensatz ohne Übereinstimmung im zweiten Datensatz)</br>\n            <b>Verwendung</b>\n            <br/>\n            <code> \n            left_join(x, y, by = c(NULL), suffix = c(\".x\", \".y\"), ...)\n            right_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            inner_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            full_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            semi_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            anti_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            </code> <br/>\n            <b>Argumente</b><br/>\n            <ul>\n            <li>\n            x: Datensatz zum Zusammenführen\n            </li>\n            <li>\n            y: Datensatz zum Zusammenführen\n            </li>\n            <li>\n            by: ein Zeichenvektor von Variablen, nach denen zusammengeführt werden soll. Wenn NULL, die Standardeinstellung, führt *_join() einen natürlichen Join durch, wobei alle Variablen mit gemeinsamen Namen über die beiden Tabellen verwendet werden. Eine Nachricht listet die Variablen auf, damit Sie überprüfen können, ob sie korrekt sind (um die Nachricht zu unterdrücken, listen Sie einfach explizit die Variablen auf, die Sie zusammenführen möchten). Um nach unterschiedlichen Variablen in x und y zu verbinden, verwenden Sie einen benannten Vektor. Zum Beispiel wird by = c(\"a\" = \"b\") x.a mit y.b abgleichen.\n            </li>\n            <li>\n            suffix: Wenn es nicht zusammengeführte doppelte Variablen in x und y gibt, werden diese Suffixe zur Ausgabe hinzugefügt, um sie zu unterscheiden. Sollte ein Zeichenvektor der Länge 2 sein.\n            </li>\n            </ul>\n            <b>Wert</b><br/>\n            Ein tibble.<br/>\n            <b>Paket</b></br>\n            dplyr</br>\n            <b>Hilfe</b></br>\n            Für detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl aus: help(left_join, package=\"dplyr\") indem Sie einen R-Code-Chunk erstellen, indem Sie auf + im Ausgabefenster klicken\n"
  }
}