{
  "title": "Negative Binomialverteilung Diagramm",
  "navigation": "Negative Binomialverteilung Diagramm",
  "size": "Zielanzahl der Erfolge",
  "prob": "Wahrscheinlichkeiten des Erfolgs",
  "plotProb": "Wahrscheinlichkeitsmassfunktion darstellen",
  "plotDistrib": "Verteilungsfunktion darstellen",
  "help": {
    "title": "Negative Binomialverteilung Diagramm",
    "r_help": "help(qnbinom, package=stats)",
    "body": "\n\n            <b>Beschreibung</b>\n            <br/>\n            Dichte, Verteilungsfunktion, Quantilfunktion und Zufallszahlen für die negative Binomialverteilung mit den Parametern Größe und Wahrscheinlichkeit.\n            <br/>\n            <b>Verwendung</b>\n            <br/>\n            <code>\n                dnbinom(x, size, prob, mu, log = FALSE)\n                <br/>\n                pnbinom(q, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qnbinom(p, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rnbinom(n, size, prob, mu)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumente</b>\n            <br/>\n            <ul>\n                <li>x : Vektor von (nicht-negativen ganzen) Quantilen.</li>\n                \n                \n                <li>q : Vektor von Quantilen.</li>\n                \n                \n                <li>p : Vektor von Wahrscheinlichkeiten.</li>\n                \n                \n                <li>n : Anzahl der Beobachtungen. Wenn die Länge(n) > 1, wird die Länge als die benötigte Anzahl betrachtet.</li>\n                \n                \n                <li>size : Zielanzahl erfolgreicher Versuche oder Streuungsparameter (der Formparameter der Gamma-Mischverteilung). Muss strikt positiv sein, muss nicht ganzzahlig sein.</li>\n                \n                \n                <li>prob : Wahrscheinlichkeit des Erfolgs in jedem Versuch. 0 < prob <= 1.</li>\n                \n                \n                <li>mu : alternative Parametrisierung über den Mittelwert: siehe 'Details'.</li>\n                \n                \n                <li>log, log.p : logisch; wenn TRUE, werden die Wahrscheinlichkeiten p als log(p) angegeben.</li>\n                \n                \n                <li>lower.tail : logisch; wenn TRUE (Standard), sind die Wahrscheinlichkeiten P[X ≤ x], andernfalls P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Details</b>\n            <br/>\n            Die negative Binomialverteilung mit size = n und prob = p hat die Dichte\n            <br/>\n            <code>\n                Γ(x+n)/(Γ(n) x!) p^n (1-p)^x\n                für x = 0, 1, 2, …, n > 0 und 0 < p ≤ 1.\n            </code>\n            <br/>\n            Dies stellt die Anzahl der Misserfolge dar, die in einer Folge von Bernoulli-Versuchen auftreten, bevor eine Zielanzahl von Erfolgen erreicht wird. Der Mittelwert ist μ = n(1-p)/p und die Varianz n(1-p)/p^2.\n            <br/>\n            Eine negative Binomialverteilung kann auch als Mischung von Poisson-Verteilungen auftreten, deren Mittelwert als Gamma-Verteilung verteilt ist (siehe pgamma) mit dem Skalierungsparameter (1 - prob)/prob und dem Formparameter size. (Diese Definition erlaubt nicht-ganzzahlige Werte von size.)\n            <br/>\n            Eine alternative Parametrisierung (häufig in der Ökologie verwendet) erfolgt über den Mittelwert mu (siehe oben) und size, den Streuungsparameter, wobei prob = size/(size+mu). Die Varianz ist mu + mu^2/size in dieser Parametrisierung.\n            <br/>\n            Wenn ein Element von x keine ganze Zahl ist, ist das Ergebnis von dnbinom null, mit einer Warnung.\n            Der Fall size == 0 ist die Verteilung, die sich auf null konzentriert. Dies ist die Grenzverteilung für size, die sich null nähert, selbst wenn mu anstelle von prob konstant gehalten wird. Beachten Sie jedoch, dass der Mittelwert der Grenzverteilung 0 ist, unabhängig vom Wert von mu.\n            <br/>\n            Das Quantil ist definiert als der kleinste Wert x, so dass F(x) ≥ p, wobei F die Verteilungsfunktion ist.\n            <br/>\n            <br/><b>Wert</b>\n            <br/>\n            dnbinom gibt die Dichte an, pnbinom gibt die Verteilungsfunktion an, qnbinom gibt die Quantilfunktion an, und rnbinom generiert Zufallszahlen.\n            <br/>\n            Ungültige size oder prob führen zu einem Rückgabewert NaN, mit einer Warnung.\n            <br/>\n            Die Länge des Ergebnisses wird durch n für rnbinom bestimmt und ist das Maximum der Längen der numerischen Argumente für die anderen Funktionen.\n            <br/>\n            Die numerischen Argumente, die nicht n sind, werden auf die Länge des Ergebnisses wiederverwendet. Nur die ersten Elemente der logischen Argumente werden verwendet.            \n      "
  }
}