{
    "title": "Parametrische Überlebensregression",
    "navigation": "Parametrische Überlebensregression",
    "modelname": "Modellname eingeben",
    "timevar": "Zeit bis zum Ereignis oder zur Zensur",
    "eventvar": "Ereignis (1 oder höher = Ereignis, 0 oder niedriger = Zensur)",
    "destvars": "Unabhängige Variablen",
    "weightvar": "Gewichte (optional)",
    "rmstChk": "Berechne eingeschränkten mittleren Überlebenszeit (RMST)",
    "rmstSEChk": "Berechne Standardfehler für RMST mit Bootstrap (Hinweis: Es dauert eine Weile)",
    "bootIter": "Bootstrap-Iteration",
    "HazardRatioChk": "Berechne Hazard-Ratios",
    "labelSurvival": "Überlebensdiagramm-Typ",
    "survivalradioCI": "Überleben mit Konfidenzintervall",
    "survivalradio": "Überleben",
    "survivalradioKMCI": "Überleben mit Kaplan-Meier (nicht-parametrisch) und Konfidenzintervall",
    "survivalradioKM": "Überleben mit Kaplan-Meier (nicht-parametrisch)",
    "labelFailure": "Kumulative Ausfalldiagramm-Typ",
    "inciradioCI": "Kumulativer Ausfall mit Konfidenzintervall",
    "inciradio": "Kumulativer Ausfall",
    "inciradioKMCI": "Kumulativer Ausfall mit Kaplan-Meier (nicht-parametrisch) und Konfidenzintervall",
    "inciradioKM": "Kumulativer Ausfall mit Kaplan-Meier (nicht-parametrisch)",
    "spectimes": "Berechne Überlebenswahrscheinlichkeit - gib Zeiten als time1, time2, time3 usw. an oder als seq (1,5,by=1)",
    "specprobs": "Berechne Überlebenszeit bis zum Ereignis - gib Quantile (Wahrscheinlichkeit) wie 0,25, 0,50, 0,60, 0,75 usw. an oder als seq (0.2,0.9,by=0.1)",
    "coVarValues": "Wenn leer gelassen, werden die Mittelwerte der unabhängigen Variablen (Kovariaten) verwendet. Andernfalls gib kommaseparierte Werte an, die zur Schätzung der Wahrscheinlichkeiten und zur Darstellung verwendet werden sollen.",
    "labelDistribution": "Wähle eine Verteilungsfunktion, die am besten zu den Daten passt",
    "selectDistFuncWeibullRad": "Weibull",
    "selectDistFuncExpRad": "Exponential",
    "selectDistFuncGammaRad": "Gamma",
    "selectDistFuncLnormalRad": "Log-Normal",
    "selectDistFuncPoissonRad": "Poisson",
    "selectDistFuncNBinomRad": "Negative Binomial",
    "selectDistFuncGeomRad": "Geometrisch",
    "selectDistFuncBetaRad": "Beta",
    "selectDistFuncUnifRad": "Uniform",
    "selectDistFuncLogisRad": "Logistisch",
    "selectDistFuncLogLogisRad": "Log-logistisch",
    "selectDistFuncCauchyRad": "Cauchy",
    "selectDistFuncNormRad": "Normal",
    "confidenceInterval": "Konfidenzintervalle für Maximum-Likelihood-Schätzungen",
    "help": {
        "title": "Parametrische Überlebensregression",
        "r_help": "help(flexsurvreg, package = 'flexsurv')",
        "body": "\n\t\t\tSiehe Beispieldatensatz im Installationsverzeichnis, der Standardspeicherort ist auf Laufwerk:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. Die Variable Followup_time sollte als Zeit bis zum Ereignis oder zur Zensur eingegeben werden und die Variable Event sollte als Ereignis (1 = Ereignis, 0 = Zensur) eingegeben werden.<br/>\n            <br/>\n            <br/>\n\t\t\tDie Beispiel-Datensätze sind lung, manufacturing_data und bulb reliability <br/><br/>\t\t\n            <b>Parameterabschätzungen und Diagramme für parametrische Überlebensregression sowie Kaplan-Meier-Überlebenskurven (Null-/Interzeptmodell)</b>\n            <br/>\n            <br/>\n            Diese werden verwendet, um das kumulierte Risiko, ein Ereignis nicht zu haben (oder umgekehrt, ein Ereignis zu haben), über einen Zeitraum nach Beginn des Follow-ups für dieses Ereignis (oder Zeit null) zu schätzen. Die Subjekte müssen ab Zeit null für das Ereignis gefährdet sein.\n            <br/>\n            <br/>\n            <b>Zeit:</b> Zeitspanne bis zu einem Ereignis, wenn das Ereignis eingetreten ist, oder bis zum letzten Follow-up für dieses Ereignis, wenn das Ereignis nicht eingetreten ist, für jedes Subjekt\n            <br/><br/>\n            <b>Ereignis:</b> Numerischer Indikator, ob das Ereignis eingetreten ist (1=Ereignis, 0=Zensur) für jedes Subjekt\n            <br/><br/>\n            <b>Diagrammtyp:</b> Wahrscheinlichkeitsdarstellung, das Ereignis nicht zu haben (Überleben) oder das Ereignis zu haben (Ausfall)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Schätzungen für bestimmte Zeiten oder Wahrscheinlichkeiten:</b> Option, um eine Tabelle einzuschließen, die die Überlebenswahrscheinlichkeiten für eine vom Benutzer ausgewählte Zeitreihe enthält.\n\t\t\t<br/><br/>\n\t\t\t<b>Geben Sie Zeiten wie time1, time2, time3 usw. an oder als seq(1,5,by=1):</b> Dies sind die spezifischen Zeiten, die in der Tabelle für bestimmte Zeiten enthalten sein werden. Sie können einzeln durch Kommas getrennt oder als eine Sequenz gleichmäßig verteilter Werte angegeben werden.\n\t\t\t<br/><br/>\n            Die Tabellen geben die Stichprobengröße, die Anzahl der Subjekte mit dem Ereignis, die mediane Überlebenszeit (falls definiert), die eingeschränkte mittlere Überlebenszeit und die mediane Follow-up-Zeit an. Die mediane Follow-up-Zeit wird mit dem umgekehrten Kaplan-Meier-Schätzer berechnet, der echte Ereignisse als zensierte Beobachtungen und echte zensierte Beobachtungen als Ereignisse behandelt. Somit ist das „Ereignis“ in diesem Schätzer „das Verfolgen der Subjekte, so lange die Studie es zulässt“.\n            <br/>\n            Eine Tabelle der parametrischen Überlebens- und Ereignisschätzungen für die gewählte Verteilung wird zu jedem beobachteten Zeitpunkt im Datensatz mit den angegebenen Konfidenzintervallen bereitgestellt.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Stiloptionen</b>\n            <br/>\n            <br/>\n            <b>Diagrammtitel:</b> Titel des Diagramms; löschen Sie allen Text für keinen Titel\n            <br/><br/>\n\t\t\t<b>Größe des Diagrammtitels:</b> Größe des Diagrammtitels.\n\t\t\t<br/><br/>\n            <b>Diagramm-Thema:</b> Allgemeiner Stil des Diagramms\n            <br/><br/>\n            <b>Nummer der Gefährdeten einfügen:</b> Optional kann ein Tabelle zur Anzahl der Subjekte, die weiterhin gefährdet sind, unten im Diagramm eingefügt werden. <b>Position der Risikotabelle</b> gibt an, ob Sie die Tabelle außerhalb der Achsen oder innerhalb der Achsen möchten. Die <b>Höhe der Risikotabelle</b> steuert den Anteil des Diagrammbereichs, den die Tabelle einnimmt. Diese Option wird ignoriert, wenn die Risikotabelle innerhalb der Achsen liegt. \n\t\t\tDie <b>Größe der Risikowerte</b> steuert die Größe der Zahlen für die Gefährdeten. Die <b>Größe des Titels der Risikotabelle</b> steuert die Größe des Titels der Risikotabelle.\n\t\t\tDie <b>Größe der Achsenbeschriftungen der Risikotabelle</b> steuert die Größe der Achsenbeschriftungen.\n\t\t\tDie <b>Größe der Markierungsetiketten der Risikotabelle</b> steuert die Größe der Markierungen für die Zeiten in der Risikotabelle. Wenn Sie alle Achsen und Gitterlinien entfernen möchten, \n\t\t\tkann die Option <b>Achsen und Gitterlinien aus der Risikotabelle entfernen</b> angeklickt werden. Dies wird nur die Gefährdetenanzahl in die Tabelle aufnehmen.\n            <br/>\n            <br/>\n            <b>Linienoptionen:</b>\n            <b>Größe</b> steuert die Dicke und <b>Farbe</b> steuert die Farbe der gezeichneten Linie. Optional kann ein 95%-Konfidenzintervall für die Schätzungen in einem <b>Band</b> (schattierter Bereich) oder <b>Schritt</b> (Linie) Format eingeschlossen werden. <b>Transparenz</b> steuert, wie dunkel das Band ist und wird ignoriert, wenn die Schrittoption ausgewählt ist. <b>Zensierte Zeiten</b> (wenn Subjekte nicht mehr für das Ereignis gefährdet sind) können mit „+“-Symbolen auf der Linie angezeigt werden. Die Größe der „+“-Symbole kann angepasst werden. Die <b>Medianüberlebenszeit anzeigen</b> Option wird horizontale oder vertikale Linien zu dem Zeitpunkt einfügen, wenn geschätzt wird, dass 50% der Subjekte das Ereignis hatten. Die Medianzeit ist undefiniert, wenn die Überlebenskurve nicht 50% erreicht.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Achsenoptionen</b>\n            <br/> \n            <br/> \n            Die <b>Beschriftung</b> Option legt die Textbeschriftung für die Achse fest. Die <b>Achsenbegrenzungen</b> legen die minimalen und maximalen Werte der Achse fest. Die <b>Schrittmarken-Inkremente</b> Option steuert den Abstand der Schrittmarken auf der Achse. Die Inkremente auf der Zeitachse steuern auch die Zeiten für die optionale Tabelle der Gefährdeten.\n            <br/> \n            Die <b>Skala</b> Option der Überlebensachse gibt an, ob die Schätzungen auf einer Proportional- (0-1) oder Prozent- (0-100) Skala dargestellt werden sollen.\n\t\t\t<br/><br/>\n\t\t\t<b>Achsenbeschriftungsgröße:</b> Diese steuert die Größe der Achsenbeschriftungen sowohl der Überlebens- als auch der Zeitachse.\n\t\t\t<br/><br/>\n\t\t\t<b>Größe der Achsenmarkierungsbeschriftungen:</b> Diese steuert die Größe der Achsenmarkierungsbeschriftungen der Überlebens- und Zeitachse.\n"
    }
}
