{
  "title": "Pareto-Diagramm",
  "navigation": "Pareto-Diagramm",
  "label1": "Drei Optionen - Langformat (Standard) d.h. Defekte und Zählungen in vertikalen Spalten, Breitformat d.h. Defekte als Spaltennamen und Zählungen als Zeile, und Zählungen aus Rohdaten berechnen",
  "selectLongRad": "Option 1: Langformat - wählen Sie die Defektkategorie und die Defektzählungen",
  "selectWideRad": "Option 2: Breitformat - Spaltennamen werden als Defektkategorie verwendet und die 1. Zeile (Standard) wird als Zählungen verwendet",
  "selectRawRad": "Option 3: Rohdaten - Zählungen berechnen, um das Pareto-Diagramm zu zeichnen",
  "rownumForCounts": "Zeilennummer (Standard 1. Zeile), die für die Zählungen verwendet werden soll",
  "mainTitle": "Diagrammtitel",
  "defects": "Variable (z.B. Kategorien), die gezeichnet werden sollen",
  "counts": "(Optional) Variable, die als Zählungen zum Zeichnen verwendet werden soll",
  "grouping": "(Optional) Gruppierungsvariable, um mehrere Pareto-Diagramme nebeneinander zu zeichnen",
  "uniformBarOrderChk": "Balken in derselben alphabetischen Reihenfolge (über Gruppen hinweg) zeichnen. Deaktivieren, um Balken basierend auf absteigender Häufigkeit (innerhalb jeder Gruppe) anzuordnen",
  "grouping2": "(Optional) Eine Gruppierungsvariable, um mehrere Pareto-Diagramme nebeneinander zu zeichnen",
  "rawVariable": "Variable (z.B. Kategorien) mit Rohdaten",
  "xlab": "Ein String, der das Label für die x-Achse angibt",
  "ylab": "Ein String, der das Label für die y-Achse angibt",
  "ylab2": "Ein String, der das Label für die zweite y-Achse auf der rechten Seite angibt",
  "percentStep": "Prozentuale Schritte, die als Tickmarken für die zweite y-Achse auf der rechten Seite verwendet werden sollen",
  "digits": "Anzahl der Dezimalstellen für die Statistiktabelle",
  "help": {
    "title": "Pareto-Diagramm",
    "r_help": "help(pareto.chart, package = qcc)",
    "body": "\n\t\t\t\t<b>Beschreibung</b></br>\n\t\t\t\tDie Funktion pareto.chart erstellt eine Tabelle von Statistiken und zeichnet ein Pareto-Diagramm\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tFür detaillierte Hilfe - verwenden Sie R help(pareto.chart, package = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUm dies auszuprobieren, können Sie die Beispieldatendatei namens defects_frequency_pareto_chart.xlsx verwenden. Öffnen Sie die Datei im Datenraster über das Menü Datei öffnen\n\t\t\t\t<br/>\n\t\t\t"
  }
}