{
  "title": "Person-Item-Karte plotten",
  "navigation": "Person-Item-Karte plotten",
  "label1": "Wählen Sie ein Modell (Modelle der Klassen Rm und dRm werden unterstützt)",
  "label1b": "Wenn keine Modelle verfügbar sind, müssen Sie zuerst ein Modell erstellen, indem Sie Modellanpassung -> IRT auswählen",
  "modelselector1": "Wählen Sie ein Modell",
  "range1": "Bereich für die X-Achse",
  "help": {
    "title": "Person-Item-Karte plotten",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>Beschreibung</b></br>\n                Eine Person-Item-Karte zeigt die Position der Item- (und Schwellen-)Parameter sowie die Verteilung der Personenparameter entlang der latenten Dimension. Person-Item-Karten sind nützlich, um den Bereich und die Position der Item-Messverteilungs (unteres Panel) mit dem Bereich und der Position der Personenmessverteilung (oberes Panel) zu vergleichen. Items sollten idealerweise entlang der gesamten Skala positioniert sein, um die 'Fähigkeit' aller Personen sinnvoll zu messen.\n\n                <br/><br/>\n                <b>Verwendung</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"Person-Item-Karte\", latdim = \"Latente Dimension\",\n                pplabel = \"Person\nParameter\nVerteilung\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>Argumente</b>\n                <br/>  \n                object: Objekt der Klassen Rm oder dRm\n                <br/>\n                item.subset: Teilmenge der anzuzeigenden Items. Entweder ein numerischer Vektor, der die Spalte in X angibt, oder ein Zeichenvektor, der den Spaltennamen angibt. Wenn \"all\", werden alle Items angezeigt. Die Anzahl der anzuzeigenden Items muss > 1 sein.\n                <br/>\n                sorted: Wenn TRUE, werden die Items in aufsteigender Reihenfolge entsprechend ihrer Position auf der latenten Dimension sortiert.   \n                <br/>\n                main: Haupttitel des Plots.\n                <br/>\n                latdim: Beschriftung der x-Achse, d.h. die latente Dimension.\n                <br/>\n                pplabel: Titel für das obere Panel, das die Verteilung der Personenparameter anzeigt\n                <br/>\n                cex.gen: cex als grafischer Parameter gibt einen numerischen Wert an, der angibt, um wie viel die Plottexte und -symbole im Vergleich zum Standard vergrößert werden sollen. Hier gilt cex.gen für alle Textbeschriftungen. Der Standardwert ist 0.7.\n                <br/>\n                xrange: Bereich für die x-Achse\n                <br/>\n                warn.ord: Wenn TRUE (Standard), werden im rechten Rand des unteren Panels Sterne angezeigt, um nicht-ordinale Schwellenpositionen für polytome Items anzuzeigen.\n                <br/>\n                warn.ord.colour: Nicht-ordinale Schwellenpositionen für polytome Items werden mit dieser Farbe hervorgehoben, um sie sichtbarer zu machen. Dies ist besonders nützlich, wenn es viele Items gibt, sodass der Plot ziemlich dicht ist. Der Standardwert ist \"schwarz\", sodass keine Unterscheidung getroffen wird.\n                <br/>   \n                irug: Wenn TRUE (Standard), werden alle Schwellen unter der Personenverteilung angezeigt, um anzuzeigen, wo die enthaltenen Items am informativsten sind.                \n                <br/>\n                pp: Wenn nicht NULL, enthält dies die Personenparameterdaten des Datenobjekts, um die Notwendigkeit einer Neuberechnung zu vermeiden.\n                <br/><br/>\n\n                <b>Pakete</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>Hilfe</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}