{
  "title": "Stichprobengröße, Präzision eines Risiko-Verhältnisses",
  "navigation": "Risiko-Verhältnis",
  "howtouse": "Geben Sie entweder die Stichprobengröße oder die Breite des Konfidenzintervalls an, und das andere wird berechnet",
  "n1": "Stichprobengröße Gruppe 1",
  "width": "Breite des Konfidenzintervalls",
  "ratio": "Verhältnis der Stichprobengröße Gruppe 2 zu Gruppe 1",
  "prop1": "Ergebnisproportion Gruppe 1",
  "prop2": "Ergebnisproportion Gruppe 2",
  "conflevel": "Konfidenzniveau (0-1)",
  "method": "Methode des Konfidenzintervalls",
  "help": {
    "title": "Stichprobengröße, Präzision eines Risiko-Verhältnisses",
    "r_help": "help(prec_riskratio, package ='presize')",
    "body": "\nDies ist eine Bewertung der Stichprobengröße für ein Verhältnis von Proportionen (Risiko-Verhältnis / relatives Risiko) basierend auf der Breite des Konfidenzintervalls. Es berechnet die Stichprobengröße oder die Breite des Konfidenzintervalls, wenn der Benutzer \ndas andere angibt.\n<br/><br/>\n<b>Stichprobengröße Gruppe 1:</b> Geben Sie die Anzahl der Probanden in Gruppe 1 an\n<br/><br/>\n<b>Breite des Konfidenzintervalls:</b> Geben Sie die gewünschte Breite des Konfidenzintervalls an. Die Breite eines Konfidenzintervalls ist ein Maß für die Präzision einer Schätzung und ist die obere Grenze minus die untere Grenze.\n<br/><br/>\n<b>Verhältnis der Stichprobengröße Gruppe 2 zu Gruppe 1:</b> Geben Sie das Verhältnis der Stichprobengröße von Gruppe 2 zur Stichprobengröße von Gruppe 1 an. Ein Wert von 1 bedeutet gleiche Stichprobengrößen.\n<br/><br/>\n<b>Ergebnisproportion Gruppe 1:</b> Geben Sie die Proportion der Probanden in Gruppe 1 mit dem 'positiven' Ergebnis an\n<br/><br/>\n<b>Ergebnisproportion Gruppe 2:</b> Geben Sie die Proportion der Probanden in Gruppe 2 mit dem 'positiven' Ergebnis an\n<br/><br/>\nBeachten Sie, dass das Risiko-Verhältnis als die Proportion in Gruppe 1 geteilt durch die Proportion in Gruppe 2 berechnet wird.\n<br/><br/>\n<b>Konfidenzniveau:</b> Geben Sie das gewünschte Niveau des Konfidenzintervalls an\n<br/><br/>\n<b>Methode des Konfidenzintervalls:</b> Geben Sie den Typ des zu verwendenden Konfidenzintervalls an. Koopman (koopman) bietet ein asymptotisches Score-Konfidenzintervall, das immer konsistent ist \nmit dem Chi-Quadrat-Test von Pearson. Es ist das empfohlene Intervall (Fagerland et al.). Katz (katz) verwendet eine logarithmische Transformation zur Berechnung des Konfidenzintervalls. Das CI kann \nnicht berechnet werden, wenn eine der Proportionen null ist. Wenn beide Proportionen 1 sind, wird die Schätzung des Standardfehlers null, was zu einem CI von [1, 1] führt.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> presize\n\t\t\t"
  }
}