{
    "title": "Ein-Stichproben-Anteilstest",
    "navigation": "Einzelne Stichprobe (Kontinuitätskorrektur)",
    "tvarbox1": "Numerisch oder Faktor mit nur 2 Ebenen/Werten",
    "label1": "Alternative Hypothese",
    "test1": "Populationsmittelwert != mu",
    "test2": "Populationsmittelwert > mu",
    "test3": "Populationsmittelwert < mu",
    "txtbox1": "Konfidenzniveau",
    "txtbox2": "Nullhypothese (mu im Bereich 0-1)",
    "chkbox1": "Mit Kontinuitätskorrektur",
    "dataInCols": "Eine oder mehrere Variablen enthalten Stichproben",
    "summarized": "Zusammengefasste Daten",
    "noOfEvents": "Anzahl der Ereignisse",
    "noOfTrials": "Anzahl der Versuche",
    "help": {
        "title": "Ein-Stichproben-Anteilstest",
        "r_help": "help(prop.test, package=stats)",
        "body": "\n<b>Beschreibung</b></br>\nprop.test kann verwendet werden, um die Nullhypothese zu testen, dass die Anteile (Erfolgswahrscheinlichkeiten) in mehreren Gruppen gleich sind oder dass sie bestimmten vorgegebenen Werten entsprechen.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: ein Vektor von Erfolgszahlen, eine eindimensionale Tabelle mit zwei Einträgen oder eine zweidimensionale Tabelle (oder Matrix) mit 2 Spalten, die die Anzahl der Erfolge und Misserfolge angeben.</li>\n<li>\nn: ein Vektor von Versuchsanzahlen; wird ignoriert, wenn x eine Matrix oder eine Tabelle ist.</li>\n<li>\np: ein Vektor von Erfolgswahrscheinlichkeiten. Die Länge von p muss der Anzahl der Gruppen entsprechen, die durch x angegeben sind, und ihre Elemente müssen größer als 0 und kleiner als 1 sein.</li>\n<li>\nalternative: ein Zeichenstring, der die alternative Hypothese angibt, muss einer von \"two.sided\" (Standard), \"greater\" oder \"less\" sein. Es kann auch nur der erste Buchstabe angegeben werden. Wird nur verwendet, um die Nullhypothese zu testen, dass ein einzelner Anteil einem bestimmten Wert entspricht oder dass zwei Anteile gleich sind; andernfalls wird es ignoriert.</li>\n<li>\nconf.level: Konfidenzniveau des zurückgegebenen Konfidenzintervalls. Muss eine einzelne Zahl zwischen 0 und 1 sein. Wird nur verwendet, wenn die Nullhypothese getestet wird, dass ein einzelner Anteil einem bestimmten Wert entspricht oder dass zwei Anteile gleich sind; andernfalls wird es ignoriert.</li>\n<li>\ncorrect: ein logischer Wert, der angibt, ob die Kontinuitätskorrektur von Yates angewendet werden soll, wenn möglich.</li>\n</ul>\n<b>Details</b></br>\nEs werden nur Gruppen mit endlichen Zahlen von Erfolgen und Misserfolgen verwendet. Die Zahlen der Erfolge und Misserfolge müssen nicht negativ sein und dürfen daher nicht größer sein als die entsprechenden Versuchsanzahlen, die positiv sein müssen. Alle endlichen Zahlen sollten Ganzzahlen sein.</br>\nWenn p NULL ist und es mehr als eine Gruppe gibt, wird getestet, ob die Anteile in jeder Gruppe gleich sind. Wenn es zwei Gruppen gibt, sind die Alternativen, dass die Erfolgswahrscheinlichkeit in der ersten Gruppe kleiner, ungleich oder größer ist als die Erfolgswahrscheinlichkeit in der zweiten Gruppe, wie von alternative angegeben. Ein Konfidenzintervall für den Unterschied der Anteile mit dem Konfidenzniveau, wie von conf.level angegeben, wird zurückgegeben und auf [-1,1] begrenzt. Die Kontinuitätskorrektur wird nur verwendet, wenn der Unterschied der Stichprobenanteile im absoluten Wert nicht überschritten wird. Andernfalls, wenn es mehr als 2 Gruppen gibt, ist die Alternative immer \"two.sided\", das zurückgegebene Konfidenzintervall ist NULL und die Kontinuitätskorrektur wird nie verwendet.</br>\nWenn es nur eine Gruppe gibt, wird getestet, ob die zugrunde liegende Erfolgswahrscheinlichkeit p ist oder 0.5, wenn p nicht angegeben ist. Die Alternative ist, dass die Erfolgswahrscheinlichkeit kleiner, ungleich oder größer ist als p oder 0.5, wie von alternative angegeben. Ein Konfidenzintervall für den zugrunde liegenden Anteil mit dem Konfidenzniveau, wie von conf.level angegeben, wird zurückgegeben und auf [0,1] begrenzt. Die Kontinuitätskorrektur wird nur verwendet, wenn der Unterschied zwischen Stichproben- und Nullanteilen im absoluten Wert nicht überschritten wird. Das Konfidenzintervall wird durch Invertieren des Score-Tests berechnet.</br>\nSchließlich, wenn p angegeben ist und es mehr als 2 Gruppen gibt, wird getestet, ob die zugrunde liegenden Erfolgswahrscheinlichkeiten die von p angegebenen Werte sind. Die Alternative ist immer \"two.sided\", das zurückgegebene Konfidenzintervall ist NULL und die Kontinuitätskorrektur wird nie verwendet.</br>\n<b>Wert</b><br/>\nEine Liste mit der Klasse \"htest\", die die folgenden Komponenten enthält:</br>\nstatistic: der Wert der Chi-Quadrat-Teststatistik von Pearson.</br>\nparameter: die Freiheitsgrade der approximativen Chi-Quadrat-Verteilung der Teststatistik.</br>\np.value: der p-Wert des Tests.</br>\nestimate: ein Vektor mit den Stichprobenanteilen x/n.</br>\nconf.int: ein Konfidenzintervall für den wahren Anteil, wenn es nur eine Gruppe gibt, oder für den Unterschied der Anteile, wenn es 2 Gruppen gibt und p nicht angegeben ist, andernfalls NULL. In den Fällen, in denen es nicht NULL ist, hat das zurückgegebene Konfidenzintervall ein asymptotisches Konfidenzniveau, wie von conf.level angegeben, und ist entsprechend der angegebenen alternativen Hypothese angemessen.</br>\nnull.value: der Wert von p, wenn er von der Null angegeben wurde, andernfalls NULL.</br>\nalternative: ein Zeichenstring, der die Alternative beschreibt.</br>\nmethod: ein Zeichenstring, der die verwendete Methode angibt und ob die Kontinuitätskorrektur von Yates angewendet wurde.</br>\ndata.name: ein Zeichenstring, der die Namen der Daten angibt.</br>\n<b>Paket</b></br>\nstats</br>\n<b>Hilfe</b></br>\nhelp(prop.test, package ='stats')\n"
    }
}
