{
  "title": "Zwei-Stichproben-Anteilstest (Beta)",
  "navigation": "Zwei Stichproben (Beta)",
  "tvarbox1": "Numerisch oder Faktor mit nur 2 Ebenen/Werten",
  "tvarbox2": "Numerisch oder Faktor mit nur 2 Ebenen/Werten",
  "label1": "Alternativhypothese",
  "test1": "Anteil != Hypothetisierter Anteil",
  "test2": "Anteil > Hypothetisierter Anteil",
  "test3": "Anteil < Hypothetisierter Anteil",
  "txtbox1": "Konfidenzniveau",
  "txtbox2": "Nullhypothese (Hypothetisierter Anteil im Bereich 0-1)",
  "chkbox1": "Mit Kontinuitätskorrektur",
  "dataInCols": "Eine oder mehrere Variablen enthalten Stichproben",
  "summarized": "Zusammengefasste Daten",
  "noOfEvents": "Anzahl der Ereignisse",
  "noOfTrials": "Anzahl der Versuche",
  "method": "Methode auswählen",
  "label2": "Stichprobe1",
  "label3": "Stichprobe2",
  "noOfEvents2": "Anzahl der Ereignisse",
  "noOfTrials2": "Anzahl der Versuche",
  "help": {
    "title": "Zwei-Stichproben-Anteilstest",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>Beschreibung</b></br>\nprop.test kann verwendet werden, um die Nullhypothese zu testen, dass die Anteile (Wahrscheinlichkeiten des Erfolgs) in mehreren Gruppen gleich sind oder dass sie bestimmten gegebenen Werten entsprechen.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: ein Vektor von Erfolgszahlen, eine eindimensionale Tabelle mit zwei Einträgen oder eine zweidimensionale Tabelle (oder Matrix) mit 2 Spalten, die die Zahlen von Erfolgen und Misserfolgen angibt.\n</li>\n<li>\nn: ein Vektor von Versuchszahlen; wird ignoriert, wenn x eine Matrix oder Tabelle ist.\n</li>\n<li>\np: ein Vektor von Wahrscheinlichkeiten des Erfolgs. Die Länge von p muss gleich der Anzahl der Gruppen sein, die durch x angegeben sind, und ihre Elemente müssen größer als 0 und kleiner als 1 sein.\n</li>\n<li>\nalternative: ein Zeichenstring, der die Alternativhypothese angibt, muss einer von \"two.sided\" (Standard), \"greater\" oder \"less\" sein. Sie können nur den Anfangsbuchstaben angeben. Wird nur verwendet, um die Nullhypothese zu testen, dass ein einzelner Anteil einem gegebenen Wert entspricht oder dass zwei Anteile gleich sind; wird sonst ignoriert.\n</li>\n<li>\nconf.level: Konfidenzniveau des zurückgegebenen Konfidenzintervalls. Muss eine einzelne Zahl zwischen 0 und 1 sein. Wird nur verwendet, wenn die Null getestet wird, dass ein einzelner Anteil einem gegebenen Wert entspricht oder dass zwei Anteile gleich sind; wird sonst ignoriert.\n</li>\n<li>\ncorrect: ein logisches Zeichen, das angibt, ob die Kontinuitätskorrektur von Yates, wo möglich, angewendet werden soll.\n</li>\n</ul>\n<b>Details</b></br>\nNur Gruppen mit endlichen Zahlen von Erfolgen und Misserfolgen werden verwendet. Die Zahlen von Erfolgen und Misserfolgen müssen nicht negativ sein und daher nicht größer als die entsprechenden Zahlen von Versuchen, die positiv sein müssen. Alle endlichen Zahlen sollten ganze Zahlen sein.</br>\nWenn p NULL ist und es mehr als eine Gruppe gibt, wird die Null getestet, dass die Anteile in jeder Gruppe gleich sind. Wenn es zwei Gruppen gibt, sind die Alternativen, dass die Erfolgswahrscheinlichkeit in der ersten Gruppe kleiner, nicht gleich oder größer ist als die Erfolgswahrscheinlichkeit in der zweiten Gruppe, wie durch die Alternative angegeben. Ein Konfidenzintervall für den Unterschied der Anteile mit dem Konfidenzniveau, wie durch conf.level angegeben, und auf [-1,1] zugeschnitten, wird zurückgegeben. Die Kontinuitätskorrektur wird nur verwendet, wenn sie den Unterschied der Stichprobenanteile im absoluten Wert nicht überschreitet. Andernfalls, wenn es mehr als 2 Gruppen gibt, ist die Alternative immer \"two.sided\", das zurückgegebene Konfidenzintervall ist NULL, und die Kontinuitätskorrektur wird niemals verwendet.</br>\nWenn es nur eine Gruppe gibt, wird die Null getestet, dass die zugrunde liegende Erfolgswahrscheinlichkeit p ist oder 0,5, wenn p nicht angegeben ist. Die Alternative ist, dass die Erfolgswahrscheinlichkeit kleiner, nicht gleich oder größer ist als p oder 0,5, je nach Angabe der Alternative. Ein Konfidenzintervall für den zugrunde liegenden Anteil mit dem Konfidenzniveau, wie durch conf.level angegeben, und auf [0,1] zugeschnitten, wird zurückgegeben. Die Kontinuitätskorrektur wird nur verwendet, wenn sie den Unterschied zwischen Stichproben- und Nullanteilen im absoluten Wert nicht überschreitet. Das Konfidenzintervall wird durch Invertieren des Score-Tests berechnet.</br>\nSchließlich, wenn p angegeben ist und es mehr als 2 Gruppen gibt, wird die Null getestet, dass die zugrunde liegenden Erfolgswahrscheinlichkeiten die von p angegebenen sind. Die Alternative ist immer \"two.sided\", das zurückgegebene Konfidenzintervall ist NULL, und die Kontinuitätskorrektur wird niemals verwendet.</br>\n<b>Wert</b><br/>\nEine Liste mit der Klasse \"htest\", die die folgenden Komponenten enthält:</br>\nstatistic: der Wert des Chi-Quadrat-Teststatistik von Pearson.</br>\nparameter: die Freiheitsgrade der approximativen Chi-Quadrat-Verteilung der Teststatistik.</br>\np.value: der p-Wert des Tests.</br>\nestimate: ein Vektor mit den Stichprobenanteilen x/n.</br>\nconf.int: ein Konfidenzintervall für den wahren Anteil, wenn es eine Gruppe gibt, oder für den Unterschied der Anteile, wenn es 2 Gruppen gibt und p nicht angegeben ist, oder NULL sonst. In den Fällen, in denen es nicht NULL ist, hat das zurückgegebene Konfidenzintervall ein asymptotisches Konfidenzniveau, wie durch conf.level angegeben, und ist geeignet für die angegebene Alternativhypothese.</br>\nnull.value: der Wert von p, wenn er durch die Null angegeben ist, oder NULL sonst.</br>\nalternative: ein Zeichenstring, der die Alternative beschreibt.</br>\nmethod: ein Zeichenstring, der die verwendete Methode angibt und ob die Kontinuitätskorrektur von Yates angewendet wurde.</br>\ndata.name: ein Zeichenstring, der die Namen der Daten angibt.</br>\n<b>Paket</b></br>\nstats</br>\n<b>Hilfe</b></br>\nhelp(prop.test, package ='stats')\n"
  }
}