{
  "title": "Zuverlässigkeitsanalyse (Cronbachs Alpha)",
  "navigation": "Cronbachs Alpha",
  "tvarbox1": "Alle Elemente",
  "tvarbox2": "Geben Sie oben die umgekehrten Punkte ein",
  "help": {
    "title": "Cronbachs Alpha",
    "r_help": "help(alpha, package=psych)",
    "body": "\n            <b>Zuverlässigkeitsstatistik Tabelle gibt Ihnen​</b></br>\n•\tCronbachs Alpha: Cronbachs α (Werte ≥ .7 oder .8 zeigen gute Zuverlässigkeit an; Kline (1999))​<br/>\n•\tstd.alpha: Der standardisierte Alpha basierend auf den Korrelationen​<br/>\n•\tGuttmans Lambda 6 (berechnet aus der quadrierten multiplen Korrelation oder 'smc')​​<br/>\n•\taverage_r: durchschnittliche Inter-Item-Korrelation (dies wird verwendet, um std.alpha zu berechnen)​​<br/>\n•\tmean: Skalenmittelwert (der Mittelwert der Mittelwerte aller Individuen)​​<br/>\n•\tsd: Standardabweichung der Skala​​<br/></br>\n<b>Interpretation der Zuverlässigkeit, wenn ein Element entfernt wird​</b></br>\n•\tBezieht sich auf das gesamte Cronbachs Alpha, wenn dieses bestimmte Element (in der Zeile) entfernt/löschen wurde</br>\n•\tWenn die Rohwerte von Cronbachs Alpha in einer Zeile größer sind als das gesamte α in der Zuverlässigkeitsstatistik Tabelle oben, bedeutet dies, dass das Entfernen dieses bestimmten Elements in der Zeile das gesamte Cronbachs Alpha der Skala erhöhen wird.​</br>\n•\tDie anderen Spalten dieser Tabelle beziehen sich darauf, wie sich die anderen Statistiken ändern, wenn dieses bestimmte Element entfernt/löschen wurde.​</br>\n<b>Wie interpretiert man 'Itemstatistiken'?​</b></br>\n•\traw.r: Die Korrelation jedes Elements mit dem Gesamtergebnis, nicht korrigiert für die Überlappung der Elemente.​</br>\n•\tr.drop: Item-Gesamt-Korrelation ohne dieses Element selbst (d.h. Item-Rest-Korrelation oder korrigierte Item-Gesamt-Korrelation); niedrige Item-Gesamt-Korrelationen zeigen an, dass das Element nicht gut mit der gesamten Skala korreliert​</br>\n•\tr.cor: Item-Gesamt-Korrelation korrigiert für die Überlappung der Elemente und die Zuverlässigkeit der Skala​</br>\n•\tmean und sd: Mittelwert und sd der Skala, wenn dieses Element entfernt wird​</br>\n•\tAlle Elemente sollten mit dem Gesamtergebnis korrelieren, daher suchen wir nach Elementen, die nicht gut mit dem Gesamtergebnis der Skala korrelieren. Wenn r.drop-Werte weniger als etwa .3 sind, bedeutet dies, dass dieses bestimmte Element nicht sehr gut mit der gesamten Skala korreliert.​</br>​</br>\n<b>Wie interpretiert man die endgültige Häufigkeitstabelle?​​</b></br>\n•\tDiese Tabelle zeigt uns, welcher Prozentsatz der Personen jede Antwort auf jedes der Elemente gegeben hat (d.h. wenn Sie eine 5-Punkte-Skala haben, zeigt es Ihnen, wie viele Prozent der Antworten 1, 2, 3, 4 oder 5 waren).​</br>\n•\tDies hilft Ihnen, die Verteilung der Antworten zu überprüfen und ob jeder die gleichen Antworten gibt (was zu einer niedrigen Zuverlässigkeit führen wird).​</br>\nWenn Ihre Skala Elemente enthält, die umgekehrt gewichtet sind, müssen Sie diese angeben. Das Argument keys ermöglicht es Ihnen dazu.</br> </br> \n\n<b>Beschreibung</b></br>\nFinden Sie zwei Schätzungen der Zuverlässigkeit: Cronbachs Alpha und Guttmans Lambda 6.​\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nalpha(x, keys=NULL,cumulative=FALSE, title=NULL, max=10,na.rm = TRUE,​\n   check.keys=FALSE,n.iter=1,delete=TRUE,use=\"pairwise\",warnings=TRUE,n.obs=NULL)​\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx​: Ein data.frame oder eine Matrix von Daten, oder eine Kovarianz- oder Korrelationsmatrix​\n</li>\n<li>\nkeys​: Wenn einige Elemente umgekehrt gewichtet werden sollen, geben Sie entweder die Richtung aller Elemente an oder nur einen Vektor, welche Elemente umgekehrt werden sollen​\n</li>\n<li>\ntitle​: Jeder Textstring zur Identifizierung dieses Laufs​\n</li>\n<li>\ncumulative​: sollten die Mittelwerte die Summe der Elemente oder den Mittelwert der Elemente widerspiegeln. Der Standardwert ist Mittelwerte.​\n</li>\n<li>\nmax​: die Anzahl der Kategorien/Elemente, die berücksichtigt werden sollen, wenn die Häufigkeiten der Kategorien berichtet werden. Standardmäßig 10, übergeben an link{response.frequencies}​\n</li>\n<li>\nna.rm​: Der Standardwert ist, fehlende Werte zu entfernen und paarweise Korrelationen zu finden​\n</li>\n<li>\ncheck.keys​: wenn TRUE, dann finden Sie die erste Hauptkomponente und umkehren Sie die Elemente mit negativen Ladungen. Geben Sie eine Warnung aus, wenn dies geschieht.​\n</li>\n<li>\nn.iter​: Anzahl der Iterationen, wenn bootstrapped Konfidenzintervalle gewünscht sind​\n</li>\n<li>\ndelete​: Löschen Sie Elemente ohne Varianz und geben Sie eine Warnung aus​\n</li>\n<li>\nuse​: Optionen, die an die Funktion cor übergeben werden: \"everything\", \"all.obs\", \"complete.obs\", \"na.or.complete\" oder \"pairwise.complete.obs\". Der Standardwert ist \"pairwise\"​\n</li>\n<li>\nwarnings​: Standardmäßig wird eine Warnung und eine Nachricht ausgegeben, dass Elemente umgekehrt wurden. Unterdrücken Sie die Nachricht, wenn warnings = FALSE​\n</li>\n<li>\nn.obs​: Wenn Sie Korrelationsmatrizen als Eingabe verwenden, können wir durch Angabe der Anzahl der Beobachtungen Konfidenzintervalle finden​\n</li>\n</ul>\n<b>Details</b></br>\nAlpha ist eine der mehreren Schätzungen der internen Konsistenzzuverlässigkeit eines Tests.​​</br>\n<b>Wert</b><br/>\ntotal​: eine Liste, die​​</br>\nraw_alpha​: Alpha basierend auf den Kovarianzen​​</br>\nstd.alpha​: Der standardisierte Alpha basierend auf den Korrelationen​​</br>\nG6(smc)​: Guttmans Lambda 6 Zuverlässigkeit​​</br>\naverage_r​: Die durchschnittliche Inter-Item-Korrelation​​</br>\nmean​: Für Datenmatrizen, der Mittelwert der Skala, die durch Summierung der Elemente gebildet wird​​</br>\nsd​: Für Datenmatrizen, die Standardabweichung des Gesamtergebnisses​​</br>\nalpha.drop​: Ein Datenrahmen mit all dem oben genannten für den Fall, dass jedes Element nacheinander entfernt wird.​​</br>\nitem.stats​: Ein Datenrahmen, der​​</br>\nn​: Anzahl der vollständigen Fälle für das Element​​</br>\nraw.r​: Die Korrelation jedes Elements mit dem Gesamtergebnis, nicht korrigiert für die Überlappung der Elemente.​​</br>\nstd.r​: Die Korrelation jedes Elements mit dem Gesamtergebnis (nicht korrigiert für die Überlappung der Elemente), wenn die Elemente alle standardisiert wurden​​</br>\nr.cor​: Item-Gesamt-Korrelation, die für die Überlappung der Elemente und die Zuverlässigkeit der Skala korrigiert wurde​​</br>\nr.drop​: Item-Gesamt-Korrelation für dieses Element gegen die Skala ohne dieses Element​​</br>\nmean​: für Datenmatrizen, der Mittelwert jedes Elements​​</br>\nsd​: Für Datenmatrizen, die Standardabweichung jedes Elements​​</br>\nresponse.freq​: Für Datenmatrizen, die Häufigkeit jeder Elementantwort (wenn weniger als 20)​​</br>\nboot​: eine 6-Spalten- durch n.iter Matrix von bootstrapped resampled Werten​​</br>\nUnidim​: Ein Index der Unidimensionalität​​</br>\nFit​: Die Anpassung der off-diagonalen Matrix​​</br>\n<b>Paket</b></br>\npsych</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl help(alpha, package=psych) aus, indem Sie einen R-Code-Chunk erstellen, indem Sie + im Ausgabefenster klicken\n\n\t\t\t"
  }
}