{
  "title": "Stichprobengröße, Test von zwei Anteilen",
  "navigation": "Zwei Anteile",
  "howtouse": "Um die Stichprobengröße zu berechnen: Geben Sie beide Gruppenanteile und die Power an\nUm die Power zu berechnen: Geben Sie beide Gruppenanteile und die Stichprobengröße an\nUm den nachweisbaren Unterschied der Anteile zu berechnen: Geben Sie die Stichprobengröße, die Power und den Anteil der Gruppe 2 an",
  "n": "Stichprobengröße",
  "power": "Power (0-1)",
  "propgrp1": "Anteil Gruppe 1",
  "propgrp2": "Anteil Gruppe 2",
  "ratio": "Stichprobengrößenverhältnis Gruppe 1 zu Gruppe 2",
  "siglevel": "Signifikanzniveau (0-1)",
  "alternativeopt": "Alternativhypothese",
  "twosided": "Zweiseitig",
  "onesided": "Einseitig",
  "help": {
    "title": "Stichprobengröße, Test von zwei Anteilen",
    "r_help": "help(epi.sscohortc, package ='epiR')",
    "body": "\nDies ist eine Bewertung der Stichprobengröße für einen Test von zwei Anteilen. Es berechnet die Stichprobengröße, die Power oder die Effektgröße (Unterschied in Anteilen, Quotenverhältnis, Odds Ratio), wenn der Benutzer \ndie anderen beiden angibt.\n<br/><br/>\n<b>Stichprobengröße:</b> Geben Sie die Anzahl der Probanden in der Studie an\n<br/><br/>\n<b>Power:</b> Geben Sie die gewünschte Power der Studie an, d.h. die Wahrscheinlichkeit, dass der Test die Nullhypothese ablehnt, wenn die Alternativhypothese wahr ist.\n<br/><br/>\n<b>Anteil Gruppe 1:</b> Geben Sie den Anteil in Gruppe 1 an\n<br/><br/>\n<b>Anteil Gruppe 2:</b> Geben Sie den Anteil in Gruppe 2 an\n<br/><br/>\n<b>Stichprobengrößenverhältnis Gruppe 1 zu Gruppe 2:</b> Geben Sie das gewünschte Verhältnis der Stichprobengrößen an (N Gruppe 1 geteilt durch N Gruppe 2). Ein Verhältnis von 1 bedeutet gleiche Stichprobengrößen.\n<br/><br/>\n<b>Signifikanzniveau:</b> Geben Sie das gewünschte Signifikanzniveau (d.h. Typ-I-Fehler) des Tests an\n<br/><br/>\n<b>Alternativhypothese:</b> Geben Sie an, ob der Test zweiseitig oder einseitig ist\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> epiR\n\t\t\t"
  }
}