{
    "title": "Vorhergesagte parametrische Überlebenswahrscheinlichkeiten",
    "label100": "Dieser Dialog gibt die vorhergesagte Überlebenswahrscheinlichkeit zu einem oder mehreren angegebenen Zeitpunkten aus.\nDie folgenden Anforderungen müssen erfüllt sein:\n1. Sie müssen ein flexsurvreg-parametrisches Überlebensregressionsmodell auf einem Datensatz erstellt haben, bei dem 1 oder ein höherer Wert = Ereignis, 0 oder ein niedrigerer Wert = Zensur ist.\n2. Der Datensatz, für den Sie Vorhersagen erstellen möchten, muss alle unabhängigen Variablen enthalten, die zur Erstellung des Originalmodells verwendet wurden.\n3. Die für die Zeit verwendete Zeitskala muss mit der Zeitskala übereinstimmen, die zur Erstellung des Originalmodells verwendet wurde.\n4. Wenn Sie Vorhersagen für eine einzelne Beobachtung wünschen, müssen Sie einen neuen Datensatz mit dieser einzelnen Beobachtung erstellen.",
    "navigation": "Parametrische Überlebensbewertung",
    "filterModels": "Modelle nach Klasse filtern",
    "modelSelection": "Wählen Sie ein Modell aus, um ein Datenset zu bewerten",
    "label1": "Diagnosetests",
    "followUpTime": "Geben Sie einen oder mehrere Zeitpunkte an, z. B. 200, 1200, 1250, für die die vorhergesagten Überlebens- und Ausfallwahrscheinlichkeiten erstellt werden.",
    "levelOfInterest": "Wenn die zu prognostizierende Variable 2 Ebenen hat, geben Sie die Ebene von Interesse an. Die Verwirrungsmatrix und die zugehörigen Statistiken werden mit der angegebenen Ebene von Interesse als Referenz angezeigt.",
    "label12": "Testergebnisse: Sobald ein Modell ausgewählt ist, führen wir Tests durch, um zu prüfen, ob die im Modell angegebenen abhängigen Variablen im Datensatz zur Bewertung verfügbar sind. Die Ergebnisse werden hier angezeigt.",
    "label2": "Überlebens- und Ausfallwahrscheinlichkeiten speichern.",
    "label3": "Vorhergesagte Wahrscheinlichkeiten werden als neue Variablen gespeichert (mit Präfix, falls angegeben)",
    "label4": "**Für abhängige Variablen mit 2 Ebenen wird die 2. Ebene als positive Ebene behandelt. Siehe Daten > Faktorstufen > Stufen manuell neu anordnen, um die Reihenfolge der Faktorstufen zu ändern und das Modell neu zu erstellen.",
    "conflevel": "Vertrauenswertintervalle für einzelne vorhergesagte Werte speichern **(Nur gültig für lineare Modelle (Klasse lm))",
    "roctable": "ROC-Tabelle anzeigen (**Nur für binäre abhängige Variablen)",
    "colname": "Spaltennamenpräfix angeben",
    "label5": "**Das Aktivieren des obigen Kontrollkästchens führt bei großen Datensätzen zu einer Leistungseinbuße.",
    "level": "Vertrauenswert angeben",
    "confusioncheck": "Verwirrungsmatrix generieren",
    "help": {
        "title": "Ein Datenset mit einem flexsurvreg (parametrisches Überlebens-) Modell bewerten",
        "r_help": "help(flexsurvreg, package = 'flexsurv')",
        "body": "\n    WENN MEHRERE ZEITRÄUME ANGEGEBEN WERDEN, WIRD EINE VERWIRRUNGSMATRIX UND EINE ROC-KURVE NUR FÜR DEN ERSTEN ZEITRAUM ERSTELLT\n    <b>Beschreibung</b></br>\n    Die Modellbewertung führt Folgendes durch</br>\n    1. Bewertet das aktuelle Datenset mit dem ausgewählten vorgefertigten Modell. Speichert die Vorhersagen mit dem angegebenen Vertrauensintervall im aktuellen Datenset unter Verwendung des angegebenen Präfixes.</br>\n    2. Erstellt optional eine Verwirrungsmatrix und eine ROC-Kurve.</br>\n    3. Im Fall, dass Sie ein Trainingsdatenset bewerten, das die abhängige Variable/zu prognostizierende Variable enthält und die abhängige Variable 2 Ebenen hat, haben Sie die Möglichkeit, die Referenzstufe/Ebene von Interesse auszuwählen.<br/>\n    4. Die Verwirrungsmatrix und die zugehörigen Statistiken werden mit der angegebenen Ebene von Interesse erstellt.<br/>\n    Siehe Details zur Funktion predict und zur Verwirrungsmatrix unten\n    <br/>\n    <br/>\n    <b>Beschreibung</b></br>\n    predict ist eine generische Funktion zur Erstellung von Vorhersagen mit dem ausgewählten Modell.\n    <br/>\n    <b>Verwendung</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argumente</b><br/>\n    <ul>\n    <li>\n    modelname: ein Modellobjekt, für das eine Vorhersage gewünscht wird.\n    </li>\n    <li>\n    prefix: Präfixzeichenfolge, die zur Erstellung neuer Variablen mit den Vorhersagen verwendet wird.\n    </li>\n    <li>\n    datasetname: ist das aktuelle Datenset, das bewertet und für die Speicherung der Vorhersagen verwendet wird.\n    </li>\n    </ul>\n    <b>Details</b></br>\n    Speichert die Vorhersagen mit dem angegebenen Vertrauensintervall im aktuellen Datenset unter Verwendung des angegebenen Präfixes.</br>\n    <b>Package</b></br>\n    stats</br>\n    <b>Hilfe</b></br>\n    Für detaillierte Hilfe klicken Sie auf das R-Symbol oben rechts in diesem Dialogfeld oder führen Sie den folgenden Befehl aus: help(predict, package ='stats') im R-Editor-Fenster\n    </br>\n    </br>\n    <b>Beschreibung</b></br>\n    Erstellt eine Verwirrungsmatrix, indem die beobachteten und vorhergesagten Klassen mit den zugehörigen Statistiken gekreuzt werden.\n    <br/>\n    <b>Verwendung</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argumente</b><br/>\n    <ul>\n    <li>\n    modelname: ein Modellobjekt, für das die Verwirrungsmatrix gewünscht wird.\n    </li>\n    <li>\n    showCofusionMatrix: logisch, wenn TRUE, wird die Verwirrungsmatrix erstellt (wenn zutreffend), wenn FALSE, wird die Verwirrungsmatrix nicht erstellt.\n    </li>\n    <li>\n    predictions: ein Objekt, das als Ergebnis des Aufrufs von predict() zurückgegeben wird.\n    </li>\n    <li>\n    datasetname: ist der aktuelle Datensetname, mit dem wir Vorhersagen machen möchten.\n    </li>\n    </ul>\n    <b>Details</b></br>\n    Zeigt die Verwirrungsmatrix mit der Funktion confusionMatrix aus dem Paket caret an.</br>\n    <b>Package</b></br>\n    caret</br>\n    <b>Hilfe</b></br>\n    Für detaillierte Hilfe klicken Sie auf das R-Symbol oben rechts in diesem Dialogfeld oder führen Sie den folgenden Befehl aus: help(confusionMatrix, package ='caret') im R-Editor-Fenster"
    }
}
