{
  "title": "Geben Sie die Ebenen an, die beibehalten oder durch andere ersetzt werden sollen",
  "navigation": "In Andere zusammenfassen (Manuell)",
  "target": "Faktorenvariablen neu anordnen",
  "label1": "Geben Sie die Faktorstufen an, die beibehalten oder durch andere ersetzt werden sollen. Wenn die zu behaltenden Stufen ausgewählt sind, werden die verbleibenden Stufen durch \"Andere\" ersetzt. Wenn Ersetzen ausgewählt ist, werden die angegebenen Stufen durch \"Andere\" ersetzt.",
  "other": "Stufenname, der für \"Andere\"-Werte verwendet wird",
  "label3": "Verwendete Methode",
  "keep": "Stufen beibehalten",
  "drop": "Stufen fallen lassen",
  "keepOption": "Geben Sie die zu behaltenden Stufen durch , getrennt ein; verbleibende Stufen werden durch \"Andere\" ersetzt, z.B. stufe1,stufe2,stufe3",
  "dropOption": "Geben Sie die Stufen an, die durch \"Andere\" ersetzt werden sollen, z.B. stufe1,stufe2,stufe3",
  "label2": "Ergebnisse in neue Variable(n) speichern oder bestehende Variable(n) überschreiben",
  "rd3": "Geben Sie ein Suffix an (Eine neue Variable wird mit dem Suffix erstellt)",
  "txt3": "Geben Sie ein Suffix ein",
  "rd2": "Geben Sie ein Präfix an (Eine neue Variable wird mit dem Präfix erstellt)",
  "txt4": "Geben Sie ein Präfix ein",
  "rd1": "Bestehende Variablen überschreiben",
  "help": {
    "title": "Stufen beibehalten oder ersetzen",
    "r_help": "help(fct_other, package =forcats)",
    "body": "\n<b>HINWEIS: SCHLIESSEN SIE DIE STUFEN NICHT IN DOPPELTE ODER EINZELNE ANFÜHRUNGSZEICHEN EIN, ES DARF KEINE PLATZHALTER IN DEN STUFENNAMEN GEBEN. GEBEN SIE DIE STUFEN GETRENNT DURCH KOMMATA IM FORMAT STUFE1,STUFE2, STUFE3 EIN</b><br/>\n<b>Beschreibung</b></br>\nGeben Sie die Faktorstufen an, die beibehalten oder fallen gelassen werden sollen. Wenn Behalten ausgewählt ist, werden die verbleibenden Stufen durch \"Andere\" ersetzt. Wenn Fallenlassen ausgewählt ist, werden die fallengelassenen Stufen durch \"Andere\" ersetzt.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nfct_other(f, keep, drop, other_level = \"Andere\")\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nf : Ein Faktor (oder Zeichenvektor).\n</li>\n<li>\nkeep, drop: keep bewahrt die aufgelisteten Stufen und ersetzt alle anderen durch other_level. drop ersetzt die aufgelisteten Stufen durch other_level und behält alle anderen bei.\n</li>\n<li>\nother_level: Wert der Stufe, der für \"andere\" Werte verwendet wird. Immer am Ende der Stufen platziert.\n</li>\n</ul>\n<b>Beispiele</b></br>\n<code>\nx <- factor(rep(LETTERS[1:9], times = c(40, 10, 5, 27, 1, 1, 1, 1, 1)))<br/>\nfct_other(x, keep = c(\"A\", \"B\"))<br/>\nfct_other(x, drop = c(\"A\", \"B\"))<br/>\n</code> <br/>\n<b>Paket</b></br>\nforcats</br>\n<b>Hilfe</b></br>\nhelp(fct_other, package =forcats)\n    "
  }
}