{
  "title": "Subset-Datensatz nach Logik",
  "navigation": "Subset-Datensatz nach Logik",
  "label0": "Sie können wählen, ob Sie die Ergebnisse in einem neuen Datensatz speichern oder den vorhandenen Datensatz überschreiben möchten",
  "label1": "Optionen",
  "New": "Ergebnisse in einem neuen Datensatz speichern",
  "newdatasetname": "Geben Sie einen Datensatznamen ein",
  "Existing": "Vorhandenen Datensatz überschreiben",
  "Output": "Ergebnisse im Ausgabefenster anzeigen",
  "distinct": "Wählen Sie eindeutige Fälle aus",
  "chkbox2": "Nicht verwendete Faktorstufen entfernen",
  "subsetvars": "Wählen Sie Variablen aus, die im subsetted Datensatz enthalten sein sollen",
  "label12": "Die Subsetting-Kriterien werden auf jede Zeile angewendet, siehe Beispiele unten. \n1: Wählen Sie Zeilen aus, in denen var 1 nicht leer und var2 leer ist, geben Sie an:\n!is.na(var1) & is.na(var2) \n2: Wählen Sie Zeilen aus, in denen var1 > 30 und var 2 männlich ist, geben Sie an:\nvar1>30 & var2=='Male' \n3: Komplexe und/oder Kriterien angeben:\n(var1 !=10 & var2>20) | var3==40 \n4: Musterabgleich (xxx) oder eine exakte Übereinstimmung (abc) angeben:\n(grepl(\"xxx\",var1) ==TRUE) | var1==\"abc\" \n5: Übereinstimmung eines Teilstrings nach Position angeben: substr(var1,2,4) ==\"abc\"",
  "subsetexpression": "Geben Sie die Subsetting-Kriterien ein.",
  "help": {
    "title": "Subset-Datensatz",
    "r_help": "hilfe(filter, paket=dplyr)",
    "body": "\n            <b>Beschreibung</b></br>\nGibt einen Teil des Datensatzes zurück. Sie können die Spalten/Variablen angeben, die Sie im kleineren Datensatz möchten. Sie können auch Auswahlkriterien angeben, die auf jede Zeile des Dataframes angewendet werden.\n<br/><br/>\n<b>Ergebnisse in einem neuen Datensatz speichern:</b> Geben Sie einen neuen Datensatz an, um die subsetted Daten zu speichern\n<br/><br/>\n<b>Vorhandenen Datensatz überschreiben:</b> Dies speichert den subsetted Datensatz unter dem vorhandenen Datensatznamen\n<br/><br/>\n<b>Ergebnisse im Ausgabefenster anzeigen:</b> Dies druckt den subsetted Datensatz nur im Ausgabefenster. Der subsetted Datensatz wird nicht in einem Datensatz gespeichert.\n<br/><br/>\n<b>Ausgewählte eindeutige Fälle:</b> Dies entfernt Duplikate aus dem subsetted Datensatz. Alle Variablen müssen gleich sein, um als Duplikat betrachtet zu werden.\n<br/><br/>\n<b>Nicht verwendete Faktorstufen entfernen:</b> Dies löscht Faktorstufen, die durch das Subset ausgeschlossen wurden (d.h. nicht mehr in den Daten erscheinen).\n<br/><br/>\n<b>Wählen Sie Variablen aus, die im subsetted Datensatz enthalten sein sollen:</b> Dies ermöglicht dem Benutzer, spezifische Spalten auszuwählen, die sie im Datensatz enthalten möchten. Wenn welche angegeben sind, werden nur die angegebenen Variablen im subsetted Datensatz angezeigt. Wenn keine Variablen angegeben sind, werden alle Variablen beibehalten.\n<br/><br/>\n<b>Geben Sie die Subsetting-Kriterien ein:</b> Geben Sie die Variablenlogik an, die verwendet wird, um die Zeilen des Datensatzes zu filtern.\n<br/><br/>\n<b>R-Paket</b></br>\ndplyr<br/>  \n<b>Hilfe</b></br>\nhilfe(filter, paket=dplyr)\n"
  }
}