{
  "title": "Tabelle, Erweitert",
  "navigation": "Tabelle, Erweitert",
  "notelabel": "HINWEIS: Mindestens eine Variable muss in mindestens einem der folgenden Tests angegeben werden: ANOVA-Test, Kruskal-Wallis-Test, Median-Test, Pearson's Chi-Quadrat-Test, Fisher's exakter Test, Ordinal-Trend-Test oder kein Test",
  "anovavarslabel": "Variablen für ANOVA-Test",
  "kwvarslabel": "Variablen für Kruskal-Wallis-Test",
  "medvarslabel": "Variablen für Median-Test",
  "chisqvarslabel": "Variablen für Pearson's Chi-Quadrat-Test",
  "fishervarslabel": "Variablen für Fisher's exakten Test",
  "ordvarslabel": "Variablen für Ordinal-Trend-Test",
  "notestvarslabel": "Variablen für keinen Test",
  "bygroupvarlabel": "Gruppen zum Vergleichen",
  "stratavarlabel": "Strata (optional)",
  "tabletitlelabel": "Tabellentitel",
  "totalcolchkboxlabel": "Gesamtspalte einfügen",
  "groupvarchkboxlabel": "Gruppenvariablenname einfügen",
  "digitslabel": "Ziffern nach dem Dezimalpunkt",
  "contdigitslabel": "Kontinuierliche Werte",
  "pctdigitslabel": "Prozentsätze",
  "pvaluedigitslabel": "p-Werte",
  "simplifylabel": "Vereinfachen Sie mehrzeilige Variablenzusammenfassungen auf eine Zeile (wenn möglich)",
  "numericsimplifylabel": "Numerische Variablen",
  "categorysimplifylabel": "Kategorische Variablen",
  "ordinalsimplifylabel": "Ordinale Variablen",
  "datesimplifylabel": "Datumsvariablen",
  "labelsimplifylabel": "Verwenden Sie die letzte Ebene im Label der kategorialen Variablen",
  "conflevellabel": "Konfidenzniveau",
  "simchkboxlabel": "Simulieren Sie p-Werte für Pearson und Fisher",
  "simnumlabel": "Anzahl der Simulationen",
  "footnotechkboxlabel": "Fußnote zu Testnamen",
  "sampsizelabel": "Stichprobengröße",
  "meanlabel": "Mittelwert",
  "quantileslabel": "Quantile",
  "otherlabel": "Sonstiges",
  "nmissanylabel": "Anzahl fehlender Werte, falls vorhanden",
  "nmissalwayslabel": "Anzahl fehlender Werte, immer",
  "meansdlabel": "Mittelwert (SD)",
  "meancilabel": "Mittelwert (CI)",
  "meanselabel": "Mittelwert (SE)",
  "gmeanlabel": "Geometrischer Mittelwert",
  "gmeansdlabel": "Geometrischer Mittelwert (SD)",
  "gmeancilabel": "Geometrischer Mittelwert (CI)",
  "trimmeancilabel": "Getrimmter Mittelwert (CI)",
  "trimpctlabel": "Getrimmten Mittelwert-Prozentsatz angeben",
  "medianlabel": "Median",
  "medianq1q3label": "Median (25. %-Perzentil, 75. %-Perzentil)",
  "q1q3label": "(25. %-Perzentil, 75. %-Perzentil)",
  "iqrlabel": "Interquartilsabstand",
  "medianrangelabel": "Median (Bereich)",
  "medianmadlabel": "Median (Median Absolute Deviation)",
  "rangelabel": "Bereich",
  "minlabel": "Minimum",
  "maxlabel": "Maximum",
  "pct1label": "1. %-Perzentil (CI)",
  "pct5label": "5. %-Perzentil (CI)",
  "pct10label": "10. %-Perzentil (CI)",
  "pct25label": "25. %-Perzentil (CI)",
  "pct33label": "33 1/3 %-Perzentil (CI)",
  "pct50label": "Median (CI)",
  "pct66label": "66 2/3 %-Perzentil (CI)",
  "pct75label": "75. %-Perzentil (CI)",
  "pct90label": "90. %-Perzentil (CI)",
  "pct95label": "95. %-Perzentil (CI)",
  "pct99label": "99. %-Perzentil (CI)",
  "custquantlabel": "Benutzerdefiniertes %-Perzentil (CI)",
  "custquantvaluelabel": "%-Perzentil angeben",
  "skewnesslabel": "Schiefe",
  "kurtosislabel": "Kurtosis",
  "sumlabel": "Summe",
  "sdlabel": "SD",
  "varlabel": "Varianz",
  "gsdlabel": "Geometrischer Mittelwert SD",
  "cvlabel": "Variationskoeffizient",
  "freqlabel": "Häufigkeit",
  "freqtotallabel": "Häufigkeit/Gesamt",
  "freqpctlabel": "Häufigkeit (%)",
  "propcilabel": "Proportion (CI)",
  "ciFootNote": "Fußnote zum Konfidenzniveau",
  "help": {
    "title": "Tabelle, Erweitert",
    "r_help": "help(tableby, package ='arsenal')",
    "body": "\nDies erstellt eine Tabelle von Zusammenfassungsstatistiken innerhalb von Gruppen zum Vergleichen und eine Stratifizierungsvariable, um die Vergleiche innerhalb zu machen. Eine Spalte für jede Gruppenvariablenkategorie wird erstellt. Die Kategorien der Stratifizierungsvariablen bilden zusätzliche Zeilen für die Tabelle. Verschiedene Zusammenfassungsstatistiken und statistische Tests können angegeben werden.\n<br/><br/>\nHinweis: Daten jeder Klasse werden nur für Zusammenfassungszwecke in die Datums-Klasse umgewandelt. Ihr ursprünglicher Datensatz bleibt unverändert. Dies bedeutet auch, dass zusammengefasste Daten nur bis zum Tag genau sind.\n<br/><br/>\n<b>Gruppen zum Vergleichen:</b> Variable, die die Kategorien definiert, die verglichen werden sollen\n<br/><br/>\n<b>Variablen für ANOVA-Test:</b> Geben Sie numerische oder Datumsvariablen für Gruppenvergleiche unter Verwendung des ANOVA-Tests an\n<br/><br/>\n<b>Variablen für Kruskal-Wallis-Test:</b> Geben Sie numerische, Datums- oder ordinale Faktorvariablen für Gruppenvergleiche unter Verwendung des Kruskal-Wallis-Tests an\n<br/><br/>\n<b>Variablen für Median-Test:</b> Geben Sie numerische oder Datumsvariablen für Gruppenvergleiche unter Verwendung eines Median-Tests an\n<br/><br/>\n<b>Variablen für Pearson's Chi-Quadrat-Test:</b> Geben Sie nominale Faktor- oder ordinale Faktorvariablen für Gruppenvergleiche unter Verwendung des Pearson's Chi-Quadrat-Tests an\n<br/><br/>\n<b>Variablen für Fisher's exakten Test:</b> Geben Sie nominale Faktor- oder ordinale Faktorvariablen für Gruppenvergleiche unter Verwendung des Fisher's exakten Tests an\n<br/><br/>\n<b>Variablen für Ordinal-Trend-Test:</b> Geben Sie nominale Faktor- oder ordinale Faktorvariablen für Gruppenvergleiche unter Verwendung eines Trendtests an. Für zwei Gruppen ist dies im Wesentlichen der Cochran-Armitage-Trend-Test.\n<br/><br/>\n<b>Variablen für keinen Test:</b> Geben Sie Variablen an, die Sie nur innerhalb von Gruppen zusammenfassen möchten. Für diese Variablen werden keine statistischen Tests berechnet.\n<br/><br/>\nHinweis: Sie müssen mindestens eine Variable angeben, um eine Tabelle zu erstellen.\n<br/><br/>\n<b>Strata (optional):</b> Variable, die die Kategorien definiert, innerhalb derer die Vergleiche angestellt werden\n<br/><br/>\n<b>Tabellentitel:</b> Geben Sie den Tabellentitel an\n<br/><br/>\n<b>Gesamtspalte einfügen:</b> ob eine Gesamtspalte in die Tabelle aufgenommen wird oder nicht\n<br/><br/>\n<b>Gruppenvariablenname einfügen:</b> ob der Gruppenvariablenname in die Tabelle aufgenommen wird oder nicht\n<br/><br/>\n<b>Ziffern nach dem Dezimalpunkt:</b> Geben Sie an, wie viele Ziffern nach dem Dezimalpunkt für kontinuierliche Werte, Prozentsätze und p-Werte angezeigt werden sollen\n<br/><br/>\n<b>Vereinfachen Sie mehrzeilige Variablenzusammenfassungen auf eine Zeile (wenn möglich):</b> Für zweikategoriale kategoriale (Faktor/Ordinal) Variablen oder einzelne Zusammenfassungen von numerischen oder Datumsvariablen können Sie die Zeilen zusammenfassen, sodass alle Variablennamen und Statistiken in einer einzigen Zeile erscheinen. Die Zusammenfassungen für die letzte Kategorie jeder kategorialen Variablen werden angezeigt. Jede Variable, für die eine Zusammenfassung nicht möglich ist, nimmt mehrere Zeilen ein. Diese Option kann für jeden Variablentyp separat ein- oder ausgeschaltet werden.\n<br/><br/>\n<b>Verwenden Sie die letzte Ebene im Label der kategorialen Variablen:</b> Für vereinfachte Tabellen wird die letzte Ebene von Faktor-/Ordinalvariablen im Zeilenlabel einbezogen.\n<br/><br/>\n<b>Konfidenzniveau:</b> Dies legt das Konfidenzniveau der Konfidenzintervalle fest.\n<br/><br/>\n<b>Statistische Testoptionen</b>\n<br/><br/>\n<b>Statistische Tests:</b> Pearson- und Fisher-Simulationen bieten die Möglichkeit, simulierte p-Werte für Pearson's Chi-Quadrat-Tests und Fisher's exakte Tests zu erhalten. Dieses Verfahren erstellt Monte-Carlo-Simulationen die angegebene Anzahl von Malen (Anzahl der Simulationen). Dies kann in Fällen nützlich sein, in denen die Standardberechnungen, insbesondere für den Fisher's exakten Test, zu Computer-Speicherfehlern führen.\n<br/><br/>\n<b>Fußnote zu Testnamen:</b> ob p-Wert-Fußnoten, die die statistischen Tests für jede Variable auflisten, einbezogen werden oder nicht\n<br/><br/>\n<b>Numerische Statistikoptionen:</b>\n<br/>Statistiken, die für numerische Variablen angezeigt werden\n<br/><br/>\n<b>Kategorische Statistikoptionen:</b> \n<br/>Statistiken, die sowohl für nominale als auch für ordinale Faktoren angezeigt werden\n<br/><br/>\n<b>Datumsstatistiken:</b>\n<br/>Statistiken, die für Datumsvariablen angezeigt werden\n<br/><br/>\n<b>Hinweis:</b> Wenn Sie eine Variable eines bestimmten Typs zusammenfassen möchten, wird empfohlen, mindestens eine Statistik in dieser Kategorie auszuwählen, die nicht \"Anzahl fehlender Werte, falls vorhanden\" ist. Wenn \"Anzahl fehlender Werte, falls vorhanden\" die einzige ausgewählte Option ist und keine Variablen einen fehlenden Wert haben, tritt ein Fehler auf.\n<br/><br/>\n<b>Erforderliche R-Pakete:</b> arsenal, lubridate, dplyr, DescTools\n\t\t\t"
  }
}