{
  "title": "Varianz-Inflationsfaktoren",
  "navigation": "VIF",
  "modelselector1": "Wählen Sie ein Modell einer der folgenden Klassen (Klasse in Klammern) Lineares Modell (lm) Verallgemeinerte lineare Modelle (glm) Ordinale logistische oder Probit-Regression (polr) Multinomiale log-lineare Modelle (multinom), Cox-Regression Modelle (coxph)",
  "help": {
    "title": "Varianz-Inflationsfaktoren",
    "r_help": "help(vif, package='car')",
    "body": "\n                <b>Beschreibung</b></br>\nBerechnet Varianz-Inflations- und verallgemeinerte Varianz-Inflationsfaktoren für lineare, verallgemeinerte lineare und andere Modelle.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code> \nvif(mod, ...)\n## Standard S3-Methode:\nvif(mod, ...)\n## S3-Methode für Klasse 'merMod'\nvif(mod, ...)\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nmod: für die Standardmethode ein Objekt, das auf coef, vcov und model.matrix reagiert, wie ein lm- oder glm-Objekt.\n</li>\n<li>\n... nicht verwendet.\n</li>\n</ul>\n<b>Details</b></br>\nWenn alle Terme in einem ungewichteten linearen Modell 1 df haben, werden die üblichen Varianz-Inflationsfaktoren berechnet.</br>\nWenn irgendein Term in einem ungewichteten linearen Modell mehr als 1 df hat, werden verallgemeinerte Varianz-Inflationsfaktoren (Fox und Monette, 1992) berechnet. Diese sind interpretierbar als die Inflation in der Größe der Konfidenzellipse oder des Ellipsoids für die Koeffizienten des Terms im Vergleich zu dem, was für orthogonale Daten erhalten würde.</br>\nDie verallgemeinerten VIFs sind invariant gegenüber der Kodierung der Terme im Modell (solange der Unterraum der Spalten der Modellmatrix, der zu jedem Term gehört, invariant ist). Um die Dimension des Konfidenzellipsoids anzupassen, gibt die Funktion auch GVIF^[1/(2*df)] aus, wobei df die Freiheitsgrade sind, die mit dem Term verbunden sind.</br>\nDurch eine weitere Verallgemeinerung ist die hier implementierte Methode auch auf andere Arten von Modellen anwendbar, insbesondere gewichtete lineare Modelle, verallgemeinerte lineare Modelle und gemischte Modelle.</br>\n<b>Wert</b><br/>\nEin Vektor von VIFs oder eine Matrix, die eine Zeile für jeden Term im Modell und Spalten für den GVIF, df und GVIF^[1/(2*df)] enthält.<br/>\n<b>Beispiele</b><br/>\n<code> \n## Ein lächerliches Beispiel...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>Paket</b></br>\ncar</br>\n<b>Hilfe</b></br>\nFür detaillierte Hilfe klicken Sie auf das R-Symbol in der oberen rechten Ecke dieses Dialogüberlagerung oder führen Sie den folgenden Befehl im R-Syntax-Editor aus: help(vif, package=\"car\")\n                "
  }
}