{
  "title": "Wilcoxon Signed-Rank-Test, eine Stichprobe",
  "navigation": "Wilcoxon-Test, eine Stichprobe",
  "tvarbox1": "Ergebnis",
  "label1": "Alternativhypothese",
  "twosided": "Median != mu",
  "greater": "Median > mu",
  "less": "Median < mu",
    "label2": "Testmethode",
    "default": "Standard",
    "exact": "Genau",
    "normal": "Normale Annäherung",
    "contingency": "Normale Annäherung (Kontinuitätskorrektur)",
  "textbox1": "Konfidenzintervall",
  "textbox2": "Nullhypothese (mu)",
  "help": {
    "title": "Wilcoxon-Test, eine Stichprobe",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>Beschreibung</b></br>\nFührt ein- und zwei-Stichproben-Wilcoxon-Tests auf Datenvektoren durch; letzterer ist auch als ‘Mann-Whitney’-Test bekannt.\n<br/>\n<b>Verwendung</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Standard S3-Methode:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## S3-Methode für Klasse 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Argumente</b><br/>\n<ul>\n<li>\nx: numerischer Vektor von Datenwerten. Nicht-finite (z.B. unendliche oder fehlende) Werte werden weggelassen.\n</li>\n<li>\ny: ein optionaler numerischer Vektor von Datenwerten: wie bei x werden nicht-finite Werte weggelassen.\n</li>\n<li>\nalternative: ein Zeichenstring, der die alternative Hypothese angibt, muss einer von \"two.sided\" (Standard), \"greater\" oder \"less\" sein. Sie können nur den Anfangsbuchstaben angeben.\n</li>\n<li>\nmu: eine Zahl, die einen optionalen Parameter angibt, der zur Bildung der Nullhypothese verwendet wird. Siehe ‘Details’.\n</li>\n<li>\npaired: ein logisches, das angibt, ob Sie einen gepaarten Test wünschen.\n</li>\n<li>\nexact: ein logisches, das angibt, ob ein exakter p-Wert berechnet werden soll.\n</li>\n<li>\ncorrect: ein logisches, das angibt, ob eine Kontinuitätskorrektur in der Normalapproximation für den p-Wert angewendet werden soll.\n</li>\n<li>\nconf.int: ein logisches, das angibt, ob ein Konfidenzintervall berechnet werden soll.\n</li>\n<li>\nconf.level: Konfidenzniveau des Intervalls.\n</li>\n<li>\nformula: eine Formel der Form lhs ~ rhs, wobei lhs eine numerische Variable ist, die die Datenwerte angibt, und rhs ein Faktor mit zwei Ebenen, der die entsprechenden Gruppen angibt.\n</li>\n<li>\ndata: eine optionale Matrix oder Datenrahmen (oder ähnlich: siehe model.frame), die die Variablen in der Formel enthält. Standardmäßig werden die Variablen aus der Umgebung(formula) entnommen.\n</li>\n<li>\nsubset: ein optionaler Vektor, der eine Teilmenge von Beobachtungen angibt, die verwendet werden sollen.\n</li>\n<li>\nna.action: eine Funktion, die angibt, was geschehen soll, wenn die Daten NAs enthalten. Standardmäßig wird getOption(\"na.action\") verwendet.\n</li>\n<li>\n...: weitere Argumente, die an oder von Methoden übergeben werden sollen.\n</li>\n</ul>\n<b>Details</b></br>\nDie Formel-Schnittstelle ist nur für die 2-Stichproben-Tests anwendbar.</br>\nWenn nur x angegeben ist oder wenn sowohl x als auch y angegeben sind und paired TRUE ist, wird ein Wilcoxon-Signed-Rank-Test der Nullhypothese durchgeführt, dass die Verteilung von x (im Ein-Stichproben-Fall) oder von x - y (im gepaarten Zwei-Stichproben-Fall) symmetrisch um mu ist.</br>\nAndernfalls, wenn sowohl x als auch y angegeben sind und paired FALSE ist, wird ein Wilcoxon-Rangsummentest (äquivalent zum Mann-Whitney-Test: siehe die Anmerkung) durchgeführt. In diesem Fall ist die Nullhypothese, dass sich die Verteilungen von x und y um einen Lageverschiebung von mu unterscheiden, und die Alternative ist, dass sie sich um eine andere Lageverschiebung unterscheiden (und die einseitige Alternative \"greater\" ist, dass x nach rechts von y verschoben ist).</br>\nStandardmäßig (wenn exact nicht angegeben ist), wird ein exakter p-Wert berechnet, wenn die Stichproben weniger als 50 endliche Werte enthalten und keine Bindungen vorhanden sind. Andernfalls wird eine Normalapproximation verwendet.</br>\nOptional (wenn das Argument conf.int wahr ist), wird ein nichtparametrisches Konfidenzintervall und ein Schätzer für den Pseudomedian (Ein-Stichproben-Fall) oder für die Differenz der Lageparameter x-y berechnet. (Der Pseudomedian einer Verteilung F ist der Median der Verteilung von (u+v)/2, wobei u und v unabhängig sind, jeweils mit der Verteilung F. Wenn F symmetrisch ist, stimmen Pseudomedian und Median überein. Siehe Hollander & Wolfe (1973), Seite 34.) Beachten Sie, dass im Zwei-Stichproben-Fall der Schätzer für die Differenz der Lageparameter nicht die Differenz der Mediane schätzt (ein häufiges Missverständnis), sondern den Median der Differenz zwischen einer Stichprobe von x und einer Stichprobe von y.</br>\nWenn exakte p-Werte verfügbar sind, wird ein exaktes Konfidenzintervall durch den Algorithmus beschrieben in Bauer (1972) erhalten, und der Hodges-Lehmann-Schätzer wird verwendet. Andernfalls basieren das zurückgegebene Konfidenzintervall und der Punkteschätzer auf Normalapproximationen. Diese sind für das Intervall, aber nicht für die Schätzung kontinuierlich korrigiert (da die Korrektur von der Alternative abhängt).</br>\nBei kleinen Stichproben kann es möglicherweise nicht möglich sein, sehr hohe Konfidenzintervallabdeckungen zu erreichen. Wenn dies geschieht, wird eine Warnung ausgegeben und ein Intervall mit niedrigerer Abdeckung wird ersetzt.</br>\n<b>Wert</b><br/>\nEine Liste mit der Klasse \"htest\", die die folgenden Komponenten enthält:\nstatistic: der Wert der Teststatistik mit einem beschreibenden Namen.</br>\nparameter: die Parameter für die exakte Verteilung der Teststatistik.</br>\np.value: der p-Wert für den Test.</br>\nnull.value: der Lageparameter mu.</br>\nalternative: ein Zeichenstring, der die alternative Hypothese beschreibt.</br>\nmethod: die Art des angewandten Tests.</br>\ndata.name: ein Zeichenstring, der die Namen der Daten angibt.</br>\nconf.int: ein Konfidenzintervall für den Lageparameter. (Nur vorhanden, wenn das Argument conf.int = TRUE.)</br>\nestimate: eine Schätzung des Lageparameters. (Nur vorhanden, wenn das Argument conf.int = TRUE.)</br>\n<b>Paket</b></br>\nstats</br>\n<b>Hilfe</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}