{
  "title": "BIC",
  "navigation": "BIC",
  "modelselector1": "다음 클래스 중 하나의 모델을 선택하십시오 (괄호 안의 클래스) 선형 모델 (lm) 일반화 선형 모델 (glm) 순서형 로지스틱 또는 프로빗 회귀 (polr) 다항 로지스틱 회귀 모델 (multinom)",
  "help": {
    "title": "BIC",
    "r_help": "help(BIC,package='stats')",
    "body": "\n                <b>설명</b></br>\n일반 함수로, 로그 우도 값을 얻을 수 있는 하나 이상의 적합된 모델 객체에 대해 아카이케의 ‘정보 기준’을 계산합니다. 공식은 -2*로그 우도 + k*npar이며, 여기서 npar는 적합된 모델의 매개변수 수를 나타내고, k = 2는 일반적인 AIC에 해당하며, k = log(n) (n은 관측치 수)인 경우는 BIC 또는 SBC (슈바르츠의 베이지안 기준)에 해당합니다.\n<br/>\n<b>사용법</b>\n<br/>\n<code> \nAIC(object, ..., k = 2)\nBIC(object, ...)\n</code> <br/>\n<b>인수</b><br/>\n<ul>\n<li>\nobject: 로그 우도를 추출할 수 있는 logLik 메서드가 있는 적합된 모델 객체 또는 logLik 클래스에서 상속된 객체입니다.\n</li>\n<li>\n... 선택적으로 더 많은 적합된 모델 객체.\n</li>\n<li>\nk: 매개변수당 사용할 패널티; 기본값 k = 2는 고전적인 AIC입니다.\n</li>\n</ul>\n<b>세부사항</b></br>\n최대 우도로 적합된 모델을 동일한 데이터에 대해 비교할 때, AIC 또는 BIC가 작을수록 적합도가 더 좋습니다.\nAIC 이론은 로그 우도가 최대화되었음을 요구합니다: AIC는 최대 우도로 적합되지 않은 모델에 대해서도 계산할 수 있지만, 그들의 AIC 값은 비교해서는 안 됩니다.</br>\n동일한 데이터에 ‘적합되지 않은’ 모델의 예는 반응이 변환된 경우 (가속 수명 모델이 로그 시간에 적합됨)와 데이터 요약에 사용된 교차표가 있는 경우입니다.</br>\n이들은 일반 함수입니다 (패키지 stats4에서 정의된 S4 제네릭 포함): 그러나 메서드는 이러한 함수가 아닌 로그 우도 함수 logLik에 대해 정의되어야 합니다: 기본 메서드의 작용은 제공된 모든 객체에 대해 logLik을 호출하고 결과를 조합하는 것입니다. 여러 일반적인 경우에서 logLik은 MLE에서 값을 반환하지 않음을 유의하십시오: 그 도움말 페이지를 참조하십시오.</br>\n로그 우도 및 따라서 AIC/BIC는 덧셈 상수까지 정의됩니다. 서로 다른 목적을 위해 서로 다른 상수가 관례적으로 사용되었으며, 따라서 extractAIC 및 AIC는 서로 다른 값을 제공할 수 있습니다 (그리고 \"lm\" 클래스의 모델에 대해 다릅니다: extractAIC에 대한 도움말을 참조하십시오). 서로 다른 클래스의 적합도를 비교할 때 특히 주의가 필요합니다 (예를 들어, 포아송과 감마 GLM의 비교는 의미가 없습니다. 하나는 이산 반응을 가지고, 다른 하나는 연속적입니다).</br>\nBIC는 AIC(object, ..., k = log(nobs(object)))로 정의됩니다. 이는 관측치 수를 알아야 합니다: 기본 메서드는 먼저 logLik 메서드의 반환 값에서 \"nobs\" 속성을 찾고, 그 다음 nobs 제네릭을 시도하며, 둘 다 성공하지 않으면 BIC를 NA로 반환합니다.</br>\n<b>값</b><br/>\n하나의 객체만 제공되면, 해당 AIC (또는 BIC, 또는 ..., k에 따라)와 함께 숫자 값이 반환됩니다.\n여러 객체가 제공되면, 객체에 해당하는 행과 모델의 매개변수 수 (df) 및 AIC 또는 BIC를 나타내는 열이 있는 데이터 프레임이 반환됩니다.<br/>\n<b>예제</b><br/>\n<code> \nlm1 <- lm(Fertility ~ . , data = swiss)</br>\nAIC(lm1)</br>\nstopifnot(all.equal(AIC(lm1),<br/>\n                    AIC(logLik(lm1))))<br/>\nBIC(lm1)</br>\nlm2 <- update(lm1, . ~ . -Examination)</br>\nAIC(lm1, lm2)</br>\nBIC(lm1, lm2)</br>\n</code> <br/>\n<b>패키지</b></br>\nstats</br>\n<b>도움말</b></br>\n자세한 도움말은 이 대화 오버레이의 오른쪽 상단에 있는 R 아이콘을 클릭하거나 R 구문 편집기에서 다음 명령을 실행하십시오: help(BIC,package='stats')\n                "
  }
}