{
  "title": "콕스, 고급",
  "navigation": "콕스, 고급",
  "helplabel": "샘플 데이터 세트 및 지원되는 데이터 형식에 대한 세부정보는 대화 상자의 오른쪽 상단에 있는 ? 버튼을 클릭하십시오.",
  "modelname": "모델 이름 입력",
  "timevar": "사건 발생 또는 검열까지의 시간",
  "eventvar": "사건 (1 = 사건 1, 0 = 검열)",
  "modelterms": "독립 변수에 대한 모델 표현식 빌더",
  "weightvar": "가중치 (선택 사항)",
  "tiemethod": "동시 시간 방법",
  "forestplotbox": "포레스트 플롯",
  "diagnosticsbox": "모델 진단",
  "martscalebox": "영 모델 마틴게일 잔차 축 최소값 (-Inf에서 1까지):",
  "devbox": "편차 분석 (유형 II)",
  "devtype": "검정 통계량",
  "help": {
    "title": "콕스, 고급",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n\t\t\t설치 디렉토리의 샘플 데이터 세트를 참조하십시오. 기본 위치는 드라이브 문자:&bsol;program files&bsol;BioStat Prime&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData입니다. 변수 Followup_time은 사건 발생 또는 검열까지의 시간으로 입력해야 하며, 변수 Event는 사건 (1 = 사건, 0 = 검열)으로 입력해야 합니다. 성별, 나이 및 BMI는 독립 변수가 될 수 있습니다. \n\t\t\t<br/>\n\t\t\t이 데이터 세트는 arsenal 패키지의 mockstudy 데이터 세트의 업데이트된 버전입니다.\n\t\t\t<br/><br/>\n            <b>콕스 비례 위험 모델</b>\n            <br/>\n            <br/>\n            검열된 관측값이 있는 사건 발생 데이터에 대한 콕스 비례 위험 모델을 적합합니다. 모델 적합 통계, 매개변수 추정 및 위험 비율이 제공됩니다. 사용 가능한 옵션에는 동시 시간 방법, 비례 위험 및 공변량 함수 형태 평가와 같은 모델 진단, 신뢰 구간이 있는 위험 비율의 포레스트 플롯이 포함됩니다. 모델은 survival 패키지의 coxph 함수를 사용하여 적합됩니다.\n            <br/>\n            <br/>\n            <b>시간:</b> 사건을 경험한 사람의 사건 발생까지의 시간 또는 사건을 경험하지 않은 사람의 마지막 추적까지의 시간\n            <br/><br/>\n            <b>사건:</b> 숫자 사건 지표; 1=사건, 0=검열\n            <br/><br/>\n            <b>독립 변수:</b> 모델에 포함할 독립 변수. 요인, 문자열 및 논리 변수는 더미로 코딩됩니다.\n            <br/><br/>\n            <b>가중치:</b> 관측 가중치에 대한 숫자 변수. 각 기록이 하나의 관측값으로 계산되지 않아야 하는 상황에서 유용합니다. \n            <br/>\n            <br/>\n            <b>필요한 패키지:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            coxph 함수에 대한 자세한 R 도움말을 얻으려면 R 도움말 가져오기 버튼을 클릭하십시오.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>옵션</b>\n            <br/>\n            <br/>\n            <b>동시 시간 방법:</b>\n            <br/>\n            동시 관측된 시간의 방법. Efron은 동시 시간이 많지 않을 때 일반적으로 더 나은 선택입니다. 정확한 방법은 동시 시간이 많은 경우, 즉 이산 시간 상황에서 유용할 수 있지만 모델을 적합하는 데 시간이 더 걸릴 수 있습니다. \n            <br/>\n            <br/>\n            <b>포레스트 플롯:</b>\n            <br/>\n            모델의 각 예측 변수에 대한 위험 비율 및 신뢰 구간의 플롯.\n            <br/>\n            <br/>\n            <b>모델 진단:</b>\n            <br/>\n            선택한 경우, 비례 위험 테스트 및 플롯이 제공되며, 모델의 각 공변량에 대한 함수 형태 평가가 추가로 제공됩니다. 영 모델 마틴게일 잔차 축 최소값 옵션은 모든 잔차가 플롯에 나타나도록 변경해야 할 수 있습니다. 함수 형태 평가를 얻으려면 숫자 예측 변수만 지정하고 누락된 데이터가 없어야 합니다. 변수 > 누락된 값 > NA 제거를 참조하십시오.\n            <br/>\n            <br/>\n            <b>편차 분석 (유형 II):</b>\n            모델의 각 예측 변수에 대한 전역 테스트. 2개 이상의 수준을 가진 효과에 대해 다중 자유도 테스트가 제공됩니다. Wald 및 우도 비율 테스트를 얻을 수 있으며, 우도 비율 테스트는 작은 샘플 속성이 더 좋습니다.\n            \n      "
  }
}