{
  "title": "일반화 선형 모델",
  "navigation": "GLZM",
  "modelname": "모델 이름",
  "dependent": "종속 변수",
  "offset": "오프셋",
  "weights": "가중치",
  "formulaBuilder": "수식 작성기",
  "family": "가족 및 링크 함수를 선택하세요",
  "theta": "세타의 값을 지정하세요 (음의 이항 가족에만 적용됨)",
  "expCoefficients": "계수를 지수화합니다",
  "help": {
    "title": "일반화 선형 모델",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>설명</b></br>\n            glm은 선형 예측기의 기호적 설명과 오류 분포의 설명을 제공하여 일반화 선형 모델을 적합하는 데 사용됩니다.\n            <br/>\nNOTE 1: 세타의 초기 값을 지정하기 위한 텍스트 상자가 제공되며, 이는 음의 이항 가족에만 적용됩니다. 생략할 경우 포아송 GLM을 사용한 초기 적합 후 모멘트 추정기가 사용됩니다.<br/>\n계산된 초기 세타는 GLM 요약 테이블 위의 출력에 표시됩니다.<br/>\nNOTE 2: 가중치를 포함하는 변수를 지정할 때, 모델을 구축하기 위해 na.exclude 옵션을 사용하므로 모든 NA 값이 종속 및 독립 변수에서 자동으로 제거됩니다.<br/> \n이로 인해 NA 값이 가중 변수에서 자동으로 제거되지 않으므로 불일치가 발생할 수 있습니다. <br/>\n이 경우 '변수 길이가 다릅니다 (가중치에 대해 발견됨)'라는 오류가 표시됩니다.<br/>\n이 오류를 해결하려면 변수 > 누락된 값 > NA 제거로 이동하여 종속, 독립 변수 및 가중 변수를 선택하여 누락된 값을 제거하고 모델을 다시 구축하세요.<br/>\nNOTE 3: 더미 코드 팩터 변수를 사용할 때 음의 이항 가족을 사용할 경우, 변수 > 계산 > 더미 코드 참조.<br/>\nNOTE 4: 기본적으로 절편이 포함되며, 절편을 제거하려면 수식 작성기에 -1을 입력하세요.\n            <br/>\n            <b>사용법</b>\n            <br/>\n            <code> \n            glm(formula, family = gaussian, data, weights, subset,\n                na.action, start = NULL, etastart, mustart, offset,\n                control = list(...), model = TRUE, method = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>인수</b><br/>\n            <ul>\n            <li>\n            formula: 적합할 모델의 기호적 설명을 포함하는 \"formula\" 클래스의 객체 (또는 해당 클래스로 변환할 수 있는 객체).\n            </li>\n            <li>\n            family: 모델에서 사용할 오류 분포 및 링크 함수에 대한 설명. glm의 경우, 이는 가족 함수를 지정하는 문자열, 가족 함수 또는 가족 함수 호출의 결과일 수 있습니다. glm.fit의 경우 세 번째 옵션만 지원됩니다. (가족 함수에 대한 세부정보는 family를 참조하세요.)\n            </li>\n            <li>\n            data: 모델의 변수를 포함하는 선택적 데이터 프레임, 리스트 또는 환경 (또는 as.data.frame에 의해 데이터 프레임으로 변환 가능한 객체).\n            </li>\n            <li>\n            weights: 적합 과정에서 사용할 '사전 가중치'의 선택적 벡터. NULL 또는 숫자 벡터여야 합니다.\n            </li>\n            <li>\n            subset: 적합 과정에서 사용할 관측치의 하위 집합을 지정하는 선택적 벡터.\n            </li>\n            <li>\n            na.action: 데이터에 NA가 포함될 때 발생해야 할 일을 나타내는 함수. 기본값은 옵션의 na.action 설정에 의해 설정되며, 설정되지 않은 경우 na.fail입니다. '공장 초기화' 기본값은 na.omit입니다. 다른 가능한 값은 NULL, 즉 아무 작업도 하지 않는 것입니다. na.exclude 값이 유용할 수 있습니다.\n            </li>\n            </ul>\n            <b>세부정보</b><br/>\n            일반적인 예측자는 response ~ terms 형식을 가지며, 여기서 response는 (숫자) 응답 벡터이고 terms는 응답에 대한 선형 예측기를 지정하는 일련의 항목입니다. 이항 및 쿼사이 이항 가족의 경우 응답은 또한 실패를 나타내는 첫 번째 수준과 모든 성공을 나타내는 두 번째 수준으로 지정할 수 있습니다. terms 사양의 형태 first + second는 첫 번째의 모든 항목과 두 번째의 모든 항목을 포함하며 중복 항목은 제거됩니다.<br/>\n            <b>값</b><br/>\n            \"glm\" 클래스의 객체는 다음 구성 요소를 포함하는 리스트입니다:\n            <ul>\n            <li>\n            coefficients: 이름이 지정된 계수 벡터\n            </li>\n            <li>\n            residuals: 작업 잔차, 즉 IWLS 적합의 최종 반복에서의 잔차. 가중치가 0인 경우는 생략되므로 해당 작업 잔차는 NA입니다.\n            </li>\n            <li>\n            fitted.values: 링크 함수의 역변환을 통해 얻은 적합된 평균 값.\n            </li>\n            <li>\n            rank: 적합된 선형 모델의 숫자 순위.\n            </li>\n            <li>\n            family: 사용된 가족 객체.\n            </li>\n            <li>\n            linear.predictors: 링크 스케일에서의 선형 적합.\n            deviance: 상수에 따라 다르며, 최대화된 로그 우도에 대해 두 배로 감소합니다. 합리적인 경우, 상수는 포화 모델이 deviance가 0이 되도록 선택됩니다.\n            </li>\n            <li>\n            aic\t: 아카이케 정보 기준의 버전으로, 최대화된 로그 우도에 대해 두 배로 감소하고 매개변수 수에 대해 두 배로 증가합니다. 이 값은 가족의 aic 구성 요소를 통해 계산됩니다. 이항 및 포아송 가족의 경우 분산은 1로 고정되며 매개변수 수는 계수 수입니다. 가우시안, 감마 및 역 가우시안 가족의 경우 분산은 잔차 deviance에서 추정되며 매개변수 수는 계수 수에 1을 더한 것입니다. 가우시안 가족의 경우 분산의 MLE가 사용되므로 이는 유효한 AIC 값이지만 감마 및 역 가우시안 가족의 경우는 아닙니다. 준우도에 의해 적합된 가족의 경우 값은 NA입니다.\n            </li>\n            </ul>\n            <b>패키지</b></br>\nglm</br>\n<b>도움말</b></br>\nhelp(glm, package ='stats')\n"
  }
}