{
  "title": "우도 비율 및 플롯 베타",
  "navigation": "우도 비율 및 플롯 베타",
  "label1": "모델 선택 (Rm, dRm 및 eRm 클래스의 모델이 지원됩니다)",
  "label1b": "사용 가능한 모델이 없으면 먼저 모델 적합 -> IRT -> 간단한 Rasch 모델을 선택하고 CML 추정을 선택하여 모델을 생성해야 합니다.",
  "modelselector1": "모델 선택",
  "spcr": "분할 기준",
  "destination": "베타를 플롯할 변수를 선택하세요",
  "help": {
    "title": "우도 비율 및 플롯 베타",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>설명</b></br>\n                이 LR-테스트는 주제 하위 그룹 분할을 기반으로 합니다.\n<br/>\n<b>사용법</b>\n<br/>\n<code> \n## S3 메서드 클래스 'Rm'에 대한\n<br/>\nLRtest(object, splitcr = \"median\", se = TRUE)\n<br/>\n## S3 메서드 클래스 'LR'에 대한\n<br/>\nplotGOF(x, beta.subset = \"all\", main = \"그래픽 모델 확인\", xlab, ylab,\n    tlab = \"항목\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>인수</b><br/>\n<ul>\n<li>\nobject: 클래스 \"Rm\"의 객체입니다.\n</li>\n<li>\nsplitcr: 주제 원시 점수 분할을 위한 분할 기준입니다. \"all.r\"는 전체 원시 점수 분할에 해당하고, \"median\"은 중앙값을 분할 기준으로 사용하며, \"mean\"은 평균 분할을 수행합니다. 선택적으로 splitcr는 각 사람을 특정 하위 그룹에 할당하는 벡터일 수도 있습니다 (예: 외부 기준을 따르는 경우). 이 벡터는 숫자, 문자 또는 팩터일 수 있습니다.\n</li>\n<li>\nse: 하위 모델에서 표준 오차 계산을 제어합니다 (기본값: TRUE)\n</li>\n<li>\nx: 클래스 \"LR\"의 객체입니다. 단일 항목의 적합성을 시각화하는 데에도 사용됩니다.\n</li>\n<li>\nbeta.subset: \"all\"이면 모든 항목이 플롯됩니다. 그렇지 않으면 숫자 하위 집합 벡터를 지정할 수 있습니다.\n</li>\n<li>\ntlab: 항목 레이블의 사양: \"item\"은 항목 이름을 인쇄하고, \"number\"는 베타 매개변수의 순서에 해당하는 정수를 제공합니다. \"none\"은 레이블을 인쇄하지 않습니다. \"identify\"는 대화형 레이블을 허용합니다. 처음에는 레이블이 인쇄되지 않으며, 항목 포인트 근처를 클릭하면 해당 레이블이 추가됩니다. 식별 프로세스는 두 번째 버튼을 클릭하고 메뉴에서 '중지'를 선택하거나 그래픽 창의 '중지' 메뉴에서 선택하여 종료됩니다. 자세한 정보와 기본 작업은 identify를 참조하십시오.\n</li>\n<li>\nconf: 항목 매개변수에 대한 신뢰 타원을 플롯합니다. conf = NULL (기본값)인 경우 타원이 그려지지 않습니다. 그렇지 않으면, conf는 선택적 요소가 포함된 목록으로 지정해야 합니다: gamma는 신뢰 수준(숫자), col 및 lty는 색상 및 선 유형(see par), 타원이 그려질 항목을 지정하는 (숫자 인덱스 벡터) beta.subset의 하위 집합이어야 하며, ia는 타원이 대화형으로 그려질지 여부를 나타내는 논리값입니다 (cf., tlab = \"identify\" 위). 기본 동작에 대한 자세한 내용은 아래의 세부정보 및 예제를 참조하십시오. conf를 사용하려면 LRtest()에서 se = TRUE 옵션을 사용하여 생성된 LR 객체 x가 있어야 합니다. 자세한 내용은 help(MLoef)를 참조하십시오.\n</li>\n</ul>\n<b>세부정보</b></br>\n데이터 세트에 결측값이 포함되어 있고 중앙값 또는 평균이 분할 기준으로 지정된 경우, 결측값 하위 그룹에 대해 평균 또는 중앙값이 계산되고 그에 따라 원시 점수 분할에 사용됩니다.\n<br/>\n단일 포인트의 레이블 지정(tlab = \"identify\") 및 특정 포인트에서 신뢰 타원 그리기(ia = TRUE)를 위한 대화형 선택을 사용하는 경우, 먼저 모든 플롯된 포인트에 레이블이 지정되고 그 후 모든 타원이 생성됩니다. 두 식별 프로세스는 두 번째(오른쪽) 마우스 버튼을 클릭하고 메뉴에서 '중지'를 선택하거나 그래픽 창의 '중지' 메뉴에서 선택하여 종료할 수 있습니다.\n<br/>\n특정 항목에 대해서만 타원을 선택적으로 그릴 수 있는 사양을 사용하여, 예를 들어, which = 1:3은 항목 1에서 3까지의 타원을 그립니다 (이들이 beta.subset에 포함되어 있는 한). 기본값은 모든 항목에 대한 타원을 그리는 것입니다. conf 목록의 col 요소는 \"blue\"와 같은 단일 색상 사양이거나 모든 항목에 대한 색상 사양 벡터일 수 있습니다. 길이는 그려질 타원의 수와 같아야 합니다. 색상 사양을 위해 표준 팔레트를 사용하여 팔레트를 설정할 수 있습니다 (예: rainbow) 또는 colorspace 또는 RColorBrewer 패키지의 팔레트를 사용할 수 있습니다. 아래에 예제가 제공됩니다.\n<br/>\nLR 클래스 객체에 대한 summary 및 print 메서드가 제공됩니다.\n<br/><br/>\n<b>값</b><br/>\nLRtest는 다음을 포함하는 LR 클래스의 객체를 반환합니다:\n<br/><br/>\nLR: LR 값.\n<br/>\ndf: 테스트 통계의 자유도.\n<br/>\nChisq: 해당 df와 함께하는 카이제곱 값.\n<br/>\n<br/>\n<b>패키지</b></br>\neRm\n<br/><br/>\n<b>도움말</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}