{
  "title": "데이터셋 병합",
  "navigation": "병합(구버전)",
  "description": "데이터셋 병합은 2개의 데이터셋을 함께 결합하는 데 도움이 됩니다. 기본적으로 이 대화 상자는 2개의 데이터셋 내에서 공통 변수 이름을 찾고 전체 공통 변수 집합에 대해 병합합니다.",
  "out": "병합된 데이터셋의 이름을 입력하세요",
  "in1": "첫 번째 데이터셋 선택",
  "in2": "두 번째 데이터셋 선택",
  "label1": "병합 옵션",
  "leftjoin": "왼쪽 조인 (첫 번째 데이터셋의 행만 유지)",
  "rightjoin": "오른쪽 조인 (두 번째 데이터셋의 행만 유지)",
  "innerjoin": "내부 조인 (두 데이터셋에 공통된 행 유지)",
  "fulljoin": "전체 조인 (두 데이터셋의 모든 행 유지)",
  "label2": "모든 공통 열 이름에 대해 수행되는 병합을 재정의합니다",
  "by": "모든 공통 열 이름에 대해 수행되는 병합의 기본 설정을 재정의하려면 아래에 공통 열 이름의 하위 집합을 입력하세요, 예: country,region. 입력된 공통 열 이름에 대해서만 병합이 수행됩니다. 이 목록을 쉼표로 구분된 값으로 형식화하세요, 예: A,B,C",
  "label3": "병합이 수행되는 열 이름이 각 데이터셋에서 다를 경우",
  "byDiffNames": "일치하는 열 이름을 쉼표로 구분하여 입력하세요, 예: 'C'='D', 'B'='A'. 여기서는 단일 인용부호(')를 사용하세요.",
  "label4": "두 데이터셋 모두에 공통 열 이름이 있는 경우",
  "suffix": "기본적으로, .x 및 .y가 공통 변수의 접미사로 사용됩니다. 이를 변경하려면 여기에서 쉼표로 구분하여 입력하세요, 예: 1,2. 모든 .은 출력 데이터셋에서 _로 대체됩니다.",
  "advOptions": "고급 옵션",
  "help": {
    "title": "데이터셋 병합",
    "r_help": "help(join, package=dplyr)",
    "body": "\n            <b>설명</b></br>\n            데이터셋 병합은 2개의 데이터셋을 함께 결합하는 데 도움이 됩니다. 기본적으로 이 대화 상자는 2개의 데이터셋 내에서 공통 변수 이름을 찾고 전체 공통 변수 집합에 대해 병합합니다.<br/> 특정 변수 집합에 대해 병합하려면 고급 메뉴에서 이를 지정할 수 있습니다.<br/>\n            inner_join: y에 일치하는 값이 있는 x의 모든 행과 x 및 y의 모든 열을 반환합니다. x와 y 사이에 여러 일치가 있는 경우, 모든 일치의 조합이 반환됩니다.</br>\n            left_join: x의 모든 행과 x 및 y의 모든 열을 반환합니다. y에 일치하지 않는 x의 행은 새 열에 NA 값을 가집니다. x와 y 사이에 여러 일치가 있는 경우, 모든 일치의 조합이 반환됩니다.</br>\n            right_join: y의 모든 행과 x 및 y의 모든 열을 반환합니다. x에 일치하지 않는 y의 행은 새 열에 NA 값을 가집니다. x와 y 사이에 여러 일치가 있는 경우, 모든 일치의 조합이 반환됩니다.</br>\n            full_join: x와 y의 모든 행과 모든 열을 반환합니다. 일치하는 값이 없는 경우, 누락된 값에 대해 NA를 반환합니다.</br>\n            <b>사용법</b>\n            <br/>\n            <code> \n            left_join(x, y, by = c(NULL), suffix = c(\".x\", \".y\"), ...)\n            right_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            inner_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            full_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            </code> <br/>\n            <b>인수</b><br/>\n            <ul>\n            <li>\n            x: 결합할 데이터셋\n            </li>\n            <li>\n            y: 결합할 데이터셋\n            </li>\n            <li>\n            by: 결합할 변수를 나타내는 문자 벡터. NULL인 경우 기본값으로 *_join()은 두 테이블 간의 공통 이름을 가진 모든 변수를 사용하여 자연 조인을 수행합니다. 변수가 올바른지 확인할 수 있도록 메시지가 나열됩니다 (메시지를 억제하려면 결합할 변수를 명시적으로 나열하면 됩니다). x와 y에서 서로 다른 변수로 결합하려면 이름이 지정된 벡터를 사용하세요. 예를 들어, by = c(\"a\" = \"b\")는 x.a를 y.b에 일치시킵니다.\n            </li>\n            <li>\n            suffix: x와 y에 비결합 중복 변수가 있는 경우, 이러한 접미사가 출력에 추가되어 구분됩니다. 길이가 2인 문자 벡터여야 합니다.\n            </li>\n            </ul>\n            <b>값</b><br/>\n            티블.<br/>\n            <b>패키지</b></br>\n            dplyr</br>\n            <b>도움말</b></br>\n            자세한 도움말은 이 대화 상자 오버레이의 오른쪽 상단에 있는 R 아이콘을 클릭하거나 다음 명령을 실행하여 help(left_join, package=\"dplyr\")를 실행하여 R 코드 청크를 생성하세요."
  }
}