{
  "title": "ANOVA, um caminho com blocos aleatórios",
  "navigation": "ANOVA, 1 via (blocos aleatórios)",
  "tvarbox1": "Variável de Resposta",
  "tvarbox2": "Efeito Fixo",
  "blockVar": "Variável(is) de Bloqueio",
  "Post_hoc": "Análise post-hoc",
  "chk1": "Histograma dos resíduos",
  "help": {
    "title": "ANOVA, um caminho com blocos aleatórios",
    "r_help": "help(lmer, package ='lme4')",
    "body": "\n<b>Descrição</b></br>\nAjuste um modelo linear de efeitos mistos (LMM) aos dados, via REML ou máxima verossimilhança.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nlmer(formula, data = NULL, REML = TRUE, control = lmerControl(),\n        start = NULL, verbose = 0L, subset, weights, na.action,\n        offset, contrasts = NULL, devFunOnly = FALSE, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nformula: um objeto de fórmula linear de dois lados descrevendo tanto a parte de efeitos fixos quanto a parte de efeitos aleatórios do modelo, com a resposta à esquerda de um operador ~ e os termos, separados por operadores +, à direita. Os termos de efeitos aleatórios são distinguidos por barras verticais (|) separando expressões para matrizes de design de fatores de agrupamento. Duas barras verticais (||) podem ser usadas para especificar múltiplos efeitos aleatórios não correlacionados para a mesma variável de agrupamento. (Devido à forma como é implementado, a sintaxe || funciona apenas para matrizes de design contendo preditores numéricos (contínuos); para ajustar modelos com efeitos categóricos independentes, veja dummy ou a função lmer_alt do pacote afex.)\n</li>\n<li>\ndata: um quadro de dados opcional contendo as variáveis nomeadas na fórmula. Por padrão, as variáveis são retiradas do ambiente de onde lmer é chamado. Embora os dados sejam opcionais, os autores do pacote recomendam fortemente seu uso, especialmente ao aplicar métodos como update e drop1 ao modelo ajustado (tais métodos não são garantidos para funcionar corretamente se os dados forem omitidos). Se os dados forem omitidos, as variáveis serão retiradas do ambiente da fórmula (se especificada como uma fórmula) ou do quadro pai (se especificada como um vetor de caracteres).\n</li>\n<li>\nREML: escalar lógico - As estimativas devem ser escolhidas para otimizar o critério REML (em oposição à log-verossimilhança)?\nna.action: uma função que indica o que deve acontecer quando os dados contêm NAs. A ação padrão (na.omit, herdada do valor 'fábrica nova' de getOption(\"na.action\")) remove quaisquer observações com valores ausentes em quaisquer variáveis.\n</li>\n</ul>\n<b>Valor</b></br>\nUm objeto da classe merMod (mais especificamente, um objeto da subclasse lmerMod), para o qual muitos métodos estão disponíveis (por exemplo, methods(class=\"merMod\"))</br>\n<b>Pacote</b></br>\nlme4</br>\n<b>Ajuda</b></br>\nhelp(lmer, package ='lme4')</br></br>\n<b>Descrição</b></br>\nMétodos de Descrição para a Função anova no Pacote lmerTest\n<br/>\n<b>Uso</b>\n<br/>\n<code> \n## Método S4 para assinatura 'merModLmerTest' anova(object, ... , ddf=\"Satterthwaite\", type=3)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: objeto da classe \"merModLmerTest\" ... objeto da classe \"merModLmerTest\". Então a estatística de comparação do modelo será calculada\n</li>\n<li>\nddf: Por padrão, a aproximação de Satterthwaite para graus de liberdade é calculada. Se ddf=\"Kenward-Roger\", então a aproximação de Kenward-Roger é calculada usando a função KRmodcomp do pacote pbkrtest. Se ddf=\"lme4\" então a tabela anova que vem do pacote lme4 é retornada.\n</li>\n<li>\nTipo: tipo de hipótese a ser testada. Pode ser type=3 ou type=2 ou type = 1 (A definição vem da teoria SAS) Detalhes De acordo com (Goodnight, J.H. 1976) o comportamento da hipótese tipo 3 não é totalmente estudado para as situações com células ausentes (onde as observações estão ausentes em alguma combinação de nível de fator). Um aviso é retornado em tais casos.\n</li>\n</ul>\n<b>Detalhes</b></br>\nDe acordo com (Goodnight, J.H. 1976) o comportamento da hipótese tipo 3 não é totalmente estudado para as situações com células ausentes (onde as observações estão ausentes em alguma combinação de nível de fator). Um aviso é retornado em tais casos.</br>\n<b>Pacote</b></br>\nlme4;lmerTest;rcompanion;ggplot2;multcomp</br>\n<b>Ajuda</b></br>\nhttps://cran.r-project.org/web/packages/lmerTest/lmerTest.pdf</br>\nhelp(nagelkerke, package ='rcompanion')</br>\nhelp(emmeans,package=\"cld\")</br>\nhelp(cld,package='emmeans')</br>\n<b>Material de referência</b></br>\nhttp://rcompanion.org/handbook/I_07.html\n"
  }
}