{
  "title": "ANOVA, um caminho com blocos",
  "navigation": "ANOVA, 1 caminho com blocos",
  "tvarbox1": "Variável de resposta (uma)",
  "tvarbox2": "Efeito fixo",
  "blockVar": "Variável(is) de bloqueio",
  "chk1": "Histograma dos resíduos",
  "chk2": "Análise post-hoc",
  "help": {
    "title": "ANOVA, um caminho com blocos",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>Descrição</b></br>\nTabelas ANOVA para Vários Modelos Estatísticos​\nCalcula tabelas de análise de variância tipo-II ou tipo-III para objetos de modelo produzidos por lm, glm, multinom (no pacote nnet), polr (no pacote MASS), coxph (no pacote survival), coxme (no pacote coxme), svyglm (no pacote survey), rlm (no pacote MASS), lmer no pacote lme4, lme no pacote nlme, e (pelo método padrão) para a maioria dos modelos com um preditor linear e coeficientes assintoticamente normais (veja detalhes abaixo). Para modelos lineares, testes F são calculados; para modelos lineares generalizados, são calculados testes de razão de verossimilhança, qui-quadrado de Wald ou testes F; para modelos logit multinomiais e logit de odds proporcionais, são calculados testes de razão de verossimilhança. Vários estatísticos de teste são fornecidos para modelos lineares multivariados produzidos por lm ou manova. Testes de razão de verossimilhança parcial ou testes de Wald são fornecidos para modelos Cox. Testes qui-quadrado de Wald são fornecidos para efeitos fixos em modelos mistos lineares e lineares generalizados. Testes qui-quadrado de Wald ou testes F são fornecidos no caso padrão.​\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmod: lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm, ou outro objeto de modelo adequado.​\n</li>\n<li>\ntype: tipo de teste, \"II\", \"III\", 2, ou 3.​\n</li>\n</ul>\n<b>Detalhes</b></br>\nAs designações \"tipo-II\" e \"tipo-III\" são emprestadas do SAS, mas as definições usadas aqui não correspondem precisamente às empregadas pelo SAS. Testes tipo-II são calculados de acordo com o princípio da marginalidade, testando cada termo após todos os outros, exceto ignorando os parentes de ordem superior do termo; os chamados testes tipo-III violam a marginalidade, testando cada termo no modelo após todos os outros. Esta definição de testes tipo-II corresponde aos testes produzidos pelo SAS para modelos de análise de variância, onde todos os preditores são fatores, mas não mais geralmente (ou seja, quando há preditores quantitativos). Tenha muito cuidado ao formular o modelo para testes tipo-III, ou as hipóteses testadas não farão sentido.​</br>\nComo implementado aqui, testes de Wald tipo-II são uma generalização das hipóteses lineares usadas para gerar esses testes em modelos lineares.​</br>\nPara testes para modelos lineares, modelos lineares multivariados e testes de Wald para modelos lineares generalizados, modelos Cox, modelos mistos, modelos lineares generalizados ajustados a dados de pesquisa, e no caso padrão, Anova encontra as estatísticas de teste sem reajustar o modelo. O método svyglm simplesmente chama o método padrão e, portanto, pode aceitar os mesmos argumentos.​</br>\n<b>Valor</b><br/>\nUm objeto da classe \"anova\", ou \"Anova.mlm\", que geralmente é impresso. Para objetos da classe \"Anova.mlm\", também há um método de resumo, que fornece muito mais detalhes do que o método de impressão sobre a MANOVA, incluindo testes F univariados tradicionais de modelos mistos com correções de Greenhouse-Geisser e Huynh-Feldt.​​</br>\n<b>Pacote</b></br>\nAnova</br>\n<b>Ajuda</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>Descrição</b></br>\nTestes de separação de médias post-hoc. Para realizar testes de separação de médias post-hoc para cada variável de fator de efeito principal, usaremos o pacote emmeans. O modelo linear em consideração é chamado de modelo, criado pela função lm acima.  \n<br/>\n<b>Uso</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>Pacote</b></br>\nFSA;car;emmeans;ggplot2;multcomp</br>\n<b>Ajuda</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
  }
}