{
  "title": "ANOVA & Test de Razão de Verossimilhança",
  "navigation": "ANOVA & Test de Razão de Verossimilhança",
  "label1": "ANOVA é realizada para modelos com as seguintes classes (classes R entre parênteses) Modelos lineares (lm), Modelos lineares generalizados (glm), Modelo log-linear binomial negativo (negbin), Modelo linear usando mínimos quadrados generalizados (gls), Modelo de regressão de sobrevivência (survreg), Modelo de risco proporcional (coxph), Regressão Loess (loess)",
  "label2": "**NOTA: O teste de verossimilhança não é suportado para modelos criados via Ajuste de Modelo (classe train),",
  "modelselector1": "Selecione um modelo",
  "help": {
    "title": "ANOVA & Test de Razão de Verossimilhança",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>Descrição</b></br>\nTabelas ANOVA: Computa tabelas de análise de variância e realiza testes de razão de verossimilhança para um objeto de modelo ajustado. Para modelos de efeitos mistos, a tabela semelhante à ANOVA para efeitos aleatórios é exibida. \n<br/>\n<b>Uso</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: um objeto contendo os resultados retornados por uma função de ajuste de modelo (por exemplo, lm ou glm).\n</li>\n</ul>\n<b>Valor</b><br/>\nEsta função (genérica) retorna um objeto da classe anova. Esses objetos representam tabelas de análise de variância e análise de desvio. Quando dada uma única argumentação, produz uma tabela que testa se os termos do modelo são significativos. Quando dada uma sequência de objetos, anova testa os modelos entre si na ordem especificada.<br/>\nO método de impressão para objetos anova imprime tabelas em uma forma 'bonita'.<br/>\n<b>Aviso</b><br/>\nA comparação entre dois ou mais modelos só será válida se eles forem ajustados ao mesmo conjunto de dados. Isso pode ser um problema se houver valores ausentes e o padrão do R de na.action = na.omit for usado.<br/>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone do R no canto superior direito deste diálogo ou execute o seguinte comando no editor de sintaxe R help(anova,package='stats')</br></br>\n<b>Descrição</b></br>\nTeste de Razão de Verossimilhança de Modelos Aninhados: lrtest é uma função genérica para realizar testes de razão de verossimilhança. O método padrão pode ser empregado para comparar modelos lineares (generalizados) aninhados (veja detalhes abaixo).\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Método padrão S3:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Método S3 para a classe 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: um objeto. Veja abaixo para detalhes.\n</li>\n<li>\n...: especificações adicionais de objetos passadas para métodos. Veja abaixo para detalhes.\n</li>\n<li>\nname: uma função para extrair um nome/descrição adequada de um objeto de modelo ajustado. Por padrão, o nome é consultado chamando a fórmula.\n</li>\n<li>\ndata: um data frame contendo as variáveis no modelo.\n</li>\n</ul>\n<b>Detalhes</b></br>\nlrtest é destinado a ser uma função genérica para comparações de modelos via testes de razão de verossimilhança assintóticos. O método padrão compara consecutivamente o objeto de modelo ajustado com os modelos passados em .... Em vez de passar os objetos de modelo ajustados em ..., várias outras especificações são possíveis. O mecanismo de atualização é o mesmo que para waldtest: os modelos em ... podem ser especificados como inteiros, caracteres (ambos para termos que devem ser eliminados do modelo anterior), fórmulas de atualização ou objetos de modelo ajustados. Exceto pelo último caso, assume-se a existência de um método de atualização. Veja waldtest para detalhes.<br/>\nSubsequentemente, um teste de razão de verossimilhança assintótico para cada dois modelos consecutivos é realizado: Duas vezes a diferença nas log-verossimilhanças (conforme derivado pelos métodos logLik) é comparada com uma distribuição qui-quadrado.<br/>\nO método \"formula\" ajusta um lm primeiro e depois chama o método padrão.<br/>\n<b>Valor</b><br/>\nUm objeto da classe \"anova\" que contém a log-verossimilhança, graus de liberdade, a diferença nos graus de liberdade, estatística do teste de razão de verossimilhança qui-quadrado e o valor p correspondente.\n<b>Exemplos</b><br/>\n<code> \n## com dados de Greene (1993):<br/>\n## carregar dados e computar lags<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## várias especificações equivalentes do teste LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>Descrição</b></br>\nTabela Semelhante à ANOVA para Efeitos Aleatórios: Computa uma tabela semelhante à ANOVA com testes de termos de efeito aleatório no modelo. Cada termo de efeito aleatório é reduzido ou removido e os testes de razão de verossimilhança das reduções do modelo são apresentados em uma forma semelhante à de drop1. rand é um alias para ranova.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmodel: um modelo linear de efeitos mistos ajustado com lmer() (herdando da classe lmerMod).\n</li>\n<li>\nreduce.terms: se TRUE (padrão) os termos de efeito aleatório são reduzidos (se possível). Se FALSE, os termos de efeito aleatório são simplesmente removidos.\n</li>\n</ul>\n<b>Detalhes</b></br>\nSe o modelo for ajustado com REML, os testes são testes de razão de verossimilhança REML.<br/>\nUm termo de efeito aleatório da forma (f1 + f2 | gr) é reduzido para termos da forma (f2 | gr) e (f1 | gr) e esses modelos reduzidos são comparados ao modelo original. Se reduce.terms for FALSE (f1 + f2 | gr) é removido em vez disso.<br/>\nUm termo de efeito aleatório da forma (f1 | gr) é reduzido para (1 | gr) (a menos que reduce.terms seja FALSE).<br/>\nUm termo de efeito aleatório da forma (1 | gr) não é reduzido, mas simplesmente removido.<br/>\nUm termo de efeito aleatório da forma (0 + f1 | gr) ou (-1 + f1 | gr) é reduzido (se reduce.terms = TRUE) para (1 | gr).<br/>\nUm termo de efeito aleatório da forma (1 | gr1/gr2) é automaticamente expandido para dois termos: (1 | gr2:gr1) e (1 | gr1) usando findbars.<br/>\nNesta exposição, não importa se f1 e f2 são fatores ou variáveis contínuas.<br/>\n<b>Valor</b><br/>\nUma tabela semelhante à ANOVA com exclusões de termos únicos de efeitos aleatórios herdando da classe anova e data.frame com as colunas:</br>\nnpar: número de parâmetros do modelo.</br>\nlogLik: a log-verossimilhança para o modelo. Note que esta é a logLik REML se o modelo for ajustado com REML.</br>\nAIC: o AIC para o modelo avaliado como -2*(logLik - npar). Menor é melhor.</br>\nLRT: a estatística do teste de razão de verossimilhança; duas vezes a diferença na log-verossimilhança, que é assintoticamente distribuída como qui-quadrado.</br>\nDf: graus de liberdade para o teste de razão de verossimilhança: a diferença no número de parâmetros do modelo.</br>\nPr(>Chisq) :o valor p.</br>\n<b>Aviso</b></br>\nEm certos casos, testes de modelos não aninhados podem ser gerados. Um exemplo é quando (0 + poly(x, 2) | gr) é reduzido (o padrão) para (1 | gr). Para o nosso melhor conhecimento, comparações de modelos não aninhados são geradas apenas em casos que são estatisticamente sem sentido de qualquer maneira (como neste exemplo onde o intercepto aleatório é suprimido).</br>\nNota: Note que anova pode ser usado para comparar dois modelos e muitas vezes será capaz de produzir os mesmos testes que ranova. Isso, no entanto, nem sempre é o caso, como ilustrado nos exemplos.</br>\n<b>Exemplos</b><br/>\n<code> \n# Teste a redução de (Dias | Sujeito) para (1 | Sujeito):<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # teste de 2 df<br/>\n# Este teste também pode ser alcançado com anova():<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# Ilustre o argumento reduce.test:<br/>\n# Teste a remoção de (Dias | Sujeito):<br/>\nranova(fm1, reduce.terms = FALSE) # teste de 3 df<br/>\n# A estatística do teste de razão de verossimilhança é neste caso:<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() nem sempre é capaz de realizar os mesmos testes que ranova(),<br/>\n# por exemplo:<br/>\nanova(fm1, fm3, refit=FALSE) # compara REML com ML e não deve ser usado<br/>\nanova(fm1, fm3, refit=TRUE) # é um teste de ajustes de ML e não é o que buscamos<br/>\n# Além disso, note que o ajuste lmer precisa vir primeiro - não um ajuste lm:<br/>\n# anova(fm3, fm1) # não funciona e gera um erro<br/>\n# ranova() pode não gerar todos os testes relevantes:<br/>\n# Para o seguinte modelo, ranova() indica que não devemos reduzir<br/>\n# (TVset | Avaliador):\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Assessor), data=TVbo)<br/>\nranova(fm)<br/>\n# No entanto, um modelo mais apropriado é:<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Assessor), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm e fm2 têm essencialmente o mesmo ajuste aos dados, mas fm usa 5 parâmetros a mais do que fm.<br/>\n</code> <br/>\n<b>Pacote</b></br>\nlmerTest</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone do R no canto superior direito deste diálogo ou execute o seguinte comando no editor de sintaxe R help(ranova, package ='lmerTest')\n                "
  }
}