{
  "title": "ANOVA, N vias",
  "modelname": "Insira um nome para o modelo",
  "label3": "Tamanho do efeito",
  "confInterval": "Intervalo de confiança para tamanhos de efeito",
  "effectsizes": "Selecione a medida do tamanho do efeito",
  "navigation": "ANOVA, N vias",
  "target": "Variável alvo (numérica/escala)",
  "dest": "Especifique um máximo de 2 variáveis fatoriais",
  "options": "Opções",
  "type": "Selecione tipo I/II/III Somas de quadrados",
  "levene": "Teste de Levene para homogeneidade de variâncias",
  "label1": "Post-hoc",
  "combon": "Comparar médias usando:",
  "adjust": "Método para ajustar valores de p",
  "compactly": "Comparando médias de forma compacta",
  "alpha": "Insira um valor de alfa:",
  "label2": "Gráficos",
  "label4": "Gráficos",
  "diag": "Gráficos diagnósticos",
  "plot1": "Plotar todas as comparações",
  "horizontalAxis": "Linhas separadas",
  "separateLines": "Eixo horizontal",
  "separatePlots": "Gráficos separados",
  "labelSaveResiduals": "Salvar estatísticas do modelo no conjunto de dados",
  "residuals": "Os resíduos são salvos com um nome de variável resíduos com um prefixo opcional",
  "stuResiduals": "Resíduos studentizados são salvos com um nome de variável resStudentized com um prefixo opcional",
  "fittedVals": "Valores ajustados são salvos com um nome de variável ajustados com um prefixo opcional",
  "prefixForSavedStatistics": "Opcionalmente insira um prefixo para os valores salvos acima, o prefixo é anexado ao(s) nome(s) da variável acima",
  "help": {
    "title": "ANOVA, N vias",
    "r_help": "help(aov, package='stats')",
    "body": "\nNOTA:</br>\n1. Para obter todas as médias marginais e post-hocs, você precisa construir uma fórmula com os efeitos principais e todos os termos de interação no modelo.</br> \nPortanto, se você estiver tentando analisar uma interação de 3 vias, precisa especificar</br>\nA + B + C + A:B + B:C + A:C + A:B:C</br>\nSe em vez disso você especificar A*B*C, você obterá a tabela ANOVA completa, você NÃO obterá as médias marginais estimadas e post-hocs para todas as interações.</br>\n2. Médias marginais estimadas E POST-HOCS são computadas para todos os efeitos principais e as INTERAÇÕES ESPECIFICADAS</br>\n<b>Descrição</b></br>\nAjusta um modelo de análise de variância, exibe soma de quadrados tipo I, II, III, exibe médias marginais e contrastes (usando médias marginais).</br> \nOpcionalmente realiza o teste de Levene para homogeneidade de variância entre grupos e plota gráficos.</br>\nO teste de Levene é executado para todos os efeitos principais</br></br>\nConstrói e resume um modelo anova usando a fórmula especificada usando a função aov</br>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nhelp(aov, package='stats')</br></br>\nExibe tabela Anova com soma de quadrados tipo I/II/III</br>\nUsa a função Anova no pacote car para soma de quadrados tipo II, III, função anova no pacote stats para soma de quadrados tipo I. Ao computar a soma de quadrados tipo III, contrastes apropriados (contr.sum) são definidos para variáveis fatoriais.</br>\n<b>Pacote</b></br>\ncar</br>\n<b>Ajuda</b></br>\nhelp(Anova, package='car')</br></br>\nExibe médias marginais estimadas</br>\n<b>Pacote</b></br>\nemmeans</br>\n<b>Ajuda</b></br>\nhelp(emmeans, package='car')</br></br>\nComputa o teste de Levene para homogeneidade de variância entre grupos. \n<b>Pacote</b></br>\ncar</br>\n<b>Ajuda</b></br>\nhelp(leveneTest, package='car')\n"
  }
}