{
  "title": "Gráfico de Barras",
  "navigation": "Gráfico de Barras",
  "optionsLabels": "Opções para rótulos",
  "suppressLabels": "Suprimir todos os rótulos para contagens e porcentagens",
  "suppressThreshold": "Suprimir rótulos para contagens e porcentagens abaixo do percentual de limiar especificado",
  "label1": "Clique na aba abaixo para selecionar contagem ou média. Quando a contagem é selecionada, uma variável Y é opcional. Quando a contagem é selecionada e uma variável Y NÃO é especificada, as contagens da variável X são exibidas. Quando a contagem é especificada e uma variável Y é especificada, os valores da variável Y são somados. Quando a média é selecionada, você precisa selecionar uma variável Y e uma variável X. As médias são calculadas para a(s) variável(is) Y",
  "x": "Variável X",
  "y": "Variável(is) Y, especifique uma variável numérica",
  "fill": "Especifique uma variável de fator para preencher as barras.",
  "dropna": "Remover valores ausentes",
  "bottomlbl": "Selecionar Gráfico de Barras",
  "meanlbl": "Média",
  "countlbl": " Contagem",
  "fill1": "Selecione uma cor para as barras. Nota: Isso é ignorado quando uma variável para preencher as barras é especificada",
  "barType": "Tipo de gráfico de barras",
  "stackedBar": "Gráfico de barras empilhadas",
  "sideBySide": "Mostrar grupos lado a lado",
  "fillPercent": "Preencher barras",
  "errorBarOptions": "Barras de erro",
  "noErrBars": "Sem barras de erro",
  "stderr": "Erros padrão",
  "stddev": "Desvio padrão",
  "cilevel": "Especifique o nível de confiança:",
  "confidenceInterval": "Nível de confiança:",
  "alpha": "Opacidade (0-1)",
  "flipBox": "Inverter Eixo",
  "specify_a_title": "Digite um título",
  "x_title": "Rótulo do Eixo X",
  "y_title": "Rótulo do Eixo Y",
  "hide": "Mostrar apenas o topo das barras de erro (deve definir a opacidade para 1)",
  "Facetrow": "Linha de Facetas",
  "Facetcolumn": "Coluna de Facetas",
  "Facetwrap": "Envolver Facetas",
  "Facetscale": "Escala de Facetas",
  "relFreq": "Frequências relativas",
  "facets_lbl": "Facetas",
  "help": {
    "title": "Ajuda do Gráfico de Barras",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Um gráfico de barras é um gráfico que apresenta dados agrupados com barras retangulares com comprimentos proporcionais aos valores que representam. As barras podem ser plotadas vertical ou horizontalmente. As barras podem ser agrupadas por uma variável de fator opcional. Os grupos podem ser empilhados em uma única barra ou exibidos lado a lado. Facetas podem ser criadas opcionalmente especificando uma variável de fator. Você também pode opcionalmente especificar temas e especificar um título e rótulos para os eixos x e y.\n        Você pode criar um gráfico de barras para uma única variável de fator, as barras representarão as contagens de cada nível da variável de fator. Aqui a variável de fator estará no eixo x, veja o exemplo abaixo. Quando a caixa de seleção de frequências relativas é selecionada, mostramos a frequência relativa em vez de contagens no eixo y.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=0.4) +\n         labs(x =\"year\",y =\"Count\",title= \"Gráfico de barras para Eixo X: ano, Eixo Y: Contagem\")\n        </code>\n        <br />\n        Você pode criar um gráfico de barras colocando uma variável de escala/número no eixo y e preenchendo as barras por uma variável de fator. A barra será preenchida somando os valores da variável y para cada nível da variável de fator, veja o exemplo abaixo\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=0.4,stat=\"identity\") +\n         labs(y =\"peso\",fill =\"origem\",title= \"Gráfico de barras para Eixo X:, Eixo Y: peso, Preenchimento: origem\")\n        </code>\n        <br />\n        Você pode especificar uma variável x, variável y e preenchimento. A barra é preenchida pela soma dos valores da variável y para cada nível da variável x, agrupada pelo nível da variável especificada no preenchimento.\n        Quando você especifica várias variáveis x, criamos um gráfico de barras separado para cada variável x.\n        <br />\n        Uso:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origem\",y = \"Contagem\",fill = \"cilindro\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: O conjunto de dados padrão​\n        </li>\n        <li>\n        aes():    Gera mapeamentos estéticos que descrevem como as variáveis nos dados são mapeadas para propriedades visuais (estéticas) dos geoms.​\n        </li>\n        <li>\n        x: Uma variável de fator/categórica. O comprimento da barra corresponde às contagens de cada nível da variável de fator.​\n        </li>\n        <li>\n        fill: Uma variável de fator/categórica opcional para agrupar as contagens dos níveis em x: (veja acima)​\n        </li>\n        <li>\n        geom_bar(): Cria o gráfico de barras, position =”stack” empilha os grupos em uma única barra, position =”dodge” empilha os grupos lado a lado, position =\"fill\" preenche a barra com uma porcentagem de cada nível de agrupamento.​\n        </li>\n        <li>\n        Labs(): Altera rótulos de eixos e títulos de legenda (isso é opcional)​\n        </li>\n        <li>\n        facet_grid(): Organiza painéis em uma grade (isso é opcional)​\n        </li>\n        <li>\n        theme_calc(): Especifica o tema da calculadora (isso é opcional)​\n        </li>\n        <li>\n        coord_flip(): Inverter eixo (isso é opcional)​\n        </li>\n        <li>\n        alpha: Controla a opacidade, assume valores entre 0-1. 1 significa sem opacidade.\n        </li>\n        </ul>\n        Pacote: ggplot2,ggthemes​\n        <br />\n        Outros: Clique no botão Ajuda R para obter ajuda detalhada em R. Você também pode digitar help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n        "
  }
}