{
  "title": "Teste de Bartlett",
  "navigation": "Teste de Bartlett",
  "tvarbox1": "Variável de resposta",
  "tvarbox2": "Variáveis numéricas ou fatores",
  "help": {
    "title": "Teste de Bartlett",
    "r_help": "help(bartlett.test, package=stats)",
    "body": "\n<b>Descrição</b></br>\nRealiza o teste de Bartlett da hipótese nula de que as variâncias em cada um dos grupos (amostras) são as mesmas.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nbartlett.test(x, ...)</br>\n## Método S3 padrão:</br>\nbartlett.test(x, g, ...)</br>\n## Método S3 para a classe 'formula'</br>\nbartlett.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nArgumentos\nx: um vetor numérico de valores de dados, ou uma lista de vetores de dados numéricos representando as respectivas amostras, ou objetos de modelos lineares ajustados (herdando da classe \"lm\").\n</li>\n<li>\ng: um vetor ou objeto fator que dá o grupo para os elementos correspondentes de x. Ignorado se x for uma lista.\n</li>\n<li>\nformula: uma fórmula da forma lhs ~ rhs onde lhs dá os valores dos dados e rhs os grupos correspondentes.\n</li>\n<li>\ndata: uma matriz ou data frame opcional (ou similar: veja model.frame) contendo as variáveis na fórmula formula. Por padrão, as variáveis são retiradas do ambiente(formula).\n</li>\n<li>\nsubset: um vetor opcional especificando um subconjunto de observações a ser utilizado.\n</li>\n<li>\nna.action: uma função que indica o que deve acontecer quando os dados contêm NAs. Por padrão, é definido como getOption(\"na.action\").\n</li>\n<li>\n...: argumentos adicionais a serem passados para ou de métodos.\n</li>\n</ul>\n<b>Detalhes</b></br>\nSe x for uma lista, seus elementos são considerados como as amostras ou modelos lineares ajustados a serem comparados para homogeneidade de variâncias. Nesse caso, os elementos devem ser todos vetores de dados numéricos ou objetos de modelos lineares ajustados, g é ignorado, e pode-se simplesmente usar bartlett.test(x) para realizar o teste. Se as amostras ainda não estiverem contidas em uma lista, use bartlett.test(list(x, ...)).</br>\nCaso contrário, x deve ser um vetor de dados numéricos, e g deve ser um vetor ou objeto fator da mesma extensão que x, dando o grupo para os elementos correspondentes de x.</br>\n<b>Valor</b><br/>\nUma lista da classe \"htest\" contendo os seguintes componentes:<br/>\nstatistic: estatística do teste K-quadrado de Bartlett.<br/>\nparameter: os graus de liberdade da distribuição qui-quadrada aproximada da estatística do teste.<br/>\np.value: o valor p do teste.<br/>\nmethod: a string de caracteres \"Teste de Bartlett de homogeneidade de variâncias\".<br/>\ndata.name: uma string de caracteres dando os nomes dos dados.<br/>\n<b>Exemplos</b><br/>\n<code> \nDataset <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))\nResult_Bartlett_Test = bartlett.test(sales ~ interaction(Dataset$Gender),data=Dataset)\n</code> <br/>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nhelp(bartlett.test, package=stats)\n"
  }
}