{
  "title": "Teste de Outlier de Bonferroni",
  "navigation": "Teste de Outlier",
  "label1": "Selecione um modelo de uma das seguintes classes (classe entre parênteses) - Modelo linear (lm), Modelo linear generalizado (glm)",
  "modelselector1": "Selecione um modelo",
  "help": {
    "title": "Teste de Outlier de Bonferroni",
    "r_help": "help(outlierTest, package='car')",
    "body": "\n                <b>Descrição</b></br>\nRelata os valores-p de Bonferroni para testar cada observação por vez para ser um outlier de mudança de média, com base nos resíduos Studentizados em modelos lineares (testes t), modelos lineares generalizados (testes normais) e modelos mistos lineares.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## Método S3 para a classe 'lm'<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## Método S3 para a classe 'lmerMod'<br/>\noutlierTest(model, ...)<br/>\n## Método S3 para a classe 'outlierTest'<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmodel: um objeto de modelo lm, glm ou lmerMod; o método \"lmerMod\" chama o método \"lm\" e pode aceitar os mesmos argumentos.\n</li>\n<li>\ncutoff: observações com valores-p de Bonferroni que excedem o cutoff não são relatadas, a menos que nenhuma observação seja nomeada, caso em que a com o maior resíduo Studentizado é relatada.\n</li>\n<li>\nn.max: número máximo de observações a relatar (padrão, 10).\n</li>\n<li>\norder: relatar resíduos Studentizados em ordem decrescente de magnitude? (padrão, TRUE).\n</li>\n<li>\nlabels: um vetor opcional de nomes de observação.\n</li>\n<li>\n...: argumentos passados para funções de métodos.\n</li>\n<li>\nx: objeto outlierTest.\n</li>\n<li>\ndigits: número de dígitos para valores-p relatados.\n</li>\n</ul>\n<b>Detalhes</b></br>\nPara um modelo linear, os valores-p relatados usam a distribuição t com graus de liberdade um a menos do que o df residual para o modelo. Para um modelo linear generalizado, os valores-p são baseados na distribuição normal padrão. O ajuste de Bonferroni multiplica o valor-p usual de dois lados pelo número de observações. O método lm funciona para objetos glm. Para mostrar todas as observações, defina cutoff=Inf e n.max=Inf.<br/>\n<b>Valor</b><br/>\nun objeto da classe outlierTest, que normalmente é apenas impresso.<br/>\n<b>Exemplos</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>Pacote</b></br>\ncar</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando no editor de sintaxe R help(outlierTest, package=\"car\")\n                "
  }
}