{
    "title": "Gráfico de Caixa",
    "navigation": "Gráfico de Caixa",
    "x": "Variável X, especifique uma variável categórica",
    "y": "Variável(is) Y, especifique variável(is) numérica(s)",
    "Fill": "Especifique uma variável de agrupamento (categórica)",
    "flipaxis": "Inverter eixo",
    "dataPoints": "Selecione uma opção para exibir os pontos de dados",
    "alpha": "Opacidade (0-1)",
    "notch": "Entalhe",
    "outliers": "Mostrar outliers (em vermelho)",
    "barcolor": "Selecione a cor para as bordas das caixas (após selecionar, clique fora do controle para aplicar)",
    "showCountsChk": "Exibir valores na caixa (1Q, mediana, 3Q)",
    "drawSignificanceChk": "Adicionar significância (valores-p) na comparação de médias entre cada par de caixas (selecione o facet para agrupar a análise)",
    "methodForMeanDiffSignificance": "Método de teste usado para comparar médias",
    "adjPvalue": "Ajustar valores-p obtidos nas comparações de médias",
    "pValueFromatting": "Formato de exibição dos valores-p (significância)",
    "specify_a_title": "Digite um título",
    "x_title": "Rótulo do eixo X",
    "y_title": "Rótulo do eixo Y",
    "angleXaxis_text": "Ângulo para inclinar o texto do eixo X (padrão 0, sem inclinação)",
    "angleYaxis_text": "Ângulo para inclinar o texto do eixo Y (padrão 0, sem inclinação)",
    "axisTickmarksCount": "Quantidade de marcas no eixo a exibir (padrão 10)",
	"positionJitterWidth": "Dispersão dos pontos de jitter (escolha um valor entre 0 e 1. O padrão é 0,2)",
    "facets_lbl": "Facetas",
    "Facetrow": "Linha de facetamento",
    "Facetcolumn": "Coluna de facetamento",
    "Facetwrap": "Agrupamento de facets (se selecionado, linha e coluna serão ignorados)",
    "Facetscale": "Escala de facetamento",
    "label1": "Linhas horizontais",
    "yIntercept": "Informe os valores de interceptação Y separados por vírgula para as linhas horizontais (ex: 100, 200, 300)",
    "hLineColor": "Selecione a cor para as linhas e rótulos (após selecionar, clique fora para aplicar)",
    "lineType": "Selecione o tipo de linha",
    "horizontalLinelabel": "Especifique os rótulos das linhas horizontais separados por vírgula (sem aspas)",
    "horizontalLinelabel_angle_text": "Ângulo para inclinar o texto dos rótulos das linhas horizontais (padrão 0)",
    "label2": "Nota: valores maiores deslocam o texto para baixo, menores para cima",
    "addHoriRefLines": "Adicionar linhas de referência",
    "xyLimits": "Limites dos eixos X e Y",
    "label5": "Especifique o intervalo dos valores dos eixos X e Y",
    "rangeXValues": "Especifique o intervalo do eixo X, ex: 0,100 (deixe em branco para eixo categórico)",
    "rangeYValues": "Especifique o intervalo do eixo Y, ex: 0,100",
    "labelHori_HorizontalJustification": "Nota: valores maiores posicionam o texto mais à esquerda, menores mais à direita",
    "verticalJustification": "Ajuste vertical do rótulo",
    "hori_HorizontalJustification": "Ajuste horizontal do rótulo",
    "addlLabelHlineTextPositionOffset": "Ajustes adicionais na posição dos rótulos das linhas horizontais",
    "horiMovementHReflineLabel": "Mover texto horizontalmente (+ ou -; deixar 0 para eixo categórico)",
    "nobreaklineHRefLabelandValueChk": "Remover quebra de linha entre valor e texto do rótulo",
    "vertiMovementHReflineLabel": "Mover texto verticalmente (+ ou -; deixar 0 para eixo categórico)",
    "help": {
        "title": "Gráfico de Caixa",
        "r_help": "help(geom_boxplot, package=ggplot2)",
        "body": "Em estatística descritiva, o gráfico de caixa representa grupos de dados numéricos com base em seus quartis. As linhas (bigodes) indicam variabilidade fora dos quartis. Outliers são exibidos como pontos individuais. A parte inferior e superior da caixa representam o primeiro e o terceiro quartis; a linha central indica a mediana. Os bigodes se estendem até 1,5 × IQR. É possível criar facets especificando variáveis categóricas. Se a opção de exibir os pontos de dados for selecionada, geom_dotplot será utilizado. Por padrão, outliers são mostrados em preto; ao selecionar a opção em vermelho, eles ganham destaque."
    }
}
