{
  "title": "Box Plot",
  "navigation": "Box Plot",
  "x": "Variável X, especifique uma variável de Categoria",
  "y": "Variável(is) Y, especifique uma(s) variável(is) Numérica(s)",
  "Fill": "Especifique uma variável de agrupamento (Categoria)",
  "flipaxis": "Inverter eixo",
  "dataPoints": "Selecione uma opção para plotar pontos de dados",
  "alpha": "Opacidade (0-1)",
  "notch": "Entalhe",
  "outliers": "Mostrar Outliers (Em Vermelho)",
  "barcolor": "Selecione uma cor para as linhas ao redor das caixas (Após a seleção da cor, clique fora do controle para aplicar)",
  "specify_a_title": "Digite um título",
  "x_title": "Rótulo do eixo X",
  "y_title": "Rótulo do eixo Y",
  "angleXaxis_text": "Ângulo para inclinar os valores do texto do eixo x (padrão 0 para sem inclinação)",
  "angleYaxis_text": "Ângulo para inclinar os valores do texto do eixo y (padrão 0 para sem inclinação)",
  "axisTickmarksCount": "Quantos valores do eixo (ou seja, marca de tick) exibir (padrão 10)",
  "Facetrow": "Linha de Faceta",
  "Facetcolumn": "Coluna de Faceta",
  "Facetwrap": "Enrolar Faceta (se escolhido, qualquer seleção de linha e coluna de Faceta será ignorada)",
  "Facetscale": "Escala de Faceta",
  "facets_lbl": "Facetas",
  "label1": "Linhas horizontais",
  "yIntercept": "Digite valores de interceptação Y separados por vírgula para as linhas horizontais, por exemplo, 100, 200, 300",
  "hLineColor": "Selecione uma cor para linha(s) e rótulo(s) (Após a seleção da cor, clique fora do controle para aplicar)",
  "lineType": "Selecione o tipo de linha",
  "horizontalLinelabel": "Especifique rótulos separados por vírgula (sem aspas) para a(s) linha(s) horizontal(is)",
  "horizontalLinelabel_angle_text": "Ângulo para inclinar o texto do rótulo da linha horizontal (padrão 0 para sem inclinação)",
  "label2": "Nota: Valores maiores movem o texto para baixo, valores menores movem o texto para cima",
  "addHoriRefLines": "Adicionar linhas de referência",
  "xyLimits": "Limites dos eixos X e Y",
  "label5": "Especifique um intervalo para os valores dos eixos X e Y",
  "rangeXValues": "Especifique o intervalo do eixo X, por exemplo, 0,100 (Deixe em branco para eixo categórico/fatorial)",
  "rangeYValues": "Especifique o intervalo do eixo Y, por exemplo, 0,100",
  "labelHori_HorizontalJustification": "Nota: valores maiores colocam o texto à esquerda, valores menores movem o texto para a direita",
  "verticalJustification": "Controle a justificação vertical do rótulo",
  "hori_HorizontalJustification": "Controle a justificação horizontal do rótulo",
  "addlLabelHlineTextPositionOffset": "Ajustes adicionais para posicionar o texto do rótulo para linhas horizontais",
  "horiMovementHReflineLabel": "Mover texto horizontalmente para a esquerda ou direita - use qualquer número com sinal + ou - (deixe 0 para eixo categórico)",
  "nobreaklineHRefLabelandValueChk": "Marque esta caixa para remover a quebra de linha entre o valor do rótulo e o texto do rótulo",
  "vertiMovementHReflineLabel": "Mover texto verticalmente para cima ou para baixo - use qualquer número com sinal + ou - (deixe 0 para eixo categórico)",
  "help": {
    "title": "Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descrição</b></br>\n        Em estatísticas descritivas, um box plot ou boxplot é uma maneira conveniente de representar graficamente grupos de dados numéricos através de seus quartis. Box plots também podem ter linhas se estendendo verticalmente a partir das caixas (bigodes) indicando variabilidade fora dos quartis superior e inferior, daí os termos gráfico de caixa e bigode e diagrama de caixa e bigode. Outliers podem ser plotados como pontos individuais. Gráficos de caixa e bigode são uniformes em seu uso da caixa: a parte inferior e superior da caixa são sempre o primeiro e o terceiro quartis, e a faixa dentro da caixa é sempre o segundo quartil (a mediana). O bigode superior se estende da dobradiça até o maior valor que está dentro de 1,5 * IQR da dobradiça, onde IQR é a faixa interquartil, ou distância entre o primeiro e o terceiro quartis. O bigode inferior se estende da dobradiça até o menor valor dentro de 1,5 * IQR da dobradiça. Dados além do final dos bigodes são outliers e plotados como pontos (conforme especificado por Tukey).​</br>\n        Facetas podem ser criadas opcionalmente especificando uma variável de fator. Você também pode opcionalmente especificar temas, e especificar um título e rótulos para os eixos x e y​</br>\n        Quando você seleciona a opção para plotar os pontos de dados, fazemos isso usando geom_dotplot</br>\n        Por padrão, outliers são mostrados com pontos pretos, quando você seleciona a opção para mostrar outliers (Em Vermelho) através da caixa de seleção, outliers se tornam mais proeminentes.\n        <br/>\n        <b>Uso</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumentos</b><br/>\n        <ul>\n        <li>\n        data: O conjunto de dados padrão​\n        </li>\n        <li>\n        x: Uma variável categórica/fatorial que define o agrupamento da variável y​\n        </li>\n        <li>\n        y: Uma variável numérica para a qual o boxplot é calculado​\n        </li>\n        <li>\n        fill: Uma variável categórica/fatorial opcional para agrupar ainda mais os grupos existentes. Cada subgrupo será mostrado em uma cor distinta.​\n        </li>\n        <li>\n        aes():    Gera mapeamentos estéticos que descrevem como as variáveis nos dados são mapeadas para propriedades visuais (estéticas) dos geoms.​\n        </li>\n        <li>\n        geom_boxplot():Cria o boxplot. As \"dobradiças\" superior e inferior correspondem ao primeiro e terceiro quartis (os 25º e 75º percentis).​\n        </li>\n        <li>\n        geom_dotplot: Plota os pontos de dados\n        </li>\n        <li>\n        Labs(): Muda os rótulos dos eixos e os títulos da legenda (Isso é opcional)​\n        </li>\n        <li>\n        facet_grid(): Organiza painéis em uma grade (Isso é opcional)​\n        </li>\n        <li>\n        theme_calc(): Especifica o tema do calculador (Isso é opcional)​\n        </li>\n        <li>\n        coord_flip(): Inverte o eixo (Isso é opcional)​\n        </li>\n        <li>\n        notch: Gráficos de caixa entalhados aplicam um \"entalhe\" ou estreitamento da caixa em torno da mediana. Entalhes são úteis para oferecer um guia aproximado para a significância da diferença das medianas; se os entalhes de duas caixas não se sobrepõem, isso oferece evidências de uma diferença estatisticamente significativa entre as medianas. Em um gráfico de caixa entalhado, os entalhes se estendem 1,58 * IQR / sqrt(n)\n        </li>\n        </ul>\n        <b>Pacote</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Ajuda</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Clique no botão de Ajuda R para obter ajuda detalhada em R. Você também pode digitar help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}