{
  "title": "Box Plot",
  "navigation": "Box Plot",
  "x": "Variável X, especifique uma variável de Categoria",
  "y": "Variável(is) Y, especifique uma variável(is) Numérica(s)",
  "Fill": "Especifique uma variável de agrupamento (Categoria)",
  "flipaxis": "Inverter eixo",
  "dataPoints": "Selecione uma opção para plotar pontos de dados",
  "alpha": "Opacidade (0-1)",
  "notch": "Entalhe",
  "outliers": "Mostrar Outliers (Em Vermelho)",
  "barcolor": "Selecione uma cor para as linhas ao redor das caixas (Após a seleção da cor, clique fora do controle para aplicar)",
  "showCountsChk": "Exibir valores na caixa (1Q, mediana, 3Q)",
  "drawSignificanceChk": "Adicionar significância (valores-p) comparação média entre cada par de caixas (selecione faceta para análise agrupada). Para tukey_hsd e games_howell_test, os valores-p já estão ajustados. O método adicional de ajuste de valor-p é ignorado.",
  "methodForMeanDiffSignificance": "Método de teste usado para comparar médias",
  "adjPvalue": "Ajustar valores-p da comparação de médias",
  "pValueFromatting": "Formatar valores-p (significância) exibidos",
  "specify_a_title": "Digite um título",
  "x_title": "Rótulo do eixo X",
  "y_title": "Rótulo do eixo Y",
  "legends": "Mostrar Legendas e, se sim, posição das Legendas (padrão é à direita)",
  "angleXaxis_text": "Ângulo para inclinar os valores do texto do eixo x (padrão 0 para sem inclinação)",
  "angleYaxis_text": "Ângulo para inclinar os valores do texto do eixo y (padrão 0 para sem inclinação)",
  "axisTickmarksCount": "Quantos valores do eixo (ou seja, marcação) exibir (padrão 10)",
  "positionJitterWidth": "Espalhamento dos pontos de jitter (escolha um valor entre 0 e 1. O padrão é 0.2)",
  "Facetrow": "Linha de Faceta",
  "Facetcolumn": "Coluna de Faceta",
  "Facetwrap": "Enrolar Faceta (se escolhido, qualquer seleção de Linha e Coluna de Faceta será ignorada)",
  "Facetscale": "Escala de Faceta",
  "label1": "Linhas horizontais",
  "connectMedianPointsChk": "Conectar os pontos medianos entre as caixas",
  "connectMeanPointsChk": "Conectar os pontos médios entre as caixas",
  "plotMedianLineChk": "Plotar uma linha horizontal para a mediana geral da variável Y (numérica)",
  "plotMeanLineChk": "Plotar uma linha horizontal para a média geral da variável Y (numérica)",
  "yIntercept": "Digite valores de intercepto Y separados por vírgula para as linhas horizontais, por exemplo, 100, 200, 300",
  "hLineColor": "Selecione uma cor para linha(s) e rótulo(s) (Após a seleção da cor, clique fora do controle para aplicar)",
  "lineType": "Selecione o tipo de linha",
  "horizontalLinelabel": "Especifique rótulos separados por vírgula (sem aspas) para a(s) linha(s) horizontal(is)",
  "horizontalLinelabel_angle_text": "Ângulo para inclinar o texto do rótulo da linha horizontal (padrão 0 para sem inclinação)",
  "label2": "Nota: Valores maiores movem o texto para baixo, valores menores movem o texto para cima",
  "addHoriRefLines": "Adicionar linhas de referência",
  "xyLimits": "Limites dos eixos X e Y",
  "label5": "Especifique um intervalo para os valores dos eixos X e Y",
  "rangeYValues": "Especifique o intervalo do eixo Y, por exemplo, 0,100",
  "labelHori_HorizontalJustification": "Nota: valores maiores colocam o texto à esquerda, valores menores movem o texto para a direita",
  "verticalJustification": "Controlar a justificação vertical do rótulo",
  "hori_HorizontalJustification": "Controlar a justificação horizontal do rótulo",
  "addlLabelHlineTextPositionOffset": "Ajustes adicionais para posicionar o texto do rótulo para linhas horizontais",
  "horiMovementHReflineLabel": "Mover texto horizontalmente para a esquerda ou direita - use qualquer número com sinal + ou - (deixe 0 para eixo Categórico)",
  "nobreaklineHRefLabelandValueChk": "Marque esta caixa para remover a quebra de linha entre o valor do rótulo e o texto do rótulo",
  "vertiMovementHReflineLabel": "Mover texto verticalmente para cima ou para baixo - use qualquer número com sinal + ou - (deixe 0 para eixo Categórico)",
  "facets_lbl": "Facetas",
  "help": {
    "title": "Box Plot",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Descrição</b></br>\n        Em estatísticas descritivas, um box plot ou boxplot é uma maneira conveniente de representar graficamente grupos de dados numéricos através de seus quartis. Box plots também podem ter linhas se estendendo verticalmente a partir das caixas (bigodes) indicando variabilidade fora dos quartis superior e inferior, daí os termos gráfico de caixa e bigode e diagrama de caixa e bigode. Outliers podem ser plotados como pontos individuais. Gráficos de caixa e bigode são uniformes em seu uso da caixa: a parte inferior e a parte superior da caixa são sempre o primeiro e o terceiro quartis, e a faixa dentro da caixa é sempre o segundo quartil (a mediana). O bigode superior se estende da dobradiça ao valor mais alto que está dentro de 1.5 * IQR da dobradiça, onde IQR é o intervalo interquartil, ou distância entre o primeiro e o terceiro quartis. O bigode inferior se estende da dobradiça ao valor mais baixo dentro de 1.5 * IQR da dobradiça. Dados além do final dos bigodes são outliers e plotados como pontos (conforme especificado por Tukey).​</br>\n        Facetas podem ser criadas opcionalmente especificando uma variável de fator. Você também pode opcionalmente especificar temas, e especificar um título e rótulos para os eixos x e y​</br>\n        Quando você seleciona a opção para plotar os pontos de dados, fazemos isso usando geom_dotplot</br>\n        Por padrão, outliers são mostrados com pontos pretos, quando você seleciona a opção para mostrar outliers (Em Vermelho) através da caixa de seleção, outliers se tornam mais proeminentes.\n        <br/>\n        <b>Uso</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argumentos</b><br/>\n        <ul>\n        <li>\n        data: O conjunto de dados padrão​\n        </li>\n        <li>\n        x: Uma variável fator/categórica que define o agrupamento da variável y​\n        </li>\n        <li>\n        y: Uma variável numérica para a qual o boxplot é calculado​\n        </li>\n        <li>\n        fill: Uma variável fator/categórica opcional para agrupar ainda mais os grupos existentes. Cada subgrupo será mostrado em uma cor distinta.​\n        </li>\n        <li>\n        aes():    Gere mapeamentos estéticos que descrevem como as variáveis nos dados são mapeadas para propriedades visuais (estéticas) dos geoms.​\n        </li>\n        <li>\n        geom_boxplot(): Cria o boxplot. As \"dobradiças\" superior e inferior correspondem aos primeiros e terceiros quartis (os 25º e 75º percentis).​\n        </li>\n        <li>\n        geom_dotplot: Plota os pontos de dados\n        </li>\n        <li>\n        Labs(): Muda rótulos dos eixos e títulos das legendas (Isso é opcional)​\n        </li>\n        <li>\n        facet_grid(): Organiza painéis em uma grade (Isso é opcional)​\n        </li>\n        <li>\n        theme_calc(): Especifica o tema do calculador (Isso é opcional)​\n        </li>\n        <li>\n        coord_flip(): Inverter eixo (Isso é opcional)​\n        </li>\n        <li>\n        notch: Box plots com entalhe aplicam um \"entalhe\" ou estreitamento da caixa em torno da mediana. Entalhes são úteis para oferecer um guia aproximado para a significância da diferença das medianas; se os entalhes de duas caixas não se sobrepõem, isso oferece evidência de uma diferença estatisticamente significativa entre as medianas. Em um box plot com entalhe, os entalhes se estendem 1.58 * IQR / sqrt(n)\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tse 'Adicionar significância (valores-p) comparação média entre cada par de caixas' for selecionado, os códigos para valores-p no gráfico são os seguintes\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tMétodos de ajuste de valor-p:\n\t\t<br/>\n\t\tOs métodos de ajuste de valor-p incluem a correção de Bonferroni (\"bonferroni\") na qual os valores-p são multiplicados pelo número de comparações. Correções menos conservadoras também estão incluídas por Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" ou seu alias \"fdr\"), e Benjamini & Yekutieli (2001) (\"BY\"), respectivamente. Uma opção de passagem (\"none\") também está incluída. O conjunto de métodos está contido no vetor p.adjust.methods para o benefício dos métodos que precisam ter o método como uma opção e passá-lo para p.adjust.\n\t\t<br/>\n\t\t<br />\n\t\tOs primeiros quatro métodos são projetados para dar um controle forte da taxa de erro familiar. Não parece haver razão para usar a correção de Bonferroni não modificada porque ela é dominada pelo método de Holm, que também é válido sob suposições arbitrárias.\n\t\t<br/>\n\t\t<br />\n\t\tOs métodos de Hochberg e Hommel são válidos quando os testes de hipótese são independentes ou quando estão associados de forma não negativa (Sarkar, 1998; Sarkar e Chang, 1997). O método de Hommel é mais poderoso do que o de Hochberg, mas a diferença geralmente é pequena e os valores-p de Hochberg são mais rápidos de calcular.\n\t\t<br/>\n\t\t<br />\n\t\tOs métodos \"BH\" (também conhecido como \"fdr\") e \"BY\" de Benjamini, Hochberg e Yekutieli controlam a taxa de descoberta falsa, a proporção esperada de descobertas falsas entre as hipóteses rejeitadas. A taxa de descoberta falsa é uma condição menos rigorosa do que a taxa de erro familiar, então esses métodos são mais poderosos do que os outros.\n\t\t<br/>\n\t\t<br />\n\t\tVeja também \n\t\t<br/>\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br/>\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br/>\n\t\t<br />\n        <b>Pacote</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Ajuda</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Clique no botão de Ajuda R para obter ajuda detalhada em R. Você também pode digitar help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
  }
}