{
  "title": "Acordo Categórico",
  "navigation": "Acordo Categórico",
  "ratervars": "Variáveis do Avaliador:",
  "cilevel": "Nível de Confiança:",
  "options": "Avançado",
  "categLabels": "Especifique opcionalmente todas as classificações possíveis separadas por , por exemplo, 1,2,3,4,5 ou \"baixo\",\"médio\",\"alto\" ",
  "weightschkbox": "Mostrar pesos das categorias",
  "weights": "Selecionar pesos das categorias",
  "N": "Tamanho da população finita (se houver)",
  "help": {
    "title": "Acordo Categórico",
    "r_help": "help(fleiss.kappa.raw, package=irrCAC)",
    "body": "\n<b>Descrição</b></br>\nCalcula o percentual de concordância, kappa de Conger/Cohen, kappa de Fleiss, AC1/AC2 de Gwet, alfa de Krippendorff e o coeficiente de Brennan-Prediger entre múltiplos avaliadores (2, 3, +) quando os dados de entrada representam as classificações brutas relatadas para cada sujeito e cada avaliador. Versões não ponderadas e ponderadas dessas estatísticas estão disponíveis, com diferentes métodos de ponderação de categorias.</br>\nValores ausentes são incorporados nos cálculos de concordância ao acaso conforme Gwet (2014).</br>\nTambém fornecemos a opção de exibir os pesos das categorias de classificação.</br>\nPara mais informações, veja: </br></br>Gwet, K.L. (2014, ISBN:978-0970806284). “Manual de Confiabilidade entre Avaliadores,” 4ª Edição. Advanced Analytics, LLC\n</br></br>Klein, D. (2018) doi:https://doi.org/10.1177/1536867X1801800408. “Implementando uma estrutura geral para avaliar o acordo entre avaliadores no Stata,” The Stata Journal Volume 18, Número 4, pp. 871-901.</br></br> \n<b>Uso</b>\n<br/>\n<br/>\n<ul>\n<li>\n<b>Variáveis do Avaliador:</b> Variáveis correspondentes a cada avaliador onde cada coluna representa um avaliador e cada linha um sujeito. Podem ser variáveis numéricas, fatoriais, ordinais ou de caractere.</br>\n</li>\n<li>\n<b>Nível de Confiança:</b> O nível de confiança associado ao intervalo de confiança. Seu valor padrão é 0.95.</br>\n</li>\n<li>\n<b>Mostrar pesos das categorias:</b> mostra os pesos numéricos para as categorias de avaliadores de acordo com os pesos selecionados. O peso selecionado deve corresponder à proximidade desejada entre as categorias.\n</li>\n<li>\n<b>Selecionar pesos das categorias:</b> Um parâmetro obrigatório que é uma variável de string ou uma matriz. A string descreve um dos pesos pré-definidos e deve assumir um dos valores (\"não ponderado\",\"quadrático\", \"ordinal\", \"linear\", \"radical\", \"razão\", \"circular\", \"bipolar\"). </br>\nSe este parâmetro for uma matriz, então deve ser uma matriz quadrada qxq onde q é o número de categorias possíveis onde um sujeito pode ser classificado. Se algumas das q categorias possíveis não forem usadas, é fortemente aconselhável especificar a lista completa de categorias possíveis. Caso contrário, o programa pode não funcionar.</br>\nNOTA: Especificar uma matriz NÃO é suportado na sintaxe. Você precisa colar o código e editar para especificar uma matriz.</br>\n</li>\n<li>\n<b>Tamanho da população finita (se houver):</b> Parâmetro opcional representando o tamanho da população (se houver). Pode ser usado para realizar uma correção da população finita para a variância. Seu valor padrão é infinito.\n</li>\n<li>\n<b>Especifique opcionalmente todas as classificações possíveis:</b> Lista opcional usada no caso em que nenhum avaliador usa uma categoria possível. Se nada for especificado, assume-se que as categorias observadas são o conjunto completo de categorias.\n</li>\n</ul>\n<b>Pacote R</b></br>\nirrCAC</br>\n<b>Ajuda</b></br>\nEste diálogo usa as funções pa.coeff.raw, conger.kappa.raw, fleiss.kappa.raw, gwet.ac1.raw, krippen.alpha.raw e bp.coeff.raw.\nPara ajuda detalhada, veja a ajuda do pacote irrCAC no menu de três pontos > Ajuda > Ajuda do Pacote R.\n"
  }
}