{
  "title": "Probabilidades Qui-quadrado",
  "navigation": "Probabilidades Qui-quadrado",
  "varvals": "Insira o(s) valor(es) da variável separados por vírgula. Exemplo: 3,0.5",
  "degoffree": "Graus de liberdade",
  "labelSig": "Nível de significância",
  "lowtail": "Cauda inferior",
  "uptail": "Cauda superior",
  "help": {
    "title": "Probabilidades Qui-quadrado",
    "r_help": "help(pchisq, package=stats)",
    "body": "\n            ​​\n            <b>Descrição</b>\n            <br/>\n            Densidade, função de distribuição, função quantil e geração aleatória para a distribuição qui-quadrado (chi^2) com df graus de liberdade e parâmetro de não-centralidade opcional ncp.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code>\n                dchisq(x, df, ncp = 0, log = FALSE)\n                <br/>\n                pchisq(q, df, ncp = 0, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qchisq(p, df, ncp = 0, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rchisq(n, df, ncp = 0)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumentos</b>\n            <br/>\n            <ul>\n                <li>x, q : vetor de quantis.</li>\n                \n                \n                <li>p : vetor de probabilidades.</li>\n                \n                \n                <li>n : número de observações. Se length(n) > 1, o comprimento é considerado como o número necessário.</li>\n                \n                \n                <li>df : graus de liberdade (não negativo, mas pode ser não inteiro).</li>\n                \n                \n                <li>ncp : parâmetro de não-centralidade (não negativo).</li>\n                \n                \n                <li>log, log.p : lógico; se TRUE, as probabilidades p são dadas como log(p).</li>\n                \n                \n                <li>lower.tail : lógico; se TRUE (padrão), as probabilidades são P[X ≤ x], caso contrário, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalhes</b>\n            <br/>\n            A distribuição qui-quadrado com df= n ≥ 0 graus de liberdade tem densidade\n            <br/>\n            <code>f_n(x) = 1 / (2^(n/2) Γ(n/2)) x^(n/2-1) e^(-x/2)</code>\n            <br/>\n            para x > 0. A média e a variância são n e 2n.\n            <br/>\n            A distribuição qui-quadrado não-central com df= n graus de liberdade e parâmetro de não-centralidade ncp = λ tem densidade\n            <br/>\n            <code>f(x) = exp(-λ/2) SOMA_{r=0}^∞ ((λ/2)^r / r!) dchisq(x, df + 2r)</code>\n            <br/>\n            para x ≥ 0. Para n inteiro, esta é a distribuição da soma dos quadrados de n normais cada um com variância um, λ sendo a soma dos quadrados das médias normais; além disso, \n            <br/>\n             <code>E(X) = n + λ, Var(X) = 2(n + 2*λ), e E((X - E(X))^3) = 8(n + 3*λ).</code>\n             <br/>\n            Note que os graus de liberdade df= n, podem ser não inteiros, e também n = 0, o que é relevante para a não-centralidade λ > 0, veja Johnson et al (1995, capítulo 29). Nesse caso (não central, df zero), a distribuição é uma mistura de uma massa pontual em x = 0 (de tamanho pchisq(0, df=0, ncp=ncp)) e uma parte contínua, e dchisq() não é uma densidade em relação a essa medida de mistura, mas sim o limite da densidade para df -> 0.\n            <br/>\n            Note que valores de ncp maiores que cerca de 1e5 podem dar resultados imprecisos com muitos avisos para pchisq e qchisq.\n            <br/>\n            <br/><b>Valor</b>\n            <br/>\n            dchisq dá a densidade, pchisq dá a função de distribuição, qchisq dá a função quantil, e rchisq gera desvios aleatórios.\n            <br/>\n            Argumentos inválidos resultarão em valor de retorno NaN, com um aviso.\n            <br/>\n            O comprimento do resultado é determinado por n para rchisq, e é o máximo dos comprimentos dos argumentos numéricos para as outras funções.\n            <br/>\n            Os argumentos numéricos além de n são reciclados para o comprimento do resultado. Apenas os primeiros elementos dos argumentos lógicos são usados.\n            <br/>\n            <br/><b>Nota</b>\n            <br/>\n            Fornecer ncp = 0 usa o algoritmo para a distribuição não-central, que não é o mesmo algoritmo usado se ncp for omitido. Isso é para dar um comportamento consistente em casos extremos com valores de ncp muito próximos de zero.\n            <br/>\n            O código para ncp diferente de zero é principalmente destinado a ser usado para valores moderados de ncp: não será altamente preciso, especialmente nas caudas, para valores grandes."
  }
}