{
  "title": "Riscos Competitivos, um grupo",
  "navigation": "Riscos Competitivos, um grupo",
  "timevar": "Tempo até o evento ou censura",
  "eventvar": "Eventos (0 = censura, 1 = evento 1, 2 = evento 2, ...)",
  "eventnum": "Código do Evento",
  "singleeventchkbox": "Plotar para um Único Evento",
  "printallest": "Tabela de Estimativas Incluindo Todos os Tempos",
  "printspecest": "Tabela de Estimativas para Tempos Específicos",
  "spectimes": "Especifique os tempos como time1, time2, time3, etc. ou como seq(1,5,by=1)",
  "styleoptions": "Opções de Estilo",
  "axisoptions": "Opções de Eixo",
  "label12": "Clique no botão ? no canto superior direito do diálogo para detalhes sobre conjuntos de dados de exemplo e o formato de dados suportado.",
  "titleboxall": "Título do Gráfico (gráfico de todos os eventos)",
  "titleboxsingle": "Título do Gráfico (gráfico de um único evento)",
  "plottitlesizelabel": "Tamanho do Título do Gráfico (5-50)",
  "themedropdown": "Tema do Gráfico",
  "label1": "Legenda (gráfico de todos os eventos)",
  "legendpos": "Posição",
  "legendtitle": "Título",
  "eventlabels": "Rótulos de Evento (especifique rótulos separados por vírgulas na ordem dos códigos de evento: por exemplo, 'Evento 1', 'Evento 2', etc; não código de censura)",
  "legendfontsize": "Tamanho dos Rótulos da Legenda (5-50)",
  "label2": "Número em Risco",
  "natriskchkbox": "Incluir Número em Risco",
  "risktableprop": "Altura da Tabela de Risco (0-1)",
  "risktablevaluesize": "Tamanho do Valor da Tabela de Risco (1-15)",
  "risktabletitlesize": "Tamanho do Título da Tabela de Risco (5-50)",
  "risktableaxislabelsize": "Tamanho do Rótulo do Eixo da Tabela de Risco (5-50)",
  "risktableticklabelsize": "Tamanho do Rótulo do Marcador do Eixo da Tabela de Risco (5-50)",
  "risktableclean": "Remover Eixos e Linhas de Grade da Tabela de Risco",
  "label3": "Opções de Linha",
  "linesize": "Tamanho (0-5)",
  "colorpalette": "Paleta de Cores (gráfico de todos os eventos)",
  "linecolor": "Cor (gráfico de um único evento)",
  "label4": "Intervalo de Confiança",
  "cichkbox": "incluir IC de 95%",
  "labelblank": "",
  "cistyle": "Estilo",
  "citransparency": "Transparência (0-1)",
  "censorchkbox": "Incluir Tempos Censurados",
  "label5": "Eixo de Incidência",
  "incaxislabelall": "Rótulo (gráfico de todos os eventos)",
  "incaxislabelsingle": "Rótulo (gráfico de um único evento)",
  "label6": "Escala",
  "defbutton": "proporção",
  "pctbutton": "porcentagem",
  "label7": "Limites do Eixo e Incrementos de Marcador (0-1)",
  "incaxismin": "Mínimo",
  "incaxismax": "Máximo",
  "incaxisinc": "Incremento",
  "label8": "Eixo do Tempo",
  "timeaxislabel": "Rótulo",
  "label9": "Limites do Eixo e Incrementos de Marcador",
  "timeaxismin": "Mínimo",
  "timeaxismax": "Máximo",
  "timeaxisinc": "Incremento",
  "label10": "Nota: O máximo pode ser especificado sem que o incremento seja especificado. O incremento não pode ser especificado sem que o máximo seja especificado.",
  "axislabelsize": "Tamanho do Rótulo do Eixo (5-50)",
  "ticklabelsize": "Tamanho do Rótulo do Marcador do Eixo (5-50)",
  "help": {
    "title": "Riscos Competitivos, Um Grupo",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n\t\t\tVeja o conjunto de dados de exemplo no diretório de instalação, o local padrão é na letra da unidade:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\melanoma_upd.RData. A variável tempo deve ser inserida como o tempo até o evento ou censura e a variável morte deve ser inserida como os Eventos.<br/>\t\t\t\n            Este conjunto de dados é uma versão atualizada do conjunto de dados de melanoma no pacote MASS.\n            <br/>\n            <br/>\n            Um risco competitivo é um evento cuja ocorrência impede a ocorrência do evento primário de interesse. Fazer uma análise padrão de Kaplan-Meier em tais casos é tendenciosa e superestima o risco de evento. Este diálogo é usado para estimar o risco cumulativo de ter o evento primário após o início do acompanhamento para esse evento (ou tempo zero), quando um ou mais riscos competitivos estão presentes. A soma das incidências cumulativas para cada evento é igual à incidência cumulativa para qualquer evento. Os sujeitos precisam estar em risco para todos os eventos a partir do tempo zero. Gráficos de incidência cumulativa para todos os eventos (curvas separadas para cada evento no mesmo gráfico), e opcionalmente para um evento específico por si só, são fornecidos. \n            <br/>\n            Uma introdução ao tópico de riscos competitivos pode ser encontrada em \"Introdução à Análise de Dados de Sobrevivência na Presença de Riscos Competitivos\" por Peter Austin, et. al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Tempo até o evento ou censura:</b> Para cada sujeito, o tempo até o primeiro evento, se um evento ocorreu, ou último acompanhamento para eventos, se nenhum evento ocorreu.\n            <br/><br/>\n            <b>Eventos:</b> Indicador numérico de qual evento ocorreu (1=evento 1, 2=evento 2, etc.) ou quando nenhum evento ocorreu (0=censura) para cada sujeito\n            <br/><br/>\n            <b>Plotar para um Único Evento:</b> Se você deseja plotar a incidência cumulativa para um evento específico por si só. O <b>Código do Evento</b> corresponde ao evento que será plotado.\n            <br/><br/>\n            <b>Tabela de Estimativas Incluindo Todos os Tempos:</b> Opção para incluir uma tabela listando as probabilidades de incidência cumulativa e intervalos de confiança de 95% para cada tempo observado no conjunto de dados\n            <br/>\n            <br/>\n\t\t\t<b>Tabela de Estimativas para Tempos Específicos:</b> Opção para incluir uma tabela que possui as probabilidades de estimativa de sobrevivência para um conjunto de tempos selecionados pelo usuário.\n\t\t\t<br/><br/>\n\t\t\t<b>Especifique os tempos como time1, time2, time3, etc. ou como seq(1,5,by=1):</b> Estes são os tempos específicos que serão incluídos na tabela para tempos específicos. Eles podem ser especificados individualmente com vírgulas, ou como uma sequência de valores uniformemente espaçados.\n\t\t\t<br/><br/>\n            Tabelas são geradas com o tamanho da amostra, o número de sujeitos com cada evento, o tempo médio restrito em estado, e o tempo mediano de acompanhamento. O tempo mediano de acompanhamento é calculado usando o estimador de Kaplan-Meier reverso, que trata eventos verdadeiros como observações censuradas e observações censuradas verdadeiras como eventos. Assim, o \"evento\" neste estimador é \"acompanhar os sujeitos pelo maior tempo que o estudo poderia\".\n            <br/>\n            Uma tabela de estimativas de incidência cumulativa é fornecida em cada tempo observado no conjunto de dados, com intervalos de confiança de 95%. \n            <br/>\n            <br/>\n            <b>Pacotes R Necessários:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n            <br/>\n            <br/>\n            <br/>\n            <b>Opções de Estilo</b>\n            <br/>\n            <br/>\n            <b>Título do Gráfico (gráfico de todos os eventos):</b> Título do gráfico exibindo todos os eventos; delete todo o texto para não ter título\n            <br/><br/>\n            <b>Título do Gráfico (gráfico de um único evento):</b> Título do gráfico exibindo o evento único selecionado; delete todo o texto para não ter título\n\t\t\t<br/><br/>\n\t\t\t<b>Tamanho do Título do Gráfico:</b> Tamanho dos títulos do gráfico.\n\t\t\t<br/><br/>\n            <b>Tema do Gráfico:</b> Estilo geral do gráfico\n            <br/><br/>\n            <b>Opções de Legenda:</b>\n            <br/>\n            A opção <b>Posição</b> controla a localização da legenda (cima, baixo, esquerda, direita). O <b>Título</b> é o título da legenda. Para remover o título, remova todo o texto da caixa de texto. <b>Rótulos de Evento</b> são usados para mostrar texto para cada código de evento numérico em vez dos códigos. Se você especificar quaisquer rótulos, todos os eventos devem ser rotulados.\n\t\t\tA opção <b>Tamanho dos Rótulos da Legenda</b> controla o tamanho de todo o texto contido na legenda.\n            <br/>\n            <br/>\n            <b>Número em Risco:</b>\n\t\t\t<br/>\n\t\t\tOpcionalmente, inclua uma tabela para o número de sujeitos ainda em risco ao longo do tempo na parte inferior dos gráficos. A <b>Altura da Tabela de Risco</b> controla a proporção da área de plotagem que a tabela ocupará.\n\t\t\tO <b>Tamanho do Valor da Tabela de Risco</b> controla o tamanho dos números em risco. O <b>Tamanho do Título da Tabela de Risco</b> controla o tamanho do título da tabela de número em risco.\n\t\t\tO <b>Tamanho do Rótulo do Eixo da Tabela de Risco</b> controla o tamanho dos rótulos dos eixos. \n\t\t\tA <b>Tamanho do Rótulo do Marcador do Eixo da Tabela de Risco</b> controla o tamanho dos rótulos do marcador. Se for desejado remover todos os eixos e linhas de grade \n\t\t\tda tabela de número em risco, a opção <b>Remover Eixos e Linhas de Grade da Tabela de Risco</b> pode ser marcada. Isso incluirá apenas os números em risco na tabela.           \n            <br/><br/>\n            <b>Opções de Linha:</b>\n            <br/>\n            <b>Tamanho</b> controla a espessura. As opções <b>Cor</b> controlam a paleta de cores usada para as linhas no gráfico de todos os eventos e a cor da linha no gráfico de um único evento. Esquemas de cores imitando revistas científicas também são fornecidos. Pode-se opcionalmente incluir um intervalo de confiança de 95% para as estimativas em um formato de <b>ribbon</b> (área sombreada) ou <b>step</b> (linha). A <b>Transparência</b> controla quão escura é a fita e é ignorada quando a opção de passo é selecionada.\n\t\t\t<br/><br/>\n\t\t\t<b>Incluir Tempos Censurados:</b> Tempos censurados (quando os sujeitos não estão mais em risco para os eventos) podem ser incluídos como um rugoso próximo ao eixo do tempo de ambos os gráficos. Isso é mais útil em conjuntos de dados menores ou em casos de menor número de sujeitos censurados.\n            <br/><br/><br/>\n\t\t\t<b>Opções de Eixo</b>\n            <br/>\n            <br/>\n            A opção <b>Rótulo</b> especifica o rótulo de texto para o eixo. Os <b>Limites do Eixo</b> especificam os valores mínimo e máximo do eixo. A opção <b>Incrementos de Marcador do Eixo</b> controla o espaçamento dos marcadores no eixo. Os incrementos no eixo do tempo também controlam os tempos para a tabela opcional de número em risco.\n            <br/>\n            A opção <b>Escala</b> do eixo de incidência especifica se você deseja que as estimativas estejam em uma escala de proporção (0-1) ou porcentagem (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Tamanho do Rótulo do Eixo:</b>  Isso controla o tamanho dos rótulos do eixo de incidência e do eixo do tempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Tamanho do Rótulo do Marcador do Eixo:</b>  Isso controla o tamanho dos rótulos do eixo de incidência e do eixo do tempo.\t\t\t\t\n      "
  }
}