{
  "title": "Comparar N Modelos",
  "navigation": "Comparar N Modelos",
  "label1": "Compara N modelos.",
  "label2": "Selecione modelos das seguintes classes (a classe R está entre parênteses abaixo)",
  "label3": "Modelos lineares (lm), Modelo linear generalizado (glm), Modelo de efeitos mistos lineares (lme), Regressão Logística ou Probit Ordenada (polr), Modelo de risco proporcional (coxph), Modelo linear usando mínimos quadrados generalizados (gls), Modelo de regressão de sobrevivência (survreg), Ajuste de Regressão Polinomial Local (loess), Modelo de mínimos quadrados não lineares (nls), Modelos Multinomiais Log-Linear (multinom)",
  "label4": "**NOTA: Modelos criados a partir da Ajuste de Modelos (classe train) não são suportados",
  "modelselector1": "Selecione um ou mais modelos para comparar:",
  "help": {
    "title": "Comparar N Modelos",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>\nCompara 2 modelos aninhados usando um teste F ou Chi-quadrado dependendo da estimativa. Testes F são usados para estimativa de mínimos quadrados, testes chi-quadrado são usados para estimativa de máxima verossimilhança. Ambos os modelos devem ser criados no mesmo conjunto de dados, pois diferenças em valores ausentes podem causar problemas</b></br>\n<b>Descrição</b></br>\nTabelas Anova: Computa tabelas de análise de variância e realiza testes de razão de verossimilhança para um objeto de modelo ajustado.  \n<br/>\n<b>Uso</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject:  um objeto contendo os resultados retornados por uma função de ajuste de modelo (por exemplo, lm ou glm).\n</li>\n</ul>\n<b>Valor</b><br/>\nEsta função (genérica) retorna um objeto da classe anova. Esses objetos representam tabelas de análise de variância e análise de desvio. Quando dado um único argumento, produz uma tabela que testa se os termos do modelo são significativos. Quando dado uma sequência de objetos, anova testa os modelos entre si na ordem especificada.<br/>\nO método de impressão para objetos anova imprime tabelas em uma forma 'bonita'.<br/>\n<b>Aviso</b><br/>\nA comparação entre dois ou mais modelos só será válida se eles forem ajustados ao mesmo conjunto de dados. Isso pode ser um problema se houver valores ausentes e o padrão do R de na.action = na.omit for usado.<br/>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone do R no canto superior direito deste diálogo ou execute o seguinte comando no editor de sintaxe R help(anova,package='stats')</br></br>\n<b>Descrição</b></br>\nTeste de Razão de Verossimilhança de Modelos Aninhados: lrtest é uma função genérica para realizar testes de razão de verossimilhança. O método padrão pode ser empregado para comparar modelos lineares (generalizados) aninhados (veja detalhes abaixo).\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Método padrão S3:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Método S3 para a classe 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: um objeto. Veja abaixo para detalhes.\n</li>\n<li>\n...: especificações adicionais de objetos passadas para métodos. Veja abaixo para detalhes.\n</li>\n<li>\nname: uma função para extrair um nome/descrição adequado de um objeto de modelo ajustado. Por padrão, o nome é consultado chamando a fórmula.\n</li>\n<li>\ndata: um data frame contendo as variáveis no modelo.\n</li>\n</ul>\n<b>Detalhes</b></br>\nlrtest é destinado a ser uma função genérica para comparações de modelos via testes de razão de verossimilhança assintóticos. O método padrão compara consecutivamente o objeto de modelo ajustado com os modelos passados em .... Em vez de passar os objetos de modelo ajustados em ..., várias outras especificações são possíveis. O mecanismo de atualização é o mesmo que para waldtest: os modelos em ... podem ser especificados como inteiros, caracteres (ambos para termos que devem ser eliminados do modelo anterior), fórmulas de atualização ou objetos de modelo ajustados. Exceto pelo último caso, assume-se a existência de um método de atualização. Veja waldtest para detalhes.<br/>\nSubsequentemente, um teste de razão de verossimilhança assintótico para cada dois modelos consecutivos é realizado: Duas vezes a diferença nas log-verossimilhanças (conforme derivado pelos métodos logLik) é comparada com uma distribuição Chi-quadrado.<br/>\nO método \"formula\" ajusta um lm primeiro e depois chama o método padrão.<br/>\n<b>Valor</b><br/>\nUm objeto da classe \"anova\" que contém a log-verossimilhança, graus de liberdade, a diferença nos graus de liberdade, estatística Chi-quadrado da razão de verossimilhança e o valor p correspondente.\n<b>Exemplos</b><br/>\n<code> \n## com dados de Greene (1993):<br/>\n## carregar dados e computar lags<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## várias especificações equivalentes do teste LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
  }
}