{
  "title": "Calcular valores de variáveis do modelo para alcançar a resposta alvo",
  "navigation": "Calcular resposta alvo",
  "label100": "Este diálogo calcula variáveis do modelo para alcançar o valor de resposta alvo do modelo\nNota: Se houver alguma variável não numérica presente no modelo selecionado,\n         o cálculo da resposta alvo levará mais tempo",
  "modelSelection": "Selecione um modelo para calcular os valores ótimos das variáveis",
  "targetResponse": "Especifique o valor de resposta alvo (numérico) desejado para o modelo selecionado",
  "targetResponseLower": "(Opcional) Especifique o valor de resposta alvo inferior (numérico) desejado para o modelo selecionado",
  "targetResponseUpper": "(Opcional) Especifique o valor de resposta alvo superior (numérico) desejado para o modelo selecionado",
  "label200": "Restrições do Otimizador de Resposta Alvo",
  "label12": "Variáveis (fatores) no modelo selecionado listadas abaixo na mesma ordem em que aparecem no modelo",
  "factorConstraintUseDatasetLowerChk": "Restrições de Limite Inferior: Se marcado, o valor mínimo (apenas para variáveis numéricas) de cada variável usada no modelo será utilizado para o limite inferior",
  "factorConstraintLower": "Restrições de Limite Inferior: (Ignorado se marcado acima) Deixe em branco para não ter restrições no limite inferior para os valores das variáveis do modelo (ou seja, fatores). Caso contrário, você deve digitar valores separados por vírgula para cada variável do modelo. Se uma variável do modelo particular não tiver limite inferior, digite -Inf, por exemplo, 0, 0.1, -Inf, 20",
  "factorConstraintUseDatasetUpperChk": "Restrições de Limite Superior: Se marcado, o valor máximo (apenas para variáveis numéricas) de cada variável usada no modelo será utilizado para o limite superior",
  "factorConstraintUpper": "Restrições de Limite Superior: (Ignorado se marcado acima) Deixe em branco para não ter restrições no limite superior para os valores das variáveis do modelo (ou seja, fatores). Caso contrário, você deve digitar valores separados por vírgula para cada variável do modelo. Se uma variável do modelo particular não tiver limite superior, digite Inf, por exemplo, 0, 0.2, 0.9, Inf",
  "factorInitalValues": "Valores Iniciais: Deixe em branco para o sistema escolher os valores iniciais para as variáveis do modelo (apenas para variáveis numéricas) (padrão: todos zeros). Caso contrário, você deve digitar valores separados por vírgula para cada variável do modelo, por exemplo, 0, 0, 0, 0",
  "confidenceLevel": "Nível de confiança",
  "showModelEquationChk": "Mostrar equação do modelo (se o modelo contiver variáveis categóricas, a equação pode não ser exibida)",
  "help": {
    "title": "Calcular valores de variáveis do modelo (fatores) para a resposta alvo para o modelo selecionado",
    "r_help": "help(optim, package = 'stats')",
    "body": "\n        "
  }
}