{
  "title": "Gráfico Coxcomb",
  "navigation": "Coxcomb",
  "x": "Variável(s) do eixo X, especifique uma variável(s) fator",
  "y": "Variável Y, especifique uma variável numérica",
  "fill": "Preenchimento, especifique uma variável fator",
  "alpha": "Opacidade (0-1)",
  "width": "Largura",
  "rdgrp1": "Proporções de preenchimento",
  "flip": "Inverter eixo",
  "barcolor": "Cor da barra (Após a seleção da cor, clique fora do controle para aplicar)",
  "specify_a_title": "Digite um título",
  "x_title": "Rótulo do Eixo X",
  "y_title": "Rótulo do Eixo Y",
  "Facetrow": "Linha de Facetas",
  "Facetcolumn": "Coluna de Facetas",
  "Facetwrap": "Enrolar Facetas",
  "Facetscale": "Escala de Facetas",
  "facets_lbl": "Facetas",
  "help": {
    "title": "Gráfico Coxcomb",
    "r_help": "help(coord_polar, package='ggplot2')",
    "body": "\n            <b>Descrição</b></br>\nUm gráfico Coxcomb/Bulls Eye (ou gráfico circular) é um gráfico estatístico circular, que é dividido em fatias/círculos concêntricos para ilustrar proporções numéricas. Em um gráfico Coxcomb/Bulls Eye, a largura de cada círculo concêntrico (e, consequentemente, sua área) é proporcional à quantidade que representa. A quantidade pode ser representada como uma contagem ou porcentagem.</br>​\nFacetas podem ser criadas opcionalmente especificando uma variável fator. Você também pode opcionalmente especificar temas e especificar um título e rótulos para os eixos x e y.</br>\nQuando você especifica múltiplas variáveis x, criamos um gráfico Coxcomb/Bulls Eye separado para cada variável x.</br>\n<b>Uso</b>\n<br/>\n<code>\n#Você pode criar um gráfico Bulls Eye para uma única variável fator, um círculo concêntrico será criado para cada nível da variável fator. A largura do círculo concêntrico é proporcional às contagens de cada nível da variável fator. Aqui a variável fator corresponderá ao preenchimento como abaixo<br/>\n#penguins é um conjunto de dados no pacote equatiomatic R\nggplot(data=penguins,aes(x ='',fill=species)) +​\n                 geom_bar(alpha=1,width =0.9) +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"Contagem\",fill =\"var1\",title= \"Gráfico Bulls Eye com Preenchimento: espécies\")​</br></br>\n#Você pode criar um gráfico Bulls Eye especificando uma variável escala/numerica como a variável y e uma variável fator que serve como preenchimento. Aqui um círculo concêntrico é criado para cada nível da variável fator de preenchimento. A largura do círculo concêntrico é proporcional à soma dos valores y em cada nível da variável fator. Aqui a variável fator corresponderá ao preenchimento como abaixo<br/>\nggplot(data=penguins,aes(x ='', y = bill_length_mm, fill = species)) +​\n                 geom_bar(alpha=1,width =0.9,stat=\"identity\") +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"var1\",fill =\"var2\",title= \"Gráfico Bulls Eye com Estética X:, Estética Y: var1, Preenchimento: var2\") </br></br>\n\n#Você pode criar um gráfico Coxcomb especificando uma variável x. As fatias são criadas para cada nível da variável x, o raio de cada fatia é proporcional à contagem<br/>\n    ggplot(data=penguins, aes(x=island, )) +\n        geom_bar( alpha=1,width=1,) +\n        coord_polar(\"x\") +\n        labs(x=\"ilha\",  title= \"Gráfico Coxcomb com Estética X: ilha\") +\n        xlab(\"ilha\") + ylab(\"Contagem\")</br></br>\n\n#Você pode gerar um gráfico Coxcomb especificando uma variável X e um preenchimento. As fatias são criadas para cada nível da variável x. Cada fatia é preenchida pela contagem dos casos em cada nível da variável de preenchimento especificada.\nggplot(data=penguins, aes(x=island,fill=species )) +\n\tgeom_bar( alpha=1, width=1) +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"ilha\",  title= \"Gráfico Coxcomb com Estética X: ilha preenchimento: espécies\") +\n\txlab(\"ilha\") + ylab(\"Contagem\")</br></br>\n\n\n#Você pode criar um gráfico Coxcomb especificando uma variável x, variável y e preenchimento. As fatias são criadas para cada nível da variável x e preenchidas pela soma dos valores da variável y para cada nível da variável especificada no preenchimento. As fatias são divididas por níveis da variável de preenchimento. A área ocupada por cada nível da variável de preenchimento dentro da fatia é proporcional à soma das contagens da variável y que correspondem à fatia e à variável de preenchimento.<br/>\nggplot(data=penguins, aes(x=island,y=bill_depth_mm,fill=species )) +\n\tgeom_bar( alpha=1,width=1,stat = \"identity\") +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"ilha\", y=\"bill_depth_mm\", title= \"Gráfico Coxcomb com Estética X: ilha Estética Y: bill_depth_mm preenchimento: espécies\") +\n\txlab(\"ilha\") + ylab(\"bill_depth_mm\")</br></br>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ndata: O conjunto de dados padrão​\n</li>\n<li>\naes(): Gera mapeamentos estéticos que descrevem como as variáveis nos dados são mapeadas para propriedades visuais (estéticas) dos geoms.​\n</li>\n<li>\nx: (Opcional) Uma variável fator/categórica. O comprimento da barra corresponde às contagens de cada nível da variável fator.​\n</li>\n<li>\nY: (Opcional) uma variável numérica\n</li>\n<li>\nfill: (Opcional) Uma variável fator/categórica opcional para agrupar as contagens dos níveis em x: (veja acima)​\n</li>\n<li>\ngeom_bar(): Cria o gráfico de barras, position =\"fill\" preenche a barra com uma porcentagem de cada nível de agrupamento.​\n</li>\n<li>\nCoor_polar(): O sistema de coordenadas polares é mais comumente usado para gráficos de pizza, que são um gráfico de barras empilhadas em coordenadas polares.\n</li>\n<li>\nLabs(): Altera rótulos de eixos e títulos de legenda (Isto é opcional)​\n</li>\n<li>\nfacet_grid(): Organiza painéis em uma grade (Isto é opcional)​\n</li>\n<li>\ntheme_calc(): Especifica o tema do calculador (Isto é opcional)​\n</li>\n<li>\ncoord_flip(): Inverter eixo (Isto é opcional)​\n</li>\n<li>\nalpha: Controla a opacidade, aceita valores entre 0-1. 1 significa sem opacidade.\n</li>\n</ul>\n<b>Pacote</b></br>\nggplot2;ggthemes;</br>\n<b>Ajuda</b></br>\nhelp(coord_polar, package=ggplot2)</br>\nOutro: Clique no botão de Ajuda R para obter ajuda detalhada em R. Você também pode digitar help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n    "
  }
}