{
  "title": "Cox, Fine-Gray",
  "navigation": "Cox, Fine-Gray",
  "modelname": "Digite o nome do modelo",
  "timevar": "Tempo até o evento ou censura",
  "eventvar": "Eventos (0 = censura, 1 = evento 1, 2 = evento 2, ...)",
  "eventcodelabel": "Código do Evento",
  "modelterms": "Construtor de expressão do modelo para variáveis independentes",
  "stratavarslabel": "Variáveis de Estratificação (opcional)",
  "weightvar": "Pesos (opcional)",
  "tiemethod": "Método de Tempo Empatado",
  "diagnosticsbox": "Diagnósticos do Modelo",
  "martminlabel": "Valor Mínimo do Eixo de Resíduos de Martingale do Modelo Nulo (-Inf a 1)",
  "anovachkboxlabel": "Análise de Deviância (Tipo II)",
  "help": {
    "title": "Cox, Fine-Gray",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nAjusta um modelo de riscos proporcionais de Cox Fine-Gray para dados de tempo até o evento com observações censuradas quando riscos concorrentes estão presentes. Os modelos Fine-Gray modelam o efeito de \nvariáveis explicativas na função de incidência cumulativa. Uma alternativa é modelar o efeito de variáveis explicativas no risco específico da causa, para o qual modelos de regressão de Cox padrão \npodem ser usados. Uma introdução ao tema de riscos concorrentes pode ser encontrada em \"Introdução à Análise de Dados de Sobrevivência na Presença de Riscos Concorrentes\" por Peter Austin, \net. al., Circulation, 2016; 133:601-609. \n<br/><br/>\nEstatísticas de ajuste do modelo, estimativas de parâmetros e razões de risco são fornecidas. As opções disponíveis incluem o método de tempo empatado e diagnósticos do modelo. O modelo é ajustado usando as \nfunções finegray e coxph no pacote survival.\n<br/><br/>\n<b>Digite o nome do modelo:</b> Especifique o nome do modelo onde os resultados serão armazenados.\n<br/><br/>\n<b>Tempo até o evento ou censura:</b> Tempo até o primeiro evento para aqueles que estão experimentando um evento ou tempo até o último acompanhamento para aqueles que não estão experimentando nenhum evento\n<br/><br/>\n<b>Eventos (0 = censura, 1 = evento 1, 2 = evento 2, ...):</b> Indicador numérico de evento; 0=censura, 1=evento 1, 2=evento 2, etc.\n<br/><br/>\n<b>Código do Evento:</b> Selecione o evento de interesse que você deseja modelar. Pode ser selecionado ou digitado.\n<br/><br/>\n<b>Construtor de Fórmulas:</b> Construa termos para incluir no modelo. Fatores, strings e variáveis lógicas serão codificadas como variáveis fictícias. Os botões fornecidos permitem que você especifique efeitos principais, efeitos fatoriais completos (efeitos principais e todas as interações com as variáveis envolvidas), polinômios, interações específicas e exclua termos da lista. Interações \ncom variáveis de estratificação são permitidas.\n<br/><br/>\n<b>Variáveis de Estratificação:</b> Especifique uma ou mais variáveis de estratificação. Estas podem ser variáveis numéricas, fatoriais, fatoriais ordenadas ou variáveis de caractere. Os estratos dividem os \nsujeitos em grupos separados, onde cada grupo tem uma função de risco basal distinta. Se várias variáveis de estratificação forem fornecidas, uma função de risco basal separada é \nutilizada para cada combinação de níveis de variáveis de estratificação.\n<br/><br/>\n<b>Pesos:</b> Variável numérica para pesos de observação. Útil em situações onde cada registro não deve ser contado como uma observação.\n<br/><br/>\n<b>Método de Tempo Empatado:</b> Método para quebrar tempos observados empatados. Efron é geralmente a melhor escolha quando não há muitos tempos empatados.\n<br/><br/>\n<b>Diagnósticos do Modelo:</b> Se selecionado, uma avaliação de riscos proporcionais e forma funcional de variáveis explicativas será avaliada, incluindo gráficos relevantes. \nSe houver variáveis de estratificação ou preditores não numéricos, gráficos de forma funcional não serão produzidos. \nO <b>Valor Mínimo do Eixo de Resíduos de Martingale do Modelo Nulo</b> pode precisar ser alterado para ver todos os resíduos de Martingale.\n<br/><br/>\n<b>Análise de Deviância (Tipo II):</b> Se selecionado, testes de variáveis inteiras (incluindo testes de múltiplos graus de liberdade para variáveis categóricas múltiplas) serão fornecidos. Testes de Wald \nsão usados.\n<br/><br/>\n<b>Pacotes R necessários:</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nClique no botão de Ajuda R para obter ajuda detalhada sobre a função coxph. Vá para Ajuda-> Ajuda da Função R para obter mais informações sobre a função finegray, que cria o \ndataset necessário.\n"
  }
}