{
  "title": "Cox, Básico",
  "navigation": "Cox, Básico",
  "helplabel": "Clique no botão ? no canto superior direito da caixa de diálogo para detalhes sobre conjuntos de dados de amostra e o formato de dados suportado.",
  "modelname": "Digite o Nome do Modelo",
  "timevar": "Tempo até o evento ou censura",
  "eventvar": "Eventos (1 = evento 1, 0 = censura)",
  "destvars": "Variáveis Independentes",
  "weightvar": "Pesos (opcional)",
  "tiemethod": "Método de Tempo Empatado",
  "forestplotbox": "Gráfico de Floresta",
  "diagnosticsbox": "Diagnósticos do Modelo",
  "martscalebox": "Valor Mínimo do Eixo de Resíduos de Martingale do Modelo Nulo (-Inf a 1):",
  "devbox": "Análise de Deviância (Tipo II)",
  "devtype": "Estatística do Teste",
  "help": {
    "title": "Cox, Básico",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n\t\t\tVeja o conjunto de dados de amostra no diretório de instalação, o local padrão é na letra da unidade:&bsol;program files&bsol;BioStat Prime&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. A variável Followup_time deve ser inserida como o tempo até o evento ou censura e a variável Event deve ser inserida como os Eventos (1 = evento, 0 = censura). Sexo, idade e IMC podem ser as variáveis independentes. \n\t\t\t<br/>\n            A variável de evento deve ser numérica, fatores não são permitidos. Se você tiver uma variável de evento que é do tipo fator com 2 valores, por exemplo, 0 e 1, converta-a para numérica\n\t\t\tEste conjunto de dados é uma versão atualizada do conjunto de dados mockstudy no pacote arsenal.\n\t\t\t<br/><br/>\n            <b>Modelo de Risco Proporcional de Cox</b>\n            <br/>\n            <br/>\n            Ajusta um modelo de riscos proporcionais de Cox para dados de tempo até o evento com observações censuradas. Estatísticas de ajuste do modelo, estimativas de parâmetros e razões de risco são fornecidas. As opções disponíveis incluem o método de tempo empatado, diagnósticos do modelo, como avaliações de riscos proporcionais e forma funcional de covariáveis, e um gráfico de floresta de razões de risco com intervalos de confiança. O modelo é ajustado usando a função coxph no pacote survival.\n            <br/>\n            <br/>\n            <b>Tempo:</b> Tempo até o evento para aqueles que experimentam o evento ou tempo até o último acompanhamento para aqueles que não experimentam o evento\n            <br/><br/>\n            <b>Evento:</b> Indicador numérico de evento; 1=evento, 0=censura\n            <br/><br/>\n            <b>Variáveis Independentes:</b> Variáveis independentes a serem incluídas no modelo. Fatores, strings e variáveis lógicas serão codificadas como variáveis fictícias.\n            <br/><br/>\n            <b>Pesos:</b> Variável numérica para pesos de observação. Útil em situações onde cada registro não deve ser contado como uma observação. \n            <br/>\n            <br/>\n            <b>Pacotes necessários:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Clique no botão Obter Ajuda R para obter ajuda detalhada sobre a função coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Opções</b>\n            <br/>\n            <br/>\n            <b>Método de Tempo Empatado:</b>\n            <br/>\n            Método para quebrar os tempos observados empatados. Efron é geralmente a melhor escolha quando não há muitos tempos empatados. O método exato pode ser benéfico se houver muitos tempos empatados, como em situações de tempo discreto, mas pode levar um pouco mais de tempo para o modelo ser ajustado. \n            <br/>\n            <br/>\n            <b>Gráfico de Floresta:</b>\n            <br/>\n            Gráfico de razões de risco e intervalos de confiança para cada preditor no modelo.\n            <br/>\n            <br/>\n            <b>Diagnósticos do Modelo:</b>\n            <br/>\n            Se selecionado, testes e gráficos de riscos proporcionais serão fornecidos, além de avaliações da forma funcional para cada covariável no modelo. A opção de valor mínimo do eixo de resíduos de Martingale do modelo nulo pode precisar ser alterada para que todos os resíduos apareçam no gráfico. Para obter avaliações da forma funcional, você deve especificar apenas preditores numéricos e não ter dados ausentes. Veja Variáveis > Valores Ausentes > Remover NAs.\n            <br/>\n            <br/>\n            <b>Análise de Deviância (Tipo II):</b>\n            Teste global de cada preditor no modelo. Testes de múltiplos graus de liberdade serão fornecidos para efeitos com mais de 2 níveis. Testes de Wald e razão de verossimilhança podem ser obtidos, com testes de razão de verossimilhança tendo melhores propriedades em pequenas amostras.\n            \n      "
  }
}