{
  "title": "Cox, covariáveis binárias dependentes do tempo",
  "navigation": "Cox, covariáveis binárias dependentes do tempo",
  "modelname": "Insira o nome do modelo",
  "timevar": "Tempo até o evento ou censura",
  "eventvar": "Eventos (1 = evento 1, 0 = censura)",
  "modelterms": "Construtor de expressão do modelo para variáveis independentes",
  "switchtimeslabel": "Variáveis de tempo de exposição para covariáveis dependentes do tempo",
  "tdprefixlabel": "Prefixo para covariáveis dependentes do tempo",
  "subjectidlabel": "Identificador do sujeito",
  "weightvar": "Pesos (opcional)",
  "tiemethod": "Método de Tempo Empatado",
  "forestplotbox": "Gráfico de Floresta",
  "diagnosticsbox": "Diagnósticos do Modelo",
  "martscalebox": "Valor Mínimo do Eixo de Resíduos de Martingale do Modelo Nulo (-Inf a 1):",
  "devbox": "Análise de Deviância (Tipo II)",
  "devtype": "Estatística do Teste",
  "startstopboxlabel": "Mostrar conjunto de dados de tempo (início, parada)",
  "startstopnamelabel": "Nome do conjunto de dados",
  "help": {
    "title": "Cox, covariáveis binárias dependentes do tempo",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nAjusta um modelo de riscos proporcionais de Cox para dados de tempo até o evento com observações censuradas que inclui uma ou mais covariáveis de \"exposição\" dependentes do tempo. Este tipo de \ncovariável é uma onde a ocorrência de um \"sim\" pode acontecer após o início do acompanhamento e uma vez que esse \"sim\" ocorre, ele permanece um \"sim\" durante a duração do acompanhamento. Um exemplo \nseria a rejeição de um enxerto pós-transplante (ou seja, antes da rejeição ocorrer, o paciente não foi \"exposto\"; após a rejeição ocorrer, o paciente foi \"exposto\").  \nTratar tal covariável como sendo conhecida no início do acompanhamento é uma forma de olhar para o futuro e leva a estimativas enviesadas (também conhecido como \"viés de tempo imortal\").\n<br/><br/>\nEstatísticas de ajuste do modelo, estimativas de parâmetros e razões de risco são fornecidas. As opções disponíveis incluem o método de tempo empatado, gráficos de floresta, diagnósticos do modelo e a capacidade \nde visualizar o conjunto de dados do processo de contagem subjacente que é criado. Uma tabela descrevendo os dados do processo de contagem é fornecida como um verificador de que esses dados estão sendo criados \napropriadamente.\n<br/><br/>  \nSumários de dados do processo de contagem:\n<br/>\n<b>precoce:</b> tempo quando o preditor muda antes do início do tempo de acompanhamento<br/>\n<b>tarde:</b> tempo quando o preditor muda após o término do acompanhamento<br/>\n<b>dentro:</b> tempo quando o preditor muda dentro do período de acompanhamento<br/>\n<b>liderando:</b> tempo quando o preditor muda no início do acompanhamento<br/>\n<b>seguindo:</b> tempo quando o preditor muda no final do acompanhamento<br/>\n<b>limite:</b> tempo quando o preditor muda no início ou no final do acompanhamento\n<br/><br/>\nPara mais informações sobre esta tabela, veja o vignettes de covariáveis dependentes do tempo em <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>.  \n<br/><br/>\nO modelo é ajustado usando a função coxph no pacote survival.\n<br/><br/>\n<b>Insira o nome do modelo:</b> Nome onde os resultados do modelo serão armazenados\n<br/><br/>\n<b>Tempo até o evento ou censura:</b> Tempo até o evento de resultado para aqueles que experimentam o evento ou tempo até o último acompanhamento para aqueles que não experimentam o evento de resultado\n<br/><br/>\n<b>Eventos (1=evento, 0=censura):</b> Indicador numérico de evento; 1=evento, 0=censura\n<br/><br/>\n<b>Construtor de Fórmulas:</b> Construa termos para incluir no modelo. Fatores, strings e variáveis lógicas serão codificadas como variáveis fictícias. Os botões fornecidos permitem que você especifique efeitos principais, efeitos fatoriais completos (efeitos principais e todas as interações com as variáveis envolvidas), polinômios, interações específicas e exclua termos da lista.\n<br/><br/>\n<b>Variáveis de tempo de exposição para covariáveis dependentes do tempo:</b> Variáveis numéricas armazenando o tempo quando o sujeito foi primeiro \"exposto\". Isso deve estar na mesma escala de tempo que \na variável de Tempo. Valores ausentes devem ser usados para sujeitos que nunca foram expostos. Cada variável especificada aqui criará uma covariável dependente do tempo separada. Um \ntempo especificado assume que um sujeito não está exposto antes deste tempo e exposto após este tempo (ou seja, quando o preditor muda de \"não\" para \"sim\"). Especificar apenas valores positivos significa \nque os sujeitos não estão expostos por algum tempo após o início do acompanhamento. Especificar alguns tempos positivos e negativos indica que alguns sujeitos foram expostos após e alguns antes \ndo início do acompanhamento, respectivamente. Se você sabe que um sujeito foi exposto antes do início do acompanhamento, mas não sabe exatamente quando, então você pode usar qualquer tempo negativo \ne o modelo tratará corretamente esse sujeito como exposto durante todo o seu tempo de acompanhamento. Se os sujeitos forem expostos após o acompanhamento, então eles são tratados corretamente como não \nestando expostos durante todo o seu tempo de acompanhamento.\n<br/><br/>\n<b>Prefixo para covariáveis dependentes do tempo:</b> Prefixo desejado a ser usado para cada covariável dependente do tempo especificada no campo <b>Variáveis de tempo de exposição</b>. O nome de\ntodas as covariáveis dependentes do tempo começará com este prefixo.\n<br/><br/>\n<b>Identificador do sujeito:</b> A variável que armazena o identificador do sujeito. Isso é necessário para fins de criação do conjunto de dados do processo de contagem subjacente.\n<br/><br/>\n<b>Pesos:</b> Variável numérica para pesos de observação. Útil em situações onde cada registro não deve ser contado como uma observação.\n<br/><br/>\n<b>Opções:</b>\n<br/><br/>\n<b>Método de Tempo Empatado:</b> Método de quebra de tempos observados empatados. Efron é geralmente a melhor escolha quando não há muitos tempos empatados. O método exato pode ser benéfico se \nhouver muitos tempos empatados, como em situações de tempo discreto, mas pode levar um pouco mais de tempo para o modelo ser ajustado.\n<br/><br/>\n<b>Gráfico de Floresta:</b> criará um gráfico de floresta de razões de risco e intervalos de confiança\n<br/><br/>\n<b>Mostrar Conjunto de Dados (início, parada):</b> Mostrará o conjunto de dados do processo de contagem subjacente usado nos cálculos. Isso divide o tempo de acompanhamento de cada sujeito em partes, dependendo \nde quando a covariável dependente do tempo deve mudar de valores.\n<br/><br/>\n<b>Diagnósticos do Modelo:</b> Se selecionado, testes e gráficos de riscos proporcionais serão fornecidos, além de avaliações da forma funcional para cada covariável no modelo.  \nA opção de valor mínimo do eixo de resíduos de Martingale do modelo nulo pode precisar ser alterada para que todos os resíduos apareçam no gráfico. Para obter avaliações da forma funcional, você deve \nespecificar apenas preditores numéricos e não ter dados ausentes. Veja Variáveis > Valores Ausentes > Remover NAs.\n<br/><br/>\n<b>Análise de Deviância (Tipo II):</b> Teste global de cada preditor no modelo. Testes de múltiplos graus de liberdade serão fornecidos para efeitos com mais de 2 níveis.  \nTestes de Wald e razão de verossimilhança podem ser obtidos, com testes de razão de verossimilhança tendo melhores propriedades em pequenas amostras.           \n<br/><br/>\n<b>Pacotes necessários:</b> survival, broom, survminer, car\n"
  }
}