{
  "title": "Tabela Cruzada",
  "navigation": "Tabela Cruzada",
  "label6": "Quando várias variáveis de linha e coluna são especificadas, geramos uma tabela cruzada separada para cada par de variáveis de linha e coluna.",
  "rowlabel": "Variável de Linha",
  "collabel": "Variável de Coluna",
  "layerlabel": "Variável(is) de Camada",
  "weightlabel": "Peso (um)",
  "label1": "Estatísticas",
  "chisqlabel": "Chisq",
  "chisqNoContCorrection": "Sem correção de continuidade para o teste qui-quadrado",
  "chisqContCorrection": "Aplicar correção de continuidade para o teste qui-quadrado (Aplica-se a uma tabela 2 por 2)",
  "chisqSimulatePValues": "Calcular valores p usando simulação de Monte Carlo",
  "chisqNoOfReplicates": "Número de replicações usadas no teste de Monte Carlo",
  "mcnemar": "McNemar",
  "mcnemarContCorrection": "Aplicar correção de continuidade para o teste de McNemar (Aplica-se a uma tabela 2 por 2)",
  "fisher": "Fisher",
  "fisherSimulatePValues": "Calcular valores p usando simulação de Monte Carlo",
  "fisherNoOfReplicates": "Número de replicações usadas no teste de Monte Carlo",
  "fishersAlternative": "Hipótese alternativa para o teste Exato de Fisher",
  "label2": "Resíduos",
  "unstandardized": "Não padronizado",
  "standardized": "Padronizado",
  "adjusted": "Ajustado",
  "label3": "Porcentagens",
  "rowpercent": "Linha",
  "colpercent": "Coluna",
  "label4": "Contagens",
  "expected": "Esperado",
  "label5": "Formato de saída",
  "longTbl": "Tabela estilo lista (Restringir largura da tabela quando muitos níveis)",
  "help": {
    "title": "Tabela Cruzada",
    "r_help": "help(CrossTable, package=gmodels)",
    "body": "\n            <b>Descrição</b></br>\nCria uma tabela cruzada com variáveis de linha, coluna e camada. Quando várias variáveis de linha e coluna são especificadas, geramos uma tabela cruzada separada para cada par de variáveis de linha e coluna. Além disso, os seguintes itens são exibidos<br/>\nContagens esperadas<br/>\nPorcentagens de linha e coluna<br/>\nResíduos não padronizados, padronizados e ajustados<br/>\nChisq com razão de chances, estatísticas de McNemar e Fisher<br/>\nNOTA: Removemos automaticamente todas as linhas onde cada contagem é 0. Isso pode impactar como os testes de Chisq, McNemar e Fisher são executados. Por exemplo, você pode esperar 3 linhas e 2 colunas, pois a variável de linha tem 3 níveis e a variável de coluna 2 níveis. No entanto, como um nível de linha tem todas as contagens 0, você obtém uma tabela 2*2. Enquanto a simulação de Monte Carlo com o teste de Fisher é executada em uma tabela 3*2, ela não se aplica a uma tabela 2*2 e o teste normal de Fisher é executado. \n<br/>\n<b>Uso</b>\n<br/>\n<code> \nBSkyCrossTable(x,y,layers, weight, datasetname, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE,long_table = FALSE )\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: variável de linha\n</li>\n<li>\ny: variável de coluna\n</li>\n<li>\nlayers: uma ou mais variáveis para camadas\n</li>\n<li>\nweights: uma variável numérica contendo os pesos de frequência\n</li>\n<li>\ndatasetname: Nome do conjunto de dados do qual x,y e layers (variáveis) são escolhidos\n</li>\n<li>\nchisq:  se TRUE gera tabela qui-quadrado\n</li>\n<li>\nprop.r: Porcentagens de linha são produzidas se isso for TRUE\n</li>\n<li>\nprop.c: Porcentagens de coluna são geradas se isso for TRUE\n</li>\n<li>\nresid: se TRUE, resíduos não padronizados são gerados\n</li>\n<li>\nsresid: se TRUE, resíduos padronizados são gerados\n</li>\n<li>\nexpected: Contagens esperadas são geradas se isso for TRUE\n</li>\n<li>\nasresid:  se TRUE, resíduos ajustados são gerados\n</li>\n<li>\nlong_table: A opção de tabela longa é introduzida para acomodar análises feitas em um grande número de variáveis. Escolher o formato longo controla a largura da tabela de saída, facilitando a visualização dos resultados sem precisar rolar para a direita na janela de saída. \n</li>\n</ul>\n<b>valor</b></br>\nUma lista com os resultados\n<br/>\n<b>Exemplo</b></br>\n<code> \nBSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>\nlayers=c('type'),datasetname='Dataset2',<br/>\nchisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>\nresid=FALSE,sresid=FALSE,expected=FALSE,<br/>\nasresid=FALSE)</br>\nBSkyFormat(BSky_Multiway_Cross_Tab)</br>\n</code> <br/>\n<b>Pacote</b></br>\ngmodels</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando help(CrossTable, package=gmodels) criando um bloco de código R clicando + na janela de saída  \n    "
  }
}