{
  "title": "Teste Diagnóstico",
  "navigation": "Teste Diagnóstico",
  "outvar": "Variável de Resultado (1=positivo, 0=negativo):",
  "testvar": "Variável de Teste (1=positivo, 0=negativo):",
  "cilevel": "Nível de Confiança:",
  "help": {
    "title": "Teste Diagnóstico",
    "r_help": "help(epi.tests,package=epiR)",
    "body": "\n<b>Descrição</b></br>\nIsso calcula várias medidas apropriadas em estudos de teste diagnóstico para um teste binário versus um resultado padrão ouro binário para detectar uma \"doença\".<br/>\nVariável de Resultado: Variável contendo os valores para o padrão ouro. Isso deve ser uma variável numérica codificada como 1 = \"doença\" positiva e 0 = \"doença\" negativa, uma vez que os cálculos dependem dessa ordem.<br/>\nVariável de Teste: Variável contendo os valores para o teste em consideração. Isso deve ser uma variável numérica codificada como 1 = \"doença\" positiva e 0 = \"doença\" negativa, uma vez que os cálculos dependem dessa ordem.<br/>\nNível de Confiança: Nível desejado de intervalo de confiança<br/>\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nepi.tests(dat, conf.level = 0.95)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ndat: Um objeto da classe tabela contendo as frequências individuais das células criadas pela tabulação da variável de resultado e da variável de teste. A Variável de Resultado contém os valores para o padrão ouro. Isso deve ser uma variável numérica codificada como 1 = \"doença\" positiva e 0 = \"doença\" negativa, uma vez que os cálculos dependem dessa ordem. A variável de teste contém os valores para o teste em consideração. Isso deve ser uma variável numérica codificada como 1 = \"doença\" positiva e 0 = \"doença\" negativa, uma vez que os cálculos dependem dessa ordem.\n</li>\n<li>\nNível de Confiança: Nível desejado de intervalo de confiança\n</li>\n</ul>\n<b>Detalhes</b></br>\nLimites de confiança binomial exatos são calculados para sensibilidade do teste, especificidade e valor preditivo positivo e negativo (veja Collett 1999 para detalhes).</br>\nOs intervalos de confiança para razões de verossimilhança positiva e negativa são baseados em fórmulas fornecidas por Simel et al. (1991).</br>\nA precisão diagnóstica é definida como a proporção de todos os testes que dão um resultado correto. A razão de chances diagnóstica é definida como quão mais provável será o teste fazer um diagnóstico correto do que um diagnóstico incorreto em pacientes com a doença (Scott et al. 2008). O número necessário para diagnosticar é definido como o número de pacientes que precisam ser testados para dar um teste positivo correto. O índice de Youden é a diferença entre a taxa de verdadeiro positivo e a taxa de falso positivo. O índice de Youden varia de -1 a +1 com valores mais próximos de 1 se tanto a sensibilidade quanto a especificidade forem altas (ou seja, próximas de 1).</br>\n<b>Valor</b></br>\nVeja a ajuda detalhada abaixo para acessar a ajuda do R que descreverá os valores retornados</br>\n<b>Pacote</b></br>\nepiR;DescTools</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone do R no canto superior direito deste diálogo ou execute o seguinte comando help(epi.tests,package=epiR) criando um bloco de código R clicando + na janela de saída\n\t\t\t"
  }
}