{
  "title": "Ajuste de distribuições univariadas a dados não censurados",
  "navigation": "Ajuste de Distribuição",
  "variableSelcted": "Selecione uma variável que contenha a distribuição",
  "label2": "Teste de ajuste para várias distribuições",
  "normDistChk": "Normal",
  "weibullDistChk": "Weibull",
  "lnormDistChk": "Log Normal",
  "poissonDistChk": "Poisson",
  "expDistChk": "Exponencial",
  "gammaDistChk": "Gamma",
  "nbinomDistChk": "Binomial Negativa",
  "geomDistChk": "Geométrica",
  "betaDistChk": "Beta",
  "unifDistChk": "Uniforme",
  "logisDistChk": "Logística",
  "cauchyDistChk": "Cauchy",
  "method": "Método de ajuste",
  "gof": "Bondade de ajuste (gof) - necessário apenas quando o método 'mge' de ajuste é escolhido acima",
  "help": {
    "title": "Ajuste de distribuições univariadas a dados não censurados",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descrição</b></br>\n\t\t\t\tAjuste de distribuições univariadas a dados não censurados por máxima verossimilhança (mle), correspondência de momentos (mme), correspondência de quantis (qme) ou maximização da estimativa de bondade de ajuste (mge), que também é conhecido como minimização da estimativa de distância.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara ajuda detalhada - use R help(fitdist, package = fitdistrplus) e help(gofstat, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tOs quatro métodos de ajuste possíveis são descritos abaixo:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method=\"mle\" (padrão)\n\t\t\t\tA estimativa de máxima verossimilhança consiste em maximizar a log-verossimilhança. Uma otimização numérica é realizada em mledist via optim para encontrar os melhores valores (veja mledist para detalhes).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method=\"mme\"\n\t\t\t\tA estimativa de correspondência de momentos consiste em igualar momentos teóricos e empíricos. Os valores estimados dos parâmetros da distribuição são calculados por uma fórmula de forma fechada para as seguintes distribuições: \"norm\", \"lnorm\", \"pois\", \"exp\", \"gamma\", \"nbinom\", \"geom\", \"beta\", \"unif\" e \"logis\". Caso contrário, os momentos teóricos e empíricos são igualados numericamente, pela minimização da soma das diferenças quadráticas entre os momentos observados e teóricos. Neste último caso, argumentos adicionais são necessários na chamada para fitdist: order e memp (veja mmedist para detalhes).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method = \"qme\"\n\t\t\t\tA estimativa de correspondência de quantis consiste em igualar quantis teóricos e empíricos. Uma otimização numérica é realizada em qmedist via optim para minimizar a soma das diferenças quadráticas entre os quantis observados e teóricos. O uso deste método requer um argumento adicional probs, definido como o vetor numérico das probabilidades para as quais o(s) quantil(is) deve(m) ser igualado(s) (veja qmedist para detalhes).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method = \"mge\"\n\t\t\t\tA estimativa de máxima bondade de ajuste consiste em maximizar uma estatística de bondade de ajuste. Uma otimização numérica é realizada em mgedist via optim para minimizar a distância de bondade de ajuste. O uso deste método requer um argumento adicional gof codificando a distância de bondade de ajuste escolhida. Pode-se usar a distância clássica de Cramer-von Mises (\"CvM\"), a distância clássica de Kolmogorov-Smirnov (\"KS\"), a distância clássica de Anderson-Darling (\"AD\") que dá mais peso às caudas da distribuição, ou uma das variantes desta última distância proposta por Luceno (2006) (veja mgedist para mais detalhes). Este método não é adequado para distribuições discretas.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tQuando method = \"mse\"\n\t\t\t\tA estimativa de máxima bondade de ajuste consiste em maximizar o espaçamento logarítmico médio. Uma otimização numérica é realizada em msedist via optim.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tconvergência é \n\t\t\t\tum código inteiro para a convergência de optim/constrOptim definido como abaixo ou definido pelo usuário na função de otimização fornecida pelo usuário. 0 indica convergência bem-sucedida. 1 indica que o limite de iteração de optim foi alcançado. 10 indica degeneração do simplex de Nealder-Mead. 100 indica que optim encontrou um erro interno.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tEstatísticas de bondade de ajuste são calculadas por gofstat(). A estatística do qui-quadrado é calculada usando células definidas pelo argumento chisqbreaks ou células definidas automaticamente a partir dos dados, a fim de alcançar aproximadamente o mesmo número de observações por célula, aproximadamente igual ao argumento meancount, ou ligeiramente mais se houver algumas empates. \n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara distribuições contínuas, as estatísticas de Kolmogorov-Smirnov, Cramer-von Mises e Anderson-Darling também são calculadas, conforme definido por Stephens (1986).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tEstatísticas de importância são as estatísticas de Cramer-von Mises, Anderson-Darling e Kolmogorov para distribuições contínuas e estatísticas do qui-quadrado para as discretas (\"binom\", \"nbinom\", \"geom\", \"hyper\" e \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Para uma boa visão geral do ajuste de distribuição, veja https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Para uma boa visão geral do ajuste de distribuição, veja https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}