{
  "title": "Gráfico de Cullen e Frey com descritivos de uma distribuição empírica para dados não censurados",
  "navigation": "Análise de Distribuição (gráfico de Cullen e Frey)",
  "variableSelcted": "Selecione uma variável que contenha a distribuição",
  "boot": "(Opcional) Valores de boot de assimetria e curtose. Se especificado, deve ser um inteiro acima de 10",
  "discreteChk": "Discreto - desmarcado (padrão) para uniforme, normal, logístico, lognormal, beta e gama. Marcado para poisson e binomial negativa",
  "method": "Não enviesado (padrão) para valores estimados não enviesados de estatísticas ou amostra para valores de amostra",
  "help": {
    "title": "Descrição de uma distribuição empírica para dados não censurados",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Descrição</b></br>\n\t\t\t\tComputa parâmetros descritivos de uma distribuição empírica para dados não censurados e fornece um gráfico de assimetria-curtose\n\t\t\t\t<br/>\n\t\t\t\tPara a ajuda detalhada - use R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMínimo, máximo, mediana, média, desvio padrão da amostra e amostra (se método==\"amostra\") ou por padrão estimativas não enviesadas de \n\t\t\t\tvalores de assimetria e curtose de Pearson são impressas (Sokal e Rohlf, 1995). Um gráfico de assimetria-curtose como o \n\t\t\t\tproposto por Cullen e Frey (1999) é dado para a distribuição empírica. Neste gráfico, valores para distribuições comuns \n\t\t\t\ntambém são exibidos como ferramentas para ajudar na escolha de distribuições a se ajustar aos dados. Para algumas \n\t\t\t\tdistribuições (normal, uniforme, logístico, exponencial por exemplo), há apenas um valor possível para a assimetria \n\t\t\t\te a curtose (para uma distribuição normal, por exemplo, assimetria = 0 e curtose = 3), e a distribuição é assim \n\t\t\t\trepresentada por um ponto no gráfico. Para outras distribuições, áreas de valores possíveis são representadas, consistindo em \n\t\t\t\tlinhas (distribuições gama e lognormal, por exemplo), ou áreas maiores (distribuição beta, por exemplo). \n\t\t\t\tA distribuição Weibull não é representada no gráfico, mas é indicada na legenda que formas próximas a \n\t\t\t\tdistribuições lognormal e gama podem ser obtidas com esta distribuição.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara levar em conta a incerteza dos valores estimados de curtose e assimetria a partir dos dados, o conjunto de dados \n\t\t\t\tpode ser bootstraped fixando o argumento boot para um inteiro acima de 10. Valores de boot de assimetria e curtose \n\t\t\t\tcorrespondentes às amostras bootstrap são então computados e relatados em azul no gráfico de assimetria-curtose.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSe discreto for VERDADEIRO, as distribuições representadas são as distribuições de Poisson, binomial negativa e a distribuição \n\t\t\t\tnormal para a qual distribuições discretas anteriores podem convergir. Se discreto for FALSO, estas são distribuições uniforme, normal, \n\t\t\tblogística, lognormal, beta e gama.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Para uma boa visão geral do ajuste de distribuição, veja https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}