{
  "title": "Uma visão geral rápida da funcionalidade de Design de Experimentos (DoE)",
  "navigation": "Visão Geral do DoE",
  "lbl1": " 1. Para criar qualquer Design sob o DOE -> menu criar design, primeiro você precisa de um conjunto de dados com detalhes dos fatores para criar o design a partir dele",
  "lbl2": " 2. Para começar, escolha um dos conjuntos de dados de exemplo (arquivo excel) fornecidos no diretório de conjuntos de dados de exemplo no seu diretório de instalação do BlueSky Statistics ou você pode criar uma tabela/conjunto de dados de detalhes dos fatores rapidamente com o menu DOE -> Criar Detalhes de Fatores DoE",
  "lbl3": " 3. Uma vez que um conjunto de dados é aberto com o menu abrir arquivo ou criado rapidamente na etapa 2 acima, vá para o menu DOE -> criar design para criar um design apropriado",
  "lbl4": " 4. Após um design ser criado com sucesso, ele aparecerá na grade da interface do usuário do conjunto de dados. Você pode usar o menu DOE -> Inspecionar Design para inspecionar o design recém-criado",
  "lbl5": " 5. Vamos exportar o design para um diretório do sistema de arquivos com o menu DOE -> Exportar Design. Ele criará automaticamente três arquivos (.csv, .rda, .html) com os mesmos nomes que o conjunto de dados de design na grade da interface do usuário no caminho do diretório de arquivos especificado",
  "lbl6": " 6. O arquivo csv exportado na etapa 5 é destinado a ser usado para configurar os experimentos no mundo real, conforme especificado no design, para coletar/registrar resultados para análise posterior",
  "lbl7": " 7. Os resultados são registrados e adicionados como coluna(s) separada(s) chamadas respostas no vocabulário DoE no arquivo csv. Não altere a extensão do arquivo csv para qualquer outro formato de arquivo. Veja o diretório de conjuntos de dados de exemplo para DoE, exemplos de arquivos csv marcados como comresp para obter os valores das colunas de resultado/resposta para copiar e criar colunas de resposta no seu próprio arquivo csv que foi exportado como parte da exportação do design na etapa 5 acima",
  "lbl8": " 8. Vamos importar o arquivo de design csv com coluna(s) de resposta adicionadas de volta ao aplicativo BlueSky Statistics com o menu DOE -> Importar Resposta de Design",
  "lbl9": " 9. Para importar o arquivo csv de design na etapa 8, o design original (que foi exportado) precisa estar disponível na grade da interface do usuário do conjunto de dados. Se não estiver disponível, use o menu abrir arquivo para carregar o arquivo .rda do design que foi criado como parte da exportação do design na etapa 5",
  "lbl10": "10. Após o arquivo csv ser importado com sucesso contra o conjunto de dados de design ativo/correto e criar um novo design com a(s) coluna(s) de resposta, você pode usar o menu DOE -> Inspecionar Design para inspecionar o design com a(s) coluna(s) de resposta",
  "lbl11": "11. Agora o design com a(s) coluna(s) de resposta está pronto para análise com o menu DOE -> Analisar Design com vários métodos de análise, por exemplo, modelo linear, modelo de superfície de resposta, etc"
}