{
  "title": "Igualdade de Variâncias",
  "navigation": "Igualdade de Variâncias",
  "label1": "Escolha os testes",
  "bartlett": "Teste de Bartlett",
  "levene": "Teste de Levene",
  "fligner": "Teste de Fligner–Killeen",
  "normal_distribution": "Teste baseado na distribuição normal",
  "pairwiseLeveneTest": "Teste de Levene par a par",
  "label2": "Formato dos dados",
  "wide": "Formato largo",
  "long": "Formato longo",
  "label3": "Nível de confiança",
  "label4": "Hipótese alternativa",
  "alt1": "Bidirecional",
  "alt2": "Maior",
  "alt3": "Menor",
  "label5": "Método de ajuste do valor-p (para o teste de Levene par a par)",
  "padj1": "Holm",
  "padj2": "Hochberg",
  "padj3": "Hommel",
  "padj4": "Bonferroni",
  "padj5": "BH",
  "padj6": "BY",
  "padj7": "FDR",
  "padj8": "Nenhum",
  "help": {
    "title": "Testes para Igualdade de Variâncias",
    "r_help": "help(bartlett.test, package=stats); help(leveneTest, package=car); help(fligner.test, package=stats)",
    "body": "\n<b>Descrição</b></br>\nTesta a igualdade de variâncias. Suporta dados nos seguintes formatos<br/>\nlargo: Cada variável contém medições, por exemplo, a variável 1 contém medições da máquina A, a variável 2 contém medições da máquina B...<br/>\nlongo: As medições em uma variável são agrupadas por uma ou mais variáveis, por exemplo, as notas de teste são agrupadas por gênero e classe. <br/>\nMétodo de ajuste do valor-p aplicado apenas quando o teste de Levene par a par é selecionado.<br/>\n<b>Uso</b>\n<br/>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"largo\" ),<br/>\n    cols_to_compare = c('A','B','C'),<br/>\n    response_col = NULL,<br/>\n    group_col = NULL,<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidirecional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n    Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Conjunto de Dados1\"<br/>\n)<br/>\nBSky_variance_analysis (<br/>\n    data_format = c(\"longo\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Nota'),<br/>\n    group_col = c('Gênero','Classe'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidirecional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Conjunto de Dados2\"<br/>\n)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ndata_format: Pode ser largo ou longo\n</li>\n<li>\ncols_to_compare: As variáveis para comparar variâncias quando o conjunto de dados está em formato largo, NULL para dados em formato longo\n</li>\n<li>\nresponse_col: A variável de medição para comparar variâncias entre grupos. NULL para dados largos\n</li>\n<li>\ngroup_col: Uma ou mais variáveis usadas para agrupar a variável de medição, testamos a igualdade de variâncias entre grupos\n</li>\n<li>\nconf_level: Intervalo de confiança\n</li>\n<li>\nalt_hypothesis: Definido como bidirecional\n</li>\n<li>\np_adjust_method: Método usado para ajustar o valor-p\n</li>\n<li>\nnormal_distribution: se TRUE, assumimos normalidade\n</li>\n<li>\nFligner_Killeen: se TRUE, realiza um teste de Fligner_Killeen\n</li>\n<li>\npairwiseComparison: Realiza um teste de Levene par a par\n</li>\n<li>\ndatasetname: Nome do conjunto de dados do qual x,y e camadas (variáveis) são escolhidos\n</li>\n</ul>\n<b>Valor</b></br>\nIntervalos de confiança de Bonferroni para os intervalos de confiança especificados. Resultados de testes para testes de múltiplas comparações (quando a normalidade não é assumida) e resultados de outros testes\n<br/>\n<b>Exemplo</b></br>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"longo\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Nota'),<br/>\n    group_col = c('Gênero','Classe'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"bidirecional\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Conjunto de Dados2\"<br/>\n)<br/>\n</code> <br/>\n\n<b>Detalhes</b></br>\nTeste de múltiplas comparações</br>\nUsado quando você não seleciona “Usar teste baseado na distribuição normal” – ou seja, você favorece métodos robustos a distribuições não normais. </br>\nSe você tiver k > 2 grupos, calculamos os intervalos para desvios padrão de modo que se dois intervalos não se sobrepuserem, os desvios padrão associados são \nsignificativamente diferentes.</br> \nPara k = 2 amostras, utiliza o método de Bonett para testar duas variâncias com razão hipotética = 1. </br>\nQuando o teste geral de múltiplas comparações é significativo, os desvios padrão que correspondem aos intervalos não sobrepostos são estatisticamente diferentes.</br>\nVantagens: Mais poderoso do que o método de Levene em muitas situações (para distribuições contínuas). Mas quando os tamanhos das amostras são pequenos (< 20) ou distribuições são \nextremamente assimétricas/com caudas pesadas, a taxa de erro tipo I pode ser inflacionada.</br>\nValor-p para o teste</br>\nSe houver 2 amostras no design, então calculamos o valor-p para o teste de múltiplas comparações usando o método de Bonett para um teste de 2 variâncias e uma razão hipotética, Ρo, de 1.</br>\nSe houver k > 2 amostras no design, então deixe Pij ser o valor-p do teste para qualquer par (i, j ) de amostras. O valor-p para o procedimento de múltiplas comparações como um teste geral de igualdade de variâncias é dado pelo seguinte:</br>\nP =min{Pij, 1<=i<j<=k}\n</br>\nEstatística do teste de Levene</br>\nO teste de Levene é usado para testar a hipótese nula de que as variâncias são iguais entre grupos (H₀: todas as variâncias iguais) versus a alternativa de que pelo menos \numa variância difere. </br>\nÉ mais robusto a desvios da normalidade em comparação com testes que assumem normalidade (por exemplo, o teste de Bartlett). </br>\nEspecificamente, usamos a modificação de Brown-Forsythe (desvios absolutos da mediana amostral em vez da média) para melhorar a robustez. </br>\nInterpretação: Se o valor-p < α, você rejeita H₀ e conclui que as variâncias não são iguais. </br>\n</br>\nEstatística do teste de Bartlett</br>\nO teste de Bartlett é projetado para testar a igualdade de variâncias quando os dados são normalmente distribuídos. H₀: todas as variâncias iguais. Quando k > 2 grupos,\nutilizamos o teste de Bartlett (se “usar teste baseado na distribuição normal” for selecionado). </br>\nA estatística do teste (comumente denotada B) é baseada na comparação da média aritmética ponderada e da média geométrica ponderada das variâncias amostrais. </br>\nA estatística segue (aproximadamente) uma distribuição qui-quadrado com k-1 df. </br>\nComo o teste de Bartlett assume normalidade, é sensível a desvios da normalidade (ou seja, distribuições não normais ou com caudas pesadas podem levar a \nresultados enganosos)</br>\n</br>\nEstatística do teste F</br>\nQuando há exatamente dois grupos (k = 2), usamos um teste F em vez do teste de Bartlett (se “usar teste baseado na distribuição normal” for selecionado). </br>\nH₀: as variâncias são iguais (σ₁² = σ₂²). </br>\nA estatística F é calculada como a razão das duas variâncias amostrais (maior sobre menor). Então o valor-p depende da hipótese alternativa\n (unilateral “menor que” ou “maior que”, ou bilateral). </br>\nInterpretação: Se o valor-p < α, rejeite H₀ e conclua que as variâncias diferem. É válido apenas sob a suposição de normalidade.</br>\n<b>Valor</b><br/>\n\n<b>Pacote</b></br>\nBlueSky</br>\n<b>Ajuda</b></br>\nPor favor, entre em contato com support@blueskystatistics.com para informações adicionais.\n    "
  }
}