{
  "exportpro_title": "Exportar a saída ativa atual para HTML, DOCX ou PDF",
  "exportpro_subtitle": "Por favor, aguarde após clicar no botão Exportar. O processo pode levar algum tempo, dependendo do tamanho da saída que você está exportando.",
  "exportPro_iconTooltip": "Exportar para HTML, DOCX, PDF",
  "exportpro_pandocHint": "Você precisa ter o Pandoc instalado separadamente. Apenas na primeira vez você precisa fornecer o caminho executável do Pandoc a partir do seu caminho de instalação do Pandoc.",
  "exportpro_pandocPathLbl": "Caminho do Pandoc:",
  "exportpro_browsePandocPathBtn": "Escolher caminho do arquivo Pandoc",
  "exportpro_outputFolderLbl": "Pasta do documento exportado:",
  "exportpro_browseOutputPathBtn": "Escolher pasta de exportação",
  "exportpro_outputFilenameLbl": "Digite o nome do arquivo exportado (sem extensão):",
  "exportpro_selExportFormatLbl": "Selecione o formato de arquivo para exportar:",
  "exportpro_HTMLradioLbl": "HTML",
  "exportpro_DOCXradioLbl": "DOCX",
  "exportpro_PDFradioLbl": "PDF",
  "exportpro_ExportBtn": "Exportar",
  "exportpro_CancelBtn": "Cancelar",
  "exportWaitMsg": "A geração da saída pode levar algum tempo. Verifique a pasta de saída após algum tempo.",
  "exportMissingFieldsMsg1": "Por favor, preencha todos os campos obrigatórios (marcados com asterisco vermelho)",
  "exportMissingFieldsMsg2": "Verifique se o caminho do Pandoc ou o caminho de saída existem",
  "noPandocFoundMsg": "O Pandoc não está instalado ou o caminho está incorreto. Por favor, insira o caminho correto do Pandoc onde o executável do Pandoc está presente e tente novamente.",
  "exportOverwriteTitle": "Sobrescrever arquivo existente?",
  "exportOverwriteMsg": "Os seguintes arquivos já existem. Você deseja sobrescrever?",
  "exportOverwriteYes": "Sim",
  "exportOverwriteNo": "Cancelar",
  "exportFileLockedTitle": "O arquivo está aberto em outro aplicativo",
  "exportFileLockedMsg1": "O seguinte arquivo está bloqueado",
  "exportFileLockedMsg2": " (possivelmente aberto em outro aplicativo)",
  "exportFileLockedMsg3": " Feche o arquivo e tente novamente. OU forneça um nome diferente para o arquivo exportado.",
  "invalidOutputFilenameMsg":"O nome do arquivo de saída não pode conter espaços nem outros caracteres especiais. Por favor, insira um nome de arquivo de saída válido com apenas caracteres alfanuméricos."
}