{
  "title": "Gráfico de Floresta",
  "navigation": "Gráfico de Floresta",
  "modelselectorlabel": "Selecionar Nome do Modelo",
  "plotvarslabel": "Variáveis para Plotar (nenhuma especificada plota todas as variáveis)",
  "varlabelslabel": "Rótulos de Variáveis (especifique como varname='rótulo' separados por vírgulas, ex. idade='Idade em anos', bmi='Índice de Massa Corporal'); pode usar \\n para quebras de linha dentro de um rótulo",
  "notelabel": "NOTA: Alterar rótulos requer um novo ajuste do modelo, portanto, grandes dados podem levar tempo",
  "label3": "NOTA: MODELOS CONSTRUÍDOS USANDO AJUSTE DE MODELO (TREINAR) NÃO SÃO SUPORTADOS",
  "estimateoptlabel": "Opções de Estimativa",
  "estimatelabellabel": "Rótulo",
  "exponentiatelabel": "Forçar Exponenciação da Estimativa do Parâmetro",
  "linecolorlabel": "Cor da Linha",
  "pointshapelabel": "Forma do Ponto",
  "pointsizelabel": "Tamanho do Ponto (0-10 mm)",
  "styleoptlabel": "Opções de Estilo",
  "factorseplinelabel": "Nomes de Fatores em Linhas Separadas",
  "plotbandslabel": "Bandas do Gráfico",
  "textsizelabel": "Tamanho do Texto (1-10 mm)",
  "estticklabelsizelabel": "Tamanho do Rótulo da Marca de Tique da Estimativa (1-50)",
  "help": {
    "title": "Gráfico de Floresta",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nIsso cria um gráfico de coeficientes do modelo, ou coeficientes exponenciados, de um modelo de regressão. Cada variável é plotada em sua própria linha com totais, estimativas de parâmetros, \nintervalos de confiança de 95% e valores p. As variáveis podem ser rotuladas para permitir uma apresentação mais agradável. Atualmente, modelos da classe lm (modelos lineares), glm (modelos lineares generalizados, \nque incluem logístico e Poisson), coxph (risco proporcional de Cox) e rq (regressão quantílica) são suportados.\n<br/><br/>\n<b>Selecionar Nome do Modelo:</b> Escolha o nome do modelo conforme especificado quando o modelo foi ajustado. Este é um campo obrigatório.\n<br/><br/>\n<b>Variáveis para Plotar:</b> Se você tiver acesso aos dados que criaram o modelo, pode especificar um subconjunto das variáveis no modelo para incluir no gráfico. Se nenhuma variável \nfor especificada, o padrão será todas as variáveis incluídas.\n<br/><br/>\n<b>Rótulos de Variáveis:</b> Especifique rótulos mais agradáveis para usar em vez dos nomes das variáveis. Se uma variável não for rotulada, o nome da variável ou o rótulo existente usado quando \no modelo foi ajustado (se existir) será plotado. Estes devem ser especificados no formato variablename=\"rótulo\", separados por vírgulas. Observe que incluir \\n em um rótulo forçará\na quebra de linha dentro do rótulo. Isso significa que você pode especificar rótulos de várias linhas e pode ser vantajoso para rótulos longos, pois rótulos longos deixados em uma linha deixam menos espaço para as estimativas. Fazer \num resumo do modelo com Avaliação do Modelo -> Resumir -> Resumir um Modelo imprimirá as variáveis do modelo usadas caso você não tenha acesso ao conjunto de dados. NOTA: Há um \nbug atual no pacote forestmodel R que não usa rótulos de variáveis para fatores em modelos de Cox - o desenvolvedor do pacote foi notificado. Uma alternativa até que o pacote seja \nconsertado é refazer o ajuste do modelo com variáveis codificadas como dummy em vez de fatores.\n<br/><br/><br/>\n<b>Opções de Estimativa:</b>\n<br/><br/>\n<b>Rótulo:</b> Rótulo opcional para a coluna de estimativa no gráfico. Regressão logística e modelos de Cox serão detectados automaticamente e as estimativas serão rotuladas como \"Razão de Chances\" e \n\"Razão de Risco\", respectivamente. Outros modelos usarão o padrão de \"Estimativa\" se você não especificar nada.\n<br/><br/>   \n<b>Forçar Exponenciação da Estimativa do Parâmetro:</b> Escolha isso para forçar os valores de exp(coeficiente) a serem exibidos, ou seja, 2.718 elevado à potência do coeficiente. Coeficientes \nexponenciados são comumente usados em modelos de risco proporcional de Cox (para razões de risco), regressão logística (para razões de chances), modelos log-binomiais (para riscos relativos) e Poisson \nregressão (para razões de taxa). Por padrão, a regressão logística e os modelos de Cox serão detectados automaticamente e exp(coeficiente) será usado.\n<br/><br/>\n<b>Cor da Linha:</b> Cor da linha para os intervalos de confiança.\n<br/><br/>\n<b>Forma do Ponto:</b> A forma dos pontos para as estimativas de parâmetros no gráfico.\n<br/><br/>\n<b>Tamanho do Ponto (0-10 mm):</b> O tamanho dos pontos, em milímetros, para as estimativas de parâmetros no gráfico. 0 mm removeria os pontos. O padrão é 4 mm.\n<br/><br/><br/>\n<b>Opções de Estilo:</b>\n<br/><br/>\n<b>Nomes de Fatores em Linhas Separadas:</b> Escolha isso para exibir os nomes das variáveis fator em uma linha separada dos níveis do fator.\n<br/><br/>\n<b>Bandas do Gráfico:</b> Escolha isso para exibir regiões sombreadas alternadas para cada linha do gráfico.\n<br/><br/>\n<b>Tamanho do Texto (1-10 mm):</b> Tamanho do texto, em milímetros, no gráfico. O padrão é 4 mm.\n<br/><br/>\nNota: Se você quiser alterar o tamanho geral do gráfico, o tamanho do gráfico pode ser definido usando o botão Temas no menu de três pontos.\n<br/><br/>\n<b>Tamanho do Rótulo da Marca de Tique da Estimativa (1-50):</b> Tamanho dos rótulos das marcas de tique para o eixo de estimativa.\n<br/><br/>\n<b>Pacotes R Necessários:</b> forestmodel, arsenal, survival, quantreg, insight\n"
  }
}