{
  "title": "Teste de Friedman",
  "navigation": "Teste de Friedman",
  "tvarbox1": "Variáveis de Resposta, 2 ou mais",
  "help": {
    "title": "Teste de Friedman",
    "r_help": "help(friedman.test, package=stats)",
    "body": "\n<b>Descrição</b></br>\nRealiza um teste de soma de postos de Friedman com dados bloqueados não replicados.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## Método S3 padrão:\nfriedman.test(y, groups, blocks, ...)\n## Método S3 para a classe 'formula'\nfriedman.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ny: um vetor numérico de valores de dados, ou uma matriz de dados.\n</li>\n<li>\ngroups: um vetor que fornece o grupo para os elementos correspondentes de y se este for um vetor; ignorado se y for uma matriz. Se não for um objeto fator, é convertido em um.\n</li>\n<li>\nblocks: um vetor que fornece o bloco para os elementos correspondentes de y se este for um vetor; ignorado se y for uma matriz. Se não for um objeto fator, é convertido em um.\n</li>\n<li>\nformula: uma fórmula da forma a ~ b | c, onde a, b e c fornecem os valores de dados e os grupos e blocos correspondentes, respectivamente.\n</li>\n<li>\ndata: uma matriz ou quadro de dados opcional (ou similar: veja model.frame) contendo as variáveis na fórmula formula. Por padrão, as variáveis são retiradas do ambiente(formula).\n</li>\n<li>\nsubset: um vetor opcional que especifica um subconjunto de observações a serem usadas.\n</li>\n<li>\nna.action: uma função que indica o que deve acontecer quando os dados contêm NAs. Por padrão, é getOption(\"na.action\").\n</li>\n<li>\n...: argumentos adicionais a serem passados para ou a partir de métodos.\n</li>\n</ul>\n<b>Detalhes</b></br>\nofriedman.test pode ser usado para analisar desenhos de blocos completos não replicados (ou seja, há exatamente uma observação em y para cada combinação de níveis de grupos e blocos) onde a suposição de normalidade pode ser violada.</br>\nA hipótese nula é que, além de um efeito dos blocos, o parâmetro de localização de y é o mesmo em cada um dos grupos.\nSe y for uma matriz, grupos e blocos são obtidos a partir dos índices de coluna e linha, respectivamente. NAs não são permitidos em grupos ou blocos; se y contiver NAs, os blocos correspondentes são removidos.</br>\n<b>Valor</b><br/>\nUma lista com a classe \"htest\" contendo os seguintes componentes:<br/>\nstatistic: o valor da estatística qui-quadrado de Friedman.<br/>\nparameter: os graus de liberdade da distribuição qui-quadrado aproximada da estatística do teste.<br/>\np.value: o valor p do teste.<br/>\nmethod: a string de caracteres \"Teste de soma de postos de Friedman\".<br/>\ndata.name: uma string de caracteres que fornece os nomes dos dados.​<br/>\n<b>Exemplos</b><br/>\n<code> \nDataframe <- data.frame(Expenses=c(20,23,19,25,26), Sales=c(48,50,55,51,49), Gender=c('m','f','f','m','m'), Deptt=c('Contabilidade', 'RH', 'Vendas','Marketing','TI'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Sales,Expenses)))<br/>\nResult_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nhelp(friedman.test, package=stats)\n"
  }
}