{
  "title": "Modelo Linear Generalizado",
  "navigation": "MLG",
  "modelname": "Nome do modelo",
  "dependent": "Variável dependente",
  "offset": "Deslocamento",
  "weights": "Pesos",
  "formulaBuilder": "Construtor de fórmula",
  "family": "Selecione uma família e função de ligação",
  "theta": "Especifique um valor de theta (aplicado apenas para a família binomial negativa)",
  "expCoefficients": "Exponentiar coeficientes",
  "help": {
    "title": "Modelo Linear Generalizado",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>Descrição</b></br>\n            glm é usado para ajustar modelos lineares generalizados, especificados dando uma descrição simbólica do preditor linear e uma descrição da distribuição de erro.\n            <br/>\nNOTA 1: Um campo de texto é fornecido para especificar o valor inicial de theta, isso se aplica apenas à família binomial negativa. Se omitido, um estimador de momento após um ajuste inicial usando um GLM de Poisson é usado.<br/>\nO theta inicial que é computado é exibido na saída acima da tabela de resumo do GLM.<br/>\nNOTA 2: Ao especificar uma variável contendo pesos, esteja ciente de que, como usamos a opção na.exclude para construir o modelo, todos os valores NA são automaticamente removidos das variáveis dependentes e independentes.<br/> \nIsso pode causar um desajuste, pois os valores NA NÃO são automaticamente removidos da variável de ponderação. <br/>\nNessa situação, você verá o erro de que os comprimentos das variáveis diferem (encontrado para (pesos))<br/>\nPara resolver esse erro, vá para Variáveis>Valores Ausentes>Remover NAs e selecione as variáveis dependentes, independentes e a variável de ponderação para remover valores ausentes e reconstruir o modelo.<br/>\nNOTA 3: Variáveis fator de código fictício, ao usar a família binomial negativa, veja Variáveis > Calcular > Código Fictício.<br/>\nNOTA 4: O intercepto é incluído por padrão, para remover o intercepto insira -1 no construtor de fórmula\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            glm(fórmula, família = gaussiana, dados, pesos, subconjunto,\n                na.action, start = NULL, etastart, mustart, offset,\n                controle = list(...), modelo = TRUE, método = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            fórmula: um objeto da classe \"fórmula\" (ou um que pode ser convertido para essa classe): uma descrição simbólica do modelo a ser ajustado. Os detalhes da especificação do modelo são dados em 'Detalhes'.\n            </li>\n            <li>\n            família: uma descrição da distribuição de erro e função de ligação a ser usada no modelo. Para glm, isso pode ser uma string de caracteres nomeando uma função de família, uma função de família ou o resultado de uma chamada a uma função de família. Para glm.fit, apenas a terceira opção é suportada. (Veja família para detalhes das funções de família.)\n            </li>\n            <li>\n            dados: um quadro de dados opcional, lista ou ambiente (ou objeto convertível por as.data.frame para um quadro de dados) contendo as variáveis no modelo. Se não encontrado nos dados, as variáveis são retiradas do ambiente(fórmula), tipicamente o ambiente de onde glm é chamado.\n            </li>\n            <li>\n            pesos: um vetor opcional de 'pesos anteriores' a serem usados no processo de ajuste. Deve ser NULL ou um vetor numérico.\n            </li>\n            <li>\n            subconjunto: um vetor opcional especificando um subconjunto de observações a serem usadas no processo de ajuste.\n            </li>\n            <li>\n            na.action: uma função que indica o que deve acontecer quando os dados contêm NAs. O padrão é definido pela configuração na.action das opções, e é na.fail se isso não estiver definido. O padrão 'fábrica-nova' é na.omit. Outro valor possível é NULL, nenhuma ação. O valor na.exclude pode ser útil.\n            </li>\n            </ul>\n            <b>Detalhes</b><br/>\n            Um preditor típico tem a forma resposta ~ termos onde resposta é o vetor de resposta (numérico) e termos é uma série de termos que especifica um preditor linear para a resposta. Para famílias binomiais e quasibinomiais, a resposta também pode ser especificada como um fator (quando o primeiro nível denota falha e todos os outros sucesso) ou como uma matriz de duas colunas com as colunas dando os números de sucessos e falhas. Uma especificação de termos da forma primeiro + segundo indica todos os termos em primeiro junto com todos os termos em segundo, com quaisquer duplicatas removidas.<br/>\n            <b>Valor</b><br/>\n            Um objeto da classe \"glm\" é uma lista contendo pelo menos os seguintes componentes:\n            <ul>\n            <li>\n            coeficientes: um vetor nomeado de coeficientes\n            </li>\n            <li>\n            resíduos: os resíduos de trabalho, ou seja, os resíduos na iteração final do ajuste IWLS. Como casos com pesos zero são omitidos, seus resíduos de trabalho são NA.\n            </li>\n            <li>\n            valores ajustados: os valores médios ajustados, obtidos transformando os preditores lineares pela inversa da função de ligação.\n            </li>\n            <li>\n            rank: o rank numérico do modelo linear ajustado.\n            </li>\n            <li>\n            família: o objeto da família usado.\n            </li>\n            <li>\n            preditores.lineares: o ajuste linear na escala de ligação.\n            deviance: até uma constante, menos duas vezes a log-verossimilhança maximizada. Onde sensato, a constante é escolhida de modo que um modelo saturado tenha deviance zero.\n            </li>\n            <li>\n            aic\t: Uma versão do Critério de Informação de Akaike, menos duas vezes a log-verossimilhança maximizada mais duas vezes o número de parâmetros, computado via o componente aic da família. Para famílias binomiais e de Poisson, a dispersão é fixada em um e o número de parâmetros é o número de coeficientes. Para famílias gaussianas, Gamma e gaussianas inversas, a dispersão é estimada a partir da deviance residual, e o número de parâmetros é o número de coeficientes mais um. Para uma família gaussiana, o MLE da dispersão é usado, então este é um valor válido de AIC, mas para famílias Gamma e gaussianas inversas não é. Para famílias ajustadas por quasi-verossimilhança, o valor é NA.\n            </li>\n            </ul>\n            <b>Pacote</b></br>\nglm</br>\n<b>Ajuda</b></br>\nhelp(glm, package ='stats')\n"
  }
}