{
    "title": "Histograma com Curvas Normais sobrepostas",
    "navigation": "Histograma",
    "x": "Eixo X, especifique uma variável numérica(s)",
    "bins": "Especifique o número de bins",
    "fill": "Especifique uma variável de agrupamento (Categoria)",
    "binwidth": "Largura do bin",
    "barcolor": "Opcionalmente selecione uma cor de preenchimento (Após a seleção da cor, clique fora do controle para aplicar)",
    "alpha": "Opacidade (0-1)",
    "flip": "Inverter Eixo",
    "specify_a_title": "Digite um título",
    "x_title": "Rótulo do eixo X",
    "y_title": "Rótulo do eixo Y",
    "legends": "Mostrar Legendas e, se sim, posição das Legendas (o padrão é à direita)",
    "facets_lbl": "Facetas",
    "Facetrow": "Linha de Facetas",
    "Facetcolumn": "Coluna de Facetas",
    "Facetwrap": "Enrolar Facetas (se escolhido, qualquer seleção de Linha e Coluna de Facetas será ignorada)",
    "Facetscale": "Escala de Facetas",
    "normalCurveColor": "Opcionalmente selecione uma cor para a curva normal (Após a seleção da cor, clique fora do controle para aplicar)",
    "rugPlot": "Exibir um gráfico de rug (adequado para pequenos conjuntos de dados)",
    "normalCurve": "Exibir uma curva normal",
    "normalCurveHeightScaleFactor": "Qualquer número, incluindo decimal, para escalar a altura da curva normal (para gráfico de barras empilhadas). Digite 0 para nenhuma escala",
    "showCountsChk": "Exibir contagens nos bins (as contagens não serão exibidas se a faceta for selecionada)",
    "histogramBarPosition": "Posição da barra, se um grupo for escolhido (empilhado ou lado a lado)",
    "histogramBinDetailsChk": "Mostrar detalhes do Bin do Histograma em uma tabela",
    "label1": "Linhas horizontais",
    "yIntercept": "Digite valores de intercepto Y separados por vírgula para as linhas horizontais, por exemplo, 100, 200, 300 (ou seja, valores de contagem). As linhas serão desenhadas apenas se um eixo de Contagens estiver presente",
    "hLineColor": "Selecione uma cor para linha(s) e rótulo(s) (Após a seleção da cor, clique fora do controle para aplicar)",
    "lineType": "Selecione o tipo de linha",
    "horizontalLinelabel": "Especifique rótulos separados por vírgula (sem aspas) para a(s) linha(s) horizontal(is)",
    "horizontalLinelabel_angle_text": "Ângulo para inclinar o texto do rótulo da linha horizontal (padrão 0 para nenhuma inclinação)",
    "label2": "Nota: Valores maiores movem o texto para baixo, valores menores movem o texto para cima",
    "addHoriRefLines": "Adicionar linhas de referência",
    "xyLimits": "Limites dos eixos X e Y",
    "label5": "Especifique um intervalo para os valores dos eixos X e Y",
    "rangeXValues": "Especifique o intervalo do eixo X, por exemplo, 0,100",
    "labelHori_HorizontalJustification": "Nota: valores maiores colocam o texto à esquerda, valores menores movem o texto para a direita",
    "verticalJustification": "Controlar a justificação vertical do rótulo",
    "hori_HorizontalJustification": "Controlar a justificação horizontal do rótulo",
    "addlLabelHlineTextPositionOffset": "Ajustes adicionais para posicionar o texto do rótulo para linhas horizontais",
    "horiMovementHReflineLabel": "Mover texto horizontalmente para a esquerda ou direita - use qualquer número com sinal + ou - (deixe 0 para eixo Categórico)",
    "nobreaklineHRefLabelandValueChk": "Marque esta caixa para remover a quebra de linha entre o valor do rótulo e o texto do rótulo",
    "vertiMovementHReflineLabel": "Mover texto verticalmente para cima ou para baixo - use qualquer número com sinal + ou - (deixe 0 para eixo Categórico)",
    "help": {
      "title": "Histograma",
      "r_help": "help(geom_histogram, package=ggplot2)",
      "body": "\n            <b>Descrição</b></br>\n            Um histograma é uma representação gráfica da distribuição de dados numéricos. É uma estimativa da distribuição de probabilidade de uma variável contínua (variável quantitativa). Você pode especificar uma largura de bin ou usar a padrão, veja abaixo. Facetas podem ser criadas opcionalmente especificando uma variável fator. Você também pode opcionalmente especificar temas, e especificar um título e rótulos para os eixos x e y.</br>\n            Quando você tem várias variáveis selecionadas para a variável do eixo X, criamos um histograma separado para cada variável do eixo x. Opcionalmente sobrepomos uma curva normal e um gráfico de rug</br>\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Contagens\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            data: O conjunto de dados padrão​\n            </li>\n            <li>\n            aes(): Gera mapeamentos estéticos que descrevem como as variáveis nos dados são mapeadas para propriedades visuais (estéticas) dos geoms.​\n            </li>\n            <li>\n            x: Uma variável numérica/escala para plotar o histograma. ​\n            </li>\n            <li>\n            geom_histogram: Cria um histograma, por padrão, stat_bin usa 30 bins - este não é um bom padrão, mas a ideia é fazer você experimentar diferentes larguras de bin..\n            </li>\n            <li>\n            geom_rug: Cria um gráfico de rug    \n            </li>\n            <li>\n            stat_function: Cria uma curva normal (Nota: Valores ausentes precisam ser removidos para a curva ser exibida)    \n            </li>\n            <li>\n            Labs(): Muda rótulos dos eixos e títulos das legendas (Isto é opcional)​\n            </li>\n            <li>\n            facet_grid(): Organiza painéis em uma grade (Isto é opcional)​\n            </li>\n            <li>\n            theme_calc(): Especifica o tema da calculadora (Isto é opcional)​\n            </li>\n            <li>\n            coord_flip(): Inverter eixos (Isto é opcional)\n            </li>\n            <li>\n            alpha: Aceita um valor entre 0-1, 1 significa sem opacidade. A opacidade se aplica à cor de preenchimento do histograma\n            </li>\n            </ul>\n            <b>Pacote</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Ajuda</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Clique no botão de Ajuda R para obter ajuda detalhada em R. Você também pode digitar help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n           "
    }
}