{
  "title": "Histograma com Curvas Normais sobrepostas",
  "navigation": "Histograma",
  "x": "Eixo X, especifique uma variável numérica(s)",
  "bins": "Especifique o número de bins",
  "fill": "Especifique uma variável de agrupamento (Categoria)",
  "binwidth": "Largura do bin",
  "barcolor": "Opcionalmente selecione uma cor de preenchimento (Após a seleção da cor, clique fora do controle para aplicar)",
  "alpha": "Opacidade (0-1)",
  "flip": "Inverter Eixo",
  "specify_a_title": "Insira um título",
  "x_title": "Rótulo do eixo X",
  "y_title": "Rótulo do eixo Y",
  "facets_lbl": "Facetas",
  "Facetrow": "Linha de Facet",
  "Facetcolumn": "Coluna de Facet",
  "Facetwrap": "Enrolar Facet (se escolhido, qualquer seleção de linha e coluna de Facet será ignorada)",
  "Facetscale": "Escala de Facet",
  "normalCurveColor": "Opcionalmente selecione uma cor de curva normal (Após a seleção da cor, clique fora do controle para aplicar)",
  "rugPlot": "Exibir um gráfico de tapete (adequado para pequenos conjuntos de dados)",
  "normalCurve": "Exibir uma curva normal (Valores ausentes são removidos para a curva ser exibida)",
  "showCountsChk": "Exibir contagens nos bins (as contagens não serão exibidas se um grupo ou facet for selecionado)",
  "histogramBarPosition": "Posição da barra, se um grupo for escolhido (empilhado ou lado a lado)",
  "histogramBinDetailsChk": "Mostrar detalhes do Bin do Histograma em uma tabela",
  "help": {
    "title": "Histograma",
    "r_help": "help(geom_histogram, package=ggplot2)",
    "body": "\n            <b>Descrição</b></br>\n            Um histograma é uma representação gráfica da distribuição de dados numéricos. É uma estimativa da distribuição de probabilidade de uma variável contínua (variável quantitativa). Você pode especificar uma largura de bin ou usar a padrão, veja abaixo. Facetas podem ser criadas opcionalmente especificando uma variável fator. Você também pode opcionalmente especificar temas e especificar um título e rótulos para os eixos x e y.</br>\n            Quando você tem várias variáveis selecionadas para a variável do eixo X, criamos um histograma separado para cada variável do eixo x. Opcionalmente sobrepomos uma curva normal e um gráfico de tapete</br>\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Contagens\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            data: O conjunto de dados padrão​\n            </li>\n            <li>\n            aes(): Gera mapeamentos estéticos que descrevem como as variáveis nos dados são mapeadas para propriedades visuais (estéticas) dos geoms.​\n            </li>\n            <li>\n            x: Uma variável numérica/escala para plotar o histograma.​\n            </li>\n            <li>\n            geom_histogram: Cria um histograma, por padrão, stat_bin usa 30 bins - este não é um bom padrão, mas a ideia é fazer você experimentar com diferentes larguras de bin..\n            </li>\n            <li>\n            geom_rug: Cria um gráfico de tapete    \n            </li>\n            <li>\n            stat_function: Cria uma curva normal (Nota: Valores ausentes precisam ser removidos para a curva ser exibida)    \n            </li>\n            <li>\n            Labs(): Muda rótulos dos eixos e títulos da legenda (Isto é opcional)​\n            </li>\n            <li>\n            facet_grid(): Organiza painéis em uma grade (Isto é opcional)​\n            </li>\n            <li>\n            theme_calc(): Especifica o tema da calculadora (Isto é opcional)​\n            </li>\n            <li>\n            coord_flip(): Inverter eixo (Isto é opcional)\n            </li>\n            <li>\n            alpha: Aceita um valor entre 0-1, 1 significa sem opacidade. A opacidade se aplica à cor de preenchimento do histograma\n            </li>\n            </ul>\n            <b>Pacote</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Ajuda</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Clique no botão de Ajuda R para obter ajuda detalhada em R. Você também pode digitar help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n           "
  }
}