{
    "title": "Histograma com Curvas Normais Sobrepostas",
    "navigation": "Histograma",
    "x": "Eixo X, especifique uma(s) variável(is) numérica(s)",
    "bins": "Especifique o número de bins",
    "fill": "Especifique uma variável de agrupamento (Categoria)",
    "binwidth": "Largura do bin",
    "barcolor": "Opcionalmente, selecione uma cor de preenchimento (Após selecionar a cor, clique fora do controle para aplicar)",
    "alpha": "Opacidade (0-1)",
    "flip": "Inverter Eixo",
    "specify_a_title": "Digite um título",
    "x_title": "Rótulo do eixo X",
    "y_title": "Rótulo do eixo Y",
    "facets_lbl": "Facetas",
    "Facetrow": "Linha da Faceta",
    "Facetcolumn": "Coluna da Faceta",
    "Facetwrap": "Envoltório da Faceta (se escolhido, qualquer seleção de linha e coluna da Faceta será ignorada)",
    "Facetscale": "Escala da Faceta",
    "normalCurveColor": "Opcionalmente, selecione a cor da curva normal (Após selecionar a cor, clique fora do controle para aplicar)",
    "rugPlot": "Exibir gráfico de tapete (adequado para pequenos conjuntos de dados)",
    "normalCurve": "Exibir curva normal (valores ausentes são removidos para exibir a curva)",
    "normalCurveHeightScaleFactor": "Qualquer número, incluindo decimais, para dimensionar a altura da curva normal (para barras empilhadas). Digite 0 para não dimensionar",
    "showCountsChk": "Exibir contagens nos bins (as contagens não serão exibidas se grupo ou faceta for selecionado)",
    "histogramBarPosition": "Posição da barra, se um grupo for escolhido (empilhado ou lado a lado)",
    "histogramBinDetailsChk": "Mostrar detalhes dos bins do histograma em uma tabela",
    "help": {
        "title": "Histograma",
        "r_help": "help(geom_histogram, package=ggplot2)",
        "body": "<b>Descrição</b></br>Um histograma é uma representação gráfica da distribuição de dados numéricos. É uma estimativa da distribuição de probabilidade de uma variável contínua (variável quantitativa). Você pode especificar a largura do bin ou usar o padrão, veja abaixo. Facetas podem ser opcionalmente criadas especificando uma variável fator. Você também pode opcionalmente especificar temas, e definir um título e rótulos para os eixos x e y.</br>Quando múltiplas variáveis são selecionadas para o eixo X, criamos um histograma separado para cada variável do eixo x. Opcionalmente, sobrepomos uma curva normal e um gráfico de tapete.</br><br/><b>Uso</b><br/><code>ggplot(data=Dataset2,aes(x=engine)) + geom_histogram(binwidth=10) + labs(x=\"engine\", y=\"Contagens\") + xlab(\"\")</code><br/><b>Argumentos</b><br/><ul><li>data: O conjunto de dados padrão</li><li>aes(): Gera mapeamentos estéticos que descrevem como as variáveis nos dados são mapeadas para propriedades visuais (estéticas) dos geoms.</li><li>x: Uma variável numérica/escala para plotar o histograma.</li><li>geom_histogram: Cria um histograma, por padrão, stat_bin usa 30 bins - este não é um bom padrão, mas a ideia é que você experimente diferentes larguras de bin.</li><li>geom_rug: Cria um gráfico de tapete.</li><li>stat_function: Cria uma curva normal (Nota: valores ausentes precisam ser removidos para exibir a curva).</li><li>Labs(): Altera os rótulos dos eixos e títulos da legenda (opcional).</li><li>facet_grid(): Organiza os painéis em uma grade (opcional).</li><li>theme_calc(): Especifica o tema do calculador (opcional).</li><li>coord_flip(): Inverte o eixo (opcional).</li><li>alpha: Recebe um valor entre 0-1, 1 significa sem opacidade. A opacidade é aplicada à cor de preenchimento do histograma.</li></ul><b>Pacote</b>: ggplot2; ggthemes; stringr<br/><b>Ajuda</b>: help(geom_histogram, package=ggplot2)"
    }
}
