{
  "title": "Instalar Pacote(s) R",
  "navigation": "Instalar Pacote(s) R",
  "package_name": "Por favor, insira o(s) nome(s) de um ou mais pacote(s) separados por vírgula",
  "instruction_text": "\nNOTA: Os nomes dos pacotes R são sensíveis a maiúsculas e minúsculas. Você pode instalar vários nomes de pacotes usando , como separador\nExemplo 1: foreign\nExemplo 2: foreign, car, MASS",
  "instruction_text1": "\nNOTA: Você deve ter acesso de gravação ao caminho selecionado abaixo, caso contrário, reinicie o aplicativo selecionando a opção executar como \nadministrador",
  "repository": "Insira a URL do repositório CRAN, o padrão https://cloud.r-project.org/ instala a partir do espelho CRAN mais próximo de você.",
  "label1": "Exemplo 1: foreign",
  "label2": "NOTA: O logotipo do R que aparece na barra de menu é propriedade copyright da fundação R",
  "installPath": "Selecione o caminho da biblioteca R onde o pacote R será instalado",
  "help": {
    "title": "Instalar Pacote(s) R",
    "r_help": "help(install.packages)",
    "body": "\n            <b>Descrição</b></br>\n            Instale ou atualize um ou mais pacotes R para o caminho da biblioteca selecionado.</br>\n            NOTA:</br>\n            1. Instalaremos todos os pacotes dos quais os pacotes especificados dependem, importam ou vinculam</br>\n            2. Se você estiver atualizando um pacote existente, deve reiniciar o aplicativo BioStat Prime.</br>\n            3. Carregaremos o pacote recém-instalado/atualizado após a instalação.</br>\n            4. Por padrão, sempre instalaremos na biblioteca pessoal do usuário na máquina local.</br>\n            5. Se o mesmo pacote R estiver instalado na localização da biblioteca pessoal e do sistema (A localização da biblioteca do sistema é o local de instalação padrão que contém os pacotes \n                que enviamos prontos para uso com o BioStat Prime), carregamos o pacote da localização pessoal.</br>\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Caminho para a biblioteca do usuário ou do sistema\", repos = \"Caminho para o repositório contendo o pacote\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            pkgs: vetor de caracteres dos nomes dos pacotes cujas versões atuais devem ser baixadas do repositório especificado.\n            </li>\n            <li>\n            lib: vetor de caracteres que fornece o caminho da biblioteca na máquina local onde instalar o(s) pacote(s). Sempre default para a localização da biblioteca pessoal do usuário.\n            </li>\n            <li>\n            repos: vetor de caracteres, a(s) URL(s) base dos repositórios a serem usados, por exemplo, a URL de um espelho CRAN como \"https://cloud.r-project.org\".\n            </li>\n            <li>\n            BSkypackageinstall: Esta é uma flag que o aplicativo BioStat Prime usa internamente para sinalizar que \n            o pacote foi instalado via o menu e para passá-lo adiante.\n            </li>\n            </ul>\n            <b>Valor</b><br/>\n            NULL invisível.<br/>\n            <b>Exemplos</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Pacote</b></br>\n            broom</br>\n            <b>Ajuda</b></br>\n            Para ajuda detalhada, clique no ícone R no canto superior direito deste diálogo sobreposto\n\n"
  }
}