{
  "title": "Estimativa de Kaplan-Meier, Um Grupo",
  "navigation": "Estimativa de Kaplan-Meier, Um Grupo",
  "timevar": "Tempo até o evento ou censura",
  "eventvar": "Evento (1 = evento, 0 = censura)",
  "label1": "Tipo de Gráfico",
  "survivalradio": "Sobrevivência",
  "inciradio": "Falha",
  "printallest": "Tabela de Estimativas Incluindo Todos os Tempos",
  "printspecest": "Tabela de Estimativas para Tempos Específicos",
  "spectimes": "Especifique os tempos como time1, time2, time3, etc. ou como seq(1,5,by=1)",
  "styleoptions": "Opções de Estilo",
  "axisoptions": "Opções de Eixo",
  "label12": "Clique no botão ? no canto superior direito da caixa de diálogo para detalhes sobre conjuntos de dados de amostra e o formato de dados suportado.",
  "titlebox": "Título do Gráfico",
  "plottitlesizelabel": "Tamanho do Título do Gráfico (5-50)",
  "themedropdown": "Tema do Gráfico",
  "label2": "Número em Risco",
  "natriskchkbox": "Incluir Número em Risco",
  "risktableprop": "Altura da Tabela de Risco (0-1)",
  "risktablepos": "Posição da Tabela de Risco",
  "risktablevaluesize": "Tamanho do Valor da Tabela de Risco (1-15)",
  "risktabletitlesize": "Tamanho do Título da Tabela de Risco (5-50)",
  "risktableaxislabelsize": "Tamanho do Rótulo do Eixo da Tabela de Risco (5-50)",
  "risktableticklabelsize": "Tamanho do Rótulo do Marcador do Eixo da Tabela de Risco (5-50)",
  "risktableclean": "Remover Eixos e Linhas de Grade da Tabela de Risco",
  "label3": "Opções de Linha",
  "linesize": "Tamanho (0-5)",
  "linecolor": "Cor",
  "label4": "Intervalo de Confiança",
  "cichkbox": "incluir IC de 95%",
  "cistyle": "Estilo",
  "citransparency": "Transparência (0-1)",
  "label5": "Tempos Censurados",
  "censorchkbox": "Incluir Tempos Censurados",
  "censorsize": "Tamanho (0-10)",
  "medsurvivalline": "Indicar Sobrevivência Mediana (h=horizontal, v=vertical)",
  "label6": "Eixo de Sobrevivência",
  "survaxislabel": "Rótulo",
  "axislabelsize": "Tamanho do Rótulo do Eixo (5-50)",
  "label7": "Escala",
  "defbutton": "proporção",
  "pctbutton": "porcentagem",
  "survaxislimits": "Limites do eixo na escala de proporção (0-1) - insira 'c(min, max)'",
  "survtickinc": "Incrementos de Marcador de Tick (0-1)",
  "label8": "Eixo do Tempo",
  "timeaxislabel": "Rótulo",
  "timeaxislimits": "Limites do Eixo (NULL é padrão, insira 'c(min,max)' para mudar, ex. 'c(0,20)')",
  "timetickinc": "Incrementos de Marcador de Tick (NULL é padrão, insira um número para mudar, min=0)",
  "ticklabelsize": "Tamanho do Rótulo do Marcador do Eixo (5-50)",
  "help": {
    "title": "Estimativa de Kaplan-Meier, Um Grupo",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tVeja o conjunto de dados de amostra no diretório de instalação, o local padrão é na letra da unidade:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. A variável Followup_time deve ser inserida como o tempo até o evento ou censura e a variável Event deve ser inserida como o Evento (1 = evento, 0 = censura).<br/>\n            Este conjunto de dados é uma versão atualizada do conjunto de dados mockstudy no pacote arsenal.<br/><br/>\t\t\n            <b>Curvas de sobrevivência de Kaplan-Meier</b>\n            <br/>\n            <br/>\n            Estas são usadas para estimar o risco cumulativo de não ter algum evento (ou inversamente, ter algum evento) ao longo de um período de tempo após o início do acompanhamento para esse evento (ou tempo zero). Os sujeitos precisam estar em risco para o evento começando no tempo zero.\n            <br/>\n            <br/>\n            <b>Tempo:</b> Duração do tempo até um evento, se o evento ocorreu, ou último acompanhamento para esse evento, se o evento não ocorreu, para cada sujeito\n            <br/><br/>\n            <b>Evento:</b> Indicador numérico de se o evento ocorreu ou não (1=evento, 0=censura) para cada sujeito\n            <br/><br/>\n            <b>Tipo de Gráfico:</b> Se você deseja plotar a probabilidade de não ter o evento (sobrevivência) ou ter o evento (falha)\n            <br/><br/>\n            <b>Tabela de Estimativas Incluindo Todos os Tempos:</b> Opção para incluir uma tabela que possui as probabilidades de estimativa de sobrevivência e evento para cada tempo observado no conjunto de dados\n            <br/>\n            <br/>\n\t\t\t<b>Tabela de Estimativas para Tempos Específicos:</b> Opção para incluir uma tabela que possui as probabilidades de estimativa de sobrevivência para um conjunto de tempos selecionados pelo usuário.\n\t\t\t<br/><br/>\n\t\t\t<b>Especifique os tempos como time1, time2, time3, etc. ou como seq(1,5,by=1):</b> Estes são os tempos específicos que serão incluídos na tabela para tempos específicos. Eles podem ser especificados individualmente com vírgulas, ou como uma sequência de valores uniformemente espaçados.\n\t\t\t<br/><br/>\n            Tabelas são geradas com o tamanho da amostra, o número de sujeitos com o evento, o tempo mediano de sobrevivência (se definido), o tempo médio de sobrevivência restrito e o tempo mediano de acompanhamento. O tempo mediano de acompanhamento é calculado usando o estimador de Kaplan-Meier reverso, que trata eventos verdadeiros como observações censuradas e observações censuradas verdadeiras como eventos. Assim, o \"evento\" neste estimador é \"acompanhar os sujeitos pelo maior tempo que o estudo poderia\".\n            <br/>\n            Uma tabela de estimativas de sobrevivência e evento de Kaplan-Meier é fornecida em cada tempo observado no conjunto de dados, com intervalos de confiança de 95%. \n            <br/>\n            <br/>\n            <b>Pacotes Necessários:</b> survival, broom, survminer, dplyr, arsenal, ggthemes \n            <br/><br/>\n            <br/>           \n            <b>Opções de Estilo</b>\n            <br/>\n            <br/>\n            <b>Título do Gráfico:</b> Título do gráfico; delete todo o texto para não ter título\n            <br/><br/>\n\t\t\t<b>Tamanho do Título do Gráfico:</b> Tamanho do título do gráfico.\n\t\t\t<br/><br/>\n            <b>Tema do Gráfico:</b> Estilo geral do gráfico\n            <br/><br/>\n            <b>Incluir Número em Risco:</b> Opcionalmente, incluir uma tabela para o número de sujeitos ainda em risco ao longo do tempo na parte inferior do gráfico.  <b>Posição da Tabela de Risco</b> especifica se você deseja que a tabela fique fora dos eixos ou dentro dos eixos.  A <b>Altura da Tabela de Risco</b> controla a proporção da área de plotagem que a tabela ocupará. Esta opção é ignorada quando a posição da tabela de risco está dentro dos eixos. \n\t\t\tO <b>Tamanho do Valor da Tabela de Risco</b> controla o tamanho dos números em risco. O <b>Tamanho do Título da Tabela de Risco</b> controla o tamanho do título da tabela de número em risco.\n\t\t\tO <b>Tamanho do Rótulo do Eixo da Tabela de Risco</b> controla o tamanho dos rótulos dos eixos.\n\t\t\tO <b>Tamanho do Rótulo do Marcador do Eixo da Tabela de Risco</b> controla o tamanho dos rótulos dos marcadores de tick para os tempos na tabela de número em risco. Se for desejado remover todos os eixos e linhas de grade \n\t\t\tda tabela de número em risco, a opção <b>Remover Eixos e Linhas de Grade da Tabela de Risco</b> pode ser marcada. Isso incluirá apenas os números em risco na tabela.\n            <br/>\n            <br/>\n            <b>Opções de Linha:</b>\n            <b>Tamanho</b> controla a espessura e <b>Cor</b> controla a cor da linha plotada. Pode-se opcionalmente incluir um intervalo de confiança de 95% para as estimativas em formato de <b>ribbon</b> (área sombreada) ou <b>step</b> (linha). <b>Transparência</b> controla quão escura é a fita e é ignorada quando a opção de passo é selecionada. <b>Tempos Censurados</b> (quando os sujeitos não estão mais em risco para o evento) podem ser indicados na linha com símbolos \"+\". O tamanho dos símbolos \"+\" pode ser ajustado. A opção <b>Indicar Sobrevivência Mediana</b> incluirá linhas horizontais ou verticais no momento em que 50% dos sujeitos são estimados como tendo tido o evento. O tempo mediano é indefinido se a curva de sobrevivência não cruzar 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opções de Eixo</b>\n            <br/> \n            <br/> \n            A opção <b>Rótulo</b> especifica o rótulo de texto para o eixo. A <b>Limites do Eixo</b> especifica os valores mínimo e máximo do eixo. A opção <b>Incrementos de Marcador de Tick</b> controla o espaçamento dos marcadores de tick no eixo. Os incrementos no eixo do tempo também controlam os tempos para a tabela opcional de número em risco.\n            <br/> \n            A opção <b>Escala</b> do eixo de sobrevivência especifica se você deseja que as estimativas estejam em uma escala de proporção (0-1) ou porcentagem (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Tamanho do Rótulo do Eixo:</b>  Isso controla o tamanho dos rótulos dos eixos de sobrevivência e tempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Tamanho do Rótulo do Marcador do Eixo:</b>  Isso controla o tamanho dos rótulos dos marcadores de tick dos eixos de sobrevivência e tempo.\n"
  }
}