{
  "title": "Teste de Soma de Postos de Kruskal-Wallis",
  "navigation": "Teste de Kruskal-Wallis",
  "tvarbox1": "Variável de resposta",
  "tvarbox2": "Variável de fator",
  "label1": "Método de estimativa",
  "default": "Assintótico",
  "exact": "Exato NOTA: a variável de fator deve ter exatamente 2 níveis ou um erro será exibido",
  "normal": "Monte Carlo",
  "header": "NOTA: Ao selecionar o método de estimativa exato, a variável de fator deve ter exatamente 2 níveis, caso contrário, um erro será exibido",
  "padjust": "Ajuste de comparação múltipla",
  "ties": "Opções para lidar com empates",
  "simulations": "Insira o número de simulações",
  "help": {
    "title": "Teste de Soma de Postos de Kruskal-Wallis",
    "r_help": "help(kruskal.test, package=stats)",
    "body": "\n<b>Descrição</b></br>\nExecuta um teste de soma de postos de Kruskal-Wallis.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nkruskal.test(x, ...)\n## Método S3 padrão:\nkruskal.test(x, g, ...)\n## Método S3 para a classe 'formula'\nkruskal.test(formula, data, subset, na.action, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nArgumentos\nx: um vetor numérico de valores de dados, ou uma lista de vetores de dados numéricos. Elementos não numéricos de uma lista serão convertidos, com um aviso.\n</li>\n<li>\ng: um vetor ou objeto fator que dá o grupo para os elementos correspondentes de x. Ignorado com um aviso se x for uma lista.\n</li>\n<li>\nformula: uma fórmula da forma resposta ~ grupo onde resposta dá os valores dos dados e grupo um vetor ou fator dos grupos correspondentes.\n</li>\n<li>\ndata: uma matriz ou data frame opcional (ou similar: veja model.frame) contendo as variáveis na fórmula formula. Por padrão, as variáveis são retiradas do ambiente(formula).\n</li>\n<li>\nsubset: um vetor opcional especificando um subconjunto de observações a serem usadas.\n</li>\n<li>\nna.action: uma função que indica o que deve acontecer quando os dados contêm NAs. Padrão para getOption(\"na.action\").\n</li>\n<li>\n...: argumentos adicionais a serem passados para ou de métodos.\n</li>\n</ul>\n<b>Detalhes</b></br>\nkruskal.test executa um teste de soma de postos de Kruskal-Wallis da nulidade de que os parâmetros de localização da distribuição de x são os mesmos em cada grupo (amostra). A alternativa é que eles diferem em pelo menos um.</br>\nSe x for uma lista, seus elementos são considerados como as amostras a serem comparadas, e, portanto, devem ser vetores de dados numéricos. Nesse caso, g é ignorado, e pode-se simplesmente usar kruskal.test(x) para realizar o teste. Se as amostras ainda não estiverem contidas em uma lista, use kruskal.test(list(x, ...)).</br>\nCaso contrário, x deve ser um vetor de dados numéricos, e g deve ser um vetor ou objeto fator da mesma extensão que x, dando o grupo para os elementos correspondentes de x.</br>\n<b>Valor</b><br/>\nUma lista com a classe \"htest\" contendo os seguintes componentes:<br/>\nstatistic: a estatística de soma de postos de Kruskal-Wallis<br/>\nparameter: os graus de liberdade da distribuição qui-quadrado aproximada da estatística do teste<br/>\np.value: o valor p do teste<br/>\nmethod: a string de caracteres \"Teste de soma de postos de Kruskal-Wallis\"<br/>\ndata.name: uma string de caracteres dando os nomes dos dados<br/>\n<b>Descrição</b></br>\nAjuste de Comparação Múltipla</br>\nOs métodos de ajuste incluem a correção de Bonferroni (\"bonferroni\") na qual os valores p são multiplicados pelo número de comparações. Correções menos conservadoras também estão incluídas por Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), Hommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" ou seu alias \"fdr\"), e Benjamini & Yekutieli (2001) (\"BY\"), respectivamente. Uma opção de passagem (\"none\") também está incluída. O conjunto de métodos está contido no vetor p.adjust.methods para o benefício de métodos que precisam ter o método como uma opção e passá-lo para p.adjust.</br>\nOs primeiros quatro métodos são projetados para dar um controle forte da taxa de erro familiar. Não parece haver razão para usar a correção de Bonferroni não modificada porque é dominada pelo método de Holm, que também é válido sob suposições arbitrárias.</br>\nOs métodos de Hochberg e Hommel são válidos quando os testes de hipótese são independentes ou quando estão associados de forma não negativa (Sarkar, 1998; Sarkar e Chang, 1997). O método de Hommel é mais poderoso que o de Hochberg, mas a diferença geralmente é pequena e os valores p de Hochberg são mais rápidos de calcular.</br>\nO método \"BH\" (também conhecido como \"fdr\") e \"BY\" de Benjamini, Hochberg e Yekutieli controlam a taxa de descoberta falsa, a proporção esperada de descobertas falsas entre as hipóteses rejeitadas. A taxa de descoberta falsa é uma condição menos rigorosa do que a taxa de erro familiar, portanto, esses métodos são mais poderosos do que os outros.</br>\n</br>\nMétodo de teste para comparações de grupos par a par:</br>\nPadrão: um valor p exato é calculado se as amostras contêm menos de 50 valores finitos e não há empates. Caso contrário, uma aproximação normal é usada.</br>\nExato: um valor p exato é calculado; não recomendado para tamanhos de amostra grandes devido ao tempo de computação</br>\nAproximação Normal: valores p usando uma aproximação normal são calculados</br>\nCom Correção de Continuidade: valores p usando uma aproximação normal com uma correção de continuidade são calculados </br>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nhelp(kruskal.test, package=stats)\n"
  }
}