{
  "title": "Validação Cruzada Leave One Out",
  "navigation": "Validação Cruzada Leave One Out",
  "modelname": "Insira o nome do modelo ajustado",
  "dependent": "Variável a Prever",
  "independent": "Variáveis Independentes",
  "levelOfInterest": "Quando a variável a prever tem 2 níveis, especifique o nível de interesse. A matriz de confusão e as estatísticas relacionadas são exibidas com o nível de interesse especificado como referência",
  "label1": "ALGUNS MODELOS OBJETAM A VALORES FALTANTES OU VARIÁVEIS DEPENDENTES QUE SÃO FATORES. PARA MANUSEIO DE VALORES FALTANTES, VEJA [ VARIÁVEIS > VALORES FALTANTES ] E PARA CODIFICAÇÃO DUMMY DE VARIÁVEIS FATORIAIS, VEJA [ VARIÁVEIS > COMPUTAR > CODIFICAÇÃO DUMMY ]. Clique no ícone ? no canto superior direito do diálogo para detalhes.",
  "ModelSelection": "Selecione uma categoria de modelo e, em seguida, o tipo de modelo",
  "help": {
    "title": "Validação Cruzada Leave One Out",
    "r_help": "ajuda(train, pacote=caret)",
    "body": "\n<b>Descrição</b></br>\nA Validação Cruzada Leave One Out utiliza as funções trainControl e train dentro do pacote caret para criar um modelo ajustado/otimizado.<br/>\nUm modelo ajustado é construído por meio da reamostragem de resultados em torno de parâmetros de ajuste. Os resultados do ajuste são exibidos abaixo das tabelas na parte inferior da saída<br/>\nUma vez que o modelo ajustado é construído, fazemos previsões usando o modelo ajustado contra o conjunto de dados de treinamento (usado para construir o modelo) e exibimos a matriz de confusão e as estatísticas relacionadas.<br/>\nNOTA: veja a URL em https://www.blueskystatistics.com/Articles.asp?ID=330 para detalhes sobre modelos que requerem variáveis dependentes para serem codificadas como dummy e requisitos correspondentes para variáveis dependentes suportadas. Além disso, alguns modelos não suportam valores faltantes; se houver erros exibidos ao construir o modelo, remova os valores faltantes.<br/>\nO modelo ajustado é armazenado no objeto da classe train com um nome que você especificou na caixa de texto de controle.<br/>\nOs valores de parâmetro selecionados para o modelo ajustado final são exibidos na parte inferior da saída.<br/>\nNo caso de preditores com 2 níveis, você tem a opção de selecionar o nível de referência/nível de interesse.<br/>\nA matriz de confusão e as estatísticas relacionadas são criadas usando o nível de interesse especificado.<br/>\n<code> \ntrain_control <- caret::trainControl(method=\"LOOCV\")<br/>\n#Sintaxe geral<br/>\ntunedModel <- caret::train(x = dados amostrados para treinar o modelo, y = variável dependente, trControl = train_control, method = \"o modelo a ser usado\", prob.model = TRUE )<br/>\n#Sintaxe de exemplo preenchida<br/>\ntunedModel <- caret::train(as.data.frame(TrainData), dependentVariable, trControl = train_control, method = \"adaboost\", preProcess = NULL, prob.model = TRUE )<br/>\n</code>\nGeramos uma matriz de confusão e estatísticas de precisão do modelo para o modelo ajustado. Isso é feito da seguinte forma\n<ul>\n<li>\nGeramos valores previstos a partir do conjunto de dados de treinamento chamando a função predict no modelo otimizado da classe train (Internamente, predict.train é a função no pacote caret que R chama)<br/>\n<code> \nvaloresPrevistos = predict(modeloAjustado retornado pela função train)<br/>\n</code> <br/>\n</li>\n<li>\nCalculamos as estatísticas de precisão a partir da matriz de confusão gerada como abaixo<br/>\n<code> \ncaret::confusionMatrix (previsões = valoresPrevistos, referência = variável dependente do modelo)<br/>\n</code> \n</li>\n</ul>\nVocê pode usar o modelo ajustado/otimizado final para pontuar um conjunto de dados. Para fazer isso, siga os passos abaixo<br/>\n1. Vá para o conjunto de dados que você deseja pontuar. Nota: Os nomes das variáveis no conjunto de dados a ser pontuado (também conhecido como variáveis independentes) devem corresponder aos nomes das variáveis que você usou no conjunto de dados para originalmente criar o modelo ajustado. Caso contrário, um erro será exibido. Esta mensagem de erro será exibida na seção de testes diagnósticos no diálogo de Pontuação do Modelo, veja o ponto 2 abaixo. <br/>\n2.\tAbra o diálogo de Pontuação do Modelo em Avaliação do Modelo>Prever>Pontuação do Modelo. <br/>\n3.\tSelecione um modelo que você deseja usar para pontuar o conjunto de dados. Você pode filtrar os modelos que você construiu por classe. <br/>\n4.\tUma vez que você tenha selecionado o modelo, especifique um prefixo a ser usado para armazenar os valores previstos. Você pode opcionalmente salvar intervalos de confiança para as previsões e gerar uma matriz de confusão. Você deve especificar um prefixo para a variável que contém as previsões/pontuações. As previsões e as probabilidades previstas, quando aplicável, são armazenadas como novas variáveis no final do conjunto de dados. Por exemplo, se o prefixo especificado for AA, as previsões são armazenadas em uma variável AA_nome da variável dependente_original_Predictions, as probabilidades previstas são armazenadas em uma variável AA_Nível1_PredictedProbs. <br/>\n5. Clique no botão Executar para pontuar o conjunto de dados. <br/>\n<b>Pacote</b></br>\ncaret</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando ajuda(train, pacote ='caret') na janela do Editor R\n"
  }
}