{
  "title": "Razões de Verossimilhança e Betas de Gráfico",
  "navigation": "Razões de Verossimilhança e Betas de Gráfico",
  "label1": "Selecione um modelo (modelos das classes Rm, dRm e eRm são suportados)",
  "label1b": "Se nenhum modelo estiver disponível, você precisa criar um modelo primeiro selecionando Ajuste de Modelo -> IRT -> Modelo Rasch Simples e escolher a estimativa CML",
  "modelselector1": "Selecione um modelo",
  "spcr": "Critérios de divisão",
  "destination": "Selecione variáveis para plotar betas",
  "help": {
    "title": "Razões de Verossimilhança e Betas de Gráfico",
    "r_help": "help(LRtest, package='eRm')",
    "body": "\n                <b>Descrição</b></br>\n                Este teste LR é baseado na divisão de subgrupos de sujeitos.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \n## Método S3 para a classe 'Rm'\n<br/>\nLRtest(object, splitcr = \"mediana\", se = TRUE)\n<br/>\n## Método S3 para a classe 'LR'\n<br/>\nplotGOF(x, beta.subset = \"todos\", main = \"Verificação Gráfica do Modelo\", xlab, ylab,\n    tlab = \"item\", xlim, ylim, type = \"p\", pos = 4, conf = NULL, ctrline = NULL, \n    smooline = NULL, asp = 1, x_axis = TRUE, y_axis = TRUE, set_par = TRUE, \n    reset_par = TRUE, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nobject: Objeto da classe \"Rm\".\n</li>\n<li>\nsplitcr: Critério de divisão para a pontuação bruta dos sujeitos. \"all.r\" corresponde a uma divisão completa da pontuação bruta, \"mediana\" usa a mediana como critério de divisão, \"média\" realiza uma divisão média. Opcionalmente, splitcr também pode ser um vetor que atribui cada pessoa a um certo subgrupo (por exemplo, seguindo um critério externo). Este vetor pode ser numérico, caracter ou um fator.\n</li>\n<li>\nse: controla o cálculo de erros padrão nos submodelos (padrão: TRUE)\n</li>\n<li>\nx: Objeto da classe \"LR\". Também usado para visualizar o ajuste de itens únicos.\n</li>\n<li>\nbeta.subset: Se \"todos\", todos os itens são plotados. Caso contrário, um vetor numérico de subconjunto pode ser especificado.\n</li>\n<li>\ntlab: Especificação de rótulos de itens: \"item\" imprime os nomes dos itens, \"número\" fornece inteiros correspondentes à ordem dos parâmetros beta, se \"nenhum\" nenhum rótulo é impresso. \"identify\" permite uma rotulagem interativa. Inicialmente, nenhum rótulo é impresso, após clicar perto de um ponto de item, o rótulo correspondente é adicionado. O processo de identificação é encerrado clicando no segundo botão e selecionando 'Parar' no menu, ou no menu 'Parar' na janela gráfica. Para mais informações e operação básica, veja identify.\n</li>\n<li>\nconf: para plotar elipses de confiança para os parâmetros do item. Se conf = NULL (o padrão) nenhuma elipse é desenhada. Caso contrário, conf deve ser especificado como uma lista com elementos opcionais: gamma, é o nível de confiança (numérico), col e lty, cor e tipo de linha (veja par), que (vetor de índice numérico) especifica para quais itens as elipses são desenhadas (deve ser um subconjunto de beta.subset), e ia, lógico, se as elipses devem ser desenhadas interativamente (cf., tlab = \"identify\" acima). Para detalhes sobre o comportamento padrão, se conf for especificado como uma lista vazia, veja Detalhes e Exemplos abaixo. Para usar conf, o objeto LR x deve ser gerado usando a opção se = TRUE em LRtest(). Veja help(MLoef) para mais detalhes.\n</li>\n</ul>\n<b>Detalhes</b></br>\nSe o conjunto de dados contiver valores ausentes e a média ou mediana for especificada como critério de divisão, médias ou medianas são calculadas para cada subgrupo de valores ausentes e, consequentemente, usadas para a divisão da pontuação bruta.\n<br/>\nAo usar seleção interativa para rotulagem de pontos únicos (tlab = \"identify\" e desenho de elipses de confiança em certos pontos (ia = TRUE), primeiro todos os pontos plotados são rotulados e, em seguida, todas as elipses são geradas. Ambos os processos de identificação podem ser encerrados clicando com o segundo botão do mouse e selecionando 'Parar' no menu, ou no menu 'Parar' na janela gráfica.\n<br/>\nUsando a especificação que permite desenhar elipses seletivamente para certos itens apenas, por exemplo, which = 1:3 desenha elipses para os itens 1 a 3 (desde que estejam incluídos em beta.subset). O padrão é desenhar elipses para todos os itens. O elemento col na lista conf pode ser uma especificação de cor única, como \"azul\" ou um vetor com especificações de cor para todos os itens. O comprimento deve ser o mesmo que o número de elipses a serem desenhadas. Para especificação de cor, uma paleta pode ser configurada usando paletas padrão (por exemplo, arco-íris) ou paletas do colorspace ou pacote RColorBrewer. Um exemplo é dado abaixo.\n<br/>\nresumos e métodos de impressão estão disponíveis para objetos da classe LR.\n<br/><br/>\n<b>Valor</b><br/>\nLRtest retorna um objeto da classe LR contendo:\n<br/><br/>\nLR: valor LR.\n<br/>\ndf: Graus de liberdade da estatística do teste.\n<br/>\nChisq: valor do qui-quadrado com df correspondente.\n<br/>\n<br/>\n<b>Pacote</b></br>\neRm\n<br/><br/>\n<b>Ajuda</b>\nhelp(LRtest, package='eRm')\n\n                "
  }
}