{
  "title": "Regressão Linear",
  "navigation": "Linear, básico (Legado)",
  "modelname": "Digite o Nome do Modelo",
  "dependent": "Variável dependente",
  "independent": "Variável(is) independente(s)",
  "nointercept": "Ignorar intercepto",
  "generateplotchk": "Plotar resíduos vs ajustados, normal Q-Q, escala-local e resíduos vs alavancagem",
  "weights": "Especifique uma variável com pesos",
  "help": {
    "title": "Regressão Linear",
    "r_help": "help(lm, package ='stats')",
    "body": "\n            <b>Descrição</b></br>\nConstrói um modelo de regressão linear. Internamente chama a função lm no pacote stats. Retorna um objeto chamado BSkyLinearRegression que é um objeto da classe lm. Exibe um resumo do modelo, tabela de coeficientes, tabela Anova e tabela de soma de quadrados e plota os seguintes resíduos vs. ajustados, normal Q-Q, quantis teóricos, resíduos vs. alavancagem. Você pode opcionalmente especificar uma variável com pesos e escolher ignorar o intercepto.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nLinearRegModel1 <- lm(depVar~indepVars, dataset)​<br/>\n#Resumindo o modelo<br/>\nsummary(LinearRegModel1)<br/>\n#Exibindo a tabela Anova<br/>\nanova(LinearRegModel1)<br/>\n#Plota resíduos vs. ajustados, normal Q-Q, escala-local, resíduos vs. alavancagem<br/>\nplot(LinearRegModel1)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ndepVar: Nome da variável dependente. Se temos um conjunto de dados carros, com uma variável mpg que queremos prever mpg (a variável dependente é mpg) digite mpg​\n</li>\n<li>\nindepVars: Nomes da variável dependente. Se temos um conjunto de dados carros, com variável dependente potência, tamanho do motor, digite potência+tamanho do motor. Variáveis categóricas são automaticamente codificadas como dummy.​\n</li>\n<li>\ndataset: Nome do dataframe. Quando você abre data frames ou conjuntos de dados, por exemplo, arquivos csv, Excel, arquivos SAS no BioStat Prime, eles são nomeados Dataset1, Dataset2, Dataset3, então digite Dataset1\n</li>\n</ul>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nhelp(lm, package ='stats')\n\t\t\t"
  }
}