{
  "ProjectTitleStr": "Projeto",
  "Source_variables": "Variáveis de origem",
  "Source_Datasets": "Conjuntos de dados de origem",
  "Source_Datasets_rerun": "Conjuntos de dados de origem",
  "jsoncomment000": "=======Construtor de Fórmulas abaixo desta linha=======",
  "FBStr0": "Construtor de Fórmulas",
  "FBStr1": "Clique em um botão abaixo e arraste e solte variáveis para criar uma expressão.",
  "FBStr2": "Clicar em um botão selecionado alternará seu estado.",
  "FBStr3": "Para inserir em uma posição, coloque o cursor nessa posição e arraste e solte/mova a(s) variável(eis).",
  "FBStr4": "Passe o mouse sobre um botão para ajuda.",
  "FBStr5": "Você não pode alternar o botão All N way.",
  "FBttip1": "Clique no botão + e mova as variáveis que deseja separar com +. Para inserir apenas +, clique duas vezes.",
  "FBttip2": "Clique no botão - e mova as variáveis que deseja separar com -. Para inserir apenas -, clique duas vezes.",
  "FBttip3": "Clique no botão * e mova as variáveis que deseja separar com *. Para inserir apenas *, clique duas vezes.",
  "FBttip4": "Clique no botão / e mova as variáveis que deseja separar com /. Para inserir apenas /, clique duas vezes.",
  "FBttip5": "Clique no botão ( para inseri-lo",
  "FBttip6": "Clique no botão ) para inseri-lo",
  "FBttip7": "Clique no botão %in% para inserir %in%",
  "FBttip8": "Clique no botão | para inseri-lo",
  "FBttip9": "Clique no botão : e mova as variáveis que deseja separar com :. Para inserir apenas :, clique duas vezes.",
  "FBbtnlbl10a": "Todas 2 maneiras",
  "FBbtnlbl10b": "Todas 3 maneiras",
  "FBbtnlbl10c": "Todas 4 maneiras",
  "FBbtnlbl10d": "Todas 5 maneiras",
  "FBbtnlbl10e": "Todas 6 maneiras",
  "FBbtnlbl10f": "Todas 7 maneiras",
  "FBbtnlbl10g": "Todas 8 maneiras",
  "FBbtnlbl10h": "Todas 9 maneiras",
  "FBbtnlbl10i": "Todas 10 maneiras",
  "FBttip10": "Clique na opção All N-way e depois mova as variáveis para criar interações N-way. Para desativar, clique em outro botão.",
  "FBbtnlbl11": "Termos polinomiais",
  "FBttip11": "Selecione um número, clique no botão e mova as variáveis para adicionar termos polinomiais de grau N",
  "FBbtnlbl12": "df para splines",
  "FBttip12": "Especifique um grau de liberdade para splines",
  "FBbtnlbl13": "Grau polinomial",
  "FBttip13": "Especifique um grau polinomial",
  "FBbtnlbl14": "B-spline",
  "FBttip14": "Clique em B-spline e mova uma ou mais variáveis. Para inserir código genérico, clique duas vezes",
  "FBbtnlbl15": "Spline natural",
  "FBttip15": "Clique em spline natural e mova uma ou mais variáveis. Para inserir código genérico, clique duas vezes",
  "FBbtnlbl16": "Polinômio ortogonal",
  "FBttip16": "Clique no botão de polinômio ortogonal e mova uma ou mais variáveis. Para inserir código genérico, clique duas vezes",
  "FBbtnlbl17": "Polinômio bruto",
  "FBttip17": "Clique no botão de polinômio bruto e mova uma ou mais variáveis. Para inserir código genérico, clique duas vezes",
  "jsoncomment001": "=======Construtor de Cálculos abaixo desta linha=======",
  "CBStr1": "Clique em um botão abaixo e arraste e solte variáveis para criar uma expressão.",
  "CBStr2": "Clicar em um botão selecionado alternará seu estado.",
  "CBStr3": "Para inserir em uma posição, coloque o cursor nessa posição e arraste e solte/mova a(s) variável(eis).",
  "CBStr4": "Passe o mouse sobre um botão para ajuda.",
  "CBtabArithmetic": "Aritmética",
  "CBtabLogical": "Lógico",
  "CBtabMath": "Matemática",
  "CBtabString1": "String(1)",
  "CBtabString2": "String(2)",
  "CBtabConversion": "Conversão",
  "CBtabStatistical": "Estatístico",
  "CBtabRandomNumbers": "Números Aleatórios",
  "CBtabDate1": "Data(1)",
  "CBtabDate2": "Data(2)",
  "CBtabDate3": "Data(3)",
  "CBtabDate4": "Data(4)",
  "CBttip1": "Clique no botão + e mova as variáveis que você deseja separar com +. Para inserir apenas +, clique duas vezes.",
  "CBttip2": "Clique no botão - e mova as variáveis que você deseja separar com -. Para inserir apenas -, clique duas vezes.",
  "CBttip3": "Clique no botão * e mova as variáveis que você deseja separar com *. Para inserir apenas *, clique duas vezes.",
  "CBttip4": "Clique no botão / e mova as variáveis que você deseja separar com /. Para inserir apenas /, clique duas vezes.",
  "CBttip5": "Clique em ^ e mova as variáveis para exponenciar, para inserir código genérico clique duas vezes.",
  "CBbtnlbl6": "sqrt",
  "CBttip6": "Clique em SQRT e mova as variáveis para calcular uma raiz quadrada, para inserir código genérico clique duas vezes.",
  "CBbtnlbl7": "log",
  "CBttip7": "Clique em LOG e mova as variáveis para calcular um logaritmo natural, para inserir código genérico clique duas vezes.",
  "CBbtnlbl8": "log10",
  "CBttip8": "Clique em LOG10 e mova as variáveis para calcular um logaritmo na base 10, para inserir código genérico clique duas vezes.",
  "CBbtnlbl9": "log2",
  "CBttip9": "Clique em LOG2 e mova as variáveis para calcular um logaritmo na base 2, para inserir código genérico clique duas vezes.",
  "CBbtnlbl10": "mod",
  "CBttip10": "Clique em MOD e mova as variáveis para dividir e calcular o resto, para inserir código genérico clique duas vezes.",
  "CBbtnlbl11": "abs",
  "CBttip11": "Clique em abs e mova as variáveis para calcular um valor absoluto, para inserir código genérico clique duas vezes.",
  "CBbtnlbl12": "exp",
  "CBttip12": "Clique em exp e mova as variáveis para calcular uma exponencial, para inserir código genérico clique duas vezes.",
  "CBbtnlbl13": "",
  "CBttip13": "Clique para inserir o símbolo >",
  "CBbtnlbl14": "",
  "CBttip14": "Clique para inserir o símbolo <",
  "CBbtnlbl15": "",
  "CBttip15": "Clique para inserir o símbolo >= ",
  "CBbtnlbl16": "",
  "CBttip16": "Clique para inserir o símbolo <= ",
  "CBbtnlbl17": "",
  "CBttip17": "Clique para inserir o símbolo == (teste de igualdade)",
  "CBbtnlbl18": "",
  "CBttip18": "Clique para inserir o símbolo != (diferente)",
  "CBbtnlbl19": "",
  "CBttip19": "Clique para inserir o símbolo | (ou lógico)",
  "CBbtnlbl20": "",
  "CBttip20": "Clique para inserir o símbolo & (e lógico)",
  "CBbtnlbl21": "%/%",
  "CBttip21": "Clique para inserir o símbolo de divisão inteira (%/%)",
  "CBbtnlbl22": "isTRUE",
  "CBttip22": "Clique em isTRUE para selecionar e mover a variável para verificar valores TRUE. Retorna TRUE/FALSE, para inserir código genérico clique duas vezes.",
  "CBbtnlbl23": "é.na",
  "CBttip23": "Clique em é.na para selecionar e mover a variável para verificar valores NA. Retorna VERDADEIRO/FALSO, para inserir código genérico clique duas vezes",
  "CBbtnlbl24": "%em%",
  "CBttip24": "Clique no botão %em% para inserir %em%",
  "CBbtnlbl25": "arredondar",
  "CBttip25": "Clique em arredondar e mova variáveis para arredondar, para inserir código genérico clique duas vezes",
  "CBbtnlbl26": "teto",
  "CBttip26": "Clique em teto e mova variáveis para calcular o teto, para inserir código genérico clique duas vezes",
  "CBbtnlbl27": "chão",
  "CBttip27": "Clique em chão e mova variáveis para calcular o chão, para inserir código genérico clique duas vezes",
  "CBbtnlbl28": "significativo",
  "CBttip28": "Clique em significativo e mova variáveis para arredondar para o número especificado de dígitos significativos, para inserir código genérico clique duas vezes",
  "CBbtnlbl29": "gamma",
  "CBttip29": "Clique em gamma e mova variáveis para calcular uma função gamma, para inserir código genérico clique duas vezes",
  "CBbtnlbl30": "lgamma",
  "CBttip30": "Clique em lgamma e mova variáveis para calcular uma função lgamma, para inserir código genérico clique duas vezes",
  "CBbtnlbl31": "beta",
  "CBttip31": "Clique em beta e mova variáveis para calcular uma função beta, para inserir código genérico clique duas vezes",
  "CBbtnlbl32": "lbeta",
  "CBttip32": "Clique em lbeta e mova variáveis para calcular uma função lbeta, para inserir código genérico clique duas vezes",
  "CBbtnlbl33": "fatorial",
  "CBttip33": "Clique em fatorial e mova variáveis para calcular fatoriais, para inserir código genérico clique duas vezes",
  "CBbtnlbl34": "pigamma",
  "CBttip34": "Clique em pigamma e mova variáveis para calcular uma função pigamma, para inserir código genérico clique duas vezes",
  "CBbtnlbl35": "maiusculas",
  "CBttip35": "Clique em maiusculas e mova variáveis para converter para maiúsculas, para inserir código genérico clique duas vezes",
  "CBbtnlbl36": "minusculas",
  "CBttip36": "Clique em minusculas e mova variáveis para converter para minúsculas, para inserir código genérico clique duas vezes",
  "CBbtnlbl37": "Preencher",
  "CBttip37": "Clique em Preencher e mova variáveis para preencher com um caractere, para inserir código genérico clique duas vezes",
  "CBbtnlbl38": "Remover Espaço",
  "CBttip38": "Clique em Remover Espaço e mova variáveis para remover espaços em branco da esquerda, direita ou de ambas as extremidades, para inserir código genérico clique duas vezes",
  "CBbtnlbl39": "Comprimento",
  "CBttip39": "Clique em Comprimento e mova variáveis para retornar o número de caracteres na string, para inserir código genérico clique duas vezes",
  "CBbtnlbl40": "Contar(correspondências)",
  "CBttip40": "Clique em Contar(correspondências) e mova variáveis para contar correspondências de um padrão/sub-string, para inserir código genérico clique duas vezes",
  "CBbtnlbl41": "Extrair Substring",
  "CBttip41": "Clique em Extrair Substring e mova variáveis para extrair uma sub-string (substitua a posição inicial e final por inteiros), para inserir código genérico clique duas vezes",
  "CBbtnlbl42": "Concatenar",
  "CBttip42": "Clique em Concatenar e mova variáveis para concatenar com um separador opcional, para inserir código genérico clique duas vezes",
  "CBbtnlbl43": "Substituir Padrão",
  "CBttip43": "Clique em Substituir Padrão e mova variáveis para substituir um padrão, para inserir código genérico clique duas vezes",
  "CBbtnlbl44": "Substituir Padrão(TODOS)",
  "CBttip44": "Clique em Substituir Padrão(TODOS) e mova variáveis para substituir todos os padrões, para inserir código genérico clique duas vezes",
  "CBbtnlbl45": "Extrair um Número",
  "CBttip45": "Clique em Extrair um Número e mova variáveis para extrair um número de, para inserir código genérico clique duas vezes",
  "CBbtnlbl46": "ParaNumérico",
  "CBttip46": "Clique em ParaNumérico e mova variáveis para converter para numérico, para inserir código genérico clique duas vezes",
  "CBbtnlbl47": "ParaCaractere",
  "CBttip47": "Clique em ParaCaractere e mova variáveis para converter para um caractere, para inserir código genérico clique duas vezes",
  "CBbtnlbl48": "ParaFator",
  "CBttip48": "Clique em ParaFator e mova as variáveis para converter em um fator, para inserir o código genérico clique duas vezes",
  "CBbtnlbl49": "ParaOrdenado",
  "CBttip49": "Clique em ParaOrdenado e mova as variáveis para converter em um fator ordenado, para inserir o código genérico clique duas vezes",
  "CBbtnlbl50": "ParaLógico",
  "CBttip50": "Clique em ParaLógico e mova as variáveis para converter em um lógico, para inserir o código genérico clique duas vezes",
  "CBbtnlbl51": "MÁX",
  "CBttip51": "Clique em MÁX e mova as variáveis para calcular o valor máximo, para inserir o código genérico clique duas vezes",
  "CBbtnlbl52": "MÍN",
  "CBttip52": "Clique em MÍN e mova as variáveis para calcular o valor mínimo, para inserir o código genérico clique duas vezes",
  "CBbtnlbl53": "MÉDIA",
  "CBttip53": "Clique em MÉDIA e mova as variáveis para calcular o valor médio, para inserir o código genérico clique duas vezes",
  "CBbtnlbl54": "MEDIANA",
  "CBttip54": "Clique em MEDIANA e mova as variáveis para calcular o valor mediano, para inserir o código genérico clique duas vezes",
  "CBbtnlbl55": "DP",
  "CBttip55": "Clique em DP e mova as variáveis para calcular o desvio padrão, para inserir o código genérico clique duas vezes",
  "CBbtnlbl56": "SOMA",
  "CBttip56": "Clique em SOMA e mova as variáveis para calcular a soma, para inserir o código genérico clique duas vezes",
  "CBbtnlbl57": "VARIÂNCIA",
  "CBttip57": "Clique em VARIÂNCIA e mova as variáveis para calcular a variância, para inserir o código genérico clique duas vezes",
  "CBbtnlbl58": "runif",
  "CBttip58": "Clique duas vezes em RUNIF e números aleatórios serão gerados a partir de uma distribuição uniforme com mínimo e máximo.",
  "CBbtnlbl59": "amostra",
  "CBttip59": "Clique em AMOSTRA e mova as variáveis para gerar amostras aleatórias com/sem reposição, para inserir o código genérico clique duas vezes",
  "CBbtnlbl60": "rnorm",
  "CBttip60": "Clique duas vezes em rnorm para gerar variáveis a partir de uma distribuição normal com uma média e desvio padrão especificados",
  "CBbtnlbl61": "Dia da Semana",
  "CBttip61": "Clique em Dia da Semana e mova uma variável de data da qual você deseja extrair o dia da semana (segunda-feira..) para inserir o código genérico clique duas vezes",
  "CBbtnlbl62": "Dia do Mês",
  "CBttip62": "Clique em Dia do Mês e mova uma variável de data da qual você deseja extrair o dia do mês (1-31) para inserir o código genérico clique duas vezes",
  "CBbtnlbl63": "Dia do Ano",
  "CBttip63": "Clique em Dia do Ano e mova uma variável de data da qual você deseja extrair o dia do ano (001-366) para inserir o código genérico clique duas vezes",
  "CBbtnlbl64": "Semana do Ano",
  "CBttip64": "Clique em Semana do Ano e mova uma variável de data da qual você deseja extrair a semana do ano (00-53) para inserir o código genérico clique duas vezes",
  "CBbtnlbl65": "Mês",
  "CBttip65": "Clique em Mês e mova uma variável de data da qual você deseja extrair o Mês (janeiro..) para inserir o código genérico clique duas vezes",
  "CBbtnlbl66": "Mês(decimal)",
  "CBttip66": "Clique em Mês(decimal) e mova uma variável de data da qual você deseja extrair o Mês (01-12) para inserir o código genérico clique duas vezes",
  "CBbtnlbl67": "Trimestres",
  "CBttip67": "Clique em Trimestres e mova uma variável de data da qual você deseja extrair os Trimestres (T1, T2..) para inserir o código genérico clique duas vezes",
  "CBbtnlbl68": "Ano(XXXX)",
  "CBttip68": "Clique em Ano(XXXX) e mova uma variável de data da qual você deseja extrair o Ano (1980) para inserir o código genérico clique duas vezes",
  "CBbtnlbl69": "Ano(XX)",
  "CBttip69": "Clique em Ano(XX) e mova uma variável de data da qual você deseja extrair o Ano (80) para inserir o código genérico clique duas vezes",
  "CBbtnlbl70": "Hora(00-12)",
  "CBttip70": "Clique em Hora(00-12) e mova uma variável de data da qual você deseja extrair a Hora (00) para inserir o código genérico clique duas vezes",
  "CBbtnlbl71": "Hora(00-23)",
  "CBttip71": "Clique em Hora(00-23) e mova uma variável de data da qual você deseja extrair a Hora, para inserir o código genérico clique duas vezes",
  "CBbtnlbl72": "Minutos",
  "CBttip72": "Clique em Minutos e mova uma variável de data da qual você deseja extrair os minutos, para inserir o código genérico clique duas vezes",
  "CBbtnlbl73": "Segs",
  "CBttip73": "Clique em Segs e mova uma variável de data da qual você deseja extrair os segundos, para inserir o código genérico, clique duas vezes",
  "CBbtnlbl74": "Data de String",
  "CBttip74": "Clique em Data de String e mova uma variável de string que você deseja converter em data, para inserir o código genérico, clique duas vezes",
  "CBbtnlbl75": "Diferença de Data",
  "CBttip75": "Clique em Diferença de Data e mova uma variável de data da qual você deseja subtrair de outra variável de data, para inserir o código genérico, clique duas vezes",
  "CBbtnlbl76": "Numérico para data",
  "CBttip76": "Clique em Numérico para data e mova uma variável numérica que você deseja converter em data, para inserir o código genérico, clique duas vezes",
  "CBbtnlbl77": "String para data",
  "CBttip77": "Clique em String para data e mova uma variável de string que você deseja converter em data, para inserir o código genérico, clique duas vezes",
  "jsoncomment002": "=======switchCase abaixo desta linha=======",
  "SCStr0": "Construtor de Condição Múltipla",
  "SCStr1": "Clique em um botão e arraste e solte variáveis para criar uma expressão.",
  "SCStr2": "Clicar em um botão selecionado alternará seu estado.",
  "SCStr3": "Para inserir em uma posição designada, arraste e solte diretamente nessa posição.",
  "SCStr4": "Passe o mouse sobre um botão para ajuda.",
  "SCifthenbtn": "SE ENTÃO",
  "SCelsebtn": "CASO CONTRÁRIO",
  "SCIFlbl": "SE",
  "SCTHENlbl": "ENTÃO",
  "SCELSElbl": "CASO CONTRÁRIO",
  "SCtabArithmetic": "Aritmética",
  "SCtabLogical": "Lógico",
  "SCtabMath": "Matemática",
  "SCtabString1": "String(1)",
  "SCtabString2": "String(2)",
  "SCtabConversion": "Conversão1",
  "SCtabStatistical": "Estatístico",
  "SCtabRandomNumbers": "Números Aleatórios",
  "SCtabDate1": "Data(1)",
  "SCtabDate2": "Data(2)",
  "SCtabDate3": "Data(3)",
  "SCtabDate4": "Data(4)",
  "SCttip1": "Clique no símbolo + e mova as variáveis que você deseja separar com +. Para inserir apenas +, clique duas vezes",
  "SCttip2": "Clique no símbolo - e mova as variáveis que você deseja separar com -. Para inserir apenas -, clique duas vezes",
  "SCttip3": "Clique no símbolo * e mova as variáveis que você deseja separar com *. Para inserir apenas *, clique duas vezes",
  "SCttip4": "Clique no símbolo / e mova as variáveis que você deseja separar com /. Para inserir apenas /, clique duas vezes",
  "SCttip5": "Clique em ^ e mova variáveis para exponenciar, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl6": "sqrt",
  "SCttip6": "Clique em SQRT e mova variáveis para calcular uma raiz quadrada, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl7": "log",
  "SCttip7": "Clique em LOG e mova variáveis para calcular um logaritmo natural, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl8": "log10",
  "SCttip8": "Clique em LOG10 e mova variáveis para calcular um logaritmo na base 10, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl9": "log2",
  "SCttip9": "Clique em LOG2 e mova variáveis para calcular um logaritmo na base 2, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl10": "mod",
  "SCttip10": "Clique em MOD e mova variáveis para dividir e calcular o resto, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl11": "abs",
  "SCttip11": "Clique em abs e mova variáveis para calcular um valor absoluto, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl12": "exp",
  "SCttip12": "Clique em exp e mova as variáveis para calcular um exponencial, para inserir código genérico clique duas vezes",
  "SCbtnlbl13": "",
  "SCttip13": "Clique para inserir o símbolo >",
  "SCbtnlbl14": "",
  "SCttip14": "Clique para inserir o símbolo <",
  "SCbtnlbl15": "",
  "SCttip15": "Clique para inserir o símbolo >=",
  "SCbtnlbl16": "",
  "SCttip16": "Clique para inserir o símbolo <=",
  "SCbtnlbl17": "",
  "SCttip17": "Clique para inserir o símbolo == (teste de igualdade)",
  "SCbtnlbl18": "",
  "SCttip18": "Clique para inserir o símbolo != (diferente)",
  "SCbtnlbl19": "",
  "SCttip19": "Clique para inserir o símbolo | (ou lógico)",
  "SCbtnlbl20": "",
  "SCttip20": "Clique para inserir o símbolo & (e lógico)",
  "SCbtnlbl21": "%/%",
  "SCttip21": "Clique para inserir o símbolo de divisão inteira (%/%)",
  "SCbtnlbl22": "isTRUE",
  "SCttip22": "Clique em isTRUE para selecionar e mover a variável para verificar valores TRUE. Retorna TRUE/FALSE, para inserir código genérico clique duas vezes",
  "SCbtnlbl23": "is.na",
  "SCttip23": "Clique em is.na para selecionar e mover a variável para verificar valores NA. Retorna TRUE/FALSE, para inserir código genérico clique duas vezes",
  "SCbtnlbl24": "%in%",
  "SCttip24": "Clique em %in% para inseri-lo. %in% é usado para verificar se uma variável contém valores, por exemplo, var1 %in% c(1,2)",
  "SCbtnlbl25": "round",
  "SCttip25": "Clique em round e mova as variáveis para arredondar, para inserir código genérico clique duas vezes",
  "SCbtnlbl26": "ceiling",
  "SCttip26": "Clique em ceiling e mova as variáveis para calcular o teto, para inserir código genérico clique duas vezes",
  "SCbtnlbl27": "floor",
  "SCttip27": "Clique em floor e mova as variáveis para calcular o piso, para inserir código genérico clique duas vezes",
  "SCbtnlbl28": "signif",
  "SCttip28": "Clique em signif e mova as variáveis para arredondar para um número especificado de dígitos significativos, para inserir código genérico clique duas vezes",
  "SCbtnlbl29": "gamma",
  "SCttip29": "Clique em gamma e mova as variáveis para calcular uma função gamma, para inserir código genérico clique duas vezes",
  "SCbtnlbl30": "lgamma",
  "SCttip30": "Clique em lgamma e mova as variáveis para calcular uma função lgamma, para inserir código genérico clique duas vezes",
  "SCbtnlbl31": "beta",
  "SCttip31": "Clique em beta e mova as variáveis para calcular uma função beta, para inserir código genérico clique duas vezes",
  "SCbtnlbl32": "lbeta",
  "SCttip32": "Clique em lbeta e mova as variáveis para calcular uma função lbeta, para inserir código genérico clique duas vezes",
  "SCbtnlbl33": "factorial",
  "SCttip33": "Clique em factorial e mova as variáveis para calcular fatoriais, para inserir código genérico clique duas vezes",
  "SCbtnlbl34": "pigamma",
  "SCttip34": "Clique em pigamma e mova as variáveis para calcular uma função pigamma, para inserir código genérico clique duas vezes",
  "SCbtnlbl35": "toupper",
  "SCttip35": "Clique em toupper e mova as variáveis para converter para maiúsculas, para inserir código genérico clique duas vezes",
  "SCbtnlbl36": "tolower",
  "SCttip36": "Clique em tolower e mova as variáveis para converter para minúsculas, para inserir código genérico clique duas vezes",
  "SCbtnlbl37": "Pad",
  "SCttip37": "Clique em Pad e mova as variáveis para Pad com um caractere, para inserir código genérico clique duas vezes",
  "SCbtnlbl38": "Trim",
  "SCttip38": "Clique em Trim e mova as variáveis para remover espaços em branco da esquerda, direita ou de ambas as extremidades, para inserir código genérico clique duas vezes",
  "SCbtnlbl39": "Length",
  "SCttip39": "Clique em Length e mova as variáveis para retornar o número de caracteres na string, para inserir código genérico clique duas vezes",
  "SCbtnlbl40": "Count(matches)",
  "SCttip40": "Clique em Count(matches) e mova as variáveis para contar as correspondências de um padrão/sub-string, para inserir código genérico clique duas vezes",
  "SCbtnlbl41": "Extract Substring",
  "SCttip41": "Clique em Extract Substring e mova as variáveis para extrair uma sub-string (substitua a posição inicial e final por inteiros), para inserir código genérico clique duas vezes",
  "SCbtnlbl42": "Concatenate",
  "SCttip42": "Clique em Concatenate e mova as variáveis para concatenar com um separador opcional, para inserir código genérico clique duas vezes",
  "SCbtnlbl43": "Replace Pattern",
  "SCttip43": "Clique em Replace Pattern e mova as variáveis para substituir um padrão, para inserir código genérico clique duas vezes",
  "SCbtnlbl44": "Replace Pattern(ALL)",
  "SCttip44": "Clique em Replace Pattern(ALL) e mova as variáveis para substituir todos os padrões, para inserir código genérico clique duas vezes",
  "SCbtnlbl45": "Extract a Number",
  "SCttip45": "Clique em Extract a Number e mova as variáveis para extrair um número de, para inserir código genérico clique duas vezes",
  "SCbtnlbl46": "ToNumeric",
  "SCttip46": "Clique em ToNumeric e mova as variáveis para converter para numérico, para inserir código genérico clique duas vezes",
  "SCbtnlbl47": "ToCharacter",
  "SCttip47": "Clique em ToCharacter e mova as variáveis para converter para um caractere, para inserir código genérico clique duas vezes",
  "SCbtnlbl48": "ToFactor",
  "SCttip48": "Clique em ToFactor e mova as variáveis para converter para um fator, para inserir código genérico clique duas vezes",
  "SCbtnlbl49": "ToOrdered",
  "SCttip49": "Clique em ToOrdered e mova as variáveis para converter para um fator ordenado, para inserir código genérico clique duas vezes",
  "SCbtnlbl50": "ToLogical",
  "SCttip50": "Clique em ToLogical e mova as variáveis para converter para um lógico, para inserir código genérico clique duas vezes",
  "SCbtnlbl51": "MAX",
  "SCttip51": "Clique em MAX e mova as variáveis para calcular o valor máximo, para inserir código genérico clique duas vezes",
  "SCbtnlbl52": "MIN",
  "SCttip52": "Clique em MIN e mova as variáveis para calcular o valor mínimo, para inserir código genérico clique duas vezes",
  "SCbtnlbl53": "MEAN",
  "SCttip53": "Clique em MEAN e mova as variáveis para calcular o valor médio, para inserir código genérico clique duas vezes",
  "SCbtnlbl54": "MEDIAN",
  "SCttip54": "Clique em MEDIAN e mova as variáveis para calcular o valor mediano, para inserir código genérico clique duas vezes",
  "SCbtnlbl55": "SD",
  "SCttip55": "Clique em SD e mova as variáveis para calcular o desvio padrão, para inserir código genérico clique duas vezes",
  "SCbtnlbl56": "SUM",
  "SCttip56": "Clique em SUM e mova as variáveis para calcular a soma, para inserir código genérico clique duas vezes",
  "SCbtnlbl57": "VARIANCE",
  "SCttip57": "Clique em VARIANCE e mova as variáveis para calcular a variância, para inserir código genérico clique duas vezes",
  "SCbtnlbl58": "runif",
  "SCttip58": "Clique duas vezes em RUNIF e números aleatórios serão gerados a partir de uma distribuição uniforme com mínimo e máximo",
  "SCbtnlbl59": "sample",
  "SCttip59": "Clique em SAMPLE e mova as variáveis para gerar amostras aleatórias com/sans reposição, para inserir código genérico clique duas vezes",
  "SCbtnlbl60": "rnorm",
  "SCttip60": "Clique duas vezes em rnorm para gerar variáveis a partir de uma distribuição normal com uma média e desvio padrão especificados",
  "SCbtnlbl61": "Day of Week",
  "SCttip61": "Clique em Day of Week e mova uma variável de data da qual você deseja extrair o dia da semana (segunda-feira..) para inserir código genérico clique duas vezes",
  "SCbtnlbl62": "Dia do Mês",
  "SCttip62": "Clique em Dia do Mês e mova uma variável de data da qual você deseja extrair o dia do mês (1-31) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl63": "Dia do Ano",
  "SCttip63": "Clique em Dia do Ano e mova uma variável de data da qual você deseja extrair o dia do ano (001-366) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl64": "Semana do Ano",
  "SCttip64": "Clique em Semana do Ano e mova uma variável de data da qual você deseja extrair a semana do ano (00-53) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl65": "Mês",
  "SCttip65": "Clique em Mês e mova uma variável de data da qual você deseja extrair o Mês (Janeiro..) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl66": "Mês(decimal)",
  "SCttip66": "Clique em Mês(decimal) e mova uma variável de data da qual você deseja extrair o Mês (01-12) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl67": "Trimestres",
  "SCttip67": "Clique em Trimestres e mova uma variável de data da qual você deseja extrair os Trimestres (Q1, Q2..) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl68": "Ano(XXXX)",
  "SCttip68": "Clique em Ano(XXXX) e mova uma variável de data da qual você deseja extrair o Ano (1980) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl69": "Ano(XX)",
  "SCttip69": "Clique em Ano(XX) e mova uma variável de data da qual você deseja extrair o Ano (80) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl70": "Hora(00-12)",
  "SCttip70": "Clique em Hora(00-12) e mova uma variável de data da qual você deseja extrair a Hora (00) para inserir o código genérico, clique duas vezes",
  "SCbtnlbl71": "Hora(00-23)",
  "SCttip71": "Clique em Hora(00-23) e mova uma variável de data da qual você deseja extrair a Hora, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl72": "Minutos",
  "SCttip72": "Clique em Minutos e mova uma variável de data da qual você deseja extrair os minutos, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl73": "Segundos",
  "SCttip73": "Clique em Segundos e mova uma variável de data da qual você deseja extrair os segundos, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl74": "Data de String",
  "SCttip74": "Clique em Data de String e mova uma variável de string que você deseja converter em data, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl75": "Diferença de Data",
  "SCttip75": "Clique em Diferença de Data e mova uma variável de data da qual você deseja subtrair de outra variável de data, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl76": "Numérico para data",
  "SCttip76": "Clique em Numérico para data e mova uma variável numérica que você deseja converter em data, para inserir o código genérico, clique duas vezes",
  "SCbtnlbl77": "String para data",
  "SCttip77": "Clique em String para data e mova uma variável de string que você deseja converter em data, para inserir o código genérico, clique duas vezes",
  "jsoncomment003": "=======Medidas Rep CTRL abaixo desta linha=======",
  "RMstr0": "Clique para Exibir/Ocultar Configuração para fator e medida dentro do sujeito",
  "RMstr0a": "Nota",
  "RMstr1": "1. O aplicativo precisa reformular os dados ao executar uma ANOVA de medidas repetidas em um conjunto de dados amplo",
  "RMstr2": "2. Suportamos múltiplas medidas repetidas para uma única variável, por exemplo, Glicose no Sangue medida no pré-teste, pós-teste e em uma visita de acompanhamento",
  "RMstr3": "3. Para o aplicativo reformular os dados, você precisa especificar um nome de fator repetido, por exemplo, Glicose no Sangue e o número de níveis. Criaremos uma variável de fator, por exemplo, chamada Glicose no Sangue com níveis criados a partir dos nomes das variáveis contendo as medidas repetidas, por exemplo, os níveis do fator serão pré-teste, pós-teste e acompanhamento",
  "RMstr4": "4. Você precisa especificar um nome de medida, por exemplo, Valor. Criaremos uma variável, por exemplo, Valor com todos os valores de Glicose no Sangue correspondentes ao pré-teste, pós-teste e acompanhamento para cada sujeito.",
  "RMstr5": "5. Suportamos uma única variável de fator entre sujeitos e dentro do sujeito.",
  "RMstr6": "6. Versões futuras suportarão múltiplas medidas, bem como múltiplas variáveis de fator entre sujeitos e dentro do sujeito.",
  "RMlbl1": "Nome do Fator Dentro do Sujeito",
  "RMlbl2": "Número de níveis",
  "RMaddbtn": "Adicionar",
  "RMlbl3": "Nova variável de fator dentro do sujeito",
  "RMdelbtn": "Excluir",
  "RMlbl4": "Nome da Medida",
  "RMlbl5": "Nova variável de medida",
  "RMdefinebtn": "Definir",
  "RMmsgboxTitle1": "Níveis incorretos para fator",
  "RMmsgboxMsg1": "Você deve especificar um nome de fator com mais de um nível.",
  "RMmsgboxTitle2": "Mais de 1 fator dentro do sujeito especificado",
  "RMmsgboxMsg2": "Atualmente, suportamos um único fator dentro do sujeito. Suportaremos múltiplas variáveis de fator dentro do sujeito em uma próxima versão.",
  "RMmsgboxTitle3": "Mais de 1 medida especificada",
  "RMmsgboxMsg3": "Atualmente, suportamos uma única medida. Suportaremos múltiplas medidas em uma próxima versão.",
  "RMmsgboxTitle4": "Variável de medida não especificada",
  "RMmsgboxMsg4": "O nome da variável de medida não está especificado. Você precisa especificar um nome de medida e clicar em adicionar.",
  "RMmsgboxTitle5": "Variável de fator dentro do sujeito não especificada",
  "RMmsgboxMsg5": "Você precisa clicar no botão Definir após inserir um nome de variável de fator repetido e um nome de medida.",
  "jsoncomment004": "=======Selecione o Conjunto de Dados abaixo desta linha=======",
  "SelDSsrclbl1": "Variáveis do ",
  "SelDSsrclbl2": "ativo (esquerda) ",
  "SelDSsrclbl3": "selecionado (direita)",
  "SelDSsrclbl4": " conjunto de dados",
  "SelDSsrclbl5": "Selecione um conjunto de dados para juntar ",
  "SelDSsrclbl6": " com",
  "jsoncomment005": "=======mesclar abaixo desta linha=======",
  "MJlbl1": "Selecione uma variável do conjunto de dados ativo e uma variável no conjunto de dados selecionado e clique em Adicionar",
  "MJbtn1": "Adicionar",
  "MJbtn2": "Excluir",
  "jsoncomment006": "=======opções abaixo desta linha=======",
  "OptVarDefaultLbl": "Opções",
  "jsoncomment007": "=======Escolha arquivo/pasta abaixo desta linha=======",
  "fileOpenLbl": "Escolher",
  "fileSaveLbl": "Especifique ou selecione um",
  "jsoncomment008": "=======controle de envoltório abaixo desta linha=======",
  "wrapCtrllabel1": "Exibir contagens no conjunto de dados agregado",
  "wrapCtrllabel2": "Opcionalmente, insira nomes para contagens e variáveis agregadas separadas por , (vírgula)",
  "colpickerttip1": "Clique para selecionar uma cor",
  "sixSigmaOvrViewLbl1": "Tutorial de Seis Sigma do Instituto Pyzdek",
  "sixSigmaOvrViewLink1": "O que é Seis Sigma e como funciona?",
  "sixSigmaOvrViewLbl2": "Pacote R (QCC) - tutorial de gráficos de controle de qualidade",
  "sixSigmaOvrViewLink2": "Tutorial de gráficos de controle de qualidade em R",
  "sixSigmaOvrViewLbl3": "Tutorial adicional de Seis Sigma encontrado na internet (baseado no Pacote R SixSigma)",
  "sixSigmaOvrViewLink3": "Parte-1",
  "sixSigmaOvrViewLink4": "Parte-2",
  "sixSigmaOvrViewLink5": "Parte-3",
  "sixSigmaOvrViewLink6": "Parte-4",
  "sixSigmaOvrViewLink7": "Parte-5",
  "OKBtnTxt": "Ok",
  "CancelBtnTxt": "Cancelar",
  "FBRulVoiMsg": "O controle com o rótulo: Construtor de Fórmulas precisa ser preenchido para prosseguir",
  "SCruleVoilationMsgTitle1": "Violação da regra de entrada",
  "SCruleVoilationMsgTitle2": "Violação da regra de entrada condicional",
  "SCruleVoilationMsg1": "Uma condição if dentro do controle com o rótulo",
  "SCruleVoilationMsg2": "Uma condição then dentro do controle com o rótulo",
  "SCruleVoilationMsg3": "Uma condição else dentro do controle com o rótulo",
  "SCruleVoilationMsg4": "Entrada condicional com o rótulo",
  "dstVarRuleViolationMsgTitle": "Violação da regra da lista de variáveis de destino",
  "dstVarRuleViolationMsg1": "Uma lista de variáveis de destino com o rótulo",
  "dstVarRuleViolationMsg2": " precisa ser preenchido para prosseguir",
  "dstVarRuleViolationMsg3": " precisa conter",
  "dstVarRuleViolationMsg4": " variáveis",
  "advTxtBxRulViolationMSgTitle1": "Alerta de Sobrescrita",
  "advTxtBxRulViolationMSgTitle2": "Violação da regra do campo de entrada",
  "advTxtBxRulViolationMSg1": "O valor especificado no campo com rótulo",
  "advTxtBxRulViolationMSg2": "sobrescreverá a variável existente",
  "advTxtBxRulViolationMSg3": "O valor especificado no campo com rótulo",
  "advTxtBxRulViolationMSg4": "sobrescreverá o conjunto de dados",
  "advTxtBxRulViolationMSg5": "Campo com rótulo",
  "advTxtBxRulViolationMSg6": "precisa ser preenchido para prosseguir",
  "advTxtBxRulViolationMSg7": "precisa ser preenchido com um valor numérico para prosseguir",
  "advTxtBxRulViolationMSg8": "precisa ser preenchido com um valor de caractere para prosseguir",
  "advTxtBxRulViolationMSg9": "O campo de entrada com rótulo",
  "advTxtBxRulViolationMSg10": "não pode começar com um número. Você não pode criar nomes de variáveis, conjuntos de dados ou modelos que comecem com um número.",
  "advTxtBxRulViolationMSg11": "não pode conter espaços. Você não pode criar nomes de variáveis, conjuntos de dados ou modelos que contenham espaços.",
  "advTxtBxRulViolationMSg12": "deve conter apenas letras, números e os caracteres ponto ou sublinhado. Deve começar com uma letra ou o ponto não seguido por um número.",
  "chkboxRulVoiMsgTitle": "Violação da regra da caixa de seleção",
  "chkboxRulVoiMsg1": "Caixa de seleção com rótulo",
  "chkboxRulVoiMsg2": "exige que outro controle seja preenchido para prosseguir",
  "comboboxRulVoiTitle": "Violação da regra do controle Combobox",
  "comboboxRulVoiMsg1": "Você precisa fazer uma seleção no Combobox com rótulo",
  "comboboxWchildRulVoiTitle": "Violação da regra do Combobox",
  "comboboxWchildRulVoiMsg1": "Uma seleção precisa ser feita no Combobox com rótulo",
  "CBuilderRulVoiTitle": "Violação da regra de entrada",
  "CBuilderRulVoiMsg1": "O controle com rótulo",
  "CBuilderRulVoiMsg2": "precisa ser preenchido para prosseguir",
  "fileOpnRulVoiTitle": "Violação da regra do campo de entrada de arquivo",
  "fileOpnRulVoiMsg1": "Por favor, selecione um arquivo no botão de navegação com rótulo",
  "fileOpnRulVoiMsg2": "e re-execute",
  "fileOpnRulVoiMsg3": "Por favor, selecione uma pasta no botão de navegação com rótulo",
  "fileOpnRulVoiMsg4": "O botão de navegação com rótulo",
  "fileOpnRulVoiMsg5": "contém um caminho que não existe",
  "fileSavRulVoiMsg1": "Você precisa selecionar um arquivo usando o botão com rótulo",
  "fileSavRulVoiMsg2": " para prosseguir",
  "handlerRulVoiTitle1": "Tipos incompatíveis",
  "handlerRulVoiTitle2": "Não suportado",
  "handlerRulVoiTitle3": "Erro",
  "handlerRulVoiTitle4": "Variáveis de junção especificadas incorretamente",
  "handlerRulVoiMsg1": "Um conjunto de restrições de igualdade deve conter todas as cargas fatoriais, relações de covariância ou relações estruturais. Os elementos que você está movendo têm tipos diferentes.",
  "handlerRulVoiMsg2": "Um conjunto de restrições de igualdade deve conter todas as cargas fatoriais, relações de covariância ou relações estruturais. Você não pode combinar tipos em um único conjunto.",
  "handlerRulVoiMsg3": "Não suportamos mais de 2 variáveis em um conjunto de mediação. Entre em contato com o suporte se precisar dessa capacidade.",
  "handlerRulVoiMsg4": "As variáveis de relação de mediação devem estar na forma A->B e B->C",
  "handlerRulVoiMsg5": "As variáveis de relação de mediação devem estar na forma A->B e B->C ou B->C e A->B",
  "handlerRulVoiMsg6": "O controle de destino não permite que variáveis sejam descartadas do controle de origem com rótulo",
  "handlerRulVoiMsg7": "Você precisa selecionar uma única variável tanto do conjunto de dados ativo quanto do conjunto de dados de destino para juntar",
  "inSpinerRulVoiMsg1": "está fora dos limites",
  "inSpinerRulVoiMsg2": "exige que um valor seja inserido",
  "inSpinerRulVoiMsg3": "exige que um valor numérico seja inserido",
  "inSpinerRulVoiMsg4": "exige que um valor de caractere seja inserido",
  "mergejoinRulVoiTitle1": "Selecione a violação da regra de controle",
  "mergejoinRulVoiMsg1": "Você precisa fazer uma seleção no mapeamento de junção com o rótulo",
  "radioRulVoiTitle1": "Violação da regra do botão de rádio",
  "radioRulVoiMsg1": "Botão de rádio com o rótulo",
  "radioRulVoiMsg2": "exige que outro controle seja preenchido para prosseguir",
  "selectRulVoiMsg1": "Você precisa fazer uma seleção no controle de seleção com o rótulo",
  "semCtrlRulVoiMsg1": "Você precisa ter 2 relacionamentos de mediação especificados no controle com o rótulo",
  "semCtrlRulVoiMsg2": "Uma restrição de igualdade definida no controle com o rótulo",
  "semCtrlRulVoiMsg3": "tem menos de 2 variáveis.",
  "semCtrlRulVoiMsg4": "Um dos nomes dos traços latentes no",
  "semCtrlRulVoiMsg5": "controle não está preenchido.",
  "semCtrlRulVoiMsg6": "Um dos nomes dos fatores de ordem superior no",
  "semCtrlRulVoiMsg7": "controle não está preenchido.",
  "semCtrlRulVoiMsg8": "Você inseriu um número em um dos nomes dos traços latentes no",
  "semCtrlRulVoiMsg9": "controle. Por favor, insira um nome válido.",
  "semCtrlRulVoiMsg10": "As variáveis que compõem o traço latente não foram especificadas no",
  "semCtrlRulVoiMsg11": "controle. Por favor, adicione variáveis ou exclua o controle.",
  "semCtrlRulVoiMsg12": "Nenhum traço latente foi especificado no",
  "semCtrlRulVoiMsg13": "controle. Por favor, adicione traços latentes ou exclua o controle.",
  "semCtrlAddBtn": "Adicionar",
  "semModTermRulVoiTitle": "Erro de relacionamento",
  "semModTermRulVoiMsg1": "Você definiu um relacionamento entre variáveis",
  "semModTermRulVoiMsg2": "nos parâmetros estruturais e as covariâncias. Você precisa definir o relacionamento uma vez",
  "wrapCtrlRulVoiTitle": "Violação da regra de controle de envoltório",
  "wrapCtrlRulVoiMsg1": "Controle de envoltório com o rótulo",
  "wrapCtrlRulVoiMsg2": "recebeu um número inesperado de variáveis (esperado",
  "wrapCtrlRulVoiMsg3": "Precisa ser preenchido para prosseguir",
  "utilityRulVoiTitle1": "Variável de medida não especificada",
  "utilityRulVoiTitle2": "Nome duplicado inserido",
  "utilityRulVoiTitle3": "Nome incorreto especificado",
  "utilityRulVoiMsg1": "O nome da variável de medida não está especificado. Você precisa especificar um nome de medida e clicar em adicionar.",
  "utilityRulVoiMsg2": "Não suportamos mais de 1 conjunto de mediação. Entre em contato com o suporte se precisar dessa capacidade.",
  "utilityRulVoiMsg3": "Você inseriu um nome de variável latente ou nome de fator de ordem superior que já foi inserido. Todos os nomes de variáveis latentes e nomes de fatores de ordem superior devem ser únicos",
  "utilityRulVoiMsg4": "Um nome de variável latente ou nome de fator de ordem superior não pode coincidir com o nome de uma variável de conjunto de dados.",
  "utilityRulVoiMsg5": "Você deve fazer uma seleção no controle com rótulos",
  "utilityRulVoiMsg6": "e",
  "utilityRulVoiMsg7": "antes de clicar no botão mover.",
  "utilityRulVoiMsg8": "Você não pode selecionar a mesma variável no controle com o rótulo",
  "utilityRulVoiMsg9": "Por favor, faça seleções diferentes.",
  "utilityRulVoiMsg10": "antes de clicar no botão mover.",
  "utilityRulVoiMsg11": "Você já tem um relacionamento entre",
  "utilityRulVoiMsg12": "Você não pode ter 2 relacionamentos entre as mesmas variáveis.",
  "errormessageIPCmsg1": "Você deve especificar uma string não vazia para usar como nome de fator",
  "errormessageIPCmsg2": "Você deve selecionar uma entrada para excluir antes de clicar no botão excluir",
  "errormessageIPCmsg3": "Você deve especificar uma string não vazia para usar como nome de medida",
  "errormessageIPCmsg4": "Você deve especificar um nome de fator com mais de um nível.",
  "errormessageIPCmsg5": "Atualmente, suportamos um único fator dentro do sujeito. Suportaremos múltiplas variáveis de fator dentro do sujeito em uma próxima versão.",
  "errormessageIPCmsg6": "Atualmente, suportamos uma única medida. Suportaremos múltiplas medidas em uma próxima versão.",
  "errormessageIPCmsg7": "Já existe uma variável de destino para capturar as medidas do fator dentro do sujeito",
  "errormessageIPCmsg8": "Este campo espera numérico, não uma string",
  "errormessageIPCmsg9": "Este campo espera uma string, não um numérico",
  "errormessageIPCmsg10": "A variável ",
  "errormessageIPCmsg11": "não pode ser movida, o destino não permite variáveis desse tipo",
  "errormessageIPCmsg12": "Você deve selecionar uma entrada para excluir antes de clicar no botão de excluir",
  "errormessageIPCTitle1": "Tipo não esperado",
  "projLaunchLoadMsg1": "Você deseja carregar seu projeto anterior ",
  "projLaunchLoadMsg2": "Isso pode levar um pouco de tempo.",
  "projSwitchMsg1": "Se você mudar para o mesmo projeto em que está trabalhando atualmente, suas alterações não salvas serão perdidas e o último projeto salvo será carregado.",
  "projSwitchMsg2": "Você deseja continuar?",
  "projSwitchMsg3": "Aviso: Recarregando o mesmo projeto para a última versão salva. Alterações não salvas serão perdidas.\n",
  "projSwitchMsg4": "Isso pode levar um pouco de tempo.",
  "projValidMsg1": "Aviso: Carregando projeto inválido ou corrompido",
  "projValidMsg2": "O projeto ",
  "projValidMsg3": " é um projeto inválido ou corrompido e será removido da lista",
  "projSwitchSaveCurrnentMsg1": "Mudar para um projeto diferente pode levar um tempo. Temporariamente você pode ver uma tela em branco.",
  "projSwitchSaveCurrnentMsg2": "Você deseja salvar as alterações, se houver, no projeto atual '",
  "projSwitchSaveCurrnentMsg3": " antes",
  "projSwitchSaveCurrnentMsg4": " de mudar para um projeto diferente ",
  "projSwitchSaveCurrnentMsg5": " mudando para um projeto 'NOVO'?",
  "projSwitchSaveCurrnentMsg6": " saindo do aplicativo?",
  "projSwitchSaveCurrnentMsg7": " abrindo outro projeto?",
  "projSaveRSpcTitle": "O arquivo está atualmente em uso por outro aplicativo",
  "projSaveRSpcMsg1": "Parece que o ",
  "projSaveRSpcMsg2": " arquivo está atualmente em uso por outro aplicativo.",
  "projSaveRSpcMsg3": "Por favor, feche o ",
  "projSaveRSpcMsg4": " arquivo em outro aplicativo e tente novamente",
  "projAsknameTitle": "Projeto com o mesmo nome já existe no dropdown de projetos",
  "projAsknameTitle2": "Aviso: Abrindo projeto inválido ou corrompido",
  "projAsknameMsg1": "O projeto ",
  "projAsknameMsg2": "localizado em",
  "projAsknameMsg3": "já existe.",
  "projAsknameMsg4": "você está salvando será salvo em",
  "projAsknameMsg5": "Você deseja substituir o projeto existente pelo novo?",
  "projAsknameMsg6": "é um projeto inválido ou corrompido.",
  "jsoncomment0010": "=======Menus de nível superior e submenus dropdown abaixo desta linha=======",
  
  "agreement_top_level_title": "Acordo",
  "professional_Agreement_Menu": "Acordo",
  
  "agreement_Method": "Método",
  "professional_Method": "Método",

  "agreement_Scale": "Escala",

  "analysis_top_level_title": "Análise",
  "contribution_Analysis_Menu": "Análise",
  "professional_Analysis_Menu": "Análise",
  "sixsigmapro_Analysis_Menu": "Análise",

  "analysis_Association_Rules": "Regras de Associação",
  "analysis_Cluster": "Agrupamento",
  "analysis_Correlations": "Correlações",

  "analysis_Crosstab": "Tabela Cruzada",
  "professional_Crosstab": "Tabela Cruzada",

  "analysis_Distribution_Analysis": "Análise de Distribuição",
  "sixsigmapro_Distribution_Analysis": "Análise de Distribuição",

  "analysis_Factor_Analysis": "Análise Fatorial",

  "analysis_Means": "Médias",
  "sixsigmapro_Means": "Médias",

  "analysis_Moments": "Momentos",
  "analysis_Non_Parametric": "Não Paramétrico",
  "analysis_Proportions": "Proporções",

  "analysis_Summary": "Resumo",
  "professional_Summary": "Resumo",
  "sixsigmapro_Summary": "Resumo",

  "analysis_Survival": "Sobrevivência",
  "contribution_Survival": "Sobrevivência",
  "professional_Survival": "Sobrevivência",

  "analysis_Tables": "Tabelas",
  "contribution_Tables": "Tabelas",

  "analysis_Variance": "Variância",
  "contribution_Sample_Size_Menu": "Tamanho da Amostra",
  "contribution_Precision": "Precisão",
  "contribution_Tests": "Testes",

  "contribution_Datasets_Menu": "Conjuntos de Dados",
  "datasets_top_level_title": "Conjuntos de Dados",
  "datasetspro_Datasets_Menu": "Conjuntos de Dados",
  "professional_Datasets_Menu": "Conjuntos de Dados",

  "contribution_Subset": "Subconjunto",
  "datasets_Subset": "Subconjunto",
  "professional_Subset": "Subconjunto",

  "datasets_group_by": "Agrupar Por",

  "datasets_Matching": "Correspondência",
  "professional_Matching": "Correspondência",

  "datasets_Merge": "Mesclar",
  "professional_Merge": "Mesclar",

  "datasets_ReShape": "Reconfigurar",
  "datasets_Sampling": "Amostragem",

  "datasets_Sort": "Ordenar",
  "professional_Sort": "Ordenar",

  "datasets_Transpose": "Transpor",

  "distribution_top_level_title": "Distribuição",
  "sixsigmapro_Distribution_Menu": "Distribuição",

  "distribution_Beta": "Beta",
  "distribution_Binomial": "Binomial",
  "distribution_Cauchy": "Cauchy",
  "distribution_Chi_squared": "Qui-quadrado",
  "distribution_Exponential": "Exponencial",
  "distribution_F": "F",
  "distribution_Gamma": "Gama",
  "distribution_Geometric": "Geométrico",
  "distribution_Gumbel": "Gumbel",
  "distribution_Hypergeometric": "Hipergeométrico",
  "distribution_Logistic": "Logístico",
  "distribution_Lognormal": "Lognormal",
  "distribution_Negative_Binomial": "Binomial Negativa",

  "distribution_Normal": "Normal",
  "sixsigmapro_Normal": "Normal",

  "distribution_Poisson": "Poisson",
  "distribution_t": "t",
  "distribution_Uniform": "Uniforme",
  "distribution_Weibull": "Weibull",
  "doe_top_level_title": "DoE",
  "doe_Create_DoE_Factor_Table": "Criar Tabela de Fatores DoE",
  "doe_Create_Design": "Criar Projeto",
  "doe_Inspect_Design": "Inspecionar Projeto",
  "doe_Modify_Design": "Modificar Projeto",
  "doe_Analyze_Design": "Analisar Projeto",

  "file_top_level_title": "Arquivo",
  "modelfitting_File": "Arquivo",
  "outputpro_File_Menu": "Arquivo",
  "projectspace_File_Menu": "Arquivo",
  "utility_File_Menu": "Arquivo",
  "utilitypro_File_Menu": "Arquivo",

  "forecasting_top_level_title": "Previsão",

  "graphics_top_level_title": "Gráficos",
  "graphicspro_Graphics_Menu": "Gráficos",

  "graphics_Distribution": "Distribuição",
  "graphicspro_Distribution": "Distribuição",

  "graphics_Line_Charts": "Gráficos de Linhas",
  "graphics_Maps": "Mapas",
  "graphics_Pie_Charts": "Gráficos de Pizza",

  "graphics_Scatter_Plot": "Gráfico de Dispersão",
  "graphicspro_Scatter_Plot": "Gráfico de Dispersão",

  "modelevaluation_top_level_title": "Avaliação de Modelos",
  "contribution_Model_Evaluation_Menu": "Avaliação de Modelos",
  "professional_Model_Evaluation_Menu": "Avaliação de Modelos",

  "modelevaluation_Compare": "Comparar",
  "modelevaluation_Fit": "Ajustar",
  "modelevaluation_IRT": "IRT",
  "modelevaluation_Predict": "Prever",
  "modelevaluation_Summarize": "Resumir",

  "modelfitting_top_level_title": "Ajuste de Modelos",
  "contribution_Model_Fitting_Menu": "Ajuste de Modelos",
  "modelfittingpro_Model_Fitting_Menu": "Ajuste de Modelos",
  "professional_Model_Fitting_Menu": "Ajuste de Modelos",

  "modelfitting_Contrasts": "Contrastes",
  "modelfitting_IRT": "IRT",
  "modelfitting_KNN": "KNN",

  "modelfitting_Regression": "Regressão",
  "contribution_Regression": "Regressão",
  "professional_Regression": "Regressão",

  "modelfitting_Neural_Nets": "Redes Neurais",
  "modelfitting_Trees": "Árvores",
  "modelfitting_File_Model": "Modelo",
  "modelfitting_Nonlinear_Regression": "Regressão Não Linear",
  "modeltuning_top_level_title": "Ajuste de Modelos",
  "projectspace_Open_Project": "Abrir Projeto",
  "projectspace_Save_Project": "Salvar Projeto",
  "projectspace_SaveAs_Project": "Salvar Como Projeto",

  "sixsigma_top_level_title": "Seis Sigma",
  "sixsigmapro_Six_Sigma_Menu": "Seis Sigma",

  "sixsigma_Pareto_Chart": "Gráfico de Pareto",
  "sixsigmapro_Pareto_Chart": "Gráfico de Pareto",

  "sixsigma_MSA": "MSA",
  "sixsigmapro_MSA": "MSA",

  "sixsigma_Process_Capability": "Capacidade do Processo",
  "sixsigmapro_Process_Capability": "Capacidade do Processo",

  "sixsigma_Shewhart_Charts": "Gráficos de Shewhart",
  "sixsigmapro_Shewhart_Charts": "Gráficos de Shewhart",

  "variables_top_level_title": "Variáveis",
  "contribution_Variables_Menu": "Variáveis",
  "professional_Variables_Menu": "Variáveis",

  "variables_Box_Cox": "Box-Cox",

  "variables_Compute": "Calcular",
  "contribution_Compute": "Calcular",

  "variables_Convert": "Converter",

  "variables_Factor_Levels": "Níveis de Fatores",
  "contribution_Factor_Levels": "Níveis de Fatores",

  "analysis_Missing_Values": "Valores Faltantes",
  "professional_Missing_Values": "Valores Faltantes",

  "Note00": "=============O menu abaixo é diferente dos 2 acima===========",
  "variables_Missing_Values": "Valores Faltantes"
}