{
  "title": "Logit Multinomial",
  "navigation": "Logit Multinomial",
  "modelname": "Insira o nome do modelo",
  "dependent": "Variável dependente",
  "independent": "Variável(is) independente(s)",
  "generateplotchk": "Plotar resíduos vs ajustados, Q-Q normal, escala-local e resíduos vs alavancagem",
  "destination2": "Especifique uma variável com pesos",
  "help": {
    "title": "Logit Multinomial",
    "r_help": "help(multinom, package=nnet)",
    "body": "\n            <b>Descrição</b></br>\n            Ajusta modelos log-lineares multinomiais via redes neurais.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            multinom(formula, data, weights, subset, na.action,<br/>\n                     contrasts = NULL, Hess = FALSE, summ = 0, censored = FALSE,<br/>\n                     model = FALSE, ...)<br/>\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            formula: uma expressão de fórmula como para modelos de regressão, da forma resposta ~ preditores. A resposta deve ser um fator ou uma matriz com K colunas, que será interpretada como contagens para cada uma das K classes. Um modelo log-linear é ajustado, com coeficientes zero para a primeira classe. Um offset pode ser incluído: deve ser uma matriz numérica com K colunas se a resposta for uma matriz com K colunas ou um fator com K >= 2 classes, ou um vetor numérico para um fator de resposta com 2 níveis. Consulte a documentação de formula() para mais detalhes.\n            </li>\n            <li>\n            data: um data frame opcional no qual interpretar as variáveis que ocorrem na fórmula.\n            </li>\n            <li>\n            weights: pesos de caso opcionais na adequação.\n            </li>\n            <li>\n            subset: expressão dizendo qual subconjunto das linhas dos dados deve ser usado na adequação. Todas as observações são incluídas por padrão.\n            </li>\n            <li>\n            na.action: uma função para filtrar dados ausentes.\n            </li>\n            <li>\n            contrasts: uma lista de contrastes a serem usados para algumas ou todas as variáveis que aparecem na fórmula do modelo.\n            </li>\n            <li>\n            Hess: lógico para se o Hessiano (a matriz de informação observada/esperada) deve ser retornado.\n            </li>\n            <li>\n            summ: inteiro; se diferente de zero, resume excluindo linhas duplicadas e ajusta pesos. Os métodos 1 e 2 diferem em velocidade (2 usa C); o método 3 também combina linhas com o mesmo X e diferentes Y, o que altera a linha de base para a deviance.\n            </li>\n            <li>\n            censored: Se Y é uma matriz com K colunas, interprete as entradas como um para classes possíveis, zero para classes impossíveis, em vez de contagens.\n            </li>\n            <li>\n            model: lógico. Se verdadeiro, o quadro do modelo é salvo como componente do modelo do objeto retornado.\n            </li>\n            <li>\n            ... argumentos adicionais para nnet\n            </li>\n            </ul>\n            <b>Detalhes</b></br>\n            multinom chama nnet. As variáveis no lado direito da fórmula devem ser aproximadamente escaladas para [0,1] ou o ajuste será lento ou pode não convergir de forma alguma.</br>\n            <b>Valor</b><br/>\n            Um objeto nnet com componentes adicionais:<br/>\n            <li>\n            deviance: a deviance residual, comparada ao modelo saturado completo (que explica observações individuais exatamente). Além disso, menos duas vezes a log-verossimilhança.\n            </li>\n            <li>\n            edf: o número (efetivo) de graus de liberdade usados pelo modelo\n            </li>\n            <li>\n            AIC: o AIC para este ajuste.\n            </li>\n            <li>\n            Hessiano: (se Hess for verdadeiro).\n            </li>\n            <li>\n            modelo: (se o modelo for verdadeiro).\n            </li>\n            <b>Exemplos</b><br/>\n            <code> \n            options(contrasts = c(\"contr.treatment\", \"contr.poly\"))<br/>\n            library(MASS)<br/>\n            example(birthwt)<br/>\n            (bwt.mu <- multinom(low ~ ., bwt))<br/>\n            </code>\n            <b>Pacote</b></br>\n            nnet</br>\n            <b>Ajuda</b></br>\n            Para ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando help(multinom, package=nnet) criando um bloco de código R clicando + na janela de saída\n           "
  }
}