{
  "title": "Escalonamento Multidimensional",
  "navigation": "Escalonamento Multidimensional",
  "betRows": "Entre linhas",
  "betVariables": "Entre variáveis",
  "textSize": "Tamanho do texto",
  "textPos": "Posição do texto",
  "destination": "Selecionar variáveis",
  "maxDimensions": "Dimensões máximas",
  "label1": "Matriz de distância",
  "computationMethod": "Método de computação",
  "power": "Potência da distância de Minkowski",
  "dispDist": "Exibir matriz de distância",
  "saveDims": "Salvar dimensões em um novo conjunto de dados",
  "datasetName": "Opcionalmente insira um nome de conjunto de dados para salvar dimensões",
  "label2": "Opções avançadas",
  "scalingMethod": "Método de escalonamento",
  "maxIter": "Número máximo de iterações (*Não aplicável para métrica clássica)",
  "plotResults": "Plotar resultados",
  "help": {
    "title": "Escalonamento Multidimensional",
    "r_help": "ajuda(cmdscale, pacote=stats)",
    "body": "\n<b>Descrição</b></br>\nExistem diferentes tipos de algoritmos de MDS, incluindo</br>\n<b>Escalonamento multidimensional clássico</b></br>\nPreserva a métrica de distância original, entre pontos, o máximo possível. Ou seja, as distâncias ajustadas no mapa MDS e as distâncias originais estão na mesma métrica. O MDS clássico pertence à chamada categoria de escalonamento multidimensional métrico.</br>\nTambém é conhecido como análise de coordenadas principais. É adequado para dados quantitativos.</br></br>\n<b>Escalonamento multidimensional não métrico</b></br>\nTambém é conhecido como MDS ordinal. Aqui, não é a métrica de um valor de distância que é importante ou significativa, mas seu valor em relação às distâncias entre outros pares de objetos.</br>\nO MDS ordinal constrói distâncias ajustadas que estão na mesma ordem de classificação que a distância original. Por exemplo, se a distância de objetos distantes 1 e 5 classificar em quinto lugar nos dados de distância originais, então eles também devem classificar em quinto lugar na configuração do MDS.</br>\nÉ adequado para dados qualitativos.</br>\nUsamos as seguintes funções R</br>\ncmdscale() [pacote stats]: Computar escalonamento multidimensional clássico (métrico).</br>\nisoMDS() [pacote MASS]: Computar o escalonamento multidimensional não métrico de Kruskal (uma forma de MDS não métrico).</br>\nsammon() [pacote MASS]: Computar o mapeamento não linear de Sammon (uma forma de MDS não métrico).</br>\nTodas essas funções levam um objeto de distância como argumento principal e k é o número desejado de dimensões na saída escalonada. Por padrão, elas retornam soluções de duas dimensões, mas podemos mudar isso através do parâmetro k que por padrão é 2.</br>\n<br/>\nOpções para exibir a matriz de distância, salvar as dimensões em um novo conjunto de dados e plotar as dimensões podem ser selecionadas. </br>\nQuando o método de escalonamento métrico clássico é selecionado, exibimos os valores próprios, estatística de bondade de ajuste e o screeplot. Para outros métodos de escalonamento, exibimos o valor de estresse.\n<b>Ajuda</b></br>\nPara ajuda detalhada, execute os seguintes comandos ajuda(dist, pacote=\"stats\") ou ajuda(cmdscale, pacote ='stats') ou ajuda(isoMDS, pacote = \"MASS\") ou ajuda(sammon, pacote =\"MASS\") no editor R do BlueSky Statistics.           \n<br/>\n<br/>\n"
  }
}