{
  "title": "Probabilidades de Cauda Binomial Negativa",
  "navigation": "Probabilidades de Cauda Binomial Negativa",
  "varvals": "Insira o(s) valor(es) da variável separados por vírgula. Exemplo: 3, 0.5",
  "size": "Número alvo de sucessos",
  "prob": "Probabilidades de sucesso",
  "labelSig": "Nível de significância",
  "lowtail": "Cauda inferior",
  "uptail": "Cauda superior",
  "help": {
    "title": "Probabilidades de Cauda Binomial Negativa",
    "r_help": "help(pnbinom, package=stats)",
    "body": "\n\n            <b>Descrição</b>\n            <br/>\n            Densidade, função de distribuição, função quantil e geração aleatória para a distribuição binomial negativa com parâmetros tamanho e prob.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code>\n                dnbinom(x, size, prob, mu, log = FALSE)\n                <br/>\n                pnbinom(q, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qnbinom(p, size, prob, mu, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rnbinom(n, size, prob, mu)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumentos</b>\n            <br/>\n            <ul>\n                <li>x : vetor de quantis (inteiros não negativos).</li>\n                \n                \n                <li>q : vetor de quantis.</li>\n                \n                \n                <li>p : vetor de probabilidades.</li>\n                \n                \n                <li>n : número de observações. Se length(n) > 1, o comprimento é considerado como o número necessário.</li>\n                \n                \n                <li>size : alvo para o número de tentativas bem-sucedidas, ou parâmetro de dispersão (o parâmetro de forma da distribuição de mistura gamma). Deve ser estritamente positivo, não precisa ser inteiro.</li>\n                \n                \n                <li>prob : probabilidade de sucesso em cada tentativa. 0 < prob <= 1.</li>\n                \n                \n                <li>mu : parametrização alternativa via média: veja 'Detalhes'.</li>\n                \n                \n                <li>log, log.p : lógico; se TRUE, as probabilidades p são dadas como log(p).</li>\n                \n                \n                <li>lower.tail : lógico; se TRUE (padrão), as probabilidades são P[X ≤ x], caso contrário, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalhes</b>\n            <br/>\n            A distribuição binomial negativa com size = n e prob = p tem densidade\n            <br/>\n            <code>\n                Γ(x+n)/(Γ(n) x!) p^n (1-p)^x\n                para x = 0, 1, 2, …, n > 0 e 0 < p ≤ 1.\n            </code>\n            <br/>\n            Isso representa o número de falhas que ocorrem em uma sequência de tentativas de Bernoulli antes que um número alvo de sucessos seja alcançado. A média é μ = n(1-p)/p e a variância n(1-p)/p^2.\n            <br/>\n            Uma distribuição binomial negativa também pode surgir como uma mistura de distribuições de Poisson com média distribuída como uma distribuição gamma (veja pgamma) com parâmetro de escala (1 - prob)/prob e parâmetro de forma size. (Essa definição permite valores não inteiros de size.)\n            <br/>\n            Uma parametrização alternativa (frequentemente usada em ecologia) é pela média mu (veja acima), e size, o parâmetro de dispersão, onde prob = size/(size+mu). A variância é mu + mu^2/size nesta parametrização.\n            <br/>\n            Se um elemento de x não for inteiro, o resultado de dnbinom é zero, com um aviso.\n            O caso size == 0 é a distribuição concentrada em zero. Esta é a distribuição limite para size se aproximando de zero, mesmo que mu em vez de prob seja mantido constante. Note, porém, que a média da distribuição limite é 0, qualquer que seja o valor de mu.\n            <br/>\n            O quantil é definido como o menor valor x tal que F(x) ≥ p, onde F é a função de distribuição.\n            <br/>\n            <br/><b>Valor</b>\n            <br/>\n            dnbinom dá a densidade, pnbinom dá a função de distribuição, qnbinom dá a função quantil, e rnbinom gera desvios aleatórios.\n            <br/>\n            Tamanho ou prob inválidos resultarão em valor de retorno NaN, com um aviso.\n            <br/>\n            O comprimento do resultado é determinado por n para rnbinom, e é o máximo dos comprimentos dos argumentos numéricos para as outras funções.\n            <br/>\n            Os argumentos numéricos além de n são reciclados para o comprimento do resultado. Apenas os primeiros elementos dos argumentos lógicos são usados.            \n"
  }
}