{
  "title": "Teste de Wilcoxon, amostras pareadas",
  "navigation": "Teste de Wilcoxon, amostras pareadas",
  "tvarbox1": "Primeira Variável (um)",
  "tvarbox2": "Segunda Variável (um)",
  "label1": "Hipótese Alternativa",
  "twosided": "Diferença != mu",
  "greater": "Diferença > mu",
  "less": "Diferença < mu",
  "label2": "Método de Teste",
  "default": "Padrão",
  "exact": "Exato",
  "normal": "Aproximação Normal",
  "contingency": "Aproximação Normal (Correção de Continuidade)",
  "textbox1": "Intervalo de confiança",
  "textbox2": "Hipótese nula (mu)",
  "help": {
    "title": "Teste de Wilcoxon, amostras pareadas",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>Descrição</b></br>\nRealiza testes de Wilcoxon de uma e duas amostras em vetores de dados; o último também é conhecido como teste de ‘Mann-Whitney’.\n<br/>\n<b>Uso</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Método S3 padrão:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## Método S3 para a classe 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: vetor numérico de valores de dados. Valores não finitos (por exemplo, infinitos ou ausentes) serão omitidos.\n</li>\n<li>\ny: um vetor numérico opcional de valores de dados: assim como x, valores não finitos serão omitidos.\n</li>\n<li>\nalternative: uma string de caracteres especificando a hipótese alternativa, deve ser uma das \"two.sided\" (padrão), \"greater\" ou \"less\". Você pode especificar apenas a letra inicial.\n</li>\n<li>\nmu: um número especificando um parâmetro opcional usado para formar a hipótese nula. Veja ‘Detalhes’.\n</li>\n<li>\npaired: um lógico indicando se você deseja um teste pareado.\n</li>\n<li>\nexact: um lógico indicando se um valor-p exato deve ser computado.\n</li>\n<li>\ncorrect: um lógico indicando se deve ser aplicada a correção de continuidade na aproximação normal para o valor-p.\n</li>\n<li>\nconf.int: um lógico indicando se um intervalo de confiança deve ser computado.\n</li>\n<li>\nconf.level: nível de confiança do intervalo.\n</li>\n<li>\nformula: uma fórmula da forma lhs ~ rhs onde lhs é uma variável numérica que fornece os valores de dados e rhs um fator com dois níveis que fornece os grupos correspondentes.\n</li>\n<li>\ndata: uma matriz ou data frame opcional (ou similar: veja model.frame) contendo as variáveis na fórmula formula. Por padrão, as variáveis são retiradas do ambiente(formula).\n</li>\n<li>\nsubset: um vetor opcional especificando um subconjunto de observações a ser usado.\n</li>\n<li>\nna.action: uma função que indica o que deve acontecer quando os dados contêm NAs. O padrão é getOption(\"na.action\").\n</li>\n<li>\n...: outros argumentos a serem passados para ou de métodos.\n</li>\n</ul>\n<b>Detalhes</b></br>\nA interface de fórmula é aplicável apenas para os testes de 2 amostras.</br>\nSe apenas x for fornecido, ou se tanto x quanto y forem fornecidos e paired for TRUE, um teste de postos sinalizados de Wilcoxon da hipótese nula de que a distribuição de x (no caso de uma amostra) ou de x - y (no caso de duas amostras pareadas) é simétrica em torno de mu é realizado.</br>\nCaso contrário, se tanto x quanto y forem fornecidos e paired for FALSE, um teste de soma de postos de Wilcoxon (equivalente ao teste de Mann-Whitney: veja a Nota) é realizado. Neste caso, a hipótese nula é que as distribuições de x e y diferem por um deslocamento de localização de mu e a alternativa é que elas diferem por algum outro deslocamento de localização (e a alternativa unilateral \"greater\" é que x está deslocado para a direita de y).</br>\nPor padrão (se exact não for especificado), um valor-p exato é computado se as amostras contiverem menos de 50 valores finitos e não houver empates. Caso contrário, uma aproximação normal é usada.</br>\nOpcionalmente (se o argumento conf.int for verdadeiro), um intervalo de confiança não paramétrico e um estimador para a pseudomediana (caso de uma amostra) ou para a diferença dos parâmetros de localização x-y é computado. (A pseudomediana de uma distribuição F é a mediana da distribuição de (u+v)/2, onde u e v são independentes, cada um com distribuição F. Se F for simétrica, então a pseudomediana e a mediana coincidem. Veja Hollander & Wolfe (1973), página 34.) Note que no caso de duas amostras, o estimador para a diferença nos parâmetros de localização não estima a diferença nas medianas (uma concepção errônea comum), mas sim a mediana da diferença entre uma amostra de x e uma amostra de y.</br>\nSe valores-p exatos estiverem disponíveis, um intervalo de confiança exato é obtido pelo algoritmo descrito em Bauer (1972), e o estimador de Hodges-Lehmann é empregado. Caso contrário, o intervalo de confiança e a estimativa pontual retornados são baseados em aproximações normais. Estes são corrigidos por continuidade para o intervalo, mas não para a estimativa (já que a correção depende da alternativa).</br>\nCom amostras pequenas, pode não ser possível alcançar coberturas de intervalo de confiança muito altas. Se isso acontecer, um aviso será dado e um intervalo com cobertura menor será substituído.</br>\n<b>Valor</b><br/>\nUma lista com a classe \"htest\" contendo os seguintes componentes:\nstatistic: o valor da estatística do teste com um nome descrevendo-o.</br>\nparameter: o(s) parâmetro(s) para a distribuição exata da estatística do teste.</br>\np.value: o valor-p para o teste.</br>\nnull.value: o parâmetro de localização mu.</br>\nalternative: uma string de caracteres descrevendo a hipótese alternativa.</br>\nmethod: o tipo de teste aplicado.</br>\ndata.name: uma string de caracteres dando os nomes dos dados.</br>\nconf.int: um intervalo de confiança para o parâmetro de localização. (Presente apenas se o argumento conf.int = TRUE.)</br>\nestimate: uma estimativa do parâmetro de localização. (Presente apenas se o argumento conf.int = TRUE.)</br>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}