{
  "title": "Estimativas de Nível de Parâmetro",
  "navigation": "Estimativas de Parâmetro",
  "label1": "Modelos das seguintes classes são suportados, classes estão listadas entre parênteses abaixo",
  "label2": "Modelos lineares (lm), Modelos lineares generalizados (glm), Modelos log-lineares multinomiais (multinom), Regressão quantílica (rq), Regressão linear robusta (rlm), Objeto de curva de sobrevivência (survfit), Modelo de efeitos mistos lineares (lme), Objeto de regressão de riscos proporcionais (coxph), Modelo de regressão de sobrevivência paramétrica (survreg), Regressão logística/probit ordenada (polr), Análise fatorial (factanal), Modelos lineares generalizados regularizados Lasso e Elastic-net (glmnet)",
  "modelselector1": "Selecione um modelo",
  "help": {
    "title": "Estimativas de Nível de Parâmetro",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>Descrição</b></br>\nExibe estimativas de parâmetros do modelo selecionado\n<br/>\n<b>Uso</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: modelo ou outro objeto R a ser convertido em um data frame de uma única linha\n</li>\n</ul>\n<b>Detalhes</b></br>\nExibe estimativas de parâmetros dos seguintes modelos</br>\nModelos lineares (classe do modelo lm)</br>\nModelos lineares generalizados (classe do modelo glm)</br>\nModelos Log-Lineares Multinomiais (classe do modelo multinom)</br>\nRegressão logística ou Probit Ordenada (classe do modelo polr)</br>\nModelos Lineares Generalizados Regularizados Lasso e Elastic-Net (classe do modelo glmnet)</br>\nRegressão linear robusta (classe do modelo rlm)</br>\nRegressão Quantílica (classe do modelo rq)</br>\nmodelo de efeitos mistos lineares (lme)</br>\nObjeto de regressão de riscos proporcionais (coxph)</br>\nModelo de regressão de sobrevivência paramétrica (survreg)</br>\nAnálise fatorial (factanal)</br>\n<b>Valor</b></br>\nUm tibble::tibble() com informações sobre os componentes do modelo.</br>\ntermo: O nome do termo de regressão.</br>\nestimate: O valor estimado do termo de regressão.</br>\nstd.error: O erro padrão do termo de regressão.</br>\nstatistic: O valor de uma estatística, quase sempre uma estatística T, a ser usada em uma hipótese de que o termo de regressão é não zero.</br>\np.value: O valor p de dois lados associado à estatística observada.</br>\nconf.low: A extremidade baixa de um intervalo de confiança para o termo de regressão. Incluído apenas se conf.int = TRUE.</br>\nconf.high: A extremidade alta de um intervalo de confiança para o termo de regressão. Incluído apenas se conf.int = TRUE.</br>\nSe o modelo linear for um objeto mlm (modelo linear múltiplo), há uma coluna adicional:</br>\nresposta: A qual coluna de resposta os coeficientes correspondem (tipicamente Y1, Y2, etc)</br>\n<b>Pacote</b></br>\nbroom</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando no editor de sintaxe R help(tidy, package ='broom')\n"
  }
}