{
  "title": "Regressão de Sobrevivência Paramétrica",
  "navigation": "Regressão de Sobrevivência Paramétrica",
  "modelname": "Insira o Nome do Modelo",
  "timevar": "Tempo até o evento ou censura",
  "eventvar": "Evento (1 ou superior = evento, 0 ou inferior = censura)",
  "destvars": "Variáveis Independentes",
  "weightvar": "Pesos (opcional)",
  "rmstChk": "Calcular tempo médio de sobrevivência restrito (RMST)",
  "rmstSEChk": "Calcular erro padrão para RMST usando bootstrap (nota: isso levará um tempo)",
  "bootIter": "Iteração Bootstrap",
  "HazardRatioChk": "Calcular Razões de Risco",
  "labelSurvival": "Tipo de Gráfico de Sobrevivência",
  "survivalradioCI": "Sobrevivência com IC",
  "survivalradio": "Sobrevivência",
  "survivalradioKMCI": "Sobrevivência com sobreposição de Kaplan-Meier (não paramétrica) com IC",
  "survivalradioKM": "Sobrevivência com sobreposição de Kaplan-Meier (não paramétrica)",
  "labelFailure": "Tipo de Gráfico de Falha Cumulativa",
  "inciradioCI": "Falha Cumulativa com IC",
  "inciradio": "Falha Cumulativa",
  "inciradioKMCI": "Falha Cumulativa com sobreposição de Kaplan-Meier (não paramétrica) com IC",
  "inciradioKM": "Falha Cumulativa com sobreposição de Kaplan-Meier (não paramétrica)",
  "spectimes": "Calcular Probabilidade de Sobrevivência - especifique os tempos como time1, time2, time3, etc. ou como seq (1,5,by=1)",
  "specprobs": "Calcular Tempo de Sobrevivência até o Evento - especifique quantil (probabilidade) como 0.25, 0.50, 0.60, 0.75, etc. ou como seq (0.2,0.9,by=0.1)",
  "coVarValues": "Se deixado em branco, os valores médios das variáveis independentes (Covariáveis) serão usados. Caso contrário, especifique valores separados por vírgula a serem usados para estimar probabilidades e plotar",
  "labelDistribution": "Selecione uma função de distribuição que melhor se ajuste aos dados",
  "selectDistFuncWeibullRad": "Weibull",
  "selectDistFuncExpRad": "Exponencial",
  "selectDistFuncGammaRad": "Gamma",
  "selectDistFuncLnormalRad": "Log Normal",
  "selectDistFuncPoissonRad": "Poisson",
  "selectDistFuncNBinomRad": "Binomial Negativa",
  "selectDistFuncGeomRad": "Geométrica",
  "selectDistFuncBetaRad": "Beta",
  "selectDistFuncUnifRad": "Uniforme",
  "selectDistFuncLogisRad": "Logística",
  "selectDistFuncLogLogisRad": "Log Logística",
  "selectDistFuncCauchyRad": "Cauchy",
  "selectDistFuncNormRad": "Normal",
  "confidenceInterval": "Intervalos de confiança para estimativas de máxima verossimilhança",
  "help": {
    "title": "Regressão de Sobrevivência Paramétrica",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n\t\t\tVeja o conjunto de dados de exemplo no diretório de instalação, o local padrão é na letra da unidade:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. A variável Followup_time deve ser inserida como o tempo até o evento ou censura e a variável Event deve ser inserida como o Evento (1 = evento, 0 = censura).<br/>\n            <br/>\n            <br/>\n\t\t\tOs conjuntos de dados de exemplo são lung, manufacturing_data e bulb reliability <br/><br/>\t\t\n            <b>Estimativas de parâmetros da Regressão de Sobrevivência Paramétrica e gráficos junto com curvas de sobrevivência de Kaplan-Meier (modelo nulo/intercepto apenas) sobrepostas</b>\n            <br/>\n            <br/>\n            Estes são usados para estimar o risco cumulativo de não ter algum evento (ou, inversamente, ter algum evento) ao longo de um período de tempo após o início do acompanhamento para esse evento (ou tempo zero). Os sujeitos precisam estar em risco para o evento a partir do tempo zero.\n            <br/>\n            <br/>\n            <b>Tempo:</b> Duração do tempo até um evento, se o evento ocorreu, ou último acompanhamento para esse evento, se o evento não ocorreu, para cada sujeito\n            <br/><br/>\n            <b>Evento:</b> Indicador numérico de se o evento ocorreu ou não (1=evento, 0=censura) para cada sujeito\n            <br/><br/>\n            <b>Tipo de Gráfico:</b> Gráfico da probabilidade de não ter o evento (sobrevivência) ou ter o evento (falha)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Tabela de Estimativa para Tempos ou probabilidade Específicos:</b> Opção para incluir uma tabela que tenha as probabilidades de estimativa de sobrevivência para um conjunto de tempos selecionados pelo usuário.\n\t\t\t<br/><br/>\n\t\t\t<b>Especifique os tempos como time1, time2, time3, etc. ou como seq(1,5,by=1):</b> Estes são os tempos específicos que serão incluídos na tabela para tempos específicos. Eles podem ser especificados individualmente com vírgulas, ou como uma sequência de valores uniformemente espaçados.\n\t\t\t<br/><br/>\n            Tabelas são geradas com o tamanho da amostra, o número de sujeitos com o evento, o tempo médio de sobrevivência (se definido), o tempo médio de sobrevivência restrito e o tempo médio de acompanhamento. O tempo médio de acompanhamento é calculado usando o estimador de Kaplan-Meier reverso, que trata eventos verdadeiros como observações censuradas e observações censuradas verdadeiras como eventos. Assim, o \"evento\" neste estimador é \"acompanhar os sujeitos pelo maior tempo que o estudo poderia\".\n            <br/>\n            Uma tabela de estimativas de sobrevivência paramétrica e eventos para a distribuição escolhida é fornecida em cada tempo observado no conjunto de dados, com intervalos de confiança dados. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Opções de Estilo</b>\n            <br/>\n            <br/>\n            <b>Título do Gráfico:</b> Título do gráfico; exclua todo o texto para não ter título\n            <br/><br/>\n\t\t\t<b>Tamanho do Título do Gráfico:</b> Tamanho do título do gráfico.\n\t\t\t<br/><br/>\n            <b>Tema do Gráfico:</b> Estilo geral do gráfico\n            <br/><br/>\n            <b>Incluir Número em Risco:</b> Opcionalmente, incluir uma tabela para o número de sujeitos ainda em risco ao longo do tempo na parte inferior do gráfico.  <b>Posição da Tabela de Risco</b> especifica se você deseja que a tabela fique fora dos eixos ou dentro dos eixos.  O <b>Tamanho da Tabela de Risco</b> controla a proporção da área de plotagem que a tabela ocupará.  Esta opção é ignorada quando a posição da tabela de risco está dentro dos eixos. \n\t\t\tO <b>Tamanho do Valor da Tabela de Risco</b> controla o tamanho dos números em risco. O <b>Tamanho do Título da Tabela de Risco</b> controla o tamanho do título da tabela de número em risco.\n\t\t\tO <b>Tamanho do Rótulo do Eixo da Tabela de Risco</b> controla o tamanho dos rótulos dos eixos.\n\t\t\tO <b>Tamanho do Rótulo da Marca do Eixo da Tabela de Risco</b> controla o tamanho dos rótulos das marcas de tick para os tempos na tabela de número em risco. Se for desejado remover todos os eixos e linhas de grade \n\t\t\tda tabela de número em risco, a opção <b>Remover Eixos e Linhas de Grade da Tabela de Risco</b> pode ser marcada.  Isso incluirá apenas os números em risco na tabela.\n            <br/>\n            <br/>\n            <b>Opções de Linha:</b>\n            <b>Tamanho</b> controla a espessura e <b>Cor</b> controla a cor da linha plotada. Pode-se opcionalmente incluir um intervalo de confiança de 95% para as estimativas em um formato de <b>ribbon</b> (área sombreada) ou <b>step</b> (linha).  <b>Transparência</b> controla quão escura é a fita e é ignorada quando a opção de passo é selecionada.  <b>Tempos Censurados</b> (quando os sujeitos não estão mais em risco para o evento) podem ser indicados na linha com símbolos \"+\". O tamanho dos símbolos \"+\" pode ser ajustado.  A opção <b>Indicar Sobrevivência Mediana</b> incluirá linhas horizontais ou verticais no momento em que 50% dos sujeitos são estimados a ter tido o evento.  O tempo mediano é indefinido se a curva de sobrevivência não cruzar 50%.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Opções de Eixo</b>\n            <br/> \n            <br/> \n            A opção <b>Rótulo</b> especifica o rótulo de texto para o eixo.  Os <b>Limites do Eixo</b> especificam os valores mínimo e máximo do eixo.  A opção <b>Incrementos de Marca de Tick</b> controla o espaçamento das marcas de tick no eixo.  Os incrementos no eixo do tempo também controlam os tempos para a tabela opcional de número em risco.\n            <br/> \n            A opção <b>Escala</b> do eixo de sobrevivência especifica se você deseja que as estimativas estejam em uma escala de proporção (0-1) ou percentual (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Tamanho do Rótulo do Eixo:</b>  Isso controla o tamanho dos rótulos dos eixos de sobrevivência e tempo.\n\t\t\t<br/><br/>\n\t\t\t<b>Tamanho do Rótulo da Marca do Eixo:</b>  Isso controla o tamanho dos rótulos das marcas de tick dos eixos de sobrevivência e tempo.\n"
  }
}