{
  "title": "Estatísticas de Personfit e o Teste de Razão de Verossimilhança de Martin-Löf",
  "navigation": "Ajuste de Pessoa",
  "label1": "Selecione um modelo (modelos das classes Rm, dRm e eRm são suportados)",
  "label1b": "Se nenhum modelo estiver disponível, você precisa criar um modelo primeiro selecionando Ajuste de Modelo -> IRT -> Modelo Rasch Simples e escolher a estimativa CML",
  "modelselector1": "Selecione um modelo",
  "chkbox": "Exibir Estatísticas do Teste de Razão de Verossimilhança de Martin-Löf",
  "lbl2": "Critérios de Divisão para o Teste de Razão de Verossimilhança",
  "rd1": "mediana",
  "rd2": "média",
  "help": {
    "title": "Estatísticas de Personfit e o Teste de Razão de Verossimilhança de Martin-Löf",
    "r_help": "help(personfit, package='eRm')",
    "body": "\n                <b>Descrição: estatísticas de personfit</b></br>\n                Para modelos da classe Rm, eRm ou dRm (Criados usando IRT -> Modelo Rasch Simples com estimativa CML) usa a função personfit para exibir estatísticas de personfit.\n\n                <br/><br/>\n                <b>Uso</b>\n                <br/>\n                <code>\n                eRm::personfit(object)\n                </code>\n                <br/><br/>\n                <b>Detalhes</b>\n                <br/>  \n                object: Objeto da classe ppar, derivado de person.parameter, execute help(person.parameter) do editor de sintaxe para ajuda.\n                <br/><br/>\n                <b>Valores</b>\n                <br/>\n                p.df: graus de liberdade para estatísticas de personfit\n                <br/>\n                st.res: Resíduos padronizados (da função personfit).\n                <br/>\n                p.outfitMSQ: Estatísticas de média-quadrada do outfit (da função personfit).\n                <br/>\n                p.infitMSQ: Estatísticas de média-quadrada do infit (da função personfit).\n                <br/><br/>\n                <b>Ajuda</b>\n                <br/>\n                Execute o seguinte do editor de Sintaxe do BioStat Prime help(personfit, package ='eRm')\n                <br/><br/>\n                <b>Pacotes</b>\n                <br/>\n                eRm\n                <br/>\n\n                <b>Descrição: Teste de Razão de Verossimilhança de Martin-Löf</b></br>\n                Este Teste de Razão de Verossimilhança é baseado na divisão de subgrupos de itens.\n                <br/><br/>\n                <b>Uso</b>\n                <br/>\n                <code>\n                MLoef(robj, splitcr = \"mediana\")\n                </code>\n                <br/><br/>\n                <b>Detalhes</b>\n                <br/>  \n                robj: Um objeto da classe 'Rm'.\n                <br/>\n                splitcr: Critério de divisão para definir os grupos de itens. \"mediana\" e \"média\" dividem os itens em dois grupos com base nas pontuações brutas de seus itens. splitcr também pode ser um vetor de comprimento k (onde k denota o número de itens) que assume dois ou mais valores distintos para definir grupos usados para o Teste de Martin-Löf.\n                <br/><br/>\n                <b>Valores</b>\n                <br/>\n                MLoef retorna um objeto da classe MLoef contendo:\n                <br/><br/>\n                LR: valor LR\n                <br/>\n                df: graus de liberdade\n                <br/>\n                p.value: valor p do teste\n                <br/>\n                fullModel: o modelo Rasch geral\n                <br/>\n                subModels: uma lista contendo os submodelos\n                <br/>\n                Lf: log-verossimilhança do modelo completo\n                <br/>\n                Ls: lista das log-verossimilhanças dos submodelos\n                <br/>\n                i.groups: uma lista dos grupos de itens\n                <br/>\n                splitcr: critério de divisão submetido\n                <br/>\n                split.vector: alocação binária de itens para grupos\n                <br/>\n                warning: itens iguais à mediana ou média para os respectivos critérios de divisão\n                <br/><br/>\n                <b>Pacotes</b>\n                <br/>\n                eRm                \n                <br/><br/>\n                <b>Ajuda</b>\n                <br/>\n                Execute o seguinte do editor de Sintaxe do BioStat Prime  help(MLoef, package ='eRm')\n\n                "
  }
}