{
  "title": "Plotar Mapa Pessoa-Item",
  "navigation": "Plotar Mapa Pessoa-Item",
  "label1": "Selecione um modelo (modelos da classe Rm e dRm suportados)",
  "label1b": "Se nenhum modelo estiver disponível, você precisa criar um modelo primeiro selecionando Ajuste de Modelo -> IRT",
  "modelselector1": "Selecione um modelo",
  "range1": "Intervalo para o eixo X",
  "help": {
    "title": "Plotar Mapa Pessoa-Item",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>Descrição</b></br>\n                Um mapa pessoa-item exibe a localização dos parâmetros dos itens (e limiares) assim como a distribuição dos parâmetros das pessoas ao longo da dimensão latente. Mapas pessoa-item são úteis para comparar o intervalo e a posição da distribuição da medida dos itens (painel inferior) com o intervalo e a posição da distribuição da medida das pessoas (painel superior). Os itens devem idealmente estar localizados ao longo de toda a escala para medir de forma significativa a ‘habilidade’ de todas as pessoas.\n\n                <br/><br/>\n                <b>Uso</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"Mapa Pessoa-Item\", latdim = \"Dimensão Latente\",\n                pplabel = \"Distribuição\nParâmetro\nPessoa\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>Argumentos</b>\n                <br/>  \n                object: Objeto da classe Rm ou dRm\n                <br/>\n                item.subset: Subconjunto de itens a serem plotados. Pode ser um vetor numérico indicando a coluna em X ou um vetor de caracteres indicando o nome da coluna. Se \"all\", todos os itens são plotados. O número de itens a serem plotados deve ser > 1.\n                <br/>\n                sorted: Se TRUE, os itens são ordenados em ordem crescente de acordo com sua localização na dimensão latente.   \n                <br/>\n                main: Título principal do gráfico.\n                <br/>\n                latdim: Rótulo do eixo x, ou seja, a dimensão latente.\n                <br/>\n                pplabel: Título para o painel superior exibindo a distribuição do parâmetro da pessoa\n                <br/>\n                cex.gen: cex como um parâmetro gráfico especifica um valor numérico que indica a quantidade pela qual o texto e os símbolos devem ser ampliados em relação ao padrão. Aqui, cex.gen se aplica a todos os rótulos de texto. O padrão é 0.7.\n                <br/>\n                xrange: Intervalo para o eixo x\n                <br/>\n                warn.ord: Se TRUE (o padrão), asteriscos são exibidos na margem direita do painel inferior para indicar locais de limiares não ordinais para itens polytomous.\n                <br/>\n                warn.ord.colour: Locais de limiares não ordinais para itens polytomous são coloridos com esta cor para torná-los mais visíveis. Isso é especialmente útil quando há muitos itens, de modo que o gráfico fica bastante denso. O padrão é \"black\", então não há distinção feita.\n                <br/>   \n                irug: Se TRUE (o padrão), todos os limiares são plotados abaixo da distribuição da pessoa para indicar onde os itens incluídos são mais informativos.                \n                <br/>\n                pp: Se não-nulo, isso contém os dados do parâmetro da pessoa do objeto de dados, evitando a necessidade de recalculá-lo.\n                <br/><br/>\n\n                <b>Pacotes</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>Ajuda</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}