{
  "title": "Gráficos P-P",
  "navigation": "P-P",
  "alpha": "Opacidade (0-1)",
  "x": "Eixo X, especifique uma variável numérica",
  "y": "Forma, especifique uma variável categórica",
  "color": "Cor, especifique uma variável de agrupamento (categoria)",
  "referenceline": "Linha de referência",
  "band": "Mostrar faixas",
  "detrend": "Remover tendência",
  "showStatsTable": "Mostrar tabela de estatísticas para teste de normalidade",
  "normalityTestMethod": "Método do teste de normalidade",
  "flip": "Inverter eixo",
  "distribution": "Selecione uma distribuição",
  "x_title": "Etiqueta do eixo X",
  "y_title": "Etiqueta do eixo Y",
  "label1": "Parâmetros da distribuição, por exemplo, para uma distribuição normal, os parâmetros podem ser mean=2, sd=2, então insira mean=2, sd=2. Para uma distribuição exponencial, os parâmetros podem ser rate=2, então insira rate=2.",
  "dparams": "Opcionalmente insira parâmetros da distribuição",
  "specify_a_title": "Digite um título",
  "Facetrow": "Linha do facet",
  "Facetcolumn": "Coluna do facet",
  "Facetwrap": "Quebra do facet",
  "Facetscale": "Escala do facet",
  "facets_lbl": "Facetas",
  "help": {
    "title": "Gráficos P-P",
    "r_help": "help(stat_pp_point,package='qqplotr')",
    "body": "\n            <b>Descrição</b></br>\n            Um gráfico P-P (probabilidade-probabilidade, gráfico percentual-percentual ou gráfico de valor P) é um gráfico de probabilidade para avaliar quão próximos dois conjuntos de dados estão, traçando as duas funções de distribuição acumulada uma contra a outra. Por padrão, comparamos a distribuição acumulada da variável selecionada com a distribuição normal, no entanto, você pode comparar com várias outras distribuições incluindo beta, cauchy, chisq, exp, f, gamma... Você também pode especificar os parâmetros da distribuição associada àquela contra a qual está sendo comparada. Clique no botão opções no diálogo principal para selecionar uma distribuição e especificar os parâmetros da distribuição. Você pode selecionar uma variável fator para agrupar a variável selecionada. Neste caso, um gráfico P-P separado é desenhado para cada grupo.\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code> \n            ggplot(data = datasetname,mapping= aes(sample = var1 ,shape = var2 ))  +stat_pp_band() + stat_pp_line() + stat_pp_point()  +labs(x = \"Pontos de Probabilidade\",y = \"Probabilidade Acumulada\",title =paste(\"Gráfico PP para variável \",var1,sep=''))+facet_grid(var3 ~.)\n            </code> <br/>\n            <b>Argumentos</b><br/>\n            <ul>\n            <li>\n            data: O conjunto de dados padrão\n            </li>\n            <li>\n            aes(): Gera mapeamentos estéticos que descrevem como as variáveis nos dados são mapeadas para propriedades visuais (estéticas) dos geoms.\n            </li>\n            <li>\n            sample: a variável numérica para traçar o gráfico P-P\n            </li>\n            <li>\n            stat_pp_point: Plota probabilidades acumuladas versus pontos de probabilidade. A função de probabilidade acumulada é construída com os dados da amostra, e então avaliada em cada ponto de probabilidade.\n            </li>\n            <li>\n            stat_pp_line: Desenha uma linha de identidade de referência (x=y).\n            </li>\n            <li>\n            stat_pp_band: Desenha bandas de confiança. Por enquanto, apenas a versão bootstrap (\"boot\") está disponível.\n            </li>\n            <li>\n            shape: Uma variável fator opcional que agrupa os valores atribuídos à amostra. Um gráfico P-P separado é criado para cada grupo conforme determinado pelos níveis da variável fator. Cada grupo é indicado por uma forma diferente.\n            </li>\n            <li>\n            Labs(): Altera os rótulos dos eixos e os títulos das legendas (opcional)\n            </li>\n            <li>\n            facet_grid(): Dispõe os painéis em uma grade (opcional). Veja help(facet_grid) para mais detalhes.\n            </li>\n            <li>  ​\n            coord_flip(): Inverte o eixo (opcional)\n            </li>\n            </ul>\n            <b>Pacote</b></br>\n            ggplot2;ggthemes;qqplotr;\n            <br/>\n            <b>Ajuda</b></br>\n            help(stat_pp_point, package='qqplotr')<br/>\n            Outro: Clique no botão de Ajuda do R para obter ajuda detalhada. Você também pode entrar help(labs), help(stat_pp_point), help(aes), help(facet_grid), help(coord_flip)<br/>\n            https://cran.r-project.org/web/packages/qqplotr/vignettes/introduction.html\n        "
  }
}
