{
  "title": "Capacidade de Processo",
  "navigation": "Capacidade de Processo",
  "summaryPlotChk": "Plote os gráficos xbar e I subjacentes usados para calcular a capacidade do processo.",
  "displaySLlineonPlotChk": "Exibir linhas LSL e USL nos gráficos subjacentes.",
  "printObjectSummaryChk": "Imprimir resumo do objeto QCC para a capacidade do processo.",
  "label1": "Duas opções - selecione uma variável (e uma variável de agrupamento, se necessário) ou selecione as variáveis no conjunto de dados se já agrupadas.",
  "label2": "Opções avançadas",
  "selectVariableRad": "Opção 1: Selecione uma variável do conjunto de dados (opcionalmente pode precisar ser agrupada).",
  "variableSelcted": "Selecione uma variável (dados observados) para analisar.",
  "groupingVariable": "Variável de agrupamento (opcional - se os dados precisam ser agrupados).",
  "variableControlLimits": "Linhas de dados a serem descartadas, se houver, antes do agrupamento para limites de controle da variável (por exemplo, especifique como 1:25 ou 1,4,5,7:12).",
  "displayGroupsChk": "Exibir os agrupamentos na grade UI do conjunto de dados apenas para referência.",
  "selectDatasetRad": "Opção 2: Selecione as variáveis do conjunto de dados se já agrupadas.",
  "variablelistSelcted": "Selecione uma ou mais variáveis agrupadas (dados observados) para analisar.",
  "rowsTobeUsed": "Se as linhas selecionadas (agrupadas) devem ser usadas para analisar a capacidade do processo (por exemplo, especifique como 1:25 ou 1,4,5,7:12).",
  "nsigmas": "Sigma - número de sigmas a serem usados para calcular limites de controle.",
  "confidence_level": "Um valor numérico entre 0 e 1 que especifica o nível a ser usado para calcular intervalos de confiança.",
  "stddev": "Método de desvio padrão para calcular xbar (para tamanho de grupo > 1).",
  "stddevXbarOne": "Método de desvio padrão para calcular I-MR.",
  "DoNotUseUnbiasingConstantChk": "Não use a constante de desvio para estimar o desvio padrão para índices de capacidade de processo globais.",
  "lower": "LSL - valor numérico do limite de especificação inferior (digite NA para especificar limites de especificação unilaterais).",
  "upper": "USL - valor numérico do limite de especificação superior (digite NA para especificar limites de especificação unilaterais).",
  "target": "Alvo - um valor opcional que especifica o alvo do processo.",
  "addlSpecLines": "Adicionar linhas de especificação adicionais no gráfico (separadas por vírgulas, por exemplo, 73.98, 74.01, 74.03).",
  "addlSpecLinesLabel": "Rótulo para as linhas de especificação adicionais (separadas por vírgulas, por exemplo, Spec 1, Spec 2, Spec 3).",
  "digits": "Dígitos - número de dígitos a serem exibidos.",
  "help": {
    "title": "Capacidade de Processo (pacote qcc)",
    "r_help": "help(process.capability, package = qcc)",
    "body": "\n\t\t\t\t<b>Descrição</b></br>\n\t\t\t\tA função qcc calcula índices de capacidade.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara ajuda detalhada, use R help(process.capability, package = qcc), help(qcc, package = qcc), help(sd.xbar, package = qcc) e help(sd.xbar.one, package = qcc).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara tentar isso, você pode carregar o conjunto de dados chamado pistonrings do pacote qcc usando o menu Carregar Conjunto de Dados selecionando o pacote qcc e, em seguida, selecionando o conjunto de dados pistonrings.\n\t\t\t\t<br/>\n\t\t\t\tEscolha a opção 1, diâmetro para variável (observada..), amostra para variável de agrupamento,\n\t\t\t\t<br/>\n\t\t\t\tDigite 1:25 nas linhas agrupadas a serem usadas.\n\t\t\t\t<br/>\n\t\t\t\tPara análise de capacidade de processo - digite 73.95 em LSL, 74.05 em USL e 74.0 no Limite Alvo.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSiga o tutorial qcc em https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
  }
}