{
  "title": "Teste de Proporção de Amostra Única",
  "navigation": "Amostra única (Correção de Continuidade)",
  "tvarbox1": "Numérico ou fator com apenas 2 níveis/valores",
  "label1": "Hipótese alternativa",
  "test1": "Média populacional != mu",
  "test2": "Média populacional > mu",
  "test3": "Média populacional < mu",
  "txtbox1": "Nível de confiança",
  "txtbox2": "Hipótese nula (mu no intervalo de 0-1)",
  "chkbox1": "Com correção de continuidade",
  "dataInCols": "Uma ou mais variáveis contêm amostras",
  "summarized": "Dados resumidos",
  "noOfEvents": "Número de eventos",
  "noOfTrials": "Número de tentativas",
  "help": {
    "title": "Teste de Proporção de Amostra Única",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>Descrição</b></br>\nprop.test pode ser usado para testar a nulidade de que as proporções (probabilidades de sucesso) em vários grupos são as mesmas, ou que elas são iguais a certos valores dados.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: um vetor de contagens de sucessos, uma tabela unidimensional com duas entradas, ou uma tabela bidimensional (ou matriz) com 2 colunas, dando as contagens de sucessos e falhas, respectivamente.\n</li>\n<li>\nn: um vetor de contagens de tentativas; ignorado se x for uma matriz ou uma tabela.\n</li>\n<li>\np: um vetor de probabilidades de sucesso. O comprimento de p deve ser o mesmo que o número de grupos especificados por x, e seus elementos devem ser maiores que 0 e menores que 1.\n</li>\n<li>\nalternative: uma string de caracteres especificando a hipótese alternativa, deve ser uma das \"two.sided\" (padrão), \"greater\" ou \"less\". Você pode especificar apenas a letra inicial. Usado apenas para testar a nulidade de que uma única proporção é igual a um valor dado, ou que duas proporções são iguais; ignorado de outra forma.\n</li>\n<li>\nconf.level: nível de confiança do intervalo de confiança retornado. Deve ser um único número entre 0 e 1. Usado apenas ao testar a nulidade de que uma única proporção é igual a um valor dado, ou que duas proporções são iguais; ignorado de outra forma.\n</li>\n<li>\ncorrect: um lógico indicando se a correção de continuidade de Yates deve ser aplicada onde possível.\n</li>\n</ul>\n<b>Detalhes</b></br>\nApenas grupos com números finitos de sucessos e falhas são usados. As contagens de sucessos e falhas devem ser não negativas e, portanto, não maiores que os números correspondentes de tentativas, que devem ser positivos. Todas as contagens finitas devem ser inteiros.</br>\nSe p for NULL e houver mais de um grupo, a nulidade testada é que as proporções em cada grupo são as mesmas. Se houver dois grupos, as alternativas são que a probabilidade de sucesso no primeiro grupo é menor que, não igual a, ou maior que a probabilidade de sucesso no segundo grupo, conforme especificado pela alternativa. Um intervalo de confiança para a diferença de proporções com nível de confiança conforme especificado por conf.level e limitado a [-1,1] é retornado. A correção de continuidade é usada apenas se não exceder a diferença das proporções amostrais em valor absoluto. Caso contrário, se houver mais de 2 grupos, a alternativa é sempre \"two.sided\", o intervalo de confiança retornado é NULL, e a correção de continuidade nunca é usada.</br>\nSe houver apenas um grupo, então a nulidade testada é que a probabilidade subjacente de sucesso é p, ou 0.5 se p não for dado. A alternativa é que a probabilidade de sucesso é menor que, não igual a, ou maior que p ou 0.5, respectivamente, conforme especificado pela alternativa. Um intervalo de confiança para a proporção subjacente com nível de confiança conforme especificado por conf.level e limitado a [0,1] é retornado. A correção de continuidade é usada apenas se não exceder a diferença entre as proporções amostrais e nulas em valor absoluto. O intervalo de confiança é calculado invertendo o teste de escore.</br>\nFinalmente, se p for dado e houver mais de 2 grupos, a nulidade testada é que as probabilidades subjacentes de sucesso são aquelas dadas por p. A alternativa é sempre \"two.sided\", o intervalo de confiança retornado é NULL, e a correção de continuidade nunca é usada.</br>\n<b>Valor</b><br/>\nUma lista com a classe \"htest\" contendo os seguintes componentes:</br>\nstatistic: o valor do teste estatístico qui-quadrado de Pearson.</br>\nparameter: os graus de liberdade da distribuição qui-quadrado aproximada do teste estatístico.</br>\np.value: o valor p do teste.</br>\nestimate: um vetor com as proporções amostrais x/n.</br>\nconf.int: um intervalo de confiança para a verdadeira proporção se houver um grupo, ou para a diferença em proporções se houver 2 grupos e p não for dado, ou NULL caso contrário. Nos casos em que não é NULL, o intervalo de confiança retornado tem um nível de confiança assintótico conforme especificado por conf.level, e é apropriado para a hipótese alternativa especificada.</br>\nnull.value: o valor de p se especificado pela nulidade, ou NULL caso contrário.</br>\nalternative: uma string de caracteres descrevendo a alternativa.</br>\nmethod: uma string de caracteres indicando o método usado, e se a correção de continuidade de Yates foi aplicada.</br>\ndata.name: uma string de caracteres dando os nomes dos dados.</br>\n<b>Pacote</b></br>\nstats</br>\n<b>Ajuda</b></br>\nhelp(prop.test, package ='stats')\n"
  }
}