{
  "title": "Divisão Aleatória",
  "navigation": "Divisão Aleatória",
  "traindataset": "Insira o nome do conjunto de dados de treinamento",
  "testdataset": "Insira o nome do conjunto de dados de teste",
  "split": "Insira a porcentagem de divisão",
  "replace": "A amostragem deve ser com reposição?",
  "seed": "Definir semente",
  "dependent": "Variável para construir amostras estratificadas",
  "help": {
    "title": "Divisão Aleatória",
    "r_help": "help(sample, package=\"base\")",
    "body": "\n<b>Descrição</b></br>\nsample pega uma amostra do tamanho especificado dos elementos de x usando com ou sem reposição.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nsample(x, size, replace = FALSE, prob = NULL)\nsample.int(n, size = n, replace = FALSE, prob = NULL)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx: Um vetor de um ou mais elementos dos quais escolher, ou um número inteiro positivo. Veja 'Detalhes.'\n</li>\n<li>\nn: um número positivo, o número de itens a serem escolhidos. Veja 'Detalhes.'\n</li>\n<li>\nsize: um inteiro não negativo que dá o número de itens a serem escolhidos.\n</li>\n<li>\nreplace: A amostragem deve ser com reposição?\n</li>\n<li>\nprob: Um vetor de pesos de probabilidade para obter os elementos do vetor que está sendo amostrado.\n</li>\n</ul>\n<b>Detalhes</b></br>\nSe x tiver comprimento 1, for numérico (no sentido de is.numeric) e x >= 1, a amostragem via sample ocorre de 1:x. Note que esse recurso de conveniência pode levar a comportamentos indesejados quando x tem comprimento variável em chamadas como sample(x). Veja os exemplos.<br/>\nCaso contrário, x pode ser qualquer objeto R para o qual o comprimento e a subdefinição por inteiros façam sentido: métodos S3 ou S4 para essas operações serão despachados conforme apropriado.<br/>\nPara sample, o padrão para size é o número de itens inferidos do primeiro argumento, de modo que sample(x) gera uma permutação aleatória dos elementos de x (ou 1:x).<br/>\nÉ permitido solicitar amostras de tamanho = 0 com n = 0 ou um x de comprimento zero, mas caso contrário n > 0 ou comprimento positivo(x) é necessário.<br/>\nValores numéricos positivos não inteiros de n ou x serão truncados para o próximo menor inteiro, que não pode ser maior que .Machine$integer.max.<br/>\nO argumento prob opcional pode ser usado para fornecer um vetor de pesos para obter os elementos do vetor que está sendo amostrado. Eles não precisam somar um, mas devem ser não negativos e não todos zero. Se replace for verdadeiro, o método de alias de Walker (Ripley, 1987) é usado quando há mais de 200 valores razoavelmente prováveis: isso dá resultados incompatíveis com aqueles de R < 2.2.0.<br/>\nSe replace for falso, essas probabilidades são aplicadas sequencialmente, ou seja, a probabilidade de escolher o próximo item é proporcional aos pesos entre os itens restantes. O número de pesos não zero deve ser pelo menos size neste caso.<br/>\nsample.int é uma interface simples na qual tanto n quanto size devem ser fornecidos como inteiros.<br/>\nA partir do R 3.0.0, n pode ser maior que o maior inteiro do tipo inteiro, até o maior inteiro representável no tipo double. Apenas amostragem uniforme é suportada. Dois números aleatórios são usados para garantir a amostragem uniforme de grandes inteiros.<br/>\n<b>Pacote</b></br>\nbase\n<b>Ajuda</b></br>\nhelp(sample, package=\"base\")\n"
  }
}