{
  "title": "Floresta Aleatória",
  "label1": "A floresta aleatória pode ser executada em modo supervisionado ou não supervisionado. Para executar em modo não supervisionado, não especifique uma variável dependente.",
  "navigation": "Floresta Aleatória",
  "modelname": "Digite o nome do modelo",
  "dependentvar": "Variável dependente",
  "independentvars": "Variável(is) independente(s)",
  "ntree": "Número de árvores",
  "mtry": "mtry",
  "proximity": "Proximidade:",
  "newds": "Especifique o nome do conjunto de dados para armazenar a proximidade:",
  "predictor": "Salvar valores previstos:",
  "newcolname": "Especifique o novo nome da coluna para os valores previstos:",
  "help": {
    "title": "Floresta Aleatória",
    "r_help": "help(randomForest,package='randomForest')",
    "body": "\n                <b>Descrição</b></br>\nrandomForest implementa o algoritmo de floresta aleatória de Breiman (baseado no código original em Fortran de Breiman e Cutler) para classificação e regressão. Também pode ser usado em modo não supervisionado para avaliar as proximidades entre pontos de dados.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nrandomForest(x, y=NULL,  ntree=500, importance=FALSE, proximity, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nx : Um data frame ou uma matriz de preditores, ou uma fórmula descrevendo o modelo a ser ajustado (para o método de impressão, um objeto randomForest).\n</li>\n<li>\ny: Um vetor de resposta. Se for um fator, a classificação é assumida, caso contrário, a regressão é assumida. Se omitido, randomForest será executado em modo não supervisionado.\n</li>\n<li>\nntree : Número de árvores a serem cultivadas. Isso não deve ser definido como um número muito pequeno, para garantir que cada linha de entrada seja prevista pelo menos algumas vezes.\n</li>\n<li>\nimportance : A importância dos preditores deve ser avaliada? \n</li>\n<li>\nproximity : A medida de proximidade entre as linhas deve ser calculada?\n</li>\n<li>\n... : parâmetros opcionais a serem passados para a função de baixo nível randomForest.default.\n</li>\n</ul>\n<b>Valor</b><br/>\nUm objeto da classe randomForest, que é uma lista com os seguintes componentes:<br/>\ncall: a chamada original para randomForest<br/>\ntype: um de regressão, classificação ou não supervisionado.<br/>\npredicted: os valores previstos dos dados de entrada com base em amostras fora da bolsa.<br/>\nimportance:\ta matriz com nclass + 2 (para classificação) ou dois (para regressão) colunas. Para classificação, as primeiras nclass colunas são as medidas específicas da classe calculadas como a média da diminuição na precisão. A nclass + 1ª coluna é a média da diminuição na precisão sobre todas as classes. A última coluna é a média da diminuição no índice de Gini. Para regressão, a primeira coluna é a média da diminuição na precisão e a segunda a média da diminuição no MSE. Se importance=FALSE, a última medida ainda é retornada como um vetor.<br/>\nimportanceSD: Os “erros padrão” da medida de importância baseada em permutação. Para classificação, uma matriz p por nclass + 1 correspondente às primeiras nclass + 1 colunas da matriz de importância. Para regressão, um vetor de comprimento p.<br/>\nlocalImp: uma matriz p por n contendo as medidas de importância caso a caso, o elemento [i,j] é a importância da i-ésima variável no j-ésimo caso. NULL se localImp=FALSE.<br/>\nntree: número de árvores cultivadas.<br/>\nmtry: número de preditores amostrados para divisão em cada nó.<br/>\nforest: (uma lista que contém toda a floresta; NULL se randomForest for executado em modo não supervisionado ou se keep.forest=FALSE.<br/>\nerr.rate: (classificação apenas) vetor de taxas de erro da previsão nos dados de entrada, o i-ésimo elemento sendo a taxa de erro (OOB) para todas as árvores até o i-ésimo.<br/>\nconfusion: (classificação apenas) a matriz de confusão da previsão (baseada em dados OOB).<br/>\nvotes: (classificação apenas) uma matriz com uma linha para cada ponto de dados de entrada e uma coluna para cada classe, dando a fração ou número de “votos” (OOB) da floresta aleatória.<br/>\noob.times: número de vezes que os casos estão “fora da bolsa” (e, portanto, usados no cálculo da estimativa de erro OOB)<br/>\nproximity: se proximity=TRUE quando randomForest é chamado, uma matriz de medidas de proximidade entre as entradas (com base na frequência com que pares de pontos de dados estão nos mesmos nós terminais).<br/>\nmse\t: (regressão apenas) vetor de erros quadráticos médios: soma dos resíduos quadrados dividida por n.<br/>\nrsq\t: (regressão apenas) “pseudo R-quadrado”: 1 - mse / Var(y).<br/>\ntest: se um conjunto de teste for fornecido (através dos argumentos xtest ou adicionalmente ytest), este componente é uma lista que contém os correspondentes previstos, err.rate, confusão, votos (para classificação) ou previstos, mse e rsq (para regressão) para o conjunto de teste. Se proximity=TRUE, há também um componente, proximidade, que contém a proximidade entre o conjunto de teste, bem como a proximidade entre os dados de teste e treinamento.<br/>\n<b>Pacote</b></br>\nrandomForest​;BlueSky</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando no editor de sintaxe R</br>\nhelp(randomForest,package='randomForest')\n                "
  }
}