{
  "title": "Recodificar Variáveis",
  "navigation": "Recodificar",
  "oldvars": "Variáveis a Recodificar",
  "label1": "Opções",
  "newvarradio": "Nova(s) Variável(eis)",
  "newvar": "Digite os nomes das novas variáveis separados por , por exemplo, newVar1, newVar2",
  "oldvarradio": "Sobrescrever variável(eis) existente(s)",
  "suffix": "Especifique um sufixo para variáveis recodificadas",
  "prefix": "Especifique um prefixo para variáveis recodificadas",
  "enterSuffix": "Digite um sufixo",
  "enterPrefix": "Digite um prefixo",
  "label3": "Ao especificar múltiplos critérios de recodificação, use ; como separador.",
  "label4": "NOTA: VALORES DE STRING DEVEM ESTAR ENTRE ASPAS DUPLAS(\") E NÃO ASPAS SIMPLES(').",
  "label5": "Digite valores antigos e novos separados por ; por exemplo, \"Masculino\"=\"Homem\";\"Fem\"=2;\"Houston, Texas\"=\"Texas\";\"Não Disponível\"=NA ",
  "label5a": "Para recodificação de tipo numérico digite 70=100;71=101;99=NA",
  "label5b": "Intervalo de valores é suportado, por exemplo, 5:10=\"médio\" Valores especiais lo e hi podem aparecer em um intervalo, por exemplo, lo:10=\"baixo\";11:89=\"médio\";90:hi=\"Alto\"",
  "label6": "A palavra-chave else pode ser usada para tudo que não se encaixa em uma especificação, por exemplo, else =NA",
  "dontMakeFactor": "Por padrão, a variável recodificada será um fator se a variável de origem for um fator. Para substituir, marque a caixa de seleção",
  "oldnewvals": "Digite critérios de recodificação",
  "help": {
    "title": "Recodificar Variáveis",
    "r_help": "help(recode, package=car)",
    "body": "\n<b>Descrição</b></br>\nRecodifica um ou mais vetores numéricos, vetores de caracteres ou fatores de acordo com as especificações de recodificação. Você pode armazenar os resultados sobrescrevendo variáveis existentes, especificando novos nomes de variáveis para armazenar valores recodificados ou escolhendo armazenar os valores recodificados em novas variáveis com um prefixo ou sufixo adequado. O prefixo ou sufixo será aplicado ao nome da variável existente.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nBSkyRecode(colNames,newColNames,OldNewVals,NewCol=TRUE,dataSetNameOrIndex='Dataset2')\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ncolNames: Um vetor de caracteres contendo uma ou mais variáveis no conjunto de dados a serem recodificadas\n</li>\n<li>\nnewColNames:  Um vetor de caracteres contendo os nomes das novas colunas.\n</li>\n<li>\nOldNewVals: Uma string de caracteres das especificações de recodificação na forma oldval1,newval1, oldval2,newval2\n</li>\n<li>\nNewCol: Um Booleano indicando se os valores recodificados são armazenados em novas variáveis (TRUE) ou se as variáveis existentes são sobrescritas (FALSE).\n</li>\n<li>\nprefixOrSuffix: Especifique se deseja armazenar os valores recodificados em novas variáveis prefixadas ou sufixadas com o nome que você especificar.  Digite prefixo ou sufixo.\n</li>\n<li>\nprefixOrSuffixString: Digite uma string para usar como prefixo ou sufixo ao nome da variável existente. Os valores recodificados serão armazenados nessas variáveis.\n</li>\n<li>\ndataSetNameOrIndex: O nome do conjunto de dados/dataframe\n</li>\n</ul>\nNota: Não converteremos de numérico para fator. Quando um numérico é recodificado, ele permanecerá numérico, quando uma variável fator é recodificada, ela permanecerá fator.<br/>\n<b>Pacote</b></br>\ncar</br>\n<b>Ajuda</b></br>\nDigite a linha abaixo no editor de sintaxe R do BlueSky Statistics</br>\nhelp(recode, package=car)\n"
  }
}