{
  "title": "Análise de Confiabilidade (Ômega de McDonald)",
  "navigation": "Ômega de McDonald",
  "tvarbox1": "Todos os Itens",
  "help": {
    "title": "Ômega de McDonald",
    "r_help": "help(omega, package=psych)",
    "body": "\n            <b>Descrição</b></br>\nCalcule as estimativas do ômega de McDonald de saturação de fator geral e total\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nomega(m,nfactors=3,fm=\"minres\",n.iter=1,p=.05,poly=FALSE,key=NULL,\n    flip=TRUE,digits=2, title=\"Ômega\",sl=TRUE,labels=NULL,\nplot=TRUE,n.obs=NA,rotate=\"oblimin\",Phi=NULL,option=\"equal\",covar=FALSE, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nm​: Uma matriz de correlação, ou um data.frame/matriz de dados, ou (se Phi) for especificado, uma matriz de padrão de fator oblíquo\n</li>\n<li>\nnfactors: O número de fatores agrupados\n</li>\n<li>\nfm​: método de fator (o padrão é minres) fm=\"pa\" para eixos principais, fm=\"minres\" para uma solução de resíduos mínimos (OLS), fm=\"pc\" para componentes principais (veja a nota), ou fm=\"ml\" para máxima verossimilhança.\n</li>\n<li>\nn.iter: Quantas repetições fazer em ômega para estimativas bootstrap​\n</li>\n<li>\np: probabilidade de limites de conferência de duas caudas\n</li>\n<li>\ndigits​: se especificado, arredonde a saída para dígitos​\n</li>\n<li>\npoly: a matriz de correlação deve ser encontrada usando correlações policóricas/tetráchoricas ou correlações de Pearson normais\n</li>\n<li>\nkey​: um vetor de +/- 1s para especificar a direção da pontuação dos itens. O padrão é assumir que todos os itens são positivamente pontuados, mas se alguns itens forem pontuados de forma reversa, então key deve ser especificado.​\n</li>\n</ul>\n<b>Valor</b><br/>\nomega hierárquico: O coeficiente ω_h<br/>\nomega.lim: O limite de ω_h à medida que o teste se torna infinitamente grande<br/>\nomega total: O coeficiente omega_t<br/>\nalpha: α de Cronbach<br/>\nschmid: A matriz de fator transformada de Schmid Leiman e matrizes associadas<br/>\nschmid$sl: As cargas do fator g, bem como os fatores residualizados<br/>\nschmid$orthog: Solução rotacionada Varimax dos fatores originais<br/>\nschmid$oblique: Os fatores transformados oblimin ou promax<br/>\nschmid$phi: a matriz de correlação dos fatores oblíquos<br/>\nschmid$gloading: As cargas no fator de ordem superior, g, dos fatores oblimin<br/>\nkey: Um vetor de -1 ou 1 mostrando qual direção os itens foram pontuados.<br/>\nmodel: uma lista de dois elementos, um adequado para dar à função sem para modelos de equações estruturais, o outro, para dar ao pacote lavaan.<br/>\nsem: A saída de uma análise sem<br/>\nomega.group: As estatísticas resumidas para o ômega total, ômega hierárquico (geral) e ômega dentro de cada grupo.<br/>\nscores: Estimativas de pontuação de fator são encontradas para a solução de Schmid-Leiman. Para obter pontuações para o modelo hierárquico, veja a nota na ajuda detalhada do R.<br/>\nvarious fit statisticsvarious fit statistics, veja a saída<br/>\n<b>Pacote</b></br>\npsych​</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone do R no canto superior direito deste diálogo ou execute o seguinte comando help(omega, package=psych) criando um bloco de código R clicando + na janela de saída\n\t\t\t"
  }
}