{
  "title": "Reformar, de largo para longo",
  "label2": "Escolha as variáveis para reformar ou, alternativamente, escolha as variáveis que não devem ser reformadas. Neste último caso, todas as variáveis restantes serão reformadas em coluna(s)",
  "navigation": "Mais longo",
  "label0": "Você pode escolher salvar os resultados em um novo conjunto de dados ou sobrescrever o conjunto de dados existente",
  "label1": "Opções",
  "advanced": "Avançado",
  "New": "Salvar resultados em um novo conjunto de dados",
  "newdatasetname": "Digite um nome para o conjunto de dados",
  "Existing": "Sobrescrever conjunto de dados existente",
  "label12": "Digite o(s) nome(s) da(s) variável(is) para nova(s) variável(is) de fator repetido",
  "repeatedMeasure": "NOTA: Ao especificar múltiplos nomes de variáveis que armazenam fatores repetidos, separe-os por vírgula, por exemplo, Mês, Dia. Você também deve clicar em avançado para especificar como os nomes das variáveis são criados.",
  "repeatedValue": "Nome da variável para o valor repetido, por exemplo, Contagem",
  "labelChoice": "Selecione uma das opções abaixo",
  "subsetvars": "Opção 1: Selecione variável(is) para reformar em uma ou mais variável(is)",
  "names_sep": "Opção 2: Especifique um caractere ou expressão regular para dividir os nomes das colunas e criar valores para os nomes das variáveis. Aceita a mesma especificação que separate(), e pode ser um vetor numérico (especificando posições para quebrar) ou uma única string (especificando uma expressão regular para dividir)",
  "names_pattern": "Opção 1: Uma expressão regular contendo grupos correspondentes (()). A parte correspondente da expressão regular entre os () será usada para criar nomes de variáveis.",
  "dontReshape": "Opção 2: Selecione variável(is) que não devem ser reformadas (todas as variáveis restantes serão reformadas em coluna(s))",
  "removeNA": "Remover linhas onde o valor repetido é NA.",
  "makeString": "Transformar o fator repetido em um tipo de string R em vez de um fator",
  "label3": "Se várias novas variáveis forem criadas para fatores repetidos, as opções abaixo controlam como os nomes das colunas são divididos. Selecione uma das 2 opções abaixo.",
  "help": {
    "title": "Reformar (de largo para longo)",
    "r_help": "help(pivot_longer, package=tidyr)",
    "body": "\n<b>Descrição</b></br>\nVeja o vídeo em <a href=\" https://youtu.be/ypLXqmFp3jY\">Reformar de largo para longo</a></br>\nToma um conjunto de dados largo e o converte em um conjunto de dados longo, convertendo colunas em pares de chave-valor\nPivot_longer pega várias colunas e as colapsa em pares chave-valor, duplicando todas as outras colunas conforme necessário. Você usa pivot_longer() quando percebe que tem colunas que não são variáveis.</br>\nDigite vignette(\"pivot\") no editor R para ver a ajuda do R. Se houver várias colunas a serem criadas, você precisa especificar argumentos para especificar como os nomes das colunas são construídos.</br>\nNeste caso, clique em avançado para inserir uma expressão regular que especifique como as variáveis devem ser criadas a partir dos nomes das colunas.</br>\nNOTA: Ao especificar múltiplas variáveis para o(s) fator(es) repetido(s), separe-as por ,\n<br/>\n<b>Uso</b>\n<br/>\n<code> \npivot_longer( cols=c(col1, col2...),names_to=\"key\",values_to=\"value\",values_drop_na = TRUE)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ncols: Colunas a serem pivotadas para o formato mais longo.\n</li>\n<li>\nvalues_to: Uma string especificando o nome da coluna a ser criada a partir dos dados armazenados nos valores das células. Se names_to for um caractere contendo o sentinela especial .value, este valor será ignorado, e o nome da coluna de valor será derivado de parte dos nomes das colunas existentes. Se vazio, todas as variáveis são selecionadas, exclua uma variável y com -y. Ao excluir variáveis, todas as variáveis restantes são pivotadas para longo.\n</li>\n<li>\nvalues_drop_na: Se TRUE, removerá linhas que contêm apenas NAs na coluna value_to. Isso efetivamente converte valores ausentes explícitos em valores ausentes implícitos, e deve geralmente ser usado apenas quando os valores ausentes nos dados foram criados por sua estrutura.\n</li>\n<li>\nnames_sep: aceita a mesma especificação que separate(), e pode ser um vetor numérico (especificando posições para quebrar) ou uma única string (especificando uma expressão regular para dividir).</br>\nVamos supor que as colunas sejam Height_1_1, Height_1_2, Weight_1_1, Weight_1_2, Sagur_1_1, Sagur_2_1 onde o 1º número é o mês e o 2º a semana, especificar _ como o separador resultará na criação de 3 variáveis, a primeira variável com valores Height, Weight, Sagur, a segunda com valores 1 e 2, e a 3ª com valores 1 e 2.</br>\nDigite help(regex) no editor de código R para mais detalhes\n</li>\n<li>\nnames_pattern: aceita a mesma especificação que extract(), uma expressão regular contendo grupos correspondentes (()).\nAceita a mesma especificação que separate(), e pode ser um vetor numérico (especificando posições para quebrar) ou uma única string (especificando uma expressão regular para dividir).</br>\nVamos supor que as colunas sejam Height_33.1_1, Height_44.1_2, Weight_66.1_1, Weight_55.1_2, onde os 2 dígitos após o 1º sublinhado devem ser ignorados, o dígito após o . é o mês e o dígito após o último _ é a semana.</br>\nAs expressões regulares que extraem os valores das novas variáveis precisam estar em (). A expressão regular será (.*)_.*.(.*)_(.)</br> \nNota: . em uma expressão regular significa qualquer caractere</br> \n* significa 0 ou mais, então .* significa 0 ou mais caracteres</br> \nPortanto, a string pode ser interpretada como procurando um padrão de</br> \n(.*) 0 ou mais caracteres seguidos por</br> \n _ um sublinhado seguido por</br> \n .*. um ou mais caracteres seguidos pelo . (escapando o . com um  indica que é o próprio caractere seguido por</br> \n.* um ou mais caracteres seguidos por</br> \n_ sublinhado seguido por</br> \n. um único caractere</br> \nTodos os padrões entre os () formam valores de cada uma das 3 novas variáveis fatoriais</br> \n</li>\n</ul>\n<b>Valor</b><br/>\nRetorna o conjunto de dados reformado\n<br/>\n<b>Pacote</b></br>\ntidyr</br>\n<b>Ajuda</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
  }
}