{
  "title": "Correspondência de Conjunto de Risco",
  "navigation": "Correspondência de Conjunto de Risco",
  "newdatasetnamelabel": "Nome do conjunto de dados para armazenar dados correspondidos",
  "groupvarlabel": "Variável de evento (1=evento, 0=censura)",
  "timevarlabel": "Variável de tempo",
  "calipervarslabel": "Variáveis para correspondência (numéricas)",
  "caliperslabel": "Especifique calipers na ordem das variáveis de correspondência separadas por vírgulas, por exemplo, 5, 2; especifique 0 para correspondências exatas",
  "ratiolabel": "Número de controles por caso",
  "repeatcontrolslabel": "Permitir que controles sejam correspondidos mais de uma vez",
  "supercontrolslabel": "Não permitir que casos sejam correspondidos a outros casos",
  "help": {
    "title": "Correspondência de Conjunto de Risco",
    "body": "\n            Realiza a correspondência de sujeitos de conjunto de risco dentro de uma coorte. Aqueles com o evento de resultado (casos) são correspondidos com aqueles que não tiveram o evento (controles) e estão no conjunto de risco no momento do evento do caso. Este é um design de caso/controle aninhado. Variáveis de linha de base conhecidas na entrada da coorte também são usadas para corresponder casos e controles.\n\t\t\t<br/><br/>\n\t\t\tVariáveis de linha de base para as quais os valores devem corresponder exatamente e valores correspondendo dentro de calipers numéricos são suportados. Controles são selecionados aleatoriamente entre todos os controles elegíveis para cada caso.\n\t\t\t<br/><br/>\n\t\t\tO conjunto de dados de saída contendo os dados correspondidos conterá as variáveis originais, o indicador de evento (\"falhou\") e uma variável identificando o conjunto correspondido (\"match.num\").\n\t\t\t<br/><br/>\n\t\t\tObservações com quaisquer valores ausentes para variáveis envolvidas no processo de correspondência são removidas antes da correspondência.\n\t\t\t<br/><br/>\n\t\t\tUma breve introdução aos designs de caso/controle aninhados pode ser encontrada em:\n\t\t\tEssebag V, et al. O estudo de caso-controle aninhado em cardiologia. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>Nome do conjunto de dados para armazenar dados correspondidos:</b>\n\t\t\t<br/>Nome do conjunto de dados de saída contendo os conjuntos de sujeitos correspondidos.\n\t\t\t<br/><br/>\n\t\t\t<b>Variável de evento (1=evento, 0=censura):</b>\n\t\t\t<br/>Nome da variável que indica aqueles com eventos. Deve ser numérica com 1=evento e 0=censura.\n\t\t\t</br><br/>\n\t\t\t<b>Variáveis para correspondência:</b>\n\t\t\t<br/>Especifique as variáveis de linha de base para as quais você deseja que os conjuntos de caso/controle sejam correspondidos. Estas devem ser numéricas.\n\t\t\t<br/><br/>\n\t\t\t<b>Especifique calipers na ordem das variáveis de correspondência separadas por vírgulas:</b>\n\t\t\t<br/>Especifique os valores de caliper numéricos para cada uma das variáveis, na ordem das variáveis. Correspondências exatas devem usar um caliper de 0. \n\t\t\tPor exemplo, se a idade (em anos) foi especificada com um caliper de 5, isso significa que os controles devem estar dentro de +/- 5 anos de seu caso correspondente.\n\t\t\tCada variável de correspondência deve ter um valor de caliper especificado.\n\t\t\t<br/><br/>\n\t\t\t<b>Número de controles por caso:</b>\n\t\t\t<br/>Este é o número máximo de controles que serão correspondidos a cada caso. Alguns conjuntos correspondidos podem ter menos do que este valor se correspondências adequadas não puderem ser identificadas.\n            <br/><br/>\n\t\t\t<b>Permitir que controles sejam correspondidos mais de uma vez:</b>\n\t\t\t<br/>Especifique se deseja ou não que os controles possam ser correspondidos a mais de um caso. Recomendamos que esta opção seja selecionada para evitar viés.\n            <br/><br/>\n\t\t\t<b>Não permitir que casos sejam correspondidos a outros casos:</b>\n\t\t\t<br/>Especifique se deve permitir que casos sejam considerados como controles antes do tempo do evento do caso. Recomendamos não selecionar esta opção para evitar viés. Não selecionar esta opção significa que um caso está no conjunto de risco de controle e é elegível para ser correspondido a outro caso, até o momento do seu evento.\n            <br/><br/>\n            <b>Pacotes R necessários:</b> dplyr, tidyr\n"
  }
}