{
  "title": "Ajuda do Pacote R",
  "navigation": "Ajuda do Pacote R",
  "packageName": "Selecione um pacote R instalado",
  "help": {
    "title": "Ajuda do Pacote R",
    "r_help": "ajuda()",
    "body": "\n<b>Descrição</b></br>\najuda é a interface principal para os sistemas de ajuda.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \najuda(topico, pacote = NULL, lib.loc = NULL,\n    verbose = getOption(\"verbose\"),\n    try.all.packages = getOption(\"help.try.all.packages\"),\n    help_type = getOption(\"help_type\"))\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ntopico: geralmente, um nome ou string de caracteres especificando o tópico para o qual a ajuda é solicitada. Uma string de caracteres (entre aspas simples ou duplas explícitas) é sempre considerada como nomeando um tópico. Se o valor de tópico for um vetor de caracteres de comprimento um, o tópico é considerado como o valor do único elemento. Caso contrário, o tópico deve ser um nome ou uma palavra reservada (se sintaticamente válida) ou string de caracteres. \n</li>\n<li>\npacote: um nome ou vetor de caracteres que dá os pacotes a serem consultados para documentação, ou NULL. Por padrão, todos os pacotes cujos namespaces estão carregados são usados. Para evitar que um nome seja desfeito, use por exemplo (pkg_ref).\n</li>\n<li>\nlib.loc: um vetor de caracteres de nomes de diretórios de bibliotecas R, ou NULL. O valor padrão de NULL corresponde a todas as bibliotecas atualmente conhecidas. Se o padrão for usado, os pacotes e namespaces carregados são pesquisados antes das bibliotecas.\n</li>\n<li>\nverbose: lógico; se TRUE, o nome do arquivo é relatado.\n</li>\n<li>\ntry.all.packages: lógico; veja Nota.\n</li>\n<li>\nhelp_type: string de caracteres: o tipo de ajuda requerida. Os valores possíveis são \"texto\", \"html\" e \"pdf\". A capitalização é ignorada e a correspondência parcial é permitida.\n</li>\n</ul>\n<b>Detalhes</b></br>\nA ajuda sobre o pacote</br>\n<b>Exemplos</b><br/>\n<code> \najuda(pacote = \"splines\")\n</code> <br/>\n<b>Pacote</b></br>\nutils</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone R no canto superior direito deste overlay de diálogo ou execute o seguinte comando no editor de sintaxe R ajuda()\n                "
  }
}