{
  "title": "Exemplo da Distribuição F",
  "navigation": "Exemplo da Distribuição F",
  "entrdsname": "Digite o nome do conjunto de dados",
  "dfnumerator": "Graus de liberdade do numerador",
  "dfdenominator": "Graus de liberdade do denominador",
  "lblnoofsamples": "Número de amostras (linhas)",
  "lblnoofobsv": "Número de observações (colunas)",
  "lblseed": "Semente",
  "lblAddtoDS": "Adicionar ao conjunto de dados",
  "chklbl1": "Médias das amostras",
  "chklbl2": "Somas das amostras",
  "chklbl3": "Desvios padrão das amostras",
  "help": {
    "title": "Exemplo da Distribuição F",
    "r_help": "help(rf, package=stats)",
    "body": "\n            ​​\n            <b>Descrição</b>\n            <br/>\n            Densidade, função de distribuição, função quantil e geração aleatória para a distribuição F com df1 e df2 graus de liberdade (e parâmetro de não centralidade opcional ncp).\n            <br/>\n            <b>Uso</b>\n            <br/>\n            <code>\n                df(x, df1, df2, ncp, log = FALSE)\n                <br/>\n                pf(q, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qf(p, df1, df2, ncp, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rf(n, df1, df2, ncp)\n                <br/>\n            </code>\n            <br/>\n            <b>Argumentos</b>\n            <br/>\n            <ul>\n                <li>x, q : vetor de quantis.</li>\n                \n                \n                <li>p : vetor de probabilidades.</li>\n                \n                \n                <li>n : número de observações. Se length(n) > 1, o comprimento é considerado como o número necessário.</li>\n                \n                \n                <li>df1, df2 : graus de liberdade. Inf é permitido.</li>\n                \n                \n                <li>ncp : parâmetro de não centralidade. Se omitido, assume-se a F central.</li>\n                \n                \n                <li>log, log.p : lógico; se TRUE, as probabilidades p são dadas como log(p).</li>\n                \n                \n                <li>lower.tail : lógico; se TRUE (padrão), as probabilidades são P[X ≤ x], caso contrário, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Detalhes</b>\n            <br/>\n            A distribuição F com df1 = n1 e df2 = n2 graus de liberdade tem densidade\n            <br/>\n            <code>f(x) = Γ((n1 + n2)/2) / (Γ(n1/2) Γ(n2/2)) (n1/n2)^(n1/2) x^(n1/2 - 1) (1 + (n1/n2) x)^-(n1 + n2)/2</code>\n            <br/>\n            para x > 0.\n            <br/>\n            É a distribuição da razão dos quadrados médios de n1 e n2 normais padrão independentes, e, portanto, da razão de duas variáveis qui-quadrado independentes, cada uma dividida por seus graus de liberdade. Como a razão de uma normal e a raiz quadrada média de m normais independentes tem uma distribuição t_m de Student, o quadrado de uma variável t_m tem uma distribuição F em 1 e m graus de liberdade.\n            <br/>\n            A distribuição F não central é novamente a razão dos quadrados médios de normais independentes de variância unitária, mas aquelas no numerador podem ter médias diferentes de zero e ncp é a soma dos quadrados das médias. Veja Qui-quadrado para mais detalhes sobre distribuições não centrais.\n            <br/>\n            <br/><b>Valor</b>\n            <br/>\n            df fornece a densidade, pf fornece a função de distribuição, qf fornece a função quantil, e rf gera desvios aleatórios.\n            <br/>\n            Argumentos inválidos resultarão em valor de retorno NaN, com um aviso.\n            <br/>\n            O comprimento do resultado é determinado por n para rf, e é o máximo dos comprimentos dos argumentos numéricos para as outras funções.\n            <br/>\n            Os argumentos numéricos além de n são reciclados para o comprimento do resultado. Apenas os primeiros elementos dos argumentos lógicos são usados.\n            <br/>\n            <br/><b>Nota</b>\n            <br/>\n            Fornecer ncp = 0 usa o algoritmo para a distribuição não central, que não é o mesmo algoritmo usado se ncp for omitido. Isso é para dar um comportamento consistente em casos extremos com valores de ncp muito próximos de zero.\n            <br/>\n            O código para ncp diferente de zero é principalmente destinado a ser usado para valores moderados de ncp: não será altamente preciso, especialmente nas caudas, para grandes valores."
  }
}