{
  "title": "Salvar Modelos em um arquivo",
  "navigation": "Salvar Modelos",
  "filterModels": "Filtrar modelos por classe",
  "modelSelection": "Selecione um ou mais modelo(s) para salvar",
  "importResp": "Selecione um arquivo para salvar um modelo",
  "label1": "NOTA: O modelo será salvo em um arquivo no caminho selecionado abaixo SOMENTE quando você executar o diálogo.",
  "levelOfInterest": "Quando a variável a ser prevista tem 2 níveis, especifique o nível de interesse. A matriz de confusão e as estatísticas relacionadas são exibidas com o nível de interesse especificado como referência",
  "label12": "Resultados do teste: Assim que um modelo for selecionado, realizaremos testes para ver se as variáveis dependentes especificadas no modelo estão disponíveis no conjunto de dados a ser pontuado. Os resultados serão exibidos aqui",
  "label2": "Salvar valores previstos e estatísticas de suporte.",
  "label3": "Previsões e probabilidades previstas, quando aplicável, são armazenadas no conjunto de dados sendo pontuado como novas variáveis com o prefixo abaixo",
  "label4": "**Para variáveis dependentes com 2 níveis, o 2º nível é tratado como o nível positivo. Veja Dados > Níveis de Fator > Reordenar Níveis Manualmente para alterar a ordem dos níveis de fator e reconstruir o modelo.",
  "conflevel": "Salvar intervalos de confiança para valores previstos individuais **(Válido apenas para modelos lineares (classe lm))",
  "roctable": "Mostrar tabela ROC (**Apenas para variáveis dependentes binárias)",
  "colname": "Especifique o prefixo do nome da coluna",
  "label5": "**Marcar a caixa acima acarretará uma penalidade de desempenho para grandes conjuntos de dados.",
  "level": "Especifique o nível de confiança",
  "confusioncheck": "Gerar Matriz de Confusão",
  "help": {
    "title": "Salvar Modelos",
    "r_help": "help(save, package='base')",
    "body": "\n    <b>Descrição</b></br>\n    Modelos selecionados serão salvos em um arquivo no formato de dados R (.RData extension)</br>\n    Você pode especificar um novo arquivo inserindo um nome ou selecionando um arquivo existente</br>\n    Se você selecionar um arquivo existente, ele será sobrescrito.</br>\n    Você deve clicar no botão de executar (o botão de triângulo horizontal) para executar o diálogo e salvar os objetos em um arquivo. \n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    save(model1, model2.., file =\"caminho do arquivo\")\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    model1, model2...: objetos de modelo ajustados\n    </li>\n    <li>\n    file:nome do arquivo com caminho, os objetos de modelo selecionados serão salvos neste arquivo RData\n    </li>\n    </ul>\n    <b>Pacote</b></br>\n    base</br>\n    <b>Ajuda</b></br>\n    Para ajuda detalhada, clique no ícone R no canto superior direito deste overlay de diálogo ou execute o seguinte comando help(save, package = 'base') na janela do editor R\n    </br>\n    "
  }
}