{
  "title": "Probabilidades de sobrevivência previstas",
  "label100": "Este diálogo gera a probabilidade de sobrevivência prevista em um ou mais \ntempos de acompanhamento especificados. \nOs seguintes requisitos devem ser atendidos.\n1. Você deve ter construído um modelo de regressão de Cox em um conjunto de dados onde 1=evento, 0=censura. \n2. O conjunto de dados para o qual você deseja gerar previsões deve ter todas as variáveis independentes usadas para criar \no modelo original. \n3. A escala de tempo usada para o tempo de acompanhamento deve corresponder à escala de tempo usada para criar o modelo original. \n4. Se você deseja previsões para uma única observação, precisa criar um novo conjunto de dados com essa observação.",
  "navigation": "Pontuação de Cox",
  "filterModels": "Filtrar modelos por classe",
  "modelSelection": "Selecione um modelo para pontuar um conjunto de dados",
  "label1": "Testes diagnósticos",
  "followUpTime": "Especifique um ou mais tempos de acompanhamento, por exemplo, 1200, 1250, as probabilidades de sobrevivência previstas serão geradas para cada tempo de acompanhamento",
  "levelOfInterest": "Quando a variável a ser prevista tem 2 níveis, especifique o nível de interesse. A matriz de confusão e as estatísticas relacionadas são exibidas com o nível de interesse especificado como referência",
  "label12": "Resultados do teste: Assim que um modelo é selecionado, executaremos testes para ver se as variáveis dependentes especificadas no modelo estão \ndisponíveis no conjunto de dados a ser pontuado. Os resultados serão exibidos aqui",
  "label2": "Salvar probabilidades de sobrevivência.",
  "label3": "As probabilidades previstas são armazenadas como novas variáveis com o prefixo abaixo adicionado ao nome da variável de evento original",
  "label4": "**Para variáveis dependentes com 2 níveis, o 2º nível é tratado como o nível positivo. Veja Dados > Níveis de Fator > Reordenar Níveis Manualmente para alterar a ordem dos níveis de fator e reconstruir o modelo.",
  "conflevel": "Salvar intervalos de confiança para valores previstos individuais **(Válido apenas para modelos lineares (classe lm))",
  "roctable": "Mostrar tabela ROC (**Apenas para variáveis dependentes binárias)",
  "colname": "Especifique o prefixo do nome da coluna",
  "label5": "**Marcar a caixa acima acarretará uma penalidade de desempenho para grandes conjuntos de dados.",
  "level": "Especifique o nível de confiança",
  "confusioncheck": "Gerar Matriz de Confusão",
  "help": {
    "title": "Pontuar Um Conjunto de Dados Usando Um Modelo",
    "r_help": "help(predict, package='stats')",
    "body": "\n    QUANDO MÚLTIPLOS PERÍODOS DE TEMPO SÃO ESPECIFICADOS, UMA MATRIZ DE CONFUSÃO E UMA CURVA ROC SÃO GERADAS APENAS PARA O PRIMEIRO PERÍODO DE TEMPO\n    <b>Descrição</b></br>\n    A pontuação do modelo faz o seguinte</br>\n    1. Pontua o conjunto de dados atual usando o modelo pré-construído selecionado. Armazena previsões com o intervalo de confiança especificado no conjunto de dados atual usando o prefixo especificado.</br>\n    2. Opcionalmente, cria uma matriz de confusão e uma curva ROC</br>\n    3. No caso em que você está pontuando um conjunto de dados de treinamento que contém a variável dependente/variável a ser prevista e a variável dependente tem 2 níveis, você tem a opção de selecionar o nível de referência/nível de interesse.<br/>\n    4. A matriz de confusão e as estatísticas relacionadas são criadas usando o nível de interesse especificado.<br/>\n    Veja detalhes sobre a função predict e a matriz de confusão abaixo\n    <br/>\n    <br/>\n    <b>Descrição</b></br>\n    predict é uma função genérica para fazer previsões usando o modelo selecionado. \n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    modelname: um objeto de modelo para o qual a previsão é desejada.\n    </li>\n    <li>\n    prefix: string de prefixo que será usada para criar novas variáveis contendo as previsões.\n    </li>\n    <li>\n    datasetname: é o conjunto de dados atual para pontuar e salvar previsões.\n    </li>\n    </ul>\n    <b>Detalhes</b></br>\n    Armazena previsões com o intervalo de confiança especificado no conjunto de dados atual usando o prefixo especificado.</br>\n    <b>Pacote</b></br>\n    stats</br>\n    <b>Ajuda</b></br>\n    Para ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando help(predict, package ='stats') na janela do editor R\n    </br>\n    </br>\n    <b>Descrição</b></br>\n    Cria uma matriz de confusão cruzando as classes observadas e previstas com estatísticas associadas. \n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    modelname : um objeto de modelo para o qual a matriz de confusão é desejada.\n    </li>\n    <li>\n    showCofusionMatrix:  lógico, se TRUE a matriz de confusão é gerada (se se aplica), se FALSE, a matriz de confusão não é gerada.\n    </li>\n    <li>\n    predictions : um objeto que é retornado como resultado da chamada predict().\n    </li>\n    <li>\n    datasetname: é o nome do conjunto de dados atual que queremos usar para fazer previsões.\n    </li>\n    </ul>\n    <b>Detalhes</b></br>\n    Exibe a matriz de confusão usando a função confusionMatrix no pacote caret</br>\n    <b>Pacote</b></br>\n    caret</br>\n    <b>Ajuda</b></br>\n    Para ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando help(confusionMatrix, package ='caret') na janela do editor R\n                "
  }
}