{
  "title": "Pontuar um Conjunto de Dados Usando um Modelo",
  "navigation": "Pontuação do Modelo",
  "filterModels": "Filtrar modelos por classe",
  "modelSelection": "Selecione um modelo para pontuar um conjunto de dados",
  "label1": "Testes diagnósticos",
  "levelOfInterest": "Quando a variável a ser prevista tem 2 níveis, especifique o nível de interesse. A matriz de confusão e as estatísticas relacionadas são exibidas com o nível de interesse especificado como referência",
  "label12": "Resultados do teste: Assim que um modelo é selecionado, realizaremos testes para ver se as variáveis dependentes especificadas no modelo estão disponíveis no conjunto de dados a ser pontuado. Os resultados serão exibidos aqui",
  "label2": "Salvar valores previstos e estatísticas de suporte.",
  "label3": "Previsões e probabilidades previstas, quando aplicável, são armazenadas no conjunto de dados sendo pontuado como novas variáveis com o prefixo abaixo",
  "label4": "**Para variáveis dependentes com 2 níveis, o 2º nível é tratado como o nível positivo. Veja Dados > Níveis de Fator > Reordenar Níveis Manualmente para alterar a ordem dos níveis de fator e reconstruir o modelo.",
  "conflevel": "Salvar intervalos de confiança e previsão para valores previstos individuais **(Válido apenas para modelos lineares (classe lm))",
  "rocCurves": "Mostrar curvas ROC (**Apenas para variáveis dependentes binárias)",
  "roctable": "Mostrar tabela ROC (**Apenas para variáveis dependentes binárias)",
  "saveRoctableToDataset": "Salvar tabela ROC em um conjunto de dados(**Apenas para variáveis dependentes binárias)",
  "label6": "**Marcar a caixa acima acarretará uma penalidade de desempenho para grandes conjuntos de dados.",
  "colname": "Especifique o prefixo do nome da coluna",
  "datasetNameForROC": "Insira um nome de conjunto de dados para armazenar os valores na tabela ROC.",
  "label5": "**Marcar a caixa acima acarretará uma penalidade de desempenho para grandes conjuntos de dados.",
  "level": "Especifique o nível de confiança",
  "confusioncheck": "Gerar Matriz de Confusão",
  "help": {
    "title": "Pontuar um Conjunto de Dados Usando um Modelo",
    "r_help": "ajuda(predict, pacote='stats')",
    "body": "\n    <b>Descrição</b></br>\n    A pontuação do modelo faz o seguinte</br>\n    1. Pontua o conjunto de dados atual usando o modelo pré-construído selecionado. Armazena previsões com o intervalo de confiança especificado no conjunto de dados atual usando o prefixo especificado.</br>\n    2. Opcionalmente cria uma matriz de confusão e uma curva ROC</br>\n    3. No caso de você estar pontuando um conjunto de dados de treinamento que contém a variável dependente/variável a ser prevista e a variável dependente tem 2 níveis, você tem a opção de selecionar o nível de referência/nível de interesse.<br/>\n    4. A matriz de confusão e as estatísticas relacionadas são criadas usando o nível de interesse especificado.<br/>\n    Veja detalhes sobre a função predict e a matriz de confusão abaixo\n    <br/>\n    <br/>\n    <b>Descrição</b></br>\n    predict é uma função genérica para fazer previsões usando o modelo selecionado. \n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    BSkyPredict(nomeModelo, prefixo, nomeConjuntoDados)\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    nomeModelo: um objeto de modelo para o qual a previsão é desejada.\n    </li>\n    <li>\n    prefixo: string de prefixo que será usada para criar novas variáveis contendo as previsões.\n    </li>\n    <li>\n    nomeConjuntoDados: é o conjunto de dados atual a ser pontuado e salvar previsões.\n    </li>\n    </ul>\n    <b>Detalhes</b></br>\n    Armazena previsões com o intervalo de confiança especificado no conjunto de dados atual usando o prefixo especificado.</br>\n    <b>Pacote</b></br>\n    stats</br>\n    <b>Ajuda</b></br>\n    Para ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando ajuda(predict, pacote ='stats') na janela do editor R\n    </br>\n    </br>\n    <b>Descrição</b></br>\n    Cria uma matriz de confusão cruzando as classes observadas e previstas com estatísticas associadas. \n    <br/>\n    <b>Uso</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(nomeModelo, mostrarMatrizConfusao, previsões, nomeConjuntoDados)\n    </code> <br/>\n    <b>Argumentos</b><br/>\n    <ul>\n    <li>\n    nomeModelo : um objeto de modelo para o qual a matriz de confusão é desejada.\n    </li>\n    <li>\n    mostrarMatrizConfusao: lógico, se VERDADEIRO a matriz de confusão é gerada (se se aplica), se FALSO, a matriz de confusão não é gerada.\n    </li>\n    <li>\n    previsões : um objeto que é retornado como resultado da chamada predict().\n    </li>\n    <li>\n    nomeConjuntoDados: é o nome do conjunto de dados atual que queremos usar para fazer previsões.\n    </li>\n    </ul>\n    <b>Detalhes</b></br>\n    Exibe a matriz de confusão usando a função confusionMatrix no pacote caret</br>\n    <b>Pacote</b></br>\n    caret</br>\n    <b>Ajuda</b></br>\n    Para ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando ajuda(confusionMatrix, pacote ='caret') na janela do editor R\n                "
  }
}