{
  "title": "SEM",
  "residualCovHeatmap": "Mapa de calor da desvio entre as matrizes de covariância observadas e implícitas pelo modelo",
  "observedCorr": "Correlações observadas",
  "modelImpliedCorr": "Correlações implícitas pelo modelo",
  "residualCorr": "Desvio entre as correlações observadas e ajustadas",
  "residualCorrHeatmap": "Mapa de calor do desvio entre as matrizes de correlações observadas e implícitas pelo modelo",
  "intercepts1": "Os interceptos das variáveis observadas",
  "intercepts": "Mostrar interceptos",
  "means": "Os interceptos/médias das variáveis latentes",
  "residuals1": "As variâncias residuais das variáveis observadas",
  "residual_covariances": "As covariâncias residuais das variáveis observadas",
  "lv_variances": "As variâncias (residuais) das variáveis latentes",
  "lv_covariances": "As covariâncias (residuais) das variáveis latentes",
  "regressions": "Todos os coeficientes de regressão no modelo",
  "loadings": "Cargas das variáveis observadas em suas respectivas variáveis latentes",
  "secOrdFacOptvar": "Fatores de segunda ordem",
  "EqConstraintsOptvar": "Restrições de igualdade",
  "mediationOptvar": "Mediação",
  "multiGrpOptions": "Opções de múltiplos grupos",
  "multiGrpSrc": "Variáveis de origem",
  "multiGrpDependent": "Variáveis de agrupamento",
  "modelname": "Digite um nome para o modelo",
  "mediationSrcCtrl": "Relações de origem",
  "mediationDestCtrl": "Parâmetros de mediação",
  "navigation": "SEM",
  "modelTermsDst": "Relação",
  "modelTerms": "Preditor",
  "modelTerms1": "Resultado",
  "sem": "Variáveis latentes",
  "sem_model_terms": "Parâmetros estruturais",
  "semSuppCtrl": "Fatores de primeira ordem",
  "sem2": "Fatores de segunda ordem",
  "label1": "Selecione um item das listas de preditor e resultado e clique no botão com uma seta para mover os itens selecionados para a lista de relações",
  "label2": "Selecione um item das listas de preditor e resultado e clique no botão com uma seta para mover os itens selecionados para a lista de relações",
  "label3": "Informação",
  "label4": "Saídas adicionais",
  "label5": "Covariâncias e correlações (veja ajuda)",
  "label6": "R-quadrado",
  "label7": "Salvar previsto",
  "label9": "Restrições",
  "coVarTerms": "1ª variável/fator",
  "coVarTerms1": "2ª variável/fator",
  "coVarDst": "Covariâncias selecionadas",
  "optionsCoVarTerms": "Covariâncias",
  "parameterizeFormula": "Mostrar rótulos de parâmetros",
  "modelOptions": "Opções do modelo",
  "method": "Selecione um método e abordagem (se aplicável)",
  "approach": "Abordagem de máxima verossimilhança",
  "missing": "Valores ausentes",
  "addFitMeasures": "Medidas de ajuste adicionais",
  "mardiaSkew": "Assimetria de Mardia (apenas casos completos)",
  "mardiaKurt": "Curtose de Mardia (apenas casos completos)",
  "observed": "Covariâncias observadas",
  "modelImplied": "Covariâncias implícitas pelo modelo (ajustadas)",
  "residual": "Desvio entre covariâncias observadas e ajustadas",
  "r2squareNone": "Nenhum",
  "r2squareEndo": "Endógeno",
  "factorScores": "Escores fatoriais (variáveis salvas com prefixo FS)",
  "indicators": "Indicadores (variáveis salvas com prefixo I)",
  "dependentVars": "Variáveis dependentes (variáveis salvas com prefixo DV)",
  "label8": "Índices de Modificação",
  "modIndices": "Índices de Modificação",
  "highLowIndices": "Ocultar índices baixos",
  "threshold": "Limite",
  "residuals": "Mostrar resíduos",
  "includeThresholds": "Mostrar limites",
  "edgeLabels": "Selecione opções para rótulos de arestas",
  "layout": "Opções para como os nós devem ser colocados",
  "rotate": "Posição das variáveis exógenas quando o layout tree ou tree2 é usado",
  "abbNodeLabels": "Número de caracteres para abreviar rótulos de nós",
  "abbEdgeLabels": "Número de caracteres para abreviar rótulos de arestas",
  "label101": "Caminhos",
  "label102": "Layout",
  "label103": "Nós",
  "semPlotOptions": "Opções de plotagem",
  "parameterOptions": "Opções de Parâmetro",
  "manifestShapes": "Formas manifestas",
  "latentShapes": "Formas latentes",
  "outputOptions": "Opções de saída",
  "label104": "Soluções padronizadas",
  "stdall": "As estimativas padronizadas são baseadas nas variâncias de ambas as variáveis observadas (contínuas) e latentes",
  "stdlv": "As estimativas padronizadas são baseadas nas variâncias das variáveis latentes (contínuas) apenas",
  "stdnox": "As estimativas padronizadas são baseadas nas variâncias de ambas as variáveis observadas (contínuas) e latentes, mas não nas variâncias de covariáveis exógenas",
  "label105": "Erros padrão",
  "label106": "Configurações de bootstrap",
  "automatic": "Automático",
  "standard": "Padrão",
  "robust": "Robusto",
  "pseudoML": "Pseudo ML",
  "bootstrap": "Bootstrap",
  "percentiles": "Percentis",
  "normal": "Normal",
  "adjustedBiasCorrected": "Corrigido por viés ajustado",
  "basic": "básico",
  "bootstratRep": "Repetições de bootstrap",
  "autoComputeCovar": "Calcular covariâncias automaticamente",
  "equalityConstraints1": "Relações",
  "sem3": "Restrições de igualdade",
  "help": {
    "title": "SEM",
    "r_help": "ajuda(sem, pacote=lavaan)",
    "body": "\n<b>Descrição</b></br>\nModelagem de Equações Estruturais (SEM) utiliza o pacote lavaan (0.6.16) para estimativa e trabalha com a formulação tradicional LISREL sem (em vez de Bentler-Weeks, RAMpath ou LISCOMP). A estimativa padrão é a máxima verossimilhança e usa NLMINB (quasi-Newton) utilizando a abordagem de verossimilhança normal (em vez do método de verossimilhança de Wishart). Os erros padrão são baseados em matrizes de informação esperadas (em vez de observadas), mas observadas, esperadas e desvios podem ser examinados usando mapas de calor. A triagem de normalidade (ou seja, assimetria e curtose de Mardia) são fornecidas. O usuário pode especificar modelos com e sem variáveis latentes contínuas (ou seja, modelagem de medição) em ordens inferiores e superiores, bem como modelos estruturais (ou seja, modelagem de caminhos). Restrições de igualdade, mediação e análise de múltiplos grupos são possíveis. Uma série de métodos de estimativa (por exemplo, variedades de máxima verossimilhança, mínimos quadrados e James-Stein) são suportados. Várias estatísticas de ajuste estão disponíveis mediante solicitação (por exemplo, GFI, aGFI, ECVI, etc.), e um pequeno subconjunto (ou seja, CFI, TLI, SRMR, RMSEA, AIC, BC) é fornecido por padrão. Intervalos de confiança utilizando várias funções de bootstrap também podem ser obtidos. Diagramas de modelos são produzidos usando semPlot (1.1.6).  \n</br>\n</br>\nQuando você clica em Covariâncias no diálogo, verá que a caixa de seleção, calcular covariâncias automaticamente está marcada. Você pode excluir uma covariância calculada automaticamente selecionando a covariância e clicando no ícone de lixo. Quando você exclui uma covariância, nós a suprimimos no código gerado. Se você quiser desfazer a supressão, deve adicioná-la manualmente novamente ou excluir e recriar a variável latente ou fator de ordem superior que faz parte da covariância que você deseja desfazer a supressão.\n</br>\n</br>\nQuando uma variável de agrupamento é selecionada (clique em Opções de Múltiplos Grupos no diálogo), você precisa selecionar a caixa de seleção \"Os interceptos das variáveis observadas\" e a caixa de seleção \"Os interceptos/médias das variáveis latentes\"\nApenas marcar a 1ª caixa de seleção lhe dá mais flexibilidade.\n</br>\nDescrição das funções de ajuste está abaixo</br>\n\"ML\" máxima verossimilhança</br>\n\"GLS\": mínimos quadrados generalizados. Apenas para dados completos.</br>\n\"WLS\": mínimos quadrados ponderados (às vezes chamado de estimativa ADF). Apenas para dados completos.</br>\n\"DWLS\": mínimos quadrados ponderados diagonalmente</br>\n\"ULS\": mínimos quadrados não ponderados</br>\n\"DLS\": mínimos quadrados ponderados distribucionalmente</br>\n\"PML\": máxima verossimilhança par a par</br>\nMuitos estimadores têm variantes robustas, o que significa que fornecem erros padrão robustos e uma estatística de teste escalada. Por exemplo, para o estimador de máxima verossimilhança, lavaan fornece as seguintes variantes robustas:</br>\n\"MLM\": estimativa de máxima verossimilhança com erros padrão robustos e uma estatística de teste escalada de Satorra-Bentler. Apenas para dados completos.</br>\n\"MLMVS\": estimativa de máxima verossimilhança com erros padrão robustos e uma estatística de teste ajustada por média e variância (também conhecida como abordagem Satterthwaite). Apenas para dados completos.</br>\n\"MLMV\": estimativa de máxima verossimilhança com erros padrão robustos e uma estatística de teste ajustada por média e variância (usando uma abordagem de deslocamento de escala). Apenas para dados completos.</br>\n\"MLF\": para estimativa de máxima verossimilhança com erros padrão baseados nas derivadas de primeira ordem, e uma estatística de teste convencional. Para dados completos e incompletos.</br>\n\"MLR\": estimativa de máxima verossimilhança com erros padrão robustos (Huber-White) e uma estatística de teste escalada que é (assintoticamente) igual à estatística de teste de Yuan-Bentler. Para dados completos e incompletos.</br>\n</br>\nTBD\nDocumentar a situação ao redor dos graus de liberdade basicamente quando uma variável de agrupamento é selecionada, você precisa selecionar a caixa de seleção \"Os interceptos das variáveis observadas\" e a caixa de seleção \"Os interceptos/médias das variáveis latentes\"\nApenas marcar a 1ª caixa de seleção lhe dá mais flexibilidade.\n<b>Pacote</b></br>\nlavaan;semPlot;semTools</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando no editor de sintaxe R</br>\najuda(sem, pacote='lavaan')\n\n\n"
  }
}