{
  "title": "Gráficos de Shewhart (I-MR Entre/Dentro)",
  "navigation": "Gráficos de Shewhart (I-MR Entre/Dentro)",
  "label2": "Duas opções - ou selecione uma variável para o gráfico (e uma variável de agrupamento, se necessário) ou selecione as variáveis no conjunto de dados para o gráfico se já estiverem agrupadas",
  "selectVariableRad": "Opção 1: Selecione uma variável do conjunto de dados que precisa ser agrupada",
  "variableSelcted": "Variável (dados observados) para o gráfico",
  "groupingVariable": "Variável de Agrupamento",
  "variableControlLimits": "Linhas a serem descartadas, se houver, antes do agrupamento para limites de controle da variável (ou seja, tamanhos de amostra da variável) e.g. especifique como 1:25 ou 1,4,5,7:12",
  "displayGroupsChk": "Exibir os agrupamentos na grade da interface do conjunto de dados",
  "selectDatasetRad": "Opção 2: Selecione as variáveis do Conjunto de Dados se já estiverem agrupadas",
  "variablelistSelcted": "Selecione uma ou mais variáveis agrupadas (dados observados) para o gráfico",
  "showMRChartChk": "Mostrar o gráfico MR das médias dos subgrupos",
  "printStatChk": "Imprimir estatísticas além dos gráficos",
  "printObjectSummaryChk": "Imprimir resumo do objeto QCC",
  "printTestSummaryChk": "Imprimir resumo dos testes para causas especiais",
  "printTestDetailChk": "Imprimir detalhes dos testes para causas especiais",
  "markTestNumberChk": "Marcar o Número do Teste no gráfico (apenas o primeiro número do teste será marcado se mais de um teste for encontrado como violado por um ponto de dados)",
  "rowsTobeUsed": "Linhas Agrupadas a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedAsNewData": "Novos Dados - Linhas agrupadas a serem usadas como Novos Dados para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12) - novos dados para plotar, mas não incluídos nos cálculos",
  "additionalPhasesLabel": "Especifique dados para Gráfico de fases adicionais (limitado a um máximo de 10 fases para ser prático para plotar em um único gráfico)",
  "rowsTobeUsedPhase2": "Linhas Agrupadas da Fase 2 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedPhase3": "Linhas Agrupadas da Fase 3 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedPhase4": "Linhas Agrupadas da Fase 4 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedPhase5": "Linhas Agrupadas da Fase 5 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedPhase6": "Linhas Agrupadas da Fase 6 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedPhase7": "Linhas Agrupadas da Fase 7 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedPhase8": "Linhas Agrupadas da Fase 8 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedPhase9": "Linhas Agrupadas da Fase 9 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "rowsTobeUsedPhase10": "Linhas Agrupadas da Fase 10 a serem usadas para o Gráfico (e.g. especifique como 1:25 ou 1,4,5,7:12)",
  "phaseNames": "Especifique os nomes das fases (separados por vírgula) para um gráfico multiphasico - os nomes padrão das fases são Fase 1, Fase 2, ...",
  "nsigmas": "Sigma - número de sigmas a serem usados para calcular limites de controle. É ignorado quando o argumento confidence.level é fornecido",
  "confidence_level": "Nível de Confiança - valor entre 0 e 1 especificando o nível de confiança dos limites de probabilidade calculados",
  "sdWarnLimits": "Adicionar linhas de limite adicionais (separadas por vírgula) no gráfico em desvios padrão específicos (e.g. 1.5, 2)",
  "digits": "Dígitos - número de dígitos a serem exibidos",
  "SStddev": "Método de desvio padrão a ser usado para o gráfico 'Dentro' S subjacente",
  "lower": "LSL - valor numérico do limite de especificação inferior para plotar uma linha LSL",
  "upper": "USL - valor numérico do limite de especificação superior para plotar uma linha USL",
  "addlSpecLinesBetween": "Adicionar linhas de especificação adicionais (separadas por vírgula) no gráfico I-MR Entre (e.g. 73.98, 74.01, 74.03)",
  "addlSpecLinesLabelBetween": "Rótulo para as linhas de especificação adicionais (o padrão é Spec)",
  "addlSpecLinesMR": "Adicionar linhas de especificação adicionais (separadas por vírgula) no gráfico MR (e.g. 0.02, 0.04, 0.06)",
  "addlSpecLinesLabelMR": "Rótulo para as linhas de especificação adicionais (o padrão é Spec)",
  "addlSpecLinesWithin": "Adicionar linhas de especificação adicionais (separadas por vírgula) no gráfico I-MR Dentro (e.g. 0.02, 0.04, 0.06)",
  "addlSpecLinesLabelWithin": "Rótulo para as linhas de especificação adicionais (o padrão é Spec)",
  "performTestLabel": "Realizar testes selecionados para causas especiais",
  "test1Chk": "Realizar teste 1",
  "test2Chk": "Realizar teste 2",
  "test3Chk": "Realizar teste 3",
  "test4Chk": "Realizar teste 4",
  "test5Chk": "Realizar teste 5",
  "test6Chk": "Realizar teste 6",
  "test7Chk": "Realizar teste 7",
  "test8Chk": "Realizar teste 8",
  "test1": "Um ponto mais do que Kσ da linha central (padrão 3)",
  "test2": "K pontos em sequência do mesmo lado da linha central (padrão 9)",
  "test3": "K pontos em sequência, todos aumentando ou todos diminuindo (padrão 6)",
  "test4": "K pontos em sequência, alternando para cima e para baixo (padrão 14)",
  "test5": "K de K+1 pontos mais do que 2σ da linha central do mesmo lado (padrão 2 de 2+1)",
  "test6": "K de K+1 pontos mais do que 1σ da linha central do mesmo lado (padrão 4 de 4+1)",
  "test7": "K pontos em sequência dentro de 1σ da linha central de ambos os lados (padrão 15)",
  "test8": "K pontos em sequência mais do que 1σ da linha central de ambos os lados (padrão 8)",
  "sigmaSymbol": "Se o símbolo sigma 'σ' não for impresso corretamente na saída, especifique um caractere ou string, e.g. s ou sigma em lugar do símbolo σ",
  "help": {
    "title": "Gráficos de Shewhart (Gráficos I-MR Entre/Dentro)",
    "r_help": "ajuda(qcc, pacote = qcc)",
    "body": "\n\t\t\t\t<b>Descrição</b></br>\n\t\t\t\tFunção qcc para realizar controle de qualidade estatística e plotar gráficos de Shewhart\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara a ajuda detalhada - use R ajuda(qcc, pacote = qcc)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPara tentar isso, você pode carregar o conjunto de dados chamado pistonrings do pacote qcc com o menu Carregar Conjunto de Dados selecionando o pacote qcc e, em seguida, selecionar o conjunto de dados pistonrings\n\t\t\t\t<br/>\n\t\t\t\tEscolha a opção 1, diâmetro para variável (observado..), amostra para variável de Agrupamento, clique em executar\n\t\t\t\t<br/>\n\t\t\t\tAlém disso, digite 1:20 nas linhas agrupadas a serem usadas, clique em executar \n\t\t\t\t<br/>\n\t\t\t\tPara plotar um gráfico com múltiplas fases\n\t\t\t\t<br/>\n\t\t\t\tDigite 25:30 nas linhas agrupadas da Fase 2\n\t\t\t\t<br/>\n\t\t\t\tDigite 31:38 nas linhas agrupadas da Fase 3\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSiga o tutorial do qcc em https://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html\n\t\t\t\t<br/>\n\t\t\t"
  }
}