{
  "title": "Modelo Rasch Simples",
  "navigation": "Modelo Rasch Simples",
  "modelname": "Insira o nome do modelo",
  "destinationvars": "Variável(is) de destino",
  "estimationlbl": "Estimativa",
  "rad1": "Usar estimativa CML",
  "chk1": "Calcular erro padronizado",
  "chk2": "Normalizar parâmetros para somar (0)",
  "rad2": "Usar estimativa MML",
  "help": {
    "title": "Modelo Rasch Simples",
    "r_help": "help(RM, package='eRm')",
    "body": "\n            <b>Descrição</b>\n            <br/>\n            Cria um modelo Rasch simples usando estimativa CML ou MML.\n            <br/><br/>\n            Para estimativa CML, invocamos eRm::RM para calcular as estimativas de parâmetros de um modelo Rasch para respostas de itens binários usando estimativa CML.\n            <br/><br/>\n            Para estimativa MML, invocamos TAM::tam.mml para gerar estimativas de parâmetros de um modelo unidimensional \n            <br/><br/>\n            <b>Uso para estimativa CML</b>\n            <br/>\n            <code>\n            eRm::RM(X, se = TRUE, sum0 = TRUE, etaStart) \n            </code>\n            <br/><br/>\n            <b>Argumentos</b>\n            <br/>          \n            <ul>\n            <li>\n            X:  Matriz de dados de entrada 0/1 ou quadro de dados; as linhas representam indivíduos, as colunas representam itens. Valores ausentes são inseridos como NA.\n            </li>\n            <li>\n            W:  Matriz de design para o modelo Rasch. Se omitido, a função calculará W automaticamente.\n            </li>\n            <li>\n            se: Se TRUE, os erros padrão são calculados.\n            </li>\n            <li>\n            sum0: Se TRUE, os parâmetros são normalizados para somar 0 especificando um W apropriado. Se FALSE, o primeiro parâmetro é restrito a 0.\n            </li>\n            <li>\n            etaStart: Um vetor de valores iniciais para os parâmetros eta pode ser especificado. Se ausente, o vetor 0 é usado.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>Uso para estimativa MML</b>\n            <br/>\n            <code>\n            tam.mml(resp,verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Argumentos</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Quadro de dados com respostas de itens poliatômicos k=0,...,K. Respostas ausentes devem ser declaradas como NA.\n            </li>\n            <li>\n            irtmodel: Para inclinações de itens fixas (em tam.mml) as opções incluem PCM (modelo de crédito parcial), PCM2 (modelo de crédito parcial com parametrização ConQuest 'item+item*step' e RSM (modelo de escala de classificação; a parametrização ConQuest 'item+step'). \n            <br/>\n            Para inclinações de itens estimadas (disponível apenas em tam.mml.2pl) as opções são 2PL (todas as inclinações das categorias de itens são estimadas; Modelo de Resposta de Item Nominal), GPCM (modelo de crédito parcial generalizado em que cada item recebe um e apenas um parâmetro de inclinação por dimensão) e 2PL.groups (subconjuntos de itens recebem as mesmas estimativas de inclinação de itens) e uma matriz de design E sobre as inclinações de itens no modelo de crédito parcial generalizado (GPCM.design, veja Exemplos). Note que as inclinações de itens não podem ser estimadas com designs facetados usando a função tam.mml.mfr. No entanto, é fácil usar matrizes de design pré-especificadas e aplicar algumas restrições ao tam.mml.2pl\n            </li>\n            <li>\n            verbose: Lógico indicando se a saída deve ser impressa durante as iterações. \n            </li>\n            </ul>\n            <br/><br/>\n            <b>Pacotes</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>            \n            <b>Ajuda</b>\n            <br/>\n            help(RM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
  }
}