{
  "title": "Divisão Estratificada",
  "navigation": "Divisão Estratificada",
  "traindataset": "Insira o nome do conjunto de dados de treinamento",
  "testdataset": "Insira o nome do conjunto de dados de teste",
  "split": "Insira a porcentagem de divisão",
  "seed": "Definir semente",
  "dependent": "Variável para construir amostras estratificadas",
  "help": {
    "title": "Divisão Estratificada",
    "r_help": "help(createDataPartition, package=\"caret\")",
    "body": "\n<b>Descrição</b></br>\nUma série de partições de teste/treinamento são criadas usando createDataPartition enquanto createResample cria uma ou mais amostras bootstrap. createFolds divide os dados em k grupos enquanto createTimeSlices cria uma divisão de validação cruzada para dados de séries. groupKFold divide os dados com base em um fator de agrupamento.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \ncreateDataPartition(y, times = 1, p = 0.5, list = TRUE, groups = min(5,length(y)))<br/>\ncreateFolds(y, k = 10, list = TRUE, returnTrain = FALSE)<br/>\ncreateTimeSlices(y, initialWindow, horizon = 1, fixedWindow = TRUE,skip = 0)<br/>\ngroupKFold(group, k = length(unique(group)))<br/>\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\ny: um vetor de resultados. Para createTimeSlices, estes devem estar em ordem cronológica.\n</li>\n<li>\ntimes: o número de partições a serem criadas\n</li>\n<li>\np: a porcentagem de dados que vai para o treinamento\n</li>\n<li>\nlist: lógico - os resultados devem estar em uma lista (TRUE) ou em uma matriz com o número de linhas igual a floor(p * length(y)) e colunas de times.\n</li>\n<li>\ngroups: para y numérico, o número de quebras nos quantis (veja abaixo)\n</li>\n<li>\nk: um inteiro para o número de dobras.\n</li>\n<li>\nreturnTrain: um lógico. Quando verdadeiro, os valores retornados são as posições das amostras correspondentes aos dados usados durante o treinamento. Este argumento só funciona em conjunto com list = TRUE\n</li>\n<li>\ninitialWindow: O número inicial de valores consecutivos em cada amostra de conjunto de treinamento\n</li>\n<li>\nhorizon: o número de valores consecutivos na amostra do conjunto de teste\n</li>\n<li>\nfixedWindow: lógico, se FALSO, todas as amostras de treinamento começam em 1\n</li>\n<li>\nskip: inteiro, quantas (se houver) reamostragens pular para reduzir a quantidade total\n</li>\n<li>\ngroup: um vetor de grupos cuja extensão corresponde ao número de linhas no conjunto de dados geral.\n</li>\n</ul>\n<b>Detalhes</b></br>\nPara amostras bootstrap, a amostragem aleatória simples é usada.\nPara outras divisões de dados, a amostragem aleatória é feita dentro dos níveis de y quando y é um fator na tentativa de equilibrar as distribuições de classe dentro das divisões.</br>\nPara y numérico, a amostra é dividida em seções de grupos com base em percentis e a amostragem é feita dentro desses subgrupos. Para createDataPartition, o número de percentis é definido pelo argumento groups. Para createFolds e createMultiFolds, o número de grupos é definido dinamicamente com base no tamanho da amostra e k. Para tamanhos de amostra menores, essas duas funções podem não fazer divisão estratificada e, na melhor das hipóteses, dividirão os dados em quartis.</br>\nAlém disso, para createDataPartition, tamanhos de classe muito pequenos (<= 3) podem não aparecer tanto nos dados de treinamento quanto nos dados de teste.</br>\nPara validação cruzada k-fold múltipla, dobras completamente independentes são criadas. Os nomes dos objetos da lista indicarão a associação da dobra usando o padrão \"Foldi.Repj\" significando a i-ésima seção (de k) do j-ésimo conjunto de validação cruzada (de times). Note que esta função chama createFolds com list = TRUE e returnTrain = TRUE.</br>\nHyndman e Athanasopoulos (2013) discutem técnicas de origem de previsão em movimento que movem os conjuntos de treinamento e teste no tempo. createTimeSlices pode criar os índices para esse tipo de divisão.</br>\nPara validação cruzada k-fold de grupo, os dados são divididos de forma que nenhum grupo esteja contido tanto nos conjuntos de modelagem quanto nos conjuntos de retenção. Um ou mais grupos podem ser deixados de fora, dependendo do valor de k.</br>\n<b>Valor</b><br/>\nUma lista ou matriz de inteiros de posição de linha correspondentes aos dados de treinamento. Para createTimeSlices, as subsamplas são nomeadas pelo índice final de cada subsample de treinamento.</br>\n<b>Pacote</b></br>\ncaret</br>\nklaR</br>\n<b>Ajuda</b></br>\nhelp(createDataPartition, package=\"caret\")\n        "
  }
}