{
  "title": "Correspondência de Sujeitos",
  "navigation": "Correspondência de Sujeitos",
  "newdatasetnamelabel": "Nome do conjunto de dados para armazenar os dados correspondidos",
  "groupvarlabel": "Variável caso/controle (controle=valor mais baixo, caso=valor mais alto)",
  "notelabel": "Nota: Você deve especificar pelo menos uma variável para variáveis exatas ou de caliper",
  "exactvarslabel": "Variáveis para correspondência exata",
  "calipervarslabel": "Variáveis para correspondência de caliper",
  "caliperslabel": "Especifique calipers na ordem das variáveis de caliper separadas por vírgulas, por exemplo, 5, 2",
  "idvarlabel": "Variável de ID do sujeito",
  "ratiolabel": "Número de controles por caso",
  "help": {
    "title": "Correspondência de Sujeitos",
    "r_help": "ajuda(matchit, pacote = 'MatchIt')",
    "body": "\n            Realiza a correspondência de sujeitos por vizinho mais próximo, onde um conjunto de casos é correspondido a 1 ou mais controles. Isso é apropriado para estudos caso/controle e estudos de coorte correspondidos.\n\t\t\t<br/><br/>\n\t\t\tVariáveis para as quais os valores devem corresponder exatamente e valores correspondendo dentro de calipers numéricos são suportados.\n\t\t\tA correspondência é feita sem reposição (cada sujeito pode ser correspondido apenas uma vez) e os controles entre os potenciais controles serão selecionados de acordo com a ordem dos dados para cada caso.\n\t\t\t<br/><br/>\n\t\t\tO conjunto de dados de saída conterá os dados originais e duas variáveis adicionais: 1) subclass: uma variável identificando o conjunto correspondido, e 2) weights: uma variável de peso de caso correspondente que pode ser usada em análises subsequentes, se desejado.\n\t\t\t<br/><br/>\n\t\t\t<b>Nome do conjunto de dados para armazenar os dados correspondidos:</b>\n\t\t\t<br/>Nome do conjunto de dados de saída contendo os conjuntos de sujeitos correspondidos.\n\t\t\t<br/><br/>\n\t\t\t<b>Variável caso/controle (controle=valor mais baixo, caso=valor mais alto):</b>\n\t\t\t<br/>Nome da variável que indica casos e controles. Pode ser numérica, fator ou caractere.  \n\t\t\tSe for uma variável numérica, isso deve ser codificado como 0=controle, 1=caso. Se for uma variável fator, o nível de ordem mais baixo será os controles e o nível de ordem mais alto será os casos.  \n\t\t\tSe for uma variável de caractere, o valor de ordem mais baixo (por ordem alfabética) será os controles, e o valor de ordem mais alto (por ordem alfabética) será os casos.\n\t\t\tPortanto, para ser mais seguro, recomendamos codificar como 0=controle, 1=caso.\n\t\t\t</br><br/>\n\t\t\t<b>Variáveis para correspondência exata:</b>\n\t\t\t<br/>Especifique as variáveis para as quais você deseja que os conjuntos caso/controle sejam correspondidos exatamente.  \n\t\t\tIsso significa que os casos e controles em um conjunto correspondido têm exatamente os mesmos valores para essas variáveis. Essas podem ser variáveis de caractere, data, numéricas, fator ou ordinais.\n\t\t\t<br/><br/>\n\t\t\t<b>Variáveis para correspondência de caliper:</b>\n\t\t\t<br/>Especifique as variáveis para as quais você deseja que os conjuntos caso/controle sejam correspondidos em valores de caliper numéricos. Os controles estarão dentro de uma largura de caliper especificada para cada uma dessas variáveis.\n\t\t\tEssas podem ser variáveis numéricas ou de data. Cada variável de caliper deve ter um valor de caliper especificado.\n\t\t\t<br/><br/>\n\t\t\t<b>Especifique calipers na ordem das variáveis de caliper separadas por vírgulas:</b>\n\t\t\t<br/>Especifique os valores de caliper numéricos para cada uma das variáveis de caliper, na ordem das variáveis de caliper.  \n\t\t\tPor exemplo, se a idade (em anos) foi especificada com um caliper de 5, isso significa que os controles devem estar dentro de +/- 5 anos de seu caso correspondente.\n\t\t\tCada variável de caliper deve ter um valor de caliper especificado. Se não houver variáveis de caliper, este campo deve estar vazio.\n\t\t\t<br/><br/>\n\t\t\t<b>Número de controles por caso:</b>\n\t\t\t<br/>Este é o número máximo de controles que serão correspondidos a cada caso. Alguns conjuntos correspondidos podem ter menos do que esse valor se correspondências adequadas não puderem ser identificadas.\n            <br/><br/>\n            <b>Pacotes R necessários:</b> dplyr, tidyr, MatchIt\n"
  }
}