{
  "title": "Teste de Variância, teste F",
  "navigation": "Teste de Variância, duas amostras",
  "tvarbox1": "Variável de resposta",
  "tvarbox2": "Variável fator, com apenas dois níveis",
  "label1": "Hipótese alternativa",
  "test1": "Diferença != 1",
  "test2": "Diferença > 1",
  "test3": "Diferença < 1",
  "txtbox1": "Nível de confiança",
  "help": {
    "title": "Teste de Variância, teste F",
    "r_help": "help(var.test, package=stats)",
    "body": "\n                <b>Descrição</b></br>\n                Realiza um teste F para comparar as variâncias de duas amostras de populações normais.\n                <br/>\n                <b>Uso</b>\n                <br/>\n                <code> \n                var.test(x, ...)</br>\n                ## Método S3 padrão:</br>\n                var.test(x, y, ratio = 1,\n                         alternative = c(\"two.sided\", \"less\", \"greater\"),\n                         conf.level = 0.95, ...)</br>\n                ## Método S3 para a classe 'formula'</br>\n                var.test(formula, data, subset, na.action, ...)\n                </code> <br/>\n                <b>Argumentos</b><br/>\n                <ul>\n                <li>\n                x, y: vetores numéricos de valores de dados, ou objetos de modelo linear ajustados (herdando da classe \"lm\").\n                </li>\n                <li>\n                ratio: a razão hipotetizada das variâncias populacionais de x e y.\n                </li>\n                <li>\n                alternative: uma string de caracteres especificando a hipótese alternativa, deve ser uma das \"two.sided\" (padrão), \"greater\" ou \"less\". Você pode especificar apenas a letra inicial.\n                </li>\n                <li>\n                conf.level: nível de confiança para o intervalo de confiança retornado.\n                </li>\n                <li>\n                formula: uma fórmula da forma lhs ~ rhs onde lhs é uma variável numérica que fornece os valores dos dados e rhs um fator com dois níveis que fornece os grupos correspondentes.\n                </li>\n                <li>\n                data: uma matriz ou data frame opcional (ou similar: veja model.frame) contendo as variáveis na fórmula formula. Por padrão, as variáveis são retiradas do ambiente(formula).\n                </li>\n                <li>\n                subset: um vetor opcional especificando um subconjunto de observações a serem usadas.\n                </li>\n                <li>\n                na.action: uma função que indica o que deve acontecer quando os dados contêm NAs. O padrão é getOption(\"na.action\").\n                </li>\n                <li>\n                ...: argumentos adicionais a serem passados para ou de métodos.\n                </li>\n                </ul>\n                <b>Detalhes</b></br>\n                A hipótese nula é que a razão das variâncias das populações das quais x e y foram extraídos, ou nos dados aos quais os modelos lineares x e y foram ajustados, é igual a ratio.</br>\n                <b>Valor</b><br/>\n                Uma lista com a classe \"htest\" contendo os seguintes componentes:\n                statistic: o valor da estatística do teste F.\n                parameter: os graus de liberdade da distribuição F da estatística do teste.\n                p.value: o valor p do teste.\n                conf.int: um intervalo de confiança para a razão das variâncias populacionais.\n                estimate: a razão das variâncias amostrais de x e y.\n                null.value: a razão das variâncias populacionais sob a hipótese nula.\n                alternative: uma string de caracteres descrevendo a hipótese alternativa.\n                method: a string de caracteres \"Teste F para comparar duas variâncias\".\n                data.name: uma string de caracteres dando os nomes dos dados.\n                <b>Exemplos</b><br/>\n                <code>\n                Dataframe <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))<br/>\n                Result_Variance_Test = var.test( Age ~Gender,alternative='two.sided',conf.level=0.95,data=Dataframe )\n                </code> <br/>\n                <b>Pacote</b></br>\n                stats</br>\n                <b>Ajuda</b></br>\n                help(var.test, package=stats)\n    "
  }
}