{
  "title": "Fatores de Inflação de Variância",
  "navigation": "FIV",
  "modelselector1": "Selecione um modelo de uma das seguintes classes (classe entre parênteses) Modelo linear (lm), Modelos lineares generalizados (glm), Regressão Logística ou Probit Ordenada (polr), Modelos Multinomial Log-Linear (multinom), Sobrevivência (coxph)",
  "help": {
    "title": "Fatores de Inflação de Variância",
    "r_help": "help(vif, package='car')",
    "body": "\n                <b>Descrição</b></br>\nCalcula fatores de inflação de variância e fatores de inflação de variância generalizados para modelos lineares, lineares generalizados e outros modelos.\n<br/>\n<b>Uso</b>\n<br/>\n<code> \nvif(mod, ...)\n## Método S3 padrão:\nvif(mod, ...)\n## Método S3 para a classe 'merMod'\nvif(mod, ...)\n</code> <br/>\n<b>Argumentos</b><br/>\n<ul>\n<li>\nmod: para o método padrão, um objeto que responde a coef, vcov e model.matrix, como um objeto lm ou glm.\n</li>\n<li>\n... não utilizado.\n</li>\n</ul>\n<b>Detalhes</b></br>\nSe todos os termos em um modelo linear não ponderado tiverem 1 df, então os fatores de inflação de variância usuais são calculados.</br>\nSe algum termo em um modelo linear não ponderado tiver mais de 1 df, então fatores de inflação de variância generalizados (Fox e Monette, 1992) são calculados. Estes são interpretáveis como a inflação no tamanho da elipse ou elipsoide de confiança para os coeficientes do termo em comparação com o que seria obtido para dados ortogonais.</br>\nOs vifs generalizados são invariantes em relação à codificação dos termos no modelo (desde que o subespaço das colunas da matriz do modelo referente a cada termo seja invariante). Para ajustar a dimensão do elipsoide de confiança, a função também imprime GVIF^[1/(2*df)] onde df é o número de graus de liberdade associado ao termo.</br>\nAtravés de uma generalização adicional, a implementação aqui é aplicável também a outros tipos de modelos, em particular modelos lineares ponderados, modelos lineares generalizados e modelos de efeitos mistos.</br>\n<b>Valor</b><br/>\nUm vetor de vifs, ou uma matriz contendo uma linha para cada termo no modelo, e colunas para o GVIF, df e GVIF^[1/(2*df)].<br/>\n<b>Exemplos</b><br/>\n<code> \n## Um exemplo ridículo...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>Pacote</b></br>\ncar</br>\n<b>Ajuda</b></br>\nPara ajuda detalhada, clique no ícone R no canto superior direito deste diálogo ou execute o seguinte comando no editor de sintaxe R help(vif, package=\"car\")\n                "
  }
}