{
  "title": "Ajouter une variable de numéro d'échantillon recalibrée",
  "navigation": "Recalibrer le numéro d'échantillon",
  "sampleVariableToCalibrate": "Sélectionnez la variable d'échantillon à recalibrer",
  "sampleVarName": "Spécifiez le nom de la nouvelle variable d'échantillon recalibrée à ajouter (par exemple, sample_recal). Si le nom de la variable est déjà présent dans l'ensemble de données, il sera mis à jour",
  "help": {
    "title": "Ajouter une variable de numéro d'échantillon recalibrée",
    "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tOrganiser des sous-groupes (c'est-à-dire groupe d'échantillons) pour l'analyse de la capacité de processus et d'autres analyses de sous-groupes\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tL'analyse, telle que l'analyse de la capacité de processus, suppose que les données sont saisies dans l'ordre dans lequel elles ont été collectées (ordre chronologique). Cela signifie que toutes les observations du même sous-groupe doivent apparaître dans des lignes consécutives de l'ensemble de données. Une colonne d'ID de sous-groupe est généralement utilisée pour définir quelles lignes appartiennent au même sous-groupe.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSi cette condition n'est pas remplie (par exemple, si les lignes du même sous-groupe sont dispersées dans l'ensemble de données et non placées les unes à côté des autres), alors les ID de sous-groupe doivent être recalibrés.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa recalibration signifie :\n\t\t\t\t<br/>\n\t\t\t\tUn nouveau numéro de sous-groupe est attribué chaque fois que l'ID de sous-groupe change d'une ligne à l'autre.\n\t\t\t\t<br/>\n\t\t\t\tSi le même ID de sous-groupe réapparaît plus tard mais n'est pas adjacent à sa précédente occurrence, il sera traité comme un nouveau sous-groupe.\n\t\t\t\t<br/>\n\t\t\t\tEn d'autres termes, seules les valeurs identiques qui apparaissent les unes à côté des autres sont considérées comme faisant partie du même sous-groupe. Les valeurs identiques séparées par d'autres sous-groupes seront divisées en sous-groupes séparés lors de la recalibration.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tLa variable de numéro d'échantillon recalibrée dans l'ensemble de données est nécessaire pour effectuer de nombreuses analyses, par exemple, la capacité de processus, les graphiques de Shewhart comme xbar, R, S, etc.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t"
  }
}