{
  "title": "ANOVA, N voies",
  "modelname": "Entrez un nom pour le modèle",
  "label3": "Taille de l'effet",
  "confInterval": "Intervalle de confiance pour les tailles d'effet",
  "effectsizes": "Sélectionnez la mesure de la taille de l'effet",
  "navigation": "ANOVA, N voies",
  "target": "Variable cible (numérique/échelle)",
  "dest": "Spécifiez un maximum de 2 variables factorielles",
  "options": "Options",
  "type": "Sélectionnez le type I/II/III des sommes des carrés",
  "levene": "Test de Levene pour l'homogénéité des variances",
  "label1": "Post-hoc",
  "combon": "Comparer les moyennes en utilisant :",
  "adjust": "Méthode d'ajustement des p-values",
  "compactly": "Comparer les moyennes de manière compacte",
  "alpha": "Entrez une valeur d'alpha :",
  "label2": "Graphiques",
  "label4": "Graphiques",
  "diag": "Graphiques diagnostiques",
  "plot1": "Tracer toutes les comparaisons",
  "horizontalAxis": "Lignes séparées",
  "separateLines": "Axe horizontal",
  "separatePlots": "Graphiques séparés",
  "labelSaveResiduals": "Enregistrer les statistiques du modèle dans le jeu de données",
  "residuals": "Les résidus sont enregistrés avec un nom de variable résidus avec un préfixe optionnel",
  "stuResiduals": "Les résidus studentisés sont enregistrés avec un nom de variable resStudentized avec un préfixe optionnel",
  "fittedVals": "Les valeurs ajustées sont enregistrées avec un nom de variable fitted avec un préfixe optionnel",
  "prefixForSavedStatistics": "Entrez éventuellement un préfixe pour les valeurs enregistrées ci-dessus, le préfixe est ajouté au(x) nom(s) de variable(s) ci-dessus",
  "help": {
    "title": "ANOVA, N voies",
    "r_help": "help(aov, package='stats')",
    "body": "\nREMARQUE :</br>\n1. Pour obtenir toutes les moyennes marginales et les post-hocs, vous devez construire une formule avec les effets principaux et tous les termes d'interaction dans le modèle.</br> \nDonc, si vous essayez d'analyser une interaction à 3 voies, vous devez spécifier :</br>\nA + B + C + A:B + B:C + A:C + A:B:C</br>\nSi vous spécifiez plutôt A*B*C, vous obtiendrez le tableau ANOVA complet, vous n'obtiendrez PAS les moyennes marginales estimées et les post-hocs pour toutes les interactions.</br>\n2. Les moyennes marginales estimées ET POST-HOCS sont calculées pour tous les effets principaux et les INTERACTIONS SPÉCIFIÉES.</br>\n<b>Description</b></br>\nAjuste un modèle d'analyse de variance, affiche les sommes des carrés de type I, II, III, affiche les moyennes marginales et les contrastes (en utilisant les moyennes marginales).</br> \nEffectue éventuellement le test de Levene pour l'homogénéité de la variance entre les groupes et trace des graphiques.</br>\nLe test de Levene est effectué pour tous les effets principaux.</br></br>\nConstruit et résume un modèle anova en utilisant la formule spécifiée avec la fonction aov.</br>\n<b>Paquet</b></br>\nstats</br>\n<b>Aide</b></br>\nhelp(aov, package='stats')</br></br>\nAffiche le tableau Anova avec les sommes des carrés de type I/II/III.</br>\nUtilise la fonction Anova dans le paquet car pour les sommes des carrés de type II, III, la fonction anova dans le paquet stats pour le type I. Lors du calcul des sommes des carrés de type III, des contrastes appropriés (contr.sum) sont définis pour les variables factorielles.</br>\n<b>Paquet</b></br>\ncar</br>\n<b>Aide</b></br>\nhelp(Anova, package='car')</br></br>\nAffiche les moyennes marginales estimées.</br>\n<b>Paquet</b></br>\nemmeans</br>\n<b>Aide</b></br>\nhelp(emmeans, package='car')</br></br>\nCalcule le test de Levene pour l'homogénéité de la variance entre les groupes. \n<b>Paquet</b></br>\ncar</br>\n<b>Aide</b></br>\nhelp(leveneTest, package='car')\n"
  }
}