{
  "title": "ANOVA, unidirectionnelle avec blocs aléatoires",
  "navigation": "ANOVA, 1 voie (blocs aléatoires)",
  "tvarbox1": "Variable de réponse",
  "tvarbox2": "Effet fixe",
  "blockVar": "Variable(s) de blocage",
  "Post_hoc": "Analyse post-hoc",
  "chk1": "Histogramme des résidus",
  "help": {
    "title": "ANOVA, unidirectionnelle avec blocs aléatoires",
    "r_help": "help(lmer, package ='lme4')",
    "body": "\n<b>Description</b></br>\nAjuster un modèle linéaire à effets mixtes (LMM) aux données, via REML ou maximum de vraisemblance.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nlmer(formula, data = NULL, REML = TRUE, control = lmerControl(),\n        start = NULL, verbose = 0L, subset, weights, na.action,\n        offset, contrasts = NULL, devFunOnly = FALSE, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nformula: un objet de formule linéaire à deux côtés décrivant à la fois la partie à effets fixes et la partie à effets aléatoires du modèle, avec la réponse à gauche d'un opérateur ~ et les termes, séparés par des opérateurs +, à droite. Les termes à effets aléatoires sont distingués par des barres verticales (|) séparant les expressions pour les matrices de conception des facteurs de regroupement. Deux barres verticales (||) peuvent être utilisées pour spécifier plusieurs effets aléatoires non corrélés pour la même variable de regroupement. (En raison de la façon dont cela est implémenté, la syntaxe || ne fonctionne que pour les matrices de conception contenant des prédicteurs numériques (continus) ; pour ajuster des modèles avec des effets catégoriels indépendants, voir dummy ou la fonction lmer_alt du package afex.)\n</li>\n<li>\ndata: un cadre de données optionnel contenant les variables nommées dans la formule. Par défaut, les variables sont prises de l'environnement à partir duquel lmer est appelé. Bien que les données soient optionnelles, les auteurs du package recommandent fortement leur utilisation, en particulier lors de l'application ultérieure de méthodes telles que update et drop1 au modèle ajusté (de telles méthodes ne sont pas garanties de fonctionner correctement si les données sont omises). Si les données sont omises, les variables seront prises de l'environnement de la formule (si spécifiée comme une formule) ou du cadre parent (si spécifiée comme un vecteur de caractères).\n</li>\n<li>\nREML: scalaire logique - Les estimations doivent-elles être choisies pour optimiser le critère REML (par opposition à la log-vraisemblance) ?\nna.action: une fonction qui indique ce qui doit se passer lorsque les données contiennent des NA. L'action par défaut (na.omit, héritée de la valeur 'usine fraîche' de getOption(\"na.action\")) supprime toute observation avec des valeurs manquantes dans n'importe quelle variable.\n</li>\n</ul>\n<b>Valeur</b></br>\nUn objet de classe merMod (plus précisément, un objet de sous-classe lmerMod), pour lequel de nombreuses méthodes sont disponibles (par exemple, methods(class=\"merMod\"))</br>\n<b>Package</b></br>\nlme4</br>\n<b>Aide</b></br>\nhelp(lmer, package ='lme4')</br></br>\n<b>Description</b></br>\nMéthodes de description pour la fonction anova dans le package lmerTest\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \n## Méthode S4 pour la signature 'merModLmerTest' anova(object, ... , ddf=\"Satterthwaite\", type=3)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject: objet de classe \"merModLmerTest\" ... objet de classe \"merModLmerTest\". Ensuite, les statistiques de comparaison de modèles seront calculées\n</li>\n<li>\nddf: Par défaut, l'approximation de Satterthwaite aux degrés de liberté est calculée. Si ddf=\"Kenward-Roger\", alors l'approximation de Kenward-Roger est calculée en utilisant la fonction KRmodcomp du package pbkrtest. Si ddf=\"lme4\", alors le tableau anova qui provient du package lme4 est retourné.\n</li>\n<li>\nType: type d'hypothèse à tester. Pourrait être type=3 ou type=2 ou type=1 (La définition provient de la théorie SAS) Détails Selon (Goodnight, J.H. 1976), le comportement de l'hypothèse de type 3 n'est pas entièrement étudié pour les situations avec des cellules manquantes (où des observations sont manquantes à certaines combinaisons de niveaux de facteurs). Un avertissement est retourné dans de tels cas.\n</li>\n</ul>\n<b>Détails</b></br>\nSelon (Goodnight, J.H. 1976), le comportement de l'hypothèse de type 3 n'est pas entièrement étudié pour les situations avec des cellules manquantes (où des observations sont manquantes à certaines combinaisons de niveaux de facteurs). Un avertissement est retourné dans de tels cas.</br>\n<b>Package</b></br>\nlme4;lmerTest;rcompanion;ggplot2;multcomp</br>\n<b>Aide</b></br>\nhttps://cran.r-project.org/web/packages/lmerTest/lmerTest.pdf</br>\nhelp(nagelkerke, package ='rcompanion')</br>\nhelp(emmeans,package=\"cld\")</br>\nhelp(cld,package='emmeans')</br>\n<b>Matériel de référence</b></br>\nhttp://rcompanion.org/handbook/I_07.html\n"
  }
}