{
  "title": "Graphique à barres",
  "navigation": "Graphique à barres",
  "optionsLabels": "Options pour les étiquettes",
  "suppressLabels": "Supprimer toutes les étiquettes pour les comptes et les pourcentages",
  "suppressThreshold": "Supprimer les étiquettes pour les comptes et les pourcentages en dessous du pourcentage seuil spécifié",
  "label1": "Cliquez sur l'onglet ci-dessous pour sélectionner le compte ou la moyenne. Lorsque le compte est sélectionné, une variable Y est optionnelle. Lorsque le compte est sélectionné et qu'une variable Y n'est PAS spécifiée, les comptes de la variable X sont affichés. Lorsque le compte est spécifié et qu'une variable Y est spécifiée, les valeurs de la variable Y sont additionnées. Lorsque la moyenne est sélectionnée, vous devez sélectionner une variable Y et une variable X. Les moyennes sont calculées pour les variables Y",
  "x": "Variable X, spécifiez une variable catégorique",
  "y": "Variable(s) Y, spécifiez une ou plusieurs variables numériques",
  "fill": "Spécifiez une variable catégorique pour remplir les barres",
  "dropna": "Supprimer les valeurs manquantes",
  "bottomlbl": "Sélectionner le graphique à barres",
  "meanlbl": "Moyenne",
  "countlbl": " Compte",
  "fill1": "Sélectionnez une couleur pour les barres. Remarque : Ceci est ignoré lorsqu'une variable pour remplir les barres est spécifiée",
  "legends": "Afficher les légendes et si oui, position des légendes (par défaut à droite)",
  "digitsCountDisplay": "Chiffres - nombre de chiffres à afficher pour les comptes et les pourcentages",
  "barType": "Type de graphique à barres",
  "stackedBar": "Graphique à barres empilées",
  "sideBySide": "Afficher les groupes côte à côte",
  "fillPercent": "Remplir les barres",
  "errorBarOptions": "Barres d'erreur",
  "noErrBars": "Pas de barres d'erreur",
  "stderr": "Erreurs standards",
  "stddev": "Écarts types",
  "cilevel": "Spécifiez le niveau de confiance :",
  "confidenceInterval": "Niveau de confiance :",
  "drawSignificance": "Ajouter la signification (valeurs p) comparaison des moyennes entre chaque paire de barres (sélectionnez un facette pour grouper l'analyse). Pour tukey_hsd et games_howell_test, les valeurs p sont déjà ajustées. La méthode d'ajustement de la valeur p supplémentaire est ignorée.",
  "methodForMeanDiffSignificance": "Méthode de test utilisée pour comparer les moyennes",
  "adjPvalue": "Ajuster les valeurs p pour comparer les moyennes produites par la méthode de test",
  "pValueFromatting": "Format des valeurs p (signification) affichées",
  "alpha": "Opacité (0-1)",
  "flipBox": "Inverser l'axe",
  "specify_a_title": "Entrez un titre",
  "x_title": "Étiquette de l'axe X",
  "y_title": "Étiquette de l'axe Y",
  "showErrorBar": "Afficher les deux extrémités de la barre d'erreur (par défaut), en haut seulement, ou en bas",
  "Facetrow": "Ligne de facette",
  "Facetcolumn": "Colonne de facette",
  "Facetwrap": "Enveloppe de facette",
  "Facetscale": "Échelle de facette",
  "relFreq": "Fréquences relatives",
  "facets_lbl": "Facettes",
  "xyLimits": "Limites des axes X et Y",
  "label5": "Spécifiez une plage pour les valeurs des axes X et Y",
  "rangeYValues": "Spécifiez la plage de l'axe Y, par exemple 0,100",
  "help": {
    "title": "Aide sur le graphique à barres",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Un graphique à barres ou un graphique à barres est un graphique qui présente des données groupées avec des barres rectangulaires dont les longueurs sont proportionnelles aux valeurs qu'elles représentent. Les barres peuvent être tracées verticalement ou horizontalement. Les barres peuvent être regroupées par une variable factrice optionnelle. Les groupes peuvent être empilés sur une seule barre ou affichés côte à côte. Des facettes peuvent être créées optionnellement en spécifiant une variable factrice. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y.\n        Vous pouvez créer un graphique à barres pour une seule variable factrice, les barres représenteront les comptes de chaque niveau de la variable factrice. Ici, la variable factrice sera sur l'axe x, voir l'exemple ci-dessous. Lorsque la case des fréquences relatives est sélectionnée, nous montrons la fréquence relative au lieu des comptes sur l'axe y.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=0.4) +\n         labs(x =\"year\",y =\"Count\",title= \"Graphique à barres pour l'axe X : année, axe Y : Compte\")\n        </code>\n        <br />\n        Vous pouvez créer un graphique à barres en plaçant une variable d'échelle/numerique sur l'axe y, et en remplissant les barres par une variable factrice. La barre sera remplie en additionnant les valeurs de la variable y pour chaque niveau de la variable factrice, voir l'exemple ci-dessous\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=0.4,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"Graphique à barres pour l'axe X :, axe Y : poids, Remplissage : origine\")\n        </code>\n        <br />\n        Vous pouvez spécifier une variable x, une variable y et un remplissage. La barre est remplie par la somme des valeurs de la variable y pour chaque niveau de la variable x, groupée par le niveau de la variable spécifiée dans le remplissage.\n        Lorsque vous spécifiez plusieurs variables x, nous créons un graphique à barres séparé pour chaque variable x. \n        <br />\n        Utilisation :\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Le jeu de données par défaut​\n        </li>\n        <li>\n        aes():    Générer des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géoms.​\n        </li>\n        <li>\n        x: Une variable factrice/catégorique. La longueur de la barre correspond aux comptes de chaque niveau de la variable factrice.​\n        </li>\n        <li>\n        fill: Une variable factrice/catégorique optionnelle pour regrouper les comptes des niveaux dans x : (voir ci-dessus)​\n        </li>\n        <li>\n        geom_bar(): Crée le graphique à barres, position =\"stack\" empile les groupes sur une seule barre, position =\"dodge\" empile les groupes côte à côte, position =\"fill\" remplit la barre avec un pourcentage de chaque niveau de regroupement.​\n        </li>\n        <li>\n        Labs(): Changer les étiquettes des axes et les titres des légendes (c'est optionnel)​\n        </li>\n        <li>\n        facet_grid(): Disposer les panneaux dans une grille (c'est optionnel)​\n        </li>\n        <li>\n        theme_calc(): Spécifie le thème du calculateur (c'est optionnel)​\n        </li>\n        <li>\n        coord_flip(): Inverser l'axe (c'est optionnel)​\n        </li>\n        <li>\n        alpha: Contrôle l'opacité, prend des valeurs entre 0-1. 1 signifie aucune opacité.\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tSi 'Ajouter la signification (valeurs p) comparaison des moyennes entre chaque paire de barres' est sélectionné sous Moyenne, les codes pour les valeurs p sur le graphique sont les suivants\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tMéthodes d'ajustement des valeurs P :\n\t\t<br/>\n\t\tLes méthodes d'ajustement des valeurs P incluent la correction de Bonferroni (\"bonferroni\") dans laquelle les valeurs p sont multipliées par \n\t\tnombre de comparaisons. Des corrections moins conservatrices sont également incluses par Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" ou son alias \"fdr\"), et Benjamini & Yekutieli (2001) (\"BY\"), \n\t\trespectivement. Une option de passage (\"none\") est également incluse. L'ensemble des méthodes est contenu dans le vecteur p.adjust.methods \n\t\tpour le bénéfice des méthodes qui doivent avoir la méthode comme option et la transmettre à p.adjust.\n\t\t<br/>\n\t\t<br/>\n\t\tLes quatre premières méthodes sont conçues pour donner un contrôle fort du taux d'erreur familial. Il semble qu'il n'y ait aucune raison d'utiliser la \n\t\tcorrection de Bonferroni non modifiée car elle est dominée par la méthode de Holm, qui est également valide sous des hypothèses arbitraires.\n\t\t<br/>\n\t\t<br/>\n\t\tLes méthodes de Hochberg et Hommel sont valides lorsque les tests d'hypothèses sont indépendants ou lorsqu'ils sont associés de manière non négative \n\t\t(Sarkar, 1998 ; Sarkar et Chang, 1997). La méthode de Hommel est plus puissante que celle de Hochberg, mais la différence est généralement petite \n\t\tet les valeurs p de Hochberg sont plus rapides à calculer.\n\t\t<br/>\n\t\t<br/>\n\t\tLes méthodes \"BH\" (alias \"fdr\") et \"BY\" de Benjamini, Hochberg et Yekutieli contrôlent le taux de fausses découvertes, la proportion attendue \n\t\tdes fausses découvertes parmi les hypothèses rejetées. Le taux de fausses découvertes est une condition moins stricte que \n\t\tle taux d'erreur familial, donc ces méthodes sont plus puissantes que les autres.\n\t\t<br/>\n\t\t<br/>\n\t\tVoir aussi \n\t\t<br />\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br />\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br />\n\t\t<br />\n        Package : ggplot2, ggthemes​\n        <br />\n        Autre : Cliquez sur le bouton Aide R pour obtenir une aide R détaillée. Vous pouvez également entrer help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n      "
  }
}