{
  "title": "Test de Bartlett",
  "navigation": "Test de Bartlett",
  "tvarbox1": "Variable de réponse",
  "tvarbox2": "Variables numériques ou facteurs",
  "help": {
    "title": "Test de Bartlett",
    "r_help": "aide(bartlett.test, package=stats)",
    "body": "\n<b>Description</b></br>\nEffectue le test de Bartlett de l'hypothèse nulle selon laquelle les variances dans chacun des groupes (échantillons) sont les mêmes.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nbartlett.test(x, ...)</br>\n## Méthode S3 par défaut:</br>\nbartlett.test(x, g, ...)</br>\n## Méthode S3 pour la classe 'formule'</br>\nbartlett.test(formule, données, sous-ensemble, na.action, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nArguments\nx: un vecteur numérique de valeurs de données, ou une liste de vecteurs de données numériques représentant les échantillons respectifs, ou des objets de modèles linéaires ajustés (héritant de la classe \"lm\").\n</li>\n<li>\ng: un vecteur ou un objet facteur donnant le groupe pour les éléments correspondants de x. Ignoré si x est une liste.\n</li>\n<li>\nformule: une formule de la forme lhs ~ rhs où lhs donne les valeurs de données et rhs les groupes correspondants.\n</li>\n<li>\ndonnées: une matrice ou un cadre de données optionnel (ou similaire : voir model.frame) contenant les variables dans la formule. Par défaut, les variables sont prises de l'environnement(formule).\n</li>\n<li>\nsous-ensemble: un vecteur optionnel spécifiant un sous-ensemble d'observations à utiliser.\n</li>\n<li>\nna.action: une fonction qui indique ce qui doit se passer lorsque les données contiennent des NAs. Par défaut, cela correspond à getOption(\"na.action\").\n</li>\n<li>\n...: d'autres arguments à passer aux méthodes ou à partir des méthodes.\n</li>\n</ul>\n<b>Détails</b></br>\nSi x est une liste, ses éléments sont considérés comme les échantillons ou les modèles linéaires ajustés à comparer pour l'homogénéité des variances. Dans ce cas, les éléments doivent être soit tous des vecteurs de données numériques, soit des objets de modèles linéaires ajustés, g est ignoré, et on peut simplement utiliser bartlett.test(x) pour effectuer le test. Si les échantillons ne sont pas encore contenus dans une liste, utilisez bartlett.test(liste(x, ...)).</br>\nSinon, x doit être un vecteur de données numériques, et g doit être un vecteur ou un objet facteur de la même longueur que x donnant le groupe pour les éléments correspondants de x.</br>\n<b>Valeur</b><br/>\nUne liste de classe \"htest\" contenant les composants suivants:<br/>\nstatistic: la statistique du test K-carré de Bartlett.<br/>\nparameter: les degrés de liberté de la distribution du chi-carré approximatif de la statistique du test.<br/>\np.value: la valeur p du test.<br/>\nmethod: la chaîne de caractères \"Test de Bartlett de l'homogénéité des variances\".<br/>\ndata.name: une chaîne de caractères donnant les noms des données.<br/>\n<b>Exemples</b><br/>\n<code> \nDataset <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))\nResult_Bartlett_Test = bartlett.test(sales ~ interaction(Dataset$Gender),data=Dataset)\n</code> <br/>\n<b>Paquet</b></br>\nstats</br>\n<b>Aide</b></br>\naide(bartlett.test, package=stats)\n"
  }
}