{
  "title": "Test des valeurs aberrantes de Bonferroni",
  "navigation": "Test des valeurs aberrantes",
  "label1": "Sélectionnez un modèle d'une des classes suivantes (classe entre parenthèses) - Modèle linéaire (lm), Modèle linéaire généralisé (glm)",
  "modelselector1": "Sélectionnez un modèle",
  "help": {
    "title": "Test des valeurs aberrantes de Bonferroni",
    "r_help": "help(outlierTest, package='car')",
    "body": "\n                <b>Description</b></br>\nRapporte les p-values de Bonferroni pour tester chaque observation à tour de rôle comme étant une valeur aberrante de décalage de moyenne, basé sur les résidus studentisés dans les modèles linéaires (tests t), les modèles linéaires généralisés (tests normaux) et les modèles mixtes linéaires.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## Méthode S3 pour la classe 'lm'<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## Méthode S3 pour la classe 'lmerMod'<br/>\noutlierTest(model, ...)<br/>\n## Méthode S3 pour la classe 'outlierTest'<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nmodel: un objet de modèle lm, glm ou lmerMod; la méthode \"lmerMod\" appelle la méthode \"lm\" et peut prendre les mêmes arguments.\n</li>\n<li>\ncutoff: les observations avec des p-values de Bonferroni dépassant le cutoff ne sont pas rapportées, à moins qu'aucune observation ne soit nommée, auquel cas celle avec le plus grand résidu studentisé est rapportée.\n</li>\n<li>\nn.max: nombre maximum d'observations à rapporter (par défaut, 10).\n</li>\n<li>\norder: rapporter les résidus studentisés dans l'ordre décroissant de magnitude ? (par défaut, TRUE).\n</li>\n<li>\nlabels: un vecteur optionnel de noms d'observation.\n</li>\n<li>\n...: arguments passés aux fonctions de méthodes.\n</li>\n<li>\nx: objet outlierTest.\n</li>\n<li>\ndigits: nombre de chiffres pour les p-values rapportées.\n</li>\n</ul>\n<b>Détails</b></br>\nPour un modèle linéaire, les p-values rapportées utilisent la distribution t avec un degré de liberté inférieur d'un à celui des résidus df pour le modèle. Pour un modèle linéaire généralisé, les p-values sont basées sur la distribution normale standard. L'ajustement de Bonferroni multiplie la p-value habituelle à deux côtés par le nombre d'observations. La méthode lm fonctionne pour les objets glm. Pour afficher toutes les observations, définissez cutoff=Inf et n.max=Inf.<br/>\n<b>Valeur</b><br/>\nun objet de classe outlierTest, qui est normalement juste imprimé.<br/>\n<b>Exemples</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>Paquet</b></br>\ncar</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R help(outlierTest, package=\"car\")\n                "
  }
}