{
    "title": "Diagramme en boîte",
    "navigation": "Diagramme en boîte",
    "x": "Variable X, spécifiez une variable de catégorie",
    "y": "Variable(s) Y, spécifiez une variable(s) numérique(s)",
    "Fill": "Spécifiez une variable de regroupement (catégorie)",
    "flipaxis": "Inverser l'axe",
    "dataPoints": "Sélectionnez une option pour tracer les points de données",
    "alpha": "Opacité (0-1)",
    "notch": "Encoche",
    "outliers": "Afficher les valeurs aberrantes (en rouge)",
    "barcolor": "Sélectionnez une couleur pour les lignes autour des boîtes (Après avoir sélectionné la couleur, cliquez en dehors du contrôle pour appliquer)",
    "showCountsChk": "Afficher les valeurs sur la boîte (1Q, médiane, 3Q)",
    "drawSignificanceChk": "Ajouter une signification (p-values) comparaison de moyenne entre chaque paire de boîtes (sélectionnez un facette pour regrouper l'analyse). Pour tukey_hsd et games_howell_test, les p-values sont déjà ajustées. La méthode d'ajustement de p-value supplémentaire est ignorée.",
    "methodForMeanDiffSignificance": "Méthode de test utilisée pour comparer les moyennes",
    "adjPvalue": "Ajuster les p-values de la comparaison des moyennes",
    "pValueFromatting": "Format des p-values (signification) affichées",
    "specify_a_title": "Entrez un titre",
    "x_title": "Étiquette de l'axe X",
    "y_title": "Étiquette de l'axe Y",
    "legends": "Afficher les légendes et si oui, position des légendes (par défaut à droite)",
    "angleXaxis_text": "Angle pour incliner les valeurs de texte de l'axe x (par défaut 0 pour pas d'inclinaison)",
    "angleYaxis_text": "Angle pour incliner les valeurs de texte de l'axe y (par défaut 0 pour pas d'inclinaison)",
    "axisTickmarksCount": "Combien de valeurs d'axe (c'est-à-dire tickmark) à afficher (par défaut 10)",
    "positionJitterWidth": "Écart des points de jitter (choisissez une valeur entre 0 et 1. Par défaut 0.2)",
    "Facetrow": "Ligne de facette",
    "Facetcolumn": "Colonne de facette",
    "Facetwrap": "Enveloppe de facette (si choisie, toute sélection de ligne et colonne de facette sera ignorée)",
    "Facetscale": "Échelle de facette",
    "label1": "Lignes horizontales",
    "plotMeanLineChk": "Tracer une ligne horizontale pour la médiane de la variable Y (numérique) sélectionnée",
    "yIntercept": "Entrez des valeurs d'interception Y séparées par des virgules pour les lignes horizontales, par exemple 100, 200, 300",
    "hLineColor": "Sélectionnez une couleur pour les lignes et étiquettes (Après avoir sélectionné la couleur, cliquez en dehors du contrôle pour appliquer)",
    "lineType": "Sélectionnez le type de ligne",
    "horizontalLinelabel": "Spécifiez des étiquettes séparées par des virgules (sans guillemets) pour les lignes horizontales",
    "horizontalLinelabel_angle_text": "Angle pour incliner le texte de l'étiquette de ligne horizontale (par défaut 0 pour pas d'inclinaison)",
    "label2": "Remarque : des valeurs plus grandes déplacent le texte vers le bas, des valeurs plus petites déplacent le texte vers le haut",
    "addHoriRefLines": "Ajouter des lignes de référence",
    "xyLimits": "Limites des axes X et Y",
    "label5": "Spécifiez une plage pour les valeurs des axes X et Y",
    "rangeYValues": "Spécifiez la plage de l'axe Y, par exemple 0,100",
    "labelHori_HorizontalJustification": "Remarque : des valeurs plus grandes placent le texte à gauche, des valeurs plus petites déplacent le texte à droite",
    "verticalJustification": "Contrôlez la justification verticale de l'étiquette",
    "hori_HorizontalJustification": "Contrôlez la justification horizontale de l'étiquette",
    "addlLabelHlineTextPositionOffset": "Ajustements supplémentaires pour positionner le texte de l'étiquette pour les lignes horizontales",
    "horiMovementHReflineLabel": "Déplacez le texte horizontalement à gauche ou à droite - utilisez n'importe quel nombre avec un signe + ou - (laissez 0 pour l'axe catégorique)",
    "nobreaklineHRefLabelandValueChk": "Cochez cette case pour supprimer le saut de ligne entre la valeur de l'étiquette et le texte de l'étiquette",
    "vertiMovementHReflineLabel": "Déplacez le texte verticalement vers le haut ou vers le bas - utilisez n'importe quel nombre avec un signe + ou - (laissez 0 pour l'axe catégorique)",
    "facets_lbl": "Facettes",
    "help": {
      "title": "Diagramme en boîte",
      "r_help": "help(geom_boxplot, package=ggplot2)",
      "body": "\n        <b>Description</b></br>\n        En statistiques descriptives, un diagramme en boîte ou boxplot est un moyen pratique de représenter graphiquement des groupes de données numériques à travers leurs quartiles. Les diagrammes en boîte peuvent également avoir des lignes s'étendant verticalement à partir des boîtes (moustaches) indiquant la variabilité en dehors des quartiles supérieur et inférieur, d'où les termes diagramme en boîte et moustaches. Les valeurs aberrantes peuvent être tracées comme des points individuels. Les diagrammes en boîte et moustaches sont uniformes dans leur utilisation de la boîte : le bas et le haut de la boîte sont toujours les premier et troisième quartiles, et la bande à l'intérieur de la boîte est toujours le deuxième quartile (la médiane). La moustache supérieure s'étend de la charnière à la valeur la plus élevée qui est dans 1,5 * IQR de la charnière, où IQR est l'intervalle interquartile, ou la distance entre le premier et le troisième quartiles. La moustache inférieure s'étend de la charnière à la valeur la plus basse dans 1,5 * IQR de la charnière. Les données au-delà de l'extrémité des moustaches sont des valeurs aberrantes et sont tracées comme des points (comme spécifié par Tukey).​</br>\n        Des facettes peuvent être créées en option en spécifiant une variable facteur. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y​</br>\n        Lorsque vous sélectionnez l'option pour tracer les points de données, nous le faisons en utilisant geom_dotplot</br>\n        Par défaut, les valeurs aberrantes sont affichées avec des points noirs, lorsque vous sélectionnez l'option pour afficher les valeurs aberrantes (en rouge) via la case à cocher, les valeurs aberrantes sont rendues plus proéminentes.\n        <br/>\n        <b>Utilisation</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Arguments</b><br/>\n        <ul>\n        <li>\n        data: Le jeu de données par défaut​\n        </li>\n        <li>\n        x: Une variable facteur/catégorique qui définit le regroupement de la variable y​\n        </li>\n        <li>\n        y: Une variable numérique pour laquelle le boxplot est calculé​\n        </li>\n        <li>\n        fill: Une variable facteur/catégorique optionnelle pour regrouper davantage les groupes existants. Chaque sous-groupe sera affiché dans une couleur distincte.​\n        </li>\n        <li>\n        aes():    Générer des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géométries.​\n        </li>\n        <li>\n        geom_boxplot(): Crée le boxplot. Les \"charnières\" supérieures et inférieures correspondent aux premier et troisième quartiles (les 25ème et 75ème percentiles).​\n        </li>\n        <li>\n        geom_dotplot: Trace les points de données\n        </li>\n        <li>\n        Labs(): Change les étiquettes des axes et les titres des légendes (c'est optionnel)​\n        </li>\n        <li>\n        facet_grid(): Dispose les panneaux dans une grille (c'est optionnel)​\n        </li>\n        <li>\n        theme_calc(): Spécifie le thème de la calculatrice (c'est optionnel)​\n        </li>\n        <li>\n        coord_flip(): Inverser l'axe (c'est optionnel)​\n        </li>\n        <li>\n        notch: Les diagrammes en boîte avec encoche appliquent une \"encoche\" ou un rétrécissement de la boîte autour de la médiane. Les encoches sont utiles pour offrir un guide approximatif à la signification de la différence des médianes ; si les encoches de deux boîtes ne se chevauchent pas, cela offre des preuves d'une différence statistiquement significative entre les médianes. Dans un diagramme en boîte avec encoche, les encoches s'étendent à 1,58 * IQR / sqrt(n)\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tSi 'Ajouter une signification (p-values) comparaison de moyenne entre chaque paire de boîtes' est sélectionné, les codes pour les p-values sur le graphique sont les suivants\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tMéthodes d'ajustement des p-values :\n\t\t<br/>\n\t\tLes méthodes d'ajustement des p-values incluent la correction de Bonferroni (\"bonferroni\") dans laquelle les p-values sont multipliées par \n\t\tnombre de comparaisons. Des corrections moins conservatrices sont également incluses par Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), \n\t\tHommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" ou son alias \"fdr\"), et Benjamini & Yekutieli (2001) (\"BY\"), \n\t\trespectivement. Une option de passage (\"none\") est également incluse. L'ensemble des méthodes est contenu dans le vecteur p.adjust.methods \n\t\tpour le bénéfice des méthodes qui ont besoin d'avoir la méthode comme option et de la transmettre à p.adjust.\n\t\t<br/>\n\t\t<br />\n\t\tLes quatre premières méthodes sont conçues pour donner un contrôle fort du taux d'erreur familial. Il semble qu'il n'y ait aucune raison d'utiliser la \n\t\tcorrection de Bonferroni non modifiée car elle est dominée par la méthode de Holm, qui est également valide sous des hypothèses arbitraires.\n\t\t<br/>\n\t\t<br />\n\t\tLes méthodes de Hochberg et Hommel sont valides lorsque les tests d'hypothèses sont indépendants ou lorsqu'ils sont associés de manière non négative \n\t\t(Sarkar, 1998 ; Sarkar et Chang, 1997). La méthode de Hommel est plus puissante que celle de Hochberg, mais la différence est généralement faible \n\t\tet les p-values de Hochberg sont plus rapides à calculer.\n\t\t<br/>\n\t\t<br />\n\t\tLes méthodes \"BH\" (alias \"fdr\") et \"BY\" de Benjamini, Hochberg et Yekutieli contrôlent le taux de fausses découvertes, la proportion attendue \n\t\tdes fausses découvertes parmi les hypothèses rejetées. Le taux de fausses découvertes est une condition moins stricte que \n\t\tle taux d'erreur familial, donc ces méthodes sont plus puissantes que les autres.\n\t\t<br/>\n\t\t<br />\n\t\tVoir aussi \n\t\t<br/>\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br/>\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br/>\n\t\t<br/>\n        <b>Package</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Aide</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Cliquez sur le bouton d'aide R pour obtenir une aide détaillée sur R. Vous pouvez également entrer help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot)\n        "
    }
}