{
    "title": "Diagramme en boîte",
    "navigation": "Diagramme en boîte",
    "x": "Variable X, spécifiez une variable catégorielle",
    "y": "Variable(s) Y, spécifiez une ou des variables numériques",
    "Fill": "Spécifiez une variable de regroupement (catégorielle)",
    "flipaxis": "Inverser l’axe",
    "dataPoints": "Sélectionnez une option pour tracer les points de données",
    "alpha": "Opacité (0-1)",
    "notch": "Encoche",
    "outliers": "Afficher les valeurs aberrantes (en rouge)",
    "barcolor": "Sélectionnez une couleur pour les contours des boîtes (après la sélection, cliquez à l’extérieur pour appliquer)",
    "showCountsChk": "Afficher les valeurs sur la boîte (1Q, médiane, 3Q)",
    "drawSignificanceChk": "Ajouter la signification (valeurs p) pour la comparaison des moyennes entre chaque paire de boîtes (sélectionnez une facette pour grouper l’analyse)",
    "methodForMeanDiffSignificance": "Méthode de test utilisée pour comparer les moyennes",
    "adjPvalue": "Ajuster les valeurs p issues de la comparaison des moyennes",
    "pValueFromatting": "Format des valeurs p (significativité) affichées",
    "specify_a_title": "Entrez un titre",
    "x_title": "Étiquette de l’axe X",
    "y_title": "Étiquette de l’axe Y",
    "angleXaxis_text": "Angle d’inclinaison du texte de l’axe X (0 par défaut, sans inclinaison)",
    "angleYaxis_text": "Angle d’inclinaison du texte de l’axe Y (0 par défaut, sans inclinaison)",
    "axisTickmarksCount": "Nombre de graduations à afficher sur l’axe (par défaut 10)",
	"positionJitterWidth": "Dispersion des points de gigue (choisissez une valeur entre 0 et 1. La valeur par défaut est 0,2)",
    "facets_lbl": "Facettes",
    "Facetrow": "Rangée de facettes",
    "Facetcolumn": "Colonne de facettes",
    "Facetwrap": "Enroulement de facettes (si sélectionné, ignore rangée et colonne)",
    "Facetscale": "Échelle de facettes",
    "label1": "Lignes horizontales",
    "yIntercept": "Saisissez les valeurs d’interception Y séparées par des virgules, ex : 100, 200, 300",
    "hLineColor": "Sélectionnez une couleur pour les lignes et les étiquettes (cliquez à l’extérieur pour appliquer après sélection)",
    "lineType": "Sélectionnez le type de ligne",
    "horizontalLinelabel": "Spécifiez les étiquettes séparées par des virgules (sans guillemets) pour les lignes horizontales",
    "horizontalLinelabel_angle_text": "Angle d’inclinaison du texte de l’étiquette de la ligne horizontale (0 par défaut)",
    "label2": "Remarque : des valeurs plus élevées abaissent le texte, des valeurs plus faibles le relèvent",
    "addHoriRefLines": "Ajouter des lignes de référence",
    "xyLimits": "Limites des axes X et Y",
    "label5": "Spécifiez une plage de valeurs pour les axes X et Y",
    "rangeXValues": "Spécifiez la plage de l’axe X, ex : 0,100 (laisser vide pour un axe catégoriel)",
    "rangeYValues": "Spécifiez la plage de l’axe Y, ex : 0,100",
    "labelHori_HorizontalJustification": "Remarque : des valeurs plus élevées déplacent le texte à gauche, des valeurs plus faibles à droite",
    "verticalJustification": "Contrôler l’alignement vertical du texte",
    "hori_HorizontalJustification": "Contrôler l’alignement horizontal du texte",
    "addlLabelHlineTextPositionOffset": "Ajustements supplémentaires de la position du texte des étiquettes des lignes horizontales",
    "horiMovementHReflineLabel": "Déplacer le texte horizontalement vers la gauche ou la droite (+ ou -) (laisser 0 pour un axe catégoriel)",
    "nobreaklineHRefLabelandValueChk": "Cochez pour supprimer le saut de ligne entre la valeur et le texte de l’étiquette",
    "vertiMovementHReflineLabel": "Déplacer le texte verticalement vers le haut ou le bas (+ ou -) (laisser 0 pour un axe catégoriel)",
    "help": {
        "title": "Diagramme en boîte",
        "r_help": "help(geom_boxplot, package=ggplot2)",
        "body": "En statistiques descriptives, le diagramme en boîte permet de représenter graphiquement des groupes de données numériques selon leurs quartiles. Des moustaches (lignes verticales) indiquent la variabilité hors des quartiles. Les valeurs aberrantes sont représentées par des points isolés. Les bords inférieur et supérieur de la boîte correspondent aux premier et troisième quartiles, la ligne centrale est la médiane. Les moustaches s’étendent jusqu’à 1,5 × IQR. Des facettes peuvent être créées en spécifiant une variable catégorielle. Lorsque l’option de tracer les points est sélectionnée, geom_dotplot est utilisé. Par défaut, les valeurs aberrantes sont en noir ; l’option rouge les rend plus visibles."
    }
}
