{
  "title": "Nettoyer les données Excel ou CSV - ajuster, supprimer des lignes et des colonnes",
  "navigation": "Nettoyage Excel",
  "resultDatasetName": "Nom du nouveau jeu de données à créer",
  "listofRowNumbersRemove": "(Optionnel) Liste des numéros de ligne à supprimer (séparés par des virgules, par ex. 1,4,5,20:30)",
  "listofColumnNumbersRemove": "(Optionnel) Liste des numéros de colonne à supprimer (séparés par des virgules, par ex. 1,2,6:10)",
  "chooseColumnNamesRad": "Spécifier les noms de colonnes du jeu de données",
  "rowNumbersContaingColNames": "Entrez les numéros de ligne (séparés par des virgules, par ex. 3,4) à utiliser pour les noms de colonnes du jeu de données de sortie",
  "deleteRowNumbersContaingColNamesChk": "Supprimer les lignes contenant des noms de colonnes pour le jeu de données de sortie",
  "combineWithExsitingColNamesChk": "Noms de colonnes créés, les combiner avec les noms d'en-tête de colonne existants",
  "specifyColumnNamesRad": "Spécifier manuellement les noms de colonnes pour le jeu de données de sortie",
  "outputColumnNames": "Entrez les noms de colonnes (séparés par des virgules) à utiliser pour le jeu de données de sortie",
  "removeColsWithConstantChk": "Supprimer toutes les colonnes avec des valeurs constantes (insensible à la casse)",
  "removeColsWithNoDataChk": "Supprimer toutes les colonnes vides",
  "removeRowsWithNoDataChk": "Supprimer toutes les lignes vides",
  "removeRowsWithNAsChk": "Conserver uniquement les cas complets, c'est-à-dire supprimer toute la ligne si une valeur vide ou NA est présente",
  "label1": "Conversion des types de colonnes dans le jeu de données de sortie",
  "convertColumnDataTypeAuto": "Déterminer automatiquement le type de données de la colonne et convertir",
  "convertColumnDataTypeNone": "Ne rien faire",
  "convertColumnDataTypeFactorToCharInt": "Convertir toutes les colonnes de facteur en type caractère et entier",
  "convertColumnDataTypeCharToFactor": "Convertir toutes les colonnes de caractère en facteurs",
  "convertColumnDataTypeAllToFactor": "Convertir toutes les colonnes en facteurs",
  "convertColumnDataTypeManual": "Tapez le type de données pour chaque colonne à convertir",
  "outputColumnTypes": "Liste des types de colonnes (séparés par des virgules, par ex. numérique, facteur, caractère, ..)",
  "help": {
    "title": "Nettoyer les données Excel ou CSV - ajuster, supprimer des lignes et des colonnes",
    "r_help": "",
    "body": "\n            <b>Description</b></br>\n            Cette boîte de dialogue est utilisée pour nettoyer une feuille Excel complexe afin d'ajouter et de supprimer des lignes et des colonnes pour créer un nouveau jeu de données\n\t\t\t<br/>\n\t\t\t<br/>\n\t\t\tPour essayer cela, vous pouvez utiliser le fichier de jeu de données d'exemple appelé Excel cleanup.xlsx\n\t\t\t<br/>\n\t\t\tOuvrez le fichier dans la grille de données avec le menu ouvrir le fichier\n\t\t\t<br/>\n\t\t\tDans la boîte de dialogue - tapez\n\t\t\t<br/>\n\t\t\tSampleGp pour le nom du nouveau jeu de données\n\t\t\t<br/>\n\t\t\t1:3 pour la liste des numéros de ligne à supprimer\n\t\t\t<br/>\n\t\t\t1,2,5:8 pour la liste des numéros de colonne à supprimer\n\t\t\t<br/>\n\t\t\tSélectionnez l'option - Spécifier les noms de colonnes à partir des jeux de données\n\t\t\t<br/>\n\t\t\t2,3 pour entrer les numéros de ligne  \n\t\t\t<br/>\n\t\t\t<br/>"
  }
}