{
  "title": "Risques concurrents, comparer les groupes",
  "navigation": "Risques concurrents, comparer les groupes",
  "timevar": "Temps jusqu'à l'événement ou censure",
  "eventvar": "Événements (0 = censure, 1 = événement 1, 2 = événement 2, ...)",
  "groupvarlabel": "Groupe",
  "eventnum": "Code d'événement",
  "singleeventchkbox": "Tracer pour un seul événement",
  "printallest": "Tableau d'estimation incluant tous les temps",
  "printspecest": "Tableau d'estimation pour des temps spécifiques",
  "spectimes": "Spécifiez les temps comme time1, time2, time3, etc. ou comme seq(1,5,by=1)",
  "styleoptions": "Options de style",
  "axisoptions": "Options d'axe",
  "titleboxall": "Titre du graphique (tous les événements)",
  "titleboxsingle": "Titre du graphique (un seul événement)",
  "plottitlesizelabel": "Taille du titre du graphique (5-50)",
  "themedropdown": "Thème du graphique",
  "label1": "Légende",
  "legendpos": "Position",
  "keywidthlabel": "Largeur de la clé (cm; graphique combiné uniquement)",
  "legendeventslabel": "Événements",
  "legendtitle": "Titre",
  "eventlabels": "Étiquettes (spécifiez les étiquettes séparées par des virgules dans l'ordre des codes d'événements : par exemple, 'Événement 1', 'Événement 2', etc.; pas de code de censure)",
  "legendgroupslabel": "Groupes",
  "grouplabels": "Étiquettes (spécifiez les étiquettes séparées par des virgules dans l'ordre des groupes : par exemple, 'Groupe 1', 'Groupe 2', etc.)",
  "legendfontsize": "Taille des étiquettes de légende (5-50)",
  "wraplabelfontsize": "Taille des étiquettes d'événements pour le graphique par événement (5-50)",
  "label2": "Nombre à risque",
  "natriskchkbox": "Inclure le nombre à risque",
  "risktableprop": "Hauteur du tableau des risques (0-1)",
  "risktablevaluesize": "Taille des valeurs du tableau des risques (1-15)",
  "risktabletitlesize": "Taille du titre du tableau des risques (5-50)",
  "risktableaxislabelsize": "Taille des étiquettes d'axe du tableau des risques (5-50)",
  "risktableticklabelsize": "Taille des étiquettes de tick du tableau des risques (5-50)",
  "risktableclean": "Supprimer les axes et les lignes de grille du tableau des risques",
  "label3": "Options de ligne",
  "linesize": "Taille (0-5)",
  "colorpalette": "Palette de couleurs",
  "label4": "Intervalle de confiance",
  "cichkbox": "Inclure l'IC à 95%",
  "labelblank": "",
  "cistyle": "Style",
  "citransparency": "Transparence (0-1)",
  "censorlabel": "Temps censurés",
  "censorchkbox": "Inclure les temps censurés",
  "censorsize": "Taille (0-10)",
  "pvaluelabel": "P-Valeur (graphique d'événement unique uniquement)",
  "pvaluechkbox": "Inclure la p-valeur",
  "pvaluelocationx": "Position de l'axe X (temps)",
  "pvaluelocationy": "Position de l'axe Y (probabilité)",
  "pvaluesize": "Taille (1-20)",
  "pvalueaccuracy": "Précision (0-1)",
  "label5": "Axe d'incidence",
  "incaxislabelall": "Étiquette (tous les événements)",
  "incaxislabelsingle": "Étiquette (un seul événement)",
  "label6": "Échelle",
  "defbutton": "proportion",
  "pctbutton": "pourcentage",
  "label7": "Limites d'axe et incréments de marque de tick (0-1)",
  "incaxismin": "Minimum",
  "incaxismax": "Maximum",
  "incaxisinc": "Incrément",
  "label8": "Axe temporel",
  "timeaxislabel": "Étiquette",
  "label9": "Limites d'axe et incréments de marque de tick",
  "timeaxismin": "Minimum",
  "timeaxismax": "Maximum",
  "timeaxisinc": "Incrément",
  "label10": "Remarque : le maximum peut être spécifié sans que l'incrément soit spécifié. L'incrément ne peut pas être spécifié sans que le maximum soit spécifié.",
  "axislabelsize": "Taille des étiquettes d'axe (5-50)",
  "ticklabelsize": "Taille des étiquettes de marque de tick d'axe (5-50)",
  "help": {
    "title": "Risques concurrents, comparer les groupes",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n            <br/>\n            Un risque concurrent est un événement dont l'occurrence empêche l'occurrence de l'événement principal d'intérêt. Faire une analyse standard de Kaplan-Meier dans de tels cas est biaisé et surestime le risque d'événement. Ce dialogue est utilisé pour estimer le risque cumulatif d'avoir l'événement principal après le début du suivi pour cet événement (ou temps zéro), lorsque un ou plusieurs risques concurrents sont présents. La somme des incidences cumulées pour chaque événement est égale à l'incidence cumulée pour tout événement. Les sujets doivent être à risque pour tous les événements à partir du temps zéro. Des graphiques d'incidence cumulée pour tous les événements (courbes séparées pour chaque événement sur le même graphique), et éventuellement pour un événement spécifique seul, sont fournis. \n            <br/>\n            Une introduction au sujet des risques concurrents peut être trouvée dans \"Introduction à l'analyse des données de survie en présence de risques concurrents\" par Peter Austin, et al., Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Temps jusqu'à l'événement ou censure :</b> Pour chaque sujet, la durée jusqu'au premier événement, si un événement s'est produit, ou la dernière suivi pour les événements, si aucun événement ne s'est produit.\n            <br/><br/>\n            <b>Événements :</b> Indicateur numérique de quel événement s'est produit (1=événement 1, 2=événement 2, etc.) ou quand aucun événement ne s'est produit (0=censure) pour chaque sujet\n            <br/><br/>\n            <b>Tracer pour un seul événement :</b> Si vous souhaitez tracer l'incidence cumulée pour un événement spécifique seul. Le <b>Code d'événement</b> correspond à l'événement qui sera tracé.\n            <br/><br/>\n            <b>Tableau d'estimation incluant tous les temps :</b> Option d'inclure un tableau listant les probabilités d'incidence cumulée et les intervalles de confiance à 95% pour chaque temps observé dans le jeu de données\n            <br/>\n            <br/>\n\t\t\t<b>Tableau d'estimation pour des temps spécifiques :</b> Option d'inclure un tableau qui a les probabilités d'incidence cumulée pour un ensemble de temps sélectionné par l'utilisateur.\n\t\t\t<br/><br/>\n\t\t\t<b>Spécifiez les temps comme time1, time2, time3, etc. ou comme seq(1,5,by=1) :</b> Ce sont les temps spécifiques qui seront inclus dans le tableau pour des temps spécifiques. Ils peuvent être spécifiés individuellement avec des virgules, ou comme une séquence de valeurs uniformément espacées.\n\t\t\t<br/><br/>\t\t\t\n            Les tableaux sont sortis avec la taille de l'échantillon, le nombre de sujets avec chaque événement, le temps moyen restreint dans l'état, et le temps médian de suivi. Le temps médian de suivi est calculé en utilisant l'estimateur de Kaplan-Meier inversé, qui traite les véritables événements comme des observations censurées et les véritables observations censurées comme des événements. Ainsi, l'\"événement\" dans cet estimateur est \"suivre les sujets aussi longtemps que l'étude le permettait\".\n            <br/>\n            Un tableau des estimations d'incidence cumulée est fourni à chaque temps observé dans le jeu de données, avec des intervalles de confiance à 95%. \n            <br/>\n            <br/>\n            <b>Packages R requis :</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>Options de style</b>\n            <br/>\n            <br/>\n            <b>Titre du graphique (tous les événements) :</b> Titre des graphiques affichant tous les événements ; supprimez tout le texte pour aucun titre\n            <br/><br/>\n            <b>Titre du graphique (un seul événement) :</b> Titre du graphique affichant l'événement unique sélectionné ; supprimez tout le texte pour aucun titre\n\t\t\t<br/><br/>\n\t\t\t<b>Taille du titre du graphique :</b> Taille des titres du graphique.\n\t\t\t<br/><br/>\n            <b>Thème du graphique :</b> Style général du graphique\n            <br/><br/>\n            <b>Options de légende :</b>\n            <br/>\n            L'option <b>Position</b> contrôle l'emplacement de la légende (haut, bas, gauche, droite). <b>Largeur de clé</b> est utilisée pour changer la largeur des clés de légende dans le graphique qui combine tous les événements et tous les groupes. Cela peut être utilisé pour rendre les types de lignes plus lisibles dans la légende.\n\t\t\t<b>Titre d'événement</b> est le titre pour la partie de la légende délimitant les événements. <b>Titre de groupe</b> est le titre pour la partie de la légende délimitant les groupes. Supprimez le texte si aucun titre n'est souhaité. <b>Étiquettes d'événements</b> sont utilisées pour afficher le texte pour chaque code d'événement numérique au lieu des codes. <b>Étiquettes de groupe</b> sont utilisées pour changer le texte pour les groupes. Si vous spécifiez des étiquettes, toutes les étiquettes doivent être spécifiées.\n\t\t\tL'option <b>Taille des étiquettes de légende</b> contrôle la taille de tout le texte contenu dans la légende.\n\t\t\tL'option <b>Taille des étiquettes d'événements pour le graphique par événement</b> contrôle la taille du texte du nom de l'événement dans le graphique qui est trié par type d'événement.\n            <br/>\n            <br/>\n            <b>Nombre à risque :</b>\n\t\t\t<br/>\n\t\t\tOptionnellement, inclure un tableau pour le nombre de sujets encore à risque au fil du temps en bas des graphiques. Cela n'est pas fourni pour le graphique qui est trié par événement pour des raisons d'espace et de lisibilité. La <b>Hauteur du tableau des risques</b> contrôle la proportion de la zone de tracé que le tableau occupera.\n\t\t\tLa <b>Taille des valeurs du tableau des risques</b> contrôle la taille des nombres à risque. La <b>Taille du titre du tableau des risques</b> contrôle la taille du titre pour le tableau du nombre à risque.\n\t\t\tLa <b>Taille des étiquettes d'axe du tableau des risques</b> contrôle la taille des étiquettes d'axe. \n\t\t\tLa <b>Taille des étiquettes de tick du tableau des risques</b> contrôle la taille des étiquettes de tick. S'il est souhaité de supprimer tous les axes et lignes de grille \n\t\t\tdu tableau du nombre à risque, l'option <b>Supprimer les axes et les lignes de grille du tableau des risques</b> peut être cochée. Cela n'inclura que les nombres à risque dans le tableau.           \n            <br/><br/>\n            <b>Options de ligne :</b>\n            <br/>\n            <b>Taille</b> contrôle l'épaisseur. L'option <b>Palette de couleurs</b> contrôle la palette de couleurs utilisée pour les lignes dans tous les graphiques. Des schémas de couleurs imitant les revues scientifiques sont également fournis. On peut optionnellement inclure un intervalle de confiance à 95% pour les estimations dans un format <b>ribbon</b> (zone ombragée) ou <b>step</b> (ligne). <b>Transparence</b> contrôle à quel point le ruban est sombre et est ignoré lorsque l'option step est sélectionnée.\n\t\t\t<br/><br/>\n\t\t\t<b>Inclure les temps censurés :</b> Les temps censurés (lorsque les sujets ne sont plus à risque pour les événements) peuvent être inclus comme des signes plus sur les lignes. Cela est plus utile dans les petits ensembles de données ou dans les cas de petits nombres de sujets censurés. Ils ne sont pas fournis dans le graphique qui superpose tous les événements et groupes pour des raisons de lisibilité.\n\t\t\t<b>Taille</b> contrôle la taille des signes plus de temps censurés.\n\t\t\t<br/><br/>\n\t\t\t<b>Inclure la p-valeur</b> peut être utilisé pour inclure la p-valeur du test de Gray de l'événement sélectionné sur le graphique d'événement unique. <b>Position de l'axe X (temps)</b> et <b>Position de l'axe Y (probabilité)</b> fournissent les coordonnées (X, Y) de la p-valeur sur le graphique.\n\t\t\t<b>Taille</b> contrôle la taille de la p-valeur sur le graphique. <b>Précision</b> contrôle la précision de la p-valeur. Par exemple, la valeur par défaut de 0.0001 afficherait des p-valeurs pas plus petites que 0.0001. Toute p-valeur inférieure à 0.0001 serait affichée comme \"p<0.0001\". \n            <br/><br/><br/>\n\t\t\t<b>Options d'axe</b>\n            <br/>\n            <br/>\n            Les options <b>Label</b> spécifient le texte d'étiquette pour l'axe. Les <b>Limites d'axe</b> spécifient les valeurs minimales et maximales de l'axe. L'option <b>Incréments de marque de tick</b> contrôle l'espacement des marques de tick sur l'axe. Les incréments sur l'axe temporel contrôlent également les temps pour le tableau optionnel du nombre à risque.\n            <br/>\n            L'option <b>Échelle</b> de l'axe d'incidence spécifie si vous souhaitez que les estimations soient sur une échelle de proportion (0-1) ou de pourcentage (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Taille des étiquettes d'axe :</b>  Cela contrôle la taille des étiquettes d'axe d'incidence et de temps.\n\t\t\t<br/><br/>\n\t\t\t<b>Taille des étiquettes de marque de tick d'axe :</b>  Cela contrôle la taille des étiquettes de marque de tick d'axe d'incidence et de temps.\n      "
  }
}