{
  "title": "Comparer N Modèles",
  "navigation": "Comparer N Modèles",
  "label1": "Compare N modèles.",
  "label2": "Sélectionnez des modèles des classes suivantes (la classe R est entre parenthèses ci-dessous)",
  "label3": "Modèles linéaires (lm), Modèle linéaire généralisé (glm), Modèle à effets mixtes linéaires (lme), Régression logistique ordonnée ou Probit (polr), Modèle de risque proportionnel (coxph), Modèle linéaire utilisant les moindres carrés généralisés (gls), Modèle de régression de survie (survreg), Ajustement de régression polynomiale locale (loess), Modèle de moindres carrés non linéaires (nls), Modèles log-linéaires multinomiaux (multinom)",
  "label4": "**REMARQUE : Les modèles créés à partir de l'optimisation des modèles (classe train) ne sont pas pris en charge",
  "modelselector1": "Sélectionnez un ou plusieurs modèles à comparer :",
  "help": {
    "title": "Comparer N Modèles",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>\nCompare 2 modèles imbriqués à l'aide d'un test F ou d'un test Chi-carré selon l'estimation. Les tests F sont utilisés pour l'estimation des moindres carrés, les tests Chi-carré sont utilisés pour l'estimation de la vraisemblance maximale. Les deux modèles doivent être créés sur le même ensemble de données, car des différences dans les valeurs manquantes peuvent poser des problèmes.</b></br>\n<b>Description</b></br>\nTables Anova : Calcule les tables d'analyse de variance et effectue des tests de rapport de vraisemblance pour un objet de modèle ajusté.  \n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject:  un objet contenant les résultats renvoyés par une fonction d'ajustement de modèle (par exemple, lm ou glm).\n</li>\n</ul>\n<b>Valeur</b><br/>\nCette fonction (générique) renvoie un objet de classe anova. Ces objets représentent des tables d'analyse de variance et d'analyse de déviance. Lorsqu'un seul argument est donné, il produit une table qui teste si les termes du modèle sont significatifs. Lorsqu'une séquence d'objets est donnée, anova teste les modèles les uns contre les autres dans l'ordre spécifié.<br/>\nLa méthode d'impression pour les objets anova imprime des tables sous une forme 'jolie'.<br/>\n<b>Avertissement</b><br/>\nLa comparaison entre deux modèles ou plus ne sera valide que s'ils sont ajustés sur le même ensemble de données. Cela peut poser un problème s'il y a des valeurs manquantes et que le défaut de R est na.action = na.omit.<br/>\n<b>Paquet</b></br>\nstats</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R dans le coin supérieur droit de cette fenêtre de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R : help(anova,package='stats')</br></br>\n<b>Description</b></br>\nTest de rapport de vraisemblance des modèles imbriqués : lrtest est une fonction générique pour effectuer des tests de rapport de vraisemblance. La méthode par défaut peut être utilisée pour comparer des modèles linéaires (généralisés) imbriqués (voir les détails ci-dessous).\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Méthode S3 par défaut :<br/>\nlrtest(object, ..., name = NULL) <br/>\n## Méthode S3 pour la classe 'formula'<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nobject: un objet. Voir ci-dessous pour les détails.\n</li>\n<li>\n...: autres spécifications d'objet passées aux méthodes. Voir ci-dessous pour les détails.\n</li>\n<li>\nname: une fonction pour extraire un nom/description approprié d'un objet de modèle ajusté. Par défaut, le nom est interrogé en appelant formula.\n</li>\n<li>\ndata: un cadre de données contenant les variables dans le modèle.\n</li>\n</ul>\n<b>Détails</b></br>\nlrtest est destiné à être une fonction générique pour les comparaisons de modèles via des tests de rapport de vraisemblance asymptotiques. La méthode par défaut compare consécutivement l'objet de modèle ajusté avec les modèles passés dans .... Au lieu de passer les objets de modèle ajustés dans ..., plusieurs autres spécifications sont possibles. Le mécanisme de mise à jour est le même que pour waldtest : les modèles dans ... peuvent être spécifiés comme des entiers, des caractères (les deux pour les termes qui doivent être éliminés du modèle précédent), des formules de mise à jour ou des objets de modèle ajustés. À l'exception du dernier cas, l'existence d'une méthode de mise à jour est supposée. Voir waldtest pour les détails.<br/>\nEnsuite, un test de rapport de vraisemblance asymptotique pour chaque deux modèles consécutifs est effectué : Deux fois la différence des log-vraisemblances (telle que dérivée par les méthodes logLik) est comparée à une distribution Chi-carré.<br/>\nLa méthode \"formule\" ajuste d'abord un lm puis appelle la méthode par défaut.<br/>\n<b>Valeur</b><br/>\nUn objet de classe \"anova\" qui contient la log-vraisemblance, les degrés de liberté, la différence des degrés de liberté, la statistique du Chi-carré du rapport de vraisemblance et la valeur p correspondante.\n<b>Exemples</b><br/>\n<code> \n## avec des données de Greene (1993) :<br/>\n## charger des données et calculer des retards<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## diverses spécifications équivalentes du test LR<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
  }
}