{
  "title": "Diagramme en Coxcomb",
  "navigation": "Coxcomb",
  "x": "Variable(s) de l'axe X, spécifiez une ou plusieurs variables factorielles",
  "y": "Variable Y, spécifiez une variable numérique",
  "fill": "Remplissage, spécifiez une variable factorielle",
  "alpha": "Opacité (0-1)",
  "width": "Largeur",
  "rdgrp1": "Proportions de remplissage",
  "flip": "Inverser l'axe",
  "barcolor": "Couleur de la barre (Après la sélection de couleur, cliquez en dehors du contrôle pour appliquer)",
  "specify_a_title": "Entrez un titre",
  "x_title": "Étiquette de l'axe X",
  "y_title": "Étiquette de l'axe Y",
  "Facetrow": "Ligne de facette",
  "Facetcolumn": "Colonne de facette",
  "Facetwrap": "Enveloppe de facette",
  "Facetscale": "Échelle de facette",
  "help": {
    "title": "Diagramme en Coxcomb",
    "r_help": "help(coord_polar, package='ggplot2')",
    "body": "\n            <b>Description</b></br>\nUn diagramme en Coxcomb/Bulls Eye (ou un diagramme circulaire) est un graphique statistique circulaire, qui est divisé en tranches/circles concentriques pour illustrer une proportion numérique. Dans un diagramme en Coxcomb/Bulls Eye, la longueur de la largeur de chaque cercle concentrique (et par conséquent sa surface) est proportionnelle à la quantité qu'il représente. La quantité peut être représentée comme un compte ou un pourcentage.</br>​\nLes facettes peuvent être créées en spécifiant une variable factorielle. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y.</br>\nLorsque vous spécifiez plusieurs variables x, nous créons un Coxcomb/Bulls Eye séparé pour chaque variable x.</br>\n<b>Utilisation</b>\n<br/>\n<code>\n#Vous pouvez créer un diagramme Bulls Eye pour une seule variable factorielle, un cercle concentrique sera créé pour chaque niveau de la variable factorielle. La largeur du cercle concentrique est proportionnelle aux comptes de chaque niveau de la variable factorielle. Ici, la variable factorielle correspondra au remplissage comme ci-dessous<br/>\n#les pingouins est un ensemble de données dans le package R equatiomatic\nggplot(data=penguins,aes(x ='',fill=species)) +​\n                 geom_bar(alpha=1,width =0.9) +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"Compte\",fill =\"var1\",title= \"Diagramme Bulls Eye avec Remplissage: species\")​</br></br>\n#Vous pouvez créer un diagramme Bulls Eye en spécifiant une variable numérique comme variable y et une variable factorielle qui sert de remplissage. Ici, un cercle concentrique est créé pour chaque niveau de la variable de remplissage. La largeur du cercle concentrique est proportionnelle à la somme des valeurs y à chaque niveau de la variable factorielle. Ici, la variable factorielle correspondra au remplissage comme ci-dessous<br/>\nggplot(data=penguins,aes(x ='', y = bill_length_mm, fill = species)) +​\n                 geom_bar(alpha=1,width =0.9,stat=\"identity\") +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"var1\",fill =\"var2\",title= \"Diagramme Bulls Eye avec Esthétique X:,Esthétique Y: var1,Remplissage: var2\") </br></br>\n\n#Vous pouvez créer un diagramme en Coxcomb en spécifiant une variable x. Les tranches sont créées pour chaque niveau de la variable x, le rayon de chaque tranche est proportionnel au compte<br/>\n    ggplot(data=penguins, aes(x=island, )) +\n        geom_bar( alpha=1,width=1,) +\n        coord_polar(\"x\") +\n        labs(x=\"island\",  title= \"Diagramme en Coxcomb avec Esthétique X: island\") +\n        xlab(\"island\") + ylab(\"Compte\")</br></br>\n\n#Vous pouvez générer un diagramme en Coxcomb en spécifiant une variable X et un remplissage. Les tranches sont créées pour chaque niveau de la variable x. Chaque tranche est remplie par le compte des cas à chaque niveau de la variable de remplissage spécifiée.\nggplot(data=penguins, aes(x=island,fill=species )) +\n\tgeom_bar( alpha=1, width=1) +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\",  title= \"Diagramme en Coxcomb avec Esthétique X: island remplissage: species\") +\n\txlab(\"island\") + ylab(\"Compte\")</br></br>\n\n\n#Vous pouvez créer un diagramme en Coxcomb en spécifiant une variable x, une variable y et un remplissage. Les tranches sont créées pour chaque niveau de la variable x et remplies par la somme des valeurs de la variable y pour chaque niveau de la variable spécifiée dans le remplissage. Les tranches sont divisées par niveaux de la variable de remplissage. La surface occupée par chaque niveau de la variable de remplissage dans la tranche est proportionnelle à la somme des comptes de la variable y qui correspondent à la tranche et à la variable de remplissage.<br/>\nggplot(data=penguins, aes(x=island,y=bill_depth_mm,fill=species )) +\n\tgeom_bar( alpha=1,width=1,stat = \"identity\") +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\", y=\"bill_depth_mm\", title= \"Diagramme en Coxcomb avec Esthétique X: island Esthétique Y: bill_depth_mm remplissage: species\") +\n\txlab(\"island\") + ylab(\"bill_depth_mm\")</br></br>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndata: L'ensemble de données par défaut​\n</li>\n<li>\naes(): Génère des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géoms.​\n</li>\n<li>\nx: (Optionnel) Une variable factorielle/catégorique. La longueur de la barre correspond aux comptes de chaque niveau de la variable factorielle.​\n</li>\n<li>\nY: (Optionnel) une variable numérique\n</li>\n<li>\nfill: (Optionnel) Une variable factorielle/catégorique optionnelle pour regrouper les comptes des niveaux dans x: (voir ci-dessus)​\n</li>\n<li>\ngeom_bar(): Crée le graphique à barres, position =\"fill\" remplit la barre avec un pourcentage de chaque niveau de regroupement.​\n</li>\n<li>\nCoor_polar(): Le système de coordonnées polaires est le plus couramment utilisé pour les diagrammes circulaires, qui sont un graphique à barres empilées en coordonnées polaires.\n</li>\n<li>\nLabs(): Change les étiquettes des axes et les titres de légende (c'est optionnel)​\n</li>\n<li>\nfacet_grid(): Dispose les panneaux dans une grille (c'est optionnel)​\n</li>\n<li>\ntheme_calc(): Spécifie le thème du calculateur (c'est optionnel)​\n</li>\n<li>\ncoord_flip(): Inverser l'axe (c'est optionnel)​\n</li>\n<li>\nalpha: Contrôle l'opacité, prend des valeurs entre 0-1. 1 signifie aucune opacité.\n</li>\n</ul>\n<b>Paquet</b></br>\nggplot2;ggthemes;</br>\n<b>Aide</b></br>\nhelp(coord_polar, package=ggplot2)</br>\nAutre: Cliquez sur le bouton d'aide R pour obtenir une aide détaillée sur R. Vous pouvez également entrer help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n    "
  }
}