{
    "title": "Cox, Fine-Gray",
    "navigation": "Cox, Fine-Gray",
    "modelname": "Entrer le nom du modèle",
    "timevar": "Temps jusqu'à l'événement ou la censure",
    "eventvar": "Événements (0 = censure, 1 = événement 1, 2 = événement 2, ...)",
    "eventcodelabel": "Code de l'événement",
    "modelterms": "Constructeur d'expressions de modèle pour les variables indépendantes",
    "stratavarslabel": "Variables de stratification (facultatif)",
    "weightvar": "Pondérations (facultatif)",
    "tiemethod": "Méthode des temps liés",
    "diagnosticsbox": "Diagnostics du modèle",
    "martminlabel": "Valeur minimale de l'axe des résidus de martingale du modèle nul (-Inf à 1)",
    "anovachkboxlabel": "Analyse de la déviance (Type II)",
    "help": {
        "title": "Cox, Fine-Gray",
        "r_help": "help(coxph, package = 'survival')",
        "body": "\nAjuste un modèle de risques proportionnels de Cox Fine-Gray pour les données de survie avec des observations censurées en présence de risques concurrents. Les modèles de Fine-Gray modélisent l'effet des \nco-variables sur la fonction d'incidence cumulée. Une alternative est de modéliser l'effet des co-variables sur le risque spécifique à la cause, pour lequel des modèles de régression de Cox standard \npeuvent être utilisés. Une introduction au sujet des risques concurrents se trouve dans \"Introduction à l'analyse des données de survie en présence de risques concurrents\" par Peter Austin, \net. al., Circulation, 2016; 133:601-609.\n<br/><br/>\nLes statistiques d'ajustement du modèle, les estimations des paramètres et les ratios de risques sont fournis. Les options incluent la méthode des temps liés et les diagnostics de modèle. Le modèle est ajusté en utilisant les \nfonctions finegray et coxph du package survival.\n<br/><br/>\n<b>Entrer le nom du modèle :</b> Spécifiez le nom du modèle dans lequel les résultats seront stockés.\n<br/><br/>\n<b>Temps jusqu'à l'événement ou la censure :</b> Temps jusqu'au premier événement pour ceux qui subissent un événement ou jusqu'au dernier suivi pour ceux qui ne subissent aucun événement.\n<br/><br/>\n<b>Événements (0 = censure, 1 = événement 1, 2 = événement 2, ...):</b> Indicateur d'événement numérique ; 0=censure, 1=événement 1, 2=événement 2, etc.\n<br/><br/>\n<b>Code de l'événement :</b> Sélectionnez l'événement d'intérêt que vous souhaitez modéliser. Peut être sélectionné ou saisi.\n<br/><br/>\n<b>Constructeur de formule :</b> Construisez les termes à inclure dans le modèle. Les facteurs, chaînes de caractères et variables logiques seront codés en variables indicatrices. Les boutons fournis vous permettent de spécifier les \neffets principaux, les effets factoriels complets (effets principaux et toutes les interactions avec les variables impliquées), les polynômes, les interactions spécifiques, et de supprimer des termes de la liste. Les interactions avec \nles variables de stratification sont autorisées.\n<br/><br/>\n<b>Variables de stratification :</b> Spécifiez une ou plusieurs variables de stratification. Celles-ci peuvent être des variables numériques, factorielles, factorielles ordonnées ou de caractères. La stratification divise les \nsujets en groupes distincts, chaque groupe ayant une fonction de risque de base distincte. Si plusieurs variables de stratification sont fournies, une fonction de risque de base distincte est \nutilisée pour chaque combinaison de niveaux des variables de stratification.\n<br/><br/>\n<b>Pondérations :</b> Variable numérique pour les pondérations des observations. Utile dans les situations où chaque enregistrement ne doit pas être compté comme une seule observation.\n<br/><br/>\n<b>Méthode des temps liés :</b> Méthode de gestion des temps d'observation liés. Efron est généralement le meilleur choix lorsqu'il n'y a pas beaucoup de temps liés.\n<br/><br/>\n<b>Diagnostics du modèle :</b> Si sélectionné, une évaluation des risques proportionnels et de la forme fonctionnelle des co-variables sera réalisée, y compris les graphiques pertinents. \nSi des variables de stratification ou des prédicteurs non numériques sont présents, les graphiques de forme fonctionnelle ne seront pas produits. \nLa <b>Valeur minimale de l'axe des résidus de martingale du modèle nul</b> peut nécessiter une modification pour voir tous les résidus de martingale.\n<br/><br/>\n<b>Analyse de la déviance (Type II) :</b> Si sélectionnée, des tests sur l'ensemble de la variable (y compris les tests à plusieurs degrés de liberté pour les co-variables à plusieurs catégories) seront fournis. Des tests de Wald sont \nutilisés.\n<br/><br/>\n<b>Packages R requis :</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nCliquez sur le bouton Aide R pour obtenir de l'aide détaillée sur la fonction coxph. Allez dans Aide-> Aide sur la fonction R pour obtenir plus d'informations sur la fonction finegray, qui crée le \nset de données requis.\n"
    }
}
