{
  "title": "Cox, Fine-Gray",
  "navigation": "Cox, Fine-Gray",
  "modelname": "Entrez le nom du modèle",
  "timevar": "Temps jusqu'à l'événement ou censure",
  "eventvar": "Événements (0 = censure, 1 = événement 1, 2 = événement 2, ...)",
  "eventcodelabel": "Code d'événement",
  "modelterms": "Constructeur d'expression de modèle pour les variables indépendantes",
  "stratavarslabel": "Variables de stratification (optionnel)",
  "weightvar": "Poids (optionnel)",
  "tiemethod": "Méthode de temps lié",
  "diagnosticsbox": "Diagnostics du modèle",
  "martminlabel": "Valeur minimale de l'axe des résidus martingales du modèle nul (-Inf à 1)",
  "anovachkboxlabel": "Analyse de la déviance (Type II)",
  "help": {
    "title": "Cox, Fine-Gray",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nAjuste un modèle de risques proportionnels de Cox Fine-Gray pour des données de temps jusqu'à l'événement avec des observations censurées lorsque des risques concurrents sont présents. Les modèles Fine-Gray modélisent l'effet des \ncovariables sur la fonction d'incidence cumulée. Une alternative consiste à modéliser l'effet des covariables sur le risque spécifique à la cause, pour lequel des modèles de régression Cox standard \npeuvent être utilisés. Une introduction au sujet des risques concurrents peut être trouvée dans \"Introduction à l'analyse des données de survie en présence de risques concurrents\" par Peter Austin, \net. al., Circulation, 2016; 133:601-609. \n<br/><br/>\nDes statistiques d'ajustement du modèle, des estimations de paramètres et des rapports de risque sont fournis. Les options disponibles incluent la méthode de temps lié et les diagnostics du modèle. Le modèle est ajusté à l'aide des \nfinegray et coxph fonctions dans le package survival.\n<br/><br/>\n<b>Entrez le nom du modèle :</b> Spécifiez le nom du modèle où les résultats seront stockés.\n<br/><br/>\n<b>Temps jusqu'à l'événement ou censure :</b> Temps jusqu'au premier événement pour ceux qui subissent un événement ou temps jusqu'à la dernière suivi pour ceux qui ne subissent aucun événement\n<br/><br/>\n<b>Événements (0 = censure, 1 = événement 1, 2 = événement 2, ...):</b> Indicateur d'événement numérique ; 0=censure, 1=événement 1, 2=événement 2, etc.\n<br/><br/>\n<b>Code d'événement :</b> Sélectionnez l'événement d'intérêt que vous souhaitez modéliser. Peut être sélectionné ou tapé.\n<br/><br/>\n<b>Constructeur de formule :</b> Construisez des termes à inclure dans le modèle. Les facteurs, chaînes et variables logiques seront codés en dummy. Les boutons fournis vous permettent de spécifier les effets principaux, les effets factoriels complets (effets principaux et toutes les interactions avec les variables impliquées), des polynômes, des interactions spécifiques et de supprimer des termes de la liste. Les interactions \navec les variables de stratification sont autorisées.\n<br/><br/>\n<b>Variables de stratification :</b> Spécifiez une ou plusieurs variables de stratification. Celles-ci peuvent être numériques, factorielles, ordonnées ou des variables de caractères. Les strates divisent les \nindividus en groupes séparés, chaque groupe ayant une fonction de risque de base distincte. Si plusieurs variables de stratification sont données, une fonction de risque de base distincte est \nutilisée pour chaque combinaison de niveaux de variables de stratification.\n<br/><br/>\n<b>Poids :</b> Variable numérique pour les poids d'observation. Utile dans les situations où chaque enregistrement ne doit pas être compté comme une observation. \n<br/><br/>\n<b>Méthode de temps lié :</b> Méthode de rupture des temps observés liés. Efron est généralement le meilleur choix lorsqu'il n'y a pas beaucoup de temps liés.\n<br/><br/>\n<b>Diagnostics du modèle :</b> Si sélectionné, une évaluation des risques proportionnels et de la forme fonctionnelle des covariables sera effectuée, y compris des graphiques pertinents. \nS'il y a des variables de stratification ou des prédicteurs non numériques, des graphiques de forme fonctionnelle ne seront pas produits. \nLa <b>Valeur minimale de l'axe des résidus martingales du modèle nul</b> peut devoir être modifiée pour voir tous les résidus martingales.\n<br/><br/>\n<b>Analyse de la déviance (Type II) :</b> Si sélectionné, des tests de variables entières (y compris des tests à plusieurs degrés de liberté pour des covariables multi-catégorielles) seront fournis. Des tests de Wald \nsont utilisés.\n<br/><br/>\n<b>Packages R requis :</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nCliquez sur le bouton d'aide R pour obtenir une aide R détaillée sur la fonction coxph. Allez à Aide-> Aide sur la fonction R pour obtenir plus d'informations sur la fonction finegray, qui crée le \ndataset nécessaire.\n"
  }
}