{
    "title": "Cox, Basique",
    "navigation": "Cox, Basique",
    "helplabel": "Cliquez sur le bouton ? en haut à droite de la boîte de dialogue pour des détails sur les ensembles de données d'exemple et le format de données supporté.",
    "modelname": "Entrez le Nom du Modèle",
    "timevar": "Temps jusqu'à l'événement ou censure",
    "eventvar": "Événements (1 = événement 1, 0 = censure)",
    "destvars": "Variables Indépendantes",
    "weightvar": "Poids (optionnel)",
    "tiemethod": "Méthode de Temps Lié",
    "forestplotbox": "Graphique Forestier",
    "diagnosticsbox": "Diagnostics du Modèle",
    "martscalebox": "Valeur Minima de l'Axe des Résidus Martingale du Modèle Nul (-Inf à 1) :",
    "devbox": "Analyse de la Déviance (Type II)",
    "devtype": "Statistique de Test",
    "help": {
        "title": "Cox, Basique",
        "r_help": "help(coxph, package = 'survival')",
        "body": "\n\t\t\tVoir l'ensemble de données d'exemple dans le répertoire d'installation, l'emplacement par défaut est à la lettre de lecteur:&bsol;program files&bsol;BlueSky Statistics&bsol;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. La variable Followup_time doit être saisie comme le temps jusqu'à l'événement ou censure et la variable Event doit être saisie comme les Événements (1 = événement, 0 = censure). Sexe, âge et IMC peuvent être les variables indépendantes. \n\t\t\t<br/>\n            La variable d'événement doit être numérique, les facteurs ne sont pas autorisés. Si vous avez une variable d'événement qui est de type facteur avec 2 valeurs par exemple 0 et 1, convertissez-la en numérique.\n\t\t\tCet ensemble de données est une version mise à jour de l'ensemble de données mockstudy dans le package arsenal.\n\t\t\t<br/><br/>\n            <b>Modèle de Risque Proportionnel de Cox</b>\n            <br/>\n            <br/>\n            Ajuste un modèle de risque proportionnel de Cox pour les données de temps jusqu'à l'événement avec des observations censurées. Des statistiques d'ajustement du modèle, des estimations des paramètres et des rapports de risque sont fournis. Les options disponibles incluent la méthode de temps lié, les diagnostics du modèle tels que les tests de risques proportionnels et les évaluations de forme fonctionnelle des covariables, et un graphique forestier des rapports de risque avec intervalles de confiance. Le modèle est ajusté en utilisant la fonction coxph dans le package survival.\n            <br/>\n            <br/>\n            <b>Temps :</b> Temps jusqu'à l'événement pour ceux ayant eu l'événement ou temps jusqu'au dernier suivi pour ceux n'ayant pas eu l'événement\n            <br/><br/>\n            <b>Événement :</b> Indicateur numérique de l'événement ; 1=événement, 0=censure\n            <br/><br/>\n            <b>Variables Indépendantes :</b> Variables indépendantes à inclure dans le modèle. Les facteurs, chaînes de caractères et variables logiques seront codés par variables fictives.\n            <br/><br/>\n            <b>Poids :</b> Variable numérique pour les poids d'observation. Utile dans les situations où chaque enregistrement ne doit pas être compté comme une seule observation. \n            <br/>\n            <br/>\n            <b>Packages requis :</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Cliquez sur le bouton Obtenir de l'aide R pour obtenir de l'aide détaillée sur la fonction coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Options</b>\n            <br/>\n            <br/>\n            <b>Méthode de Temps Lié :</b>\n            <br/>\n            Méthode pour rompre les temps observés liés. Efron est généralement le meilleur choix lorsqu'il n'y a pas beaucoup de temps liés. La méthode exacte peut être bénéfique s'il y a beaucoup de temps liés, comme dans des situations de temps discret, mais peut prendre un peu plus de temps pour ajuster le modèle. \n            <br/>\n            <br/>\n            <b>Graphique Forestier :</b>\n            <br/>\n            Graphique des rapports de risque et des intervalles de confiance pour chaque prédicteur dans le modèle.\n            <br/>\n            <br/>\n            <b>Diagnostics du Modèle :</b>\n            <br/>\n            Si sélectionné, des tests et graphiques de risques proportionnels seront fournis, en plus des évaluations de la forme fonctionnelle pour chaque covariable dans le modèle. L'option de valeur minimale de l'axe des résidus martingale du modèle nul peut devoir être modifiée afin que tous les résidus apparaissent dans le graphique. Pour obtenir des évaluations de la forme fonctionnelle, vous devez spécifier uniquement des prédicteurs numériques et ne pas avoir de données manquantes. Voir Variables > Valeurs Manquantes > Supprimer les NAs.\n            <br/>\n            <br/>\n            <b>Analyse de la Déviance (Type II) :</b>\n            Test global de chaque prédicteur dans le modèle. Des tests à plusieurs degrés de liberté seront fournis pour des effets ayant plus de 2 niveaux. Les tests de Wald et de rapport de vraisemblance peuvent être obtenus, les tests de rapports de vraisemblance ayant de meilleures propriétés pour les petits échantillons.\n            \n"
    }
}
