{
  "title": "Cox, covariables binaires dépendantes du temps",
  "navigation": "Cox, covariables binaires dépendantes du temps",
  "modelname": "Entrez le nom du modèle",
  "timevar": "Temps jusqu'à l'événement ou censure",
  "eventvar": "Événements (1 = événement 1, 0 = censure)",
  "modelterms": "Constructeur d'expression de modèle pour les variables indépendantes",
  "switchtimeslabel": "Variables de temps d'exposition pour les covariables dépendantes du temps",
  "tdprefixlabel": "Préfixe pour les covariables dépendantes du temps",
  "subjectidlabel": "Identifiant du sujet",
  "weightvar": "Poids (optionnel)",
  "tiemethod": "Méthode de temps lié",
  "forestplotbox": "Graphique en forêt",
  "diagnosticsbox": "Diagnostics du modèle",
  "martscalebox": "Valeur minimale de l'axe des résidus de Martingale du modèle nul (-Inf à 1) :",
  "devbox": "Analyse de la déviance (Type II)",
  "devtype": "Statistique de test",
  "startstopboxlabel": "Afficher le jeu de données (début, fin)",
  "startstopnamelabel": "Nom du jeu de données",
  "help": {
    "title": "Cox, covariables binaires dépendantes du temps",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nAjuste un modèle de risques proportionnels de Cox pour des données de temps jusqu'à l'événement avec des observations censurées qui incluent une ou plusieurs covariables d'exposition binaires dépendantes du temps. Ce type de \ncovariable est une où l'occurrence d'un \"oui\" peut se produire après le début du suivi et une fois que ce \"oui\" se produit, il reste un \"oui\" pendant la durée du suivi. Un exemple \nserait le rejet d'un greffon après la transplantation (c'est-à-dire qu'avant que le rejet ne se produise, le patient n'a pas été \"exposé\" ; après que le rejet se produise, le patient a été \"exposé\").  \nTraiter une telle covariable comme étant connue au début du suivi est une forme de regard vers l'avenir et conduit à des estimations biaisées (également connu sous le nom de \"biais de temps immortel\").\n<br/><br/>\nDes statistiques d'ajustement de modèle, des estimations de paramètres et des rapports de risque sont fournis. Les options disponibles incluent la méthode de temps lié, les graphiques en forêt, les diagnostics de modèle, et la possibilité \nde visualiser le jeu de données sous-jacent du processus de comptage qui est créé. Un tableau décrivant les données du processus de comptage est fourni comme vérification que ces données sont créées \nappropriément.\n<br/><br/>  \nSommaires des données du processus de comptage :\n<br/>\n<b>tôt :</b> temps lorsque le prédicteur change avant le début du temps de suivi<br/>\n<b>tard :</b> temps lorsque le prédicteur change après la fin du suivi<br/>\n<b>à l'intérieur :</b> temps lorsque le prédicteur change à l'intérieur de la période de suivi<br/>\n<b>menant :</b> temps lorsque le prédicteur change au début du suivi<br/>\n<b>suivant :</b> temps lorsque le prédicteur change à la fin du suivi<br/>\n<b>limite :</b> temps lorsque le prédicteur change soit au début soit à la fin du suivi\n<br/><br/>\nPour plus d'informations sur ce tableau, consultez la vignette des covariables dépendantes du temps à <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>.  \n<br/><br/>\nLe modèle est ajusté en utilisant la fonction coxph dans le package survival.\n<br/><br/>\n<b>Entrez le nom du modèle :</b> Nom où les résultats du modèle seront stockés\n<br/><br/>\n<b>Temps jusqu'à l'événement ou censure :</b> Temps jusqu'à l'événement pour ceux qui vivent l'événement ou temps jusqu'au dernier suivi pour ceux qui ne vivent pas l'événement\n<br/><br/>\n<b>Événements (1=événement, 0=censure) :</b> Indicateur numérique d'événement ; 1=événement, 0=censure\n<br/><br/>\n<b>Constructeur de formule :</b> Construire des termes à inclure dans le modèle. Les facteurs, chaînes et variables logiques seront codés en variables fictives. Les boutons fournis vous permettent de spécifier les effets principaux, les effets factoriels complets (effets principaux et toutes les interactions avec les variables impliquées), les polynômes, les interactions spécifiques, et de supprimer des termes de la liste.\n<br/><br/>\n<b>Variables de temps d'exposition pour les covariables dépendantes du temps :</b> Variables numériques stockant le temps lorsque le sujet a été \"exposé\" pour la première fois. Cela doit être sur la même échelle de temps que \nla variable de temps. Les valeurs manquantes doivent être utilisées pour les sujets qui n'ont jamais été exposés. Chaque variable spécifiée ici créera une covariable dépendante du temps distincte. Un \ntemps spécifié suppose qu'un sujet n'est pas exposé avant ce temps et exposé après ce temps (c'est-à-dire lorsque le prédicteur change de \"non\" à \"oui\"). Spécifier uniquement des valeurs positives signifie \nque les sujets ne sont pas exposés pendant un certain temps après le début du suivi. Spécifier certains temps positifs et négatifs indique que certains sujets ont été exposés après et certains avant \nle début du suivi, respectivement. Si vous savez qu'un sujet a été exposé avant le début du suivi, mais que vous ne savez pas exactement quand, alors vous pouvez utiliser n'importe quel temps négatif \net le modèle traitera correctement ce sujet comme étant exposé pendant toute la durée de son suivi. Si les sujets sont exposés après le suivi, alors ils sont correctement traités comme n'étant pas\nexposés pendant toute la durée de leur suivi.\n<br/><br/>\n<b>Préfixe pour les covariables dépendantes du temps :</b> Préfixe souhaité à utiliser pour chaque covariable dépendante du temps spécifiée dans le champ <b>Variables de temps d'exposition</b>. Le nom de\nchaque covariable dépendante du temps commencera par ce préfixe.\n<br/><br/>\n<b>Identifiant du sujet :</b> La variable stockant l'identifiant du sujet. Ceci est requis pour des raisons de création du jeu de données sous-jacent du processus de comptage.\n<br/><br/>\n<b>Poids :</b> Variable numérique pour les poids d'observation. Utile dans les situations où chaque enregistrement ne doit pas être compté comme une observation.\n<br/><br/>\n<b>Options :</b>\n<br/><br/>\n<b>Méthode de temps lié :</b> Méthode de rupture des temps observés liés. Efron est généralement le meilleur choix lorsque les temps liés ne sont pas nombreux. La méthode exacte peut être bénéfique si \nil y a de nombreux temps liés, comme dans des situations de temps discret, mais peut prendre un peu plus de temps pour que le modèle soit ajusté.\n<br/><br/>\n<b>Graphique en forêt :</b> créera un graphique en forêt des rapports de risque et des intervalles de confiance\n<br/><br/>\n<b>Afficher le jeu de données (début, fin) :</b> Affichera le jeu de données sous-jacent du processus de comptage utilisé dans les calculs. Cela divise le temps de suivi de chaque sujet en parties, en fonction \nde quand la covariable dépendante du temps doit changer de valeurs.\n<br/><br/>\n<b>Diagnostics du modèle :</b> Si sélectionné, des tests et graphiques de risques proportionnels seront fournis, en plus des évaluations de la forme fonctionnelle pour chaque covariable dans le modèle.  \nL'option de valeur minimale de l'axe des résidus de Martingale du modèle nul pourrait devoir être modifiée afin que tous les résidus apparaissent dans le graphique. Pour obtenir des évaluations de forme fonctionnelle, vous devez \nspecifier uniquement des prédicteurs numériques et ne pas avoir de données manquantes. Voir Variables > Valeurs manquantes > Supprimer les NAs.\n<br/><br/>\n<b>Analyse de la déviance (Type II) :</b> Test global de chaque prédicteur dans le modèle. Des tests multi-degrés de liberté seront fournis pour les effets ayant plus de 2 niveaux.  \nDes tests de Wald et de rapport de vraisemblance peuvent être obtenus, les tests de rapport de vraisemblance ayant de meilleures propriétés pour les petits échantillons.           \n<br/><br/>\n<b>Packages requis :</b> survival, broom, survminer, car\n"
  }
}