{
    "title": "Cox, Avancé",
    "navigation": "Cox, Avancé",
    "helplabel": "Cliquez sur le bouton ? en haut à droite de la boîte de dialogue pour des détails sur les ensembles de données d'exemple et le format de données pris en charge.",
    "modelname": "Entrer le nom du modèle",
    "timevar": "Temps jusqu'à l'événement ou la censure",
    "eventvar": "Événements (1 = événement, 0 = censure)",
    "modelterms": "Constructeur d'expressions de modèle pour les variables indépendantes",
    "weightvar": "Pondérations (facultatif)",
    "tiemethod": "Méthode des temps liés",
    "forestplotbox": "Graphique en forêt",
    "diagnosticsbox": "Diagnostics du modèle",
    "martscalebox": "Valeur minimale de l'axe des résidus de Martingale du modèle nul (-Inf à 1) :",
    "devbox": "Analyse de la déviance (Type II)",
    "devtype": "Statistique de test",
    "help": {
        "title": "Cox, Avancé",
        "r_help": "help(coxph, package = 'survival')",
        "body": "\n\t\t\tVoir l'ensemble de données d'exemple dans le répertoire d'installation, l'emplacement par défaut est le lecteur :&bsol;program files&bsol;BioStat Prime;10&bsol;Samples_and_Documents&bsol;Datasets_and_Demos&bsol;Regression_Cox&bsol;mockstudy_upd.RData. La variable Followup_time doit être saisie comme le temps jusqu'à l'événement ou la censure et la variable Event doit être saisie comme les événements (1 = événement, 0 = censure). Sexe, âge et IMC peuvent être les variables indépendantes.\n\t\t\t<br/>\n\t\t\tCet ensemble de données est une version mise à jour de l'ensemble de données mockstudy du package arsenal.\n\t\t\t<br/><br/>\n            <b>Modèle de risques proportionnels de Cox</b>\n            <br/>\n            <br/>\n            Ajuste un modèle de risques proportionnels de Cox pour des données de survie avec des observations censurées. Les statistiques d'ajustement du modèle, les estimations des paramètres et les ratios de risque sont fournis. Les options disponibles incluent la méthode des temps liés, les diagnostics du modèle tels que les tests de risques proportionnels et les évaluations de la forme fonctionnelle des covariables, et un graphique en forêt des ratios de risque avec intervalles de confiance. Le modèle est ajusté en utilisant la fonction coxph du package survival.\n            <br/>\n            <br/>\n            <b>Temps :</b> Temps jusqu'à l'événement pour ceux qui subissent l'événement ou temps jusqu'au dernier suivi pour ceux qui ne subissent pas l'événement\n            <br/><br/>\n            <b>Événement :</b> Indicateur numérique d'événement ; 1=événement, 0=censure\n            <br/><br/>\n            <b>Variables indépendantes :</b> Variables indépendantes à inclure dans le modèle. Les facteurs, chaînes de caractères et variables logiques seront codés en variables indicatrices.\n            <br/><br/>\n            <b>Pondérations :</b> Variable numérique pour les pondérations des observations. Utile dans les situations où chaque enregistrement ne doit pas être compté comme une seule observation.\n            <br/>\n            <br/>\n            <b>Packages requis :</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            Cliquez sur le bouton Obtenir l'aide R pour obtenir une aide détaillée sur la fonction coxph.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Options</b>\n            <br/>\n            <br/>\n            <b>Méthode des temps liés :</b>\n            <br/>\n            Méthode de gestion des temps d'observation liés. Efron est généralement le meilleur choix lorsqu'il n'y a pas beaucoup de temps liés. La méthode exacte peut être bénéfique s'il y a de nombreux temps liés, comme dans les situations de temps discrets, mais elle peut prendre un peu plus de temps pour l'ajustement du modèle.\n            <br/>\n            <br/>\n            <b>Graphique en forêt :</b>\n            <br/>\n            Graphique des ratios de risque et des intervalles de confiance pour chaque prédicteur dans le modèle.\n            <br/>\n            <br/>\n            <b>Diagnostics du modèle :</b>\n            <br/>\n            Si sélectionné, des tests de risques proportionnels et des graphiques seront fournis, en plus des évaluations de la forme fonctionnelle pour chaque covariable dans le modèle. L'option de la valeur minimale de l'axe des résidus de Martingale du modèle nul peut nécessiter d'être modifiée pour que tous les résidus apparaissent dans le graphique. Pour obtenir les évaluations de la forme fonctionnelle, vous devez spécifier uniquement des prédicteurs numériques et ne pas avoir de données manquantes. Voir Variables > Valeurs manquantes > Supprimer les NAs.\n            <br/>\n            <br/>\n            <b>Analyse de la déviance (Type II) :</b>\n            Test global de chaque prédicteur dans le modèle. Des tests avec plusieurs degrés de liberté seront fournis pour les effets ayant plus de 2 niveaux. Les tests de Wald et les tests de rapport de vraisemblance peuvent être obtenus, les tests de rapport de vraisemblance ayant de meilleures propriétés pour les petits échantillons.\n            \n"
    }
}
