{
  "help": {
    "title": "Tableau croisé",
    "r_help": "help(CrossTable, package=gmodels)",
    "body": "\n            <b>Description</b></br>\nCrée une table croisée avec des variables de ligne, de colonne et de couche. Lorsque plusieurs variables de ligne et de colonne sont spécifiées, nous générons une table croisée séparée pour chaque paire de variables de ligne et de colonne. De plus, les éléments suivants sont affichés<br/>\nComptes attendus<br/>\nPourcentages de lignes et de colonnes<br/>\nRésidus non standardisés, standardisés et ajustés<br/>\nChisq avec rapport de cotes, statistiques de McNemar et Fisher<br/>\nREMARQUE : Nous supprimons automatiquement toutes les lignes où chaque compte est 0. Cela peut avoir un impact sur la façon dont les tests Chisq, McNemar et Fisher sont exécutés. Par exemple, vous pouvez vous attendre à 3 lignes et 2 colonnes car la variable de ligne a 3 niveaux et la variable de colonne 2 niveaux. Cependant, comme un niveau de ligne a tous les comptes à 0, vous obtenez une table 2*2. Alors que la simulation de Monte Carlo avec le test de Fisher fonctionne sur une table 3*2, elle ne s'applique pas à une table 2*2 et le test de Fisher normal est exécuté. \n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nBSkyCrossTable(x,y,layers, weight, datasetname, chisq= FALSE, prop.r=FALSE, prop.c=FALSE, resid=FALSE, sresid=FALSE, expected=FALSE, asresid=FALSE,long_table = FALSE )\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: variable de ligne\n</li>\n<li>\ny: variable de colonne\n</li>\n<li>\nlayers: une ou plusieurs variables pour les couches\n</li>\n<li>\nweights: une variable numérique contenant les poids de fréquence\n</li>\n<li>\ndatasetname: Nom du jeu de données à partir duquel x, y et layers (variables) sont choisis\n</li>\n<li>\nchisq:  si TRUE, génère une table de chi carré\n</li>\n<li>\nprop.r: Les pourcentages de lignes sont produits si cela est TRUE\n</li>\n<li>\nprop.c: Les pourcentages de colonnes sont générés si cela est TRUE\n</li>\n<li>\nresid: si TRUE, des résidus non standardisés sont générés\n</li>\n<li>\nsresid: si TRUE, des résidus standardisés sont générés\n</li>\n<li>\nexpected: Les comptes attendus sont générés si cela est TRUE\n</li>\n<li>\nasresid:  si TRUE, des résidus ajustés sont générés\n</li>\n<li>\nlong_table: L'option Long table est introduite pour accueillir l'analyse effectuée sur un grand nombre de variables. Choisir le format long contrôle la largeur de la table de sortie, ce qui facilite la visualisation des résultats sans avoir à faire défiler vers la droite dans la fenêtre de sortie. \n</li>\n</ul>\n<b>valeur</b></br>\nUne liste avec les résultats\n<br/>\n<b>Exemple</b></br>\n<code> \nBSky_Multiway_Cross_Tab = BSkyCrossTable(x=c('manufact'),y=c('model'),<br/>\nlayers=c('type'),datasetname='Dataset2',<br/>\nchisq = FALSE,prop.r=FALSE,prop.c=FALSE,<br/>\nresid=FALSE,sresid=FALSE,expected=FALSE,<br/>\nasresid=FALSE)</br>\nBSkyFormat(BSky_Multiway_Cross_Tab)</br>\n</code> <br/>\n<b>Paquet</b></br>\ngmodels</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette fenêtre de dialogue ou exécutez la commande suivante help(CrossTable, package=gmodels) en créant un bloc de code R en cliquant sur + dans la fenêtre de sortie  \n    "
  }
}