{
  "title": "Graphique de Cullen et Frey avec des descriptifs d'une distribution empirique pour des données non censurées",
  "navigation": "Analyse de distribution (graphique de Cullen et Frey)",
  "variableSelcted": "Sélectionnez une variable contenant la distribution",
  "boot": "(Optionnel) Valeurs de bootstrap de l'asymétrie et de la kurtosis. Si spécifié, doit être un entier supérieur à 10",
  "discreteChk": "Discret - non coché (par défaut) pour uniforme, normal, logistique, lognormal, beta et gamma. Coché pour poisson et binomial négatif",
  "method": "Non biaisé (par défaut) pour des valeurs estimées non biaisées de statistiques ou échantillon pour des valeurs d'échantillon",
  "help": {
    "title": "Description d'une distribution empirique pour des données non censurées",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Description</b></br>\n\t\t\t\tCalcule les paramètres descriptifs d'une distribution empirique pour des données non censurées et fournit un graphique de l'asymétrie et de la kurtosis\n\t\t\t\t<br/>\n\t\t\t\tPour l'aide détaillée - utilisez R help(descdist, package = fitdistrplus)\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMinimum, maximum, médiane, moyenne, écart-type de l'échantillon, et échantillon (si méthode==\"sample\") ou par défaut des estimations non biaisées de \n\t\t\t\tl'asymétrie et des valeurs de kurtosis de Pearson sont imprimées (Sokal et Rohlf, 1995). Un graphique de l'asymétrie et de la kurtosis tel que le \n\t\t\t\tproposé par Cullen et Frey (1999) est donné pour la distribution empirique. Sur ce graphique, les valeurs pour les distributions courantes \n\t\t\t\tsont également affichées comme outils pour aider au choix des distributions à ajuster aux données. Pour certaines \n\t\t\t\tdistributions (normale, uniforme, logistique, exponentielle par exemple), il n'y a qu'une seule valeur possible pour l'asymétrie \n\t\t\t\tet la kurtosis (pour une distribution normale par exemple, asymétrie = 0 et kurtosis = 3), et la distribution est donc \n\t\t\t\treprésentée par un point sur le graphique. Pour d'autres distributions, des zones de valeurs possibles sont représentées, consistant en \n\t\t\t\tlignes (distributions gamma et lognormales par exemple), ou de plus grandes zones (distribution beta par exemple). \n\t\t\t\tLa distribution de Weibull n'est pas représentée sur le graphique mais il est indiqué dans la légende que des formes proches \n\t\t\t\tdes distributions lognormales et gamma peuvent être obtenues avec cette distribution.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tPour tenir compte de l'incertitude des valeurs estimées de kurtosis et d'asymétrie à partir des données, l'ensemble de données \n\t\t\t\tpeut être bootstrapé en fixant l'argument boot à un entier supérieur à 10. Les valeurs de bootstrap de l'asymétrie et de la kurtosis \n\t\t\t\tcorrespondant aux échantillons bootstrap sont alors calculées et rapportées en couleur bleue sur le graphique de l'asymétrie et de la kurtosis.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSi discret est TRUE, les distributions représentées sont les distributions de Poisson, binomiales négatives, et la distribution normale \n\t\t\t\tvers laquelle les précédentes distributions discrètes peuvent converger. Si discret est FALSE, ce sont les distributions uniformes, normales, \n\t\t\t\tlogistiques, lognormales, beta et gamma.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Pour un bon aperçu de l'ajustement des distributions, voir https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}