{
  "title": "Un aperçu rapide de la fonctionnalité de conception des expériences (DoE)",
  "navigation": "Aperçu du DoE",
  "lbl1": "1. Pour créer une conception sous DoE -> menu créer une conception, vous avez d'abord besoin d'un ensemble de données avec des détails sur les facteurs pour créer la conception.",
  "lbl2": "2. Pour commencer, choisissez l'un des ensembles de données d'exemple (fichier Excel) fournis dans le répertoire des ensembles de données d'exemple dans le répertoire d'installation de votre application ou vous pouvez créer une table/ensemble de données de détails sur les facteurs à la volée avec le menu DoE -> Créer des détails de facteur DoE.",
  "lbl3": "3. Une fois qu'un ensemble de données est ouvert avec le menu ouvrir un fichier ou créé à la volée à l'étape 2 ci-dessus, allez sous DoE -> menu créer une conception pour créer une conception appropriée.",
  "lbl4": "4. Après qu'une conception a été créée avec succès, elle apparaîtra sur la grille UI de l'ensemble de données. Vous pouvez utiliser le menu DoE -> Inspecter la conception pour inspecter la conception juste créée.",
  "lbl5": "5. Exportons la conception vers un répertoire du système de fichiers avec le menu DoE -> Exporter la conception. Cela créera automatiquement trois fichiers (.csv, .rda, .html) avec les mêmes noms que l'ensemble de données de conception sur la grille UI dans le chemin du répertoire de fichiers spécifié.",
  "lbl6": "6. Le fichier CSV exporté à l'étape 5 est destiné à être utilisé pour mettre en place les expériences dans le monde réel comme spécifié dans la conception pour collecter/enregistrer des résultats pour une analyse ultérieure.",
  "lbl7": "7. Les résultats sont enregistrés et ajoutés en tant que colonne(s) séparée(s) appelées réponses dans le vocabulaire DoE dans le fichier CSV. Ne changez pas l'extension du fichier CSV en un autre format de fichier. Consultez le répertoire des ensembles de données d'exemple pour DoE, des exemples de fichiers CSV étiquetés comme avecresp pour obtenir les valeurs des colonnes de résultats/réponses à copier pour créer des colonnes de réponses dans votre propre fichier CSV qui a été exporté dans le cadre de l'exportation de conception à l'étape 5 ci-dessus.",
  "lbl8": "8. Importons le fichier de conception CSV avec les colonnes de réponse ajoutées à l'application avec le menu DoE -> Importer la réponse de conception.",
  "lbl9": "9. Pour importer le fichier CSV de conception à l'étape 8, la conception originale (qui a été exportée) doit être disponible dans la grille UI de l'ensemble de données. Si elle n'est pas disponible, utilisez le menu ouvrir un fichier pour charger le fichier .rda de conception qui a été créé dans le cadre de l'exportation de conception à l'étape 5.",
  "lbl10": "10. Après que le fichier CSV a été importé avec succès contre le bon ensemble de données de conception actif et a créé une nouvelle conception avec les colonnes de réponse, vous pouvez utiliser le menu DoE -> Inspecter la conception pour inspecter la conception avec les colonnes de réponse.",
  "lbl11": "11. Maintenant, la conception avec les colonnes de réponse est prête pour l'analyse avec le menu DoE -> Analyser la conception avec diverses méthodes d'analyse, par exemple, modèle linéaire, modèle de surface de réponse, etc."
}