{
  "title": "Égalité des variances",
  "navigation": "Égalité des variances",
  "label1": "Choisissez des tests",
  "bartlett": "Test de Bartlett",
  "levene": "Test de Levene",
  "fligner": "Test de Fligner–Killeen",
  "normal_distribution": "Test basé sur la distribution normale",
  "pairwiseLeveneTest": "Test de Levene pairwise",
  "label2": "Format des données",
  "wide": "Format large",
  "long": "Format long",
  "label3": "Niveau de confiance",
  "label4": "Hypothèse alternative",
  "alt1": "Deux côtés",
  "alt2": "Plus grand",
  "alt3": "Moins",
  "label5": "Méthode d'ajustement de la valeur p (pour le test de Levene pairwise)",
  "padj1": "Holm",
  "padj2": "Hochberg",
  "padj3": "Hommel",
  "padj4": "Bonferroni",
  "padj5": "BH",
  "padj6": "BY",
  "padj7": "FDR",
  "padj8": "Aucun",
  "help": {
    "title": "Tests pour l'égalité des variances",
    "r_help": "help(bartlett.test, package=stats); help(leveneTest, package=car); help(fligner.test, package=stats)",
    "body": "\n<b>Description</b></br>\nTeste l'égalité des variances. Prend en charge les données dans les formats suivants<br/>\nlarg: Chaque variable contient des mesures par exemple, la variable 1 contient des mesures de la machine A, la variable 2 contient des mesures de la machine B...<br/>\nlong: Les mesures dans une variable sont regroupées par une ou plusieurs variables par exemple, les scores de test sont regroupés par sexe et classe. <br/>\nLa méthode d'ajustement de la valeur p est appliquée uniquement lorsque le test de Levene pairwise est sélectionné.<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"large\" ),<br/>\n    cols_to_compare = c('A','B','C'),<br/>\n    response_col = NULL,<br/>\n    group_col = NULL,<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"deux.côtés\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n    Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset1\"<br/>\n)<br/>\nBSky_variance_analysis (<br/>\n    data_format = c(\"long\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Score'),<br/>\n    group_col = c('Genre','Classe'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"deux.côtés\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset2\"<br/>\n)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndata_format: Peut être large ou long\n</li>\n<li>\ncols_to_compare: Les variables à comparer les variances lorsque le jeu de données est au format large, NULL pour les données au format long\n</li>\n<li>\nresponse_col: La variable de mesure à comparer les variances entre les groupes. NULL pour les données larges\n</li>\n<li>\ngroup_col: Une ou plusieurs variables utilisées pour regrouper la variable de mesure, nous testons l'égalité des variances entre les groupes\n</li>\n<li>\nconf_level: Intervalle de confiance\n</li>\n<li>\nalt_hypothesis: Défini sur deux.côtés\n</li>\n<li>\np_adjust_method: Méthode utilisée pour ajuster la valeur p\n</li>\n<li>\nnormal_distribution: si TRUE, nous supposons la normalité\n</li>\n<li>\nFligner_Killeen: si TRUE, effectue un test de Fligner_Killeen\n</li>\n<li>\npairwiseComparison: Effectuer un test de Levene pairwise\n</li>\n<li>\ndatasetname: Nom du jeu de données à partir duquel x,y et les couches (variables) sont choisis\n</li>\n</ul>\n<b>Valeur</b></br>\nIntervalles de confiance de Bonferroni pour les intervalles de confiance spécifiés. Résultats des tests pour les tests de comparaisons multiples (lorsque la normalité n'est pas supposée) et résultats d'autres tests\n<br/>\n<b>Exemple</b></br>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"long\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Score'),<br/>\n    group_col = c('Genre','Classe'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"deux.côtés\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset2\"<br/>\n)<br/>\n</code> <br/>\n\n<b>Détails</b></br>\nTest de comparaisons multiples</br>\nUtilisé lorsque vous ne sélectionnez pas “Utiliser un test basé sur la distribution normale” – c'est-à-dire, vous privilégiez des méthodes robustes aux distributions non normales. </br>\nSi vous avez k > 2 groupes, nous calculons les intervalles pour les écarts-types de sorte que si deux intervalles ne se chevauchent pas, les écarts-types associés sont \nsignificativement différents.</br> \nPour k = 2 échantillons, il utilise la méthode de Bonett pour tester deux variances avec un ratio hypothétique = 1. </br>\nLorsque le test global de comparaisons multiples est significatif, les écarts-types qui correspondent aux intervalles non chevauchants sont statistiquement différents.</br>\nAvantages : Plus puissant que la méthode de Levene dans de nombreuses situations (pour les distributions continues). Mais lorsque les tailles d'échantillons sont petites (< 20) ou que les distributions sont \nextêmement asymétriques/à queues lourdes, le taux d'erreur de type I peut être gonflé.</br>\nValeur p pour le test</br>\nS'il y a 2 échantillons dans le design, alors nous calculons la valeur p pour le test de comparaisons multiples en utilisant la méthode de Bonett pour un test de 2 variances et un ratio hypothétique, Ρo, de 1.</br>\nS'il y a k > 2 échantillons dans le design, alors soit Pij la valeur p du test pour n'importe quelle paire (i, j ) d'échantillons. La valeur p pour la procédure de comparaisons multiples en tant que test global d'égalité des variances est donnée par ce qui suit :</br>\nP =min{Pij, 1<=i<j<=k}\n</br>\nStatistique du test de Levene</br>\nLe test de Levene est utilisé pour tester l'hypothèse nulle selon laquelle les variances sont égales entre les groupes (H₀ : toutes les variances égales) contre l'alternative qu'au moins \none variance diffère. </br>\nIl est plus robuste aux départs de la normalité par rapport aux tests qui supposent la normalité (par exemple, le test de Bartlett). </br>\nSpécifiquement, nous utilisons la modification de Brown-Forsythe (écarts absolus par rapport à la médiane de l'échantillon plutôt qu'à la moyenne) pour une robustesse améliorée. </br>\nInterprétation : Si la valeur p < α, vous rejetez H₀ et concluez que les variances ne sont pas égales. </br>\n</br>\nStatistique du test de Bartlett</br>\nLe test de Bartlett est conçu pour tester l'égalité des variances lorsque les données sont normalement distribuées. H₀ : toutes les variances égales. Lorsque k > 2 groupes,\nous utilisons le test de Bartlett (si “utiliser un test basé sur la distribution normale” est sélectionné). </br>\nLa statistique de test (commument notée B) est basée sur la comparaison de la moyenne arithmétique pondérée et de la moyenne géométrique pondérée des variances d'échantillon. </br>\nLa statistique suit (approximativement) une distribution du chi carré avec k-1 df. </br>\nParce que le test de Bartlett suppose la normalité, il est sensible aux départs de la normalité (c'est-à-dire, des distributions non normales ou à queues lourdes peuvent conduire à des résultats trompeurs)</br>\n</br>\nStatistique du test F</br>\nLorsqu'il y a exactement deux groupes (k = 2), nous utilisons un test F plutôt que le test de Bartlett (si “utiliser un test basé sur la distribution normale” est sélectionné). </br>\nH₀ : les variances sont égales (σ₁² = σ₂²). </br>\nLa statistique F est calculée comme le rapport des deux variances d'échantillon (plus grande sur plus petite). Ensuite, la valeur p dépend de l'hypothèse alternative\n (unilatérale “moins que” ou “plus que”, ou bilatérale). </br>\nInterprétation : Si la valeur p < α, rejetez H₀ et concluez que les variances diffèrent. Elle n'est valide que sous l'hypothèse de normalité.</br>\n<b>Valeur</b><br/>\n\n<b>Package</b></br>\nBlueSky</br>\n<b>Aide</b></br>\nVeuillez contacter support@blueskystatistics.com pour des informations supplémentaires.\n    "
  }
}