{
  "title": "Diagramme de forêt",
  "navigation": "Diagramme de forêt",
  "modelselectorlabel": "Sélectionner le nom du modèle",
  "plotvarslabel": "Variables à tracer (aucune spécifiée trace toutes les variables)",
  "varlabelslabel": "Étiquettes de variables (spécifiez comme varname='label' séparées par des virgules, par exemple âge='Âge en années', bmi='Indice de masse corporelle'); peut utiliser \\n pour des sauts de ligne dans une étiquette",
  "notelabel": "REMARQUE : Changer les étiquettes nécessite un nouveau réglage du modèle, donc de grandes données pourraient prendre du temps",
  "label3": "REMARQUE : LES MODÈLES CONSTRUITS À L'AIDE DE L'AJUSTEMENT DU MODÈLE (ENTRAÎNER) NE SONT PAS SOUTENUS",
  "estimateoptlabel": "Options d'estimation",
  "estimatelabellabel": "Étiquette",
  "exponentiatelabel": "Forcer l'exponentiation de l'estimation du paramètre",
  "linecolorlabel": "Couleur de la ligne",
  "pointshapelabel": "Forme du point",
  "pointsizelabel": "Taille du point (0-10 mm)",
  "styleoptlabel": "Options de style",
  "factorseplinelabel": "Noms des facteurs sur des lignes séparées",
  "plotbandslabel": "Bandes de tracé",
  "textsizelabel": "Taille du texte (1-10 mm)",
  "estticklabelsizelabel": "Taille de l'étiquette de marque d'estimation (1-50)",
  "help": {
    "title": "Diagrammes de forêt",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nCela crée un graphique des coefficients du modèle, ou des coefficients exponentiés, à partir d'un modèle de régression. Chaque variable est tracée dans sa propre ligne avec des totaux, des estimations de paramètres, \nintervalles de confiance à 95 % et valeurs p. Les variables peuvent être étiquetées pour permettre une présentation plus agréable. Actuellement, les modèles de classe lm (modèles linéaires), glm (modèles linéaires généralisés, \nqui incluent logistique et Poisson), coxph (risques proportionnels de Cox) et rq (régression quantile) sont pris en charge.\n<br/><br/>\n<b>Sélectionner le nom du modèle :</b> Choisissez le nom du modèle tel que spécifié lors de l'ajustement du modèle. C'est un champ requis.\n<br/><br/>\n<b>Variables à tracer :</b> Si vous avez accès aux données qui ont créé le modèle, vous pouvez spécifier un sous-ensemble des variables dans le modèle à inclure dans le graphique. Si aucune variable \n n'est spécifiée, cela par défaut à toutes les variables incluses.\n<br/><br/>\n<b>Étiquettes de variables :</b> Spécifiez des étiquettes plus agréables à utiliser à la place des noms de variables. Si une variable n'est pas étiquetée, le nom de la variable ou l'étiquette de variable existante utilisée lors de l'ajustement du modèle (si elle existe) sera tracée. Celles-ci doivent être spécifiées dans un format variablename=\"label\", séparées par des virgules. Notez qu'inclure \\n dans une étiquette forcera\nun saut de ligne dans l'étiquette. Cela signifie que vous pouvez spécifier des étiquettes multi-lignes et cela pourrait être avantageux pour les longues étiquettes, car les longues étiquettes laissées sur une seule ligne laissent moins d'espace pour les estimations. Faire un résumé du modèle avec Évaluation du modèle -> Résumer -> Résumer un modèle imprimera les variables du modèle utilisées au cas où vous n'auriez pas accès à l'ensemble de données. REMARQUE : Il y a un \nbug actuel dans le paquet R forestmodel qui n'utilise pas les étiquettes de variables pour les facteurs dans les modèles de Cox - le développeur du paquet a été informé. Une alternative jusqu'à ce que le paquet soit \nréparé est de réajuster le modèle avec des variables codées par des indicateurs au lieu de facteurs.\n<br/><br/><br/>\n<b>Options d'estimation :</b>\n<br/><br/>\n<b>Étiquette :</b> Étiquette optionnelle pour la colonne d'estimation dans le graphique. La régression logistique et les modèles de Cox seront automatiquement détectés et les estimations étiquetées comme \"Odds Ratio\" et \n\"Hazard Ratio\", respectivement. D'autres modèles utiliseront la valeur par défaut de \"Estimate\" si vous ne spécifiez rien.\n<br/><br/>   \n<b>Forcer l'exponentiation de l'estimation du paramètre :</b> Choisissez cela pour forcer les valeurs de exp(coefficient) à être affichées, c'est-à-dire 2.718 élevé à la puissance du coefficient. Les coefficients exponentiés \nsont couramment utilisés dans les modèles de risques proportionnels de Cox (pour les rapports de risque), la régression logistique (pour les rapports de cotes), les modèles log-binomiaux (pour les risques relatifs) et la régression de Poisson (pour les rapports de taux). Par défaut, la régression logistique et les modèles de Cox seront automatiquement détectés et exp(coefficient) sera utilisé.\n<br/><br/>\n<b>Couleur de la ligne :</b> Couleur de la ligne pour les intervalles de confiance.\n<br/><br/>\n<b>Forme du point :</b> La forme des points pour les estimations de paramètres dans le graphique.\n<br/><br/>\n<b>Taille du point (0-10 mm) :</b>  La taille des points, en millimètres, pour les estimations de paramètres dans le graphique. 0 mm supprimerait les points. La valeur par défaut est de 4 mm.\n<br/><br/><br/>\n<b>Options de style :</b>\n<br/><br/>\n<b>Noms des facteurs sur des lignes séparées :</b> Choisissez cela pour afficher les noms des variables de facteur sur une ligne séparée des niveaux du facteur.\n<br/><br/>\n<b>Bandes de tracé :</b> Choisissez cela pour afficher des régions ombragées alternées pour chaque ligne du graphique.\n<br/><br/>\n<b>Taille du texte (1-10 mm) :</b> Taille du texte, en millimètres, dans le graphique. La valeur par défaut est de 4 mm.\n<br/><br/>\nRemarque : Si vous souhaitez changer la taille globale du graphique, la taille du graphique peut être définie à l'aide du bouton Thèmes dans le menu à trois points.\n<br/><br/>\n<b>Taille de l'étiquette de marque d'estimation (1-50) :</b> Taille des étiquettes de marque pour l'axe d'estimation.\n<br/><br/>\n<b>Packages R requis :</b>  forestmodel, arsenal, survival, quantreg, insight\n"
  }
}