{
  "title": "Modèle Linéaire Généralisé",
  "navigation": "MLG",
  "modelname": "Nom du modèle",
  "dependent": "Variable dépendante",
  "offset": "Décalage",
  "weights": "Poids",
  "formulaBuilder": "Constructeur de formule",
  "family": "Sélectionnez une famille et une fonction de lien",
  "theta": "Spécifiez une valeur de theta (appliqué uniquement pour la famille binomiale négative)",
  "expCoefficients": "Exponentier les coefficients",
  "help": {
    "title": "Modèle Linéaire Généralisé",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>Description</b></br>\n            glm est utilisé pour ajuster des modèles linéaires généralisés, spécifiés en donnant une description symbolique du prédicteur linéaire et une description de la distribution d'erreur.\n            <br/>\nNOTE 1 : Une zone de texte est fournie pour spécifier la valeur initiale de theta, cela s'applique uniquement à la famille binomiale négative. Si omis, un estimateur de moment après un ajustement initial utilisant un GLM de Poisson est utilisé.<br/>\nLe theta initial qui est calculé est affiché dans la sortie au-dessus du tableau récapitulatif du GLM.<br/>\nNOTE 2 : Lors de la spécification d'une variable contenant des poids, soyez conscient que puisque nous utilisons l'option na.exclude pour construire le modèle, toutes les valeurs NA sont automatiquement supprimées des variables dépendantes et indépendantes.<br/> \nCela peut provoquer un décalage car les valeurs NA ne sont PAS automatiquement supprimées de la variable de poids. <br/>\nDans cette situation, vous verrez l'erreur que les longueurs de variable diffèrent (trouvé pour (poids))<br/>\nPour résoudre cette erreur, allez à Variables>Valeurs manquantes>Supprimer les NAs et sélectionnez les variables dépendantes, indépendantes et la variable de poids pour supprimer les valeurs manquantes et reconstruire le modèle.<br/>\nNOTE 3 : Variables de facteur de code fictif, lors de l'utilisation de la famille binomiale négative, voir Variables > Calculer > Code fictif.<br/>\nNOTE 4 : L'intercepte est inclus par défaut, pour supprimer l'intercepte, entrez -1 dans le constructeur de formule\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            glm(formula, family = gaussian, data, weights, subset,\n                na.action, start = NULL, etastart, mustart, offset,\n                control = list(...), model = TRUE, method = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, contrasts = NULL, ...)\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            formula: un objet de classe \"formule\" (ou un qui peut être converti en cette classe) : une description symbolique du modèle à ajuster. Les détails de la spécification du modèle sont donnés sous ‘Détails’.\n            </li>\n            <li>\n            family: une description de la distribution d'erreur et de la fonction de lien à utiliser dans le modèle. Pour glm, cela peut être une chaîne de caractères nommant une fonction de famille, une fonction de famille ou le résultat d'un appel à une fonction de famille. Pour glm.fit, seule la troisième option est supportée. (Voir family pour les détails des fonctions de famille.)\n            </li>\n            <li>\n            data: un cadre de données, une liste ou un environnement optionnel (ou un objet pouvant être converti par as.data.frame en un cadre de données) contenant les variables du modèle. Si non trouvé dans les données, les variables sont prises de l'environnement(formula), typiquement l'environnement à partir duquel glm est appelé.\n            </li>\n            <li>\n            weights: un vecteur optionnel de \"poids a priori\" à utiliser dans le processus d'ajustement. Doit être NULL ou un vecteur numérique.\n            </li>\n            <li>\n            subset: un vecteur optionnel spécifiant un sous-ensemble d'observations à utiliser dans le processus d'ajustement.\n            </li>\n            <li>\n            na.action: une fonction qui indique ce qui doit se passer lorsque les données contiennent des NA. La valeur par défaut est définie par le paramètre na.action des options, et est na.fail si cela n'est pas défini. La valeur par défaut \"d'usine\" est na.omit. Une autre valeur possible est NULL, aucune action. La valeur na.exclude peut être utile.\n            </li>\n            </ul>\n            <b>Détails</b><br/>\n            Un prédicteur typique a la forme réponse ~ termes où réponse est le vecteur de réponse (numérique) et termes est une série de termes qui spécifie un prédicteur linéaire pour la réponse. Pour les familles binomiales et quasibinomiales, la réponse peut également être spécifiée comme un facteur (lorsque le premier niveau désigne l'échec et tous les autres le succès) ou comme une matrice à deux colonnes avec les colonnes donnant les nombres de succès et d'échecs. Une spécification de termes de la forme premier + second indique tous les termes dans premier avec tous les termes dans second avec les doublons supprimés.<br/>\n            <b>Valeur</b><br/>\n            Un objet de classe \"glm\" est une liste contenant au moins les composants suivants :\n            <ul>\n            <li>\n            coefficients: un vecteur nommé de coefficients\n            </li>\n            <li>\n            residuals: les résidus de travail, c'est-à-dire les résidus dans la dernière itération de l'ajustement IWLS. Puisque les cas avec des poids nuls sont omis, leurs résidus de travail sont NA.\n            </li>\n            <li>\n            fitted.values: les valeurs moyennes ajustées, obtenues en transformant les prédicteurs linéaires par l'inverse de la fonction de lien.\n            </li>\n            <li>\n            rank: le rang numérique du modèle linéaire ajusté.\n            </li>\n            <li>\n            family: l'objet de famille utilisé.\n            </li>\n            <li>\n            linear.predictors: l'ajustement linéaire sur l'échelle de lien.\n            deviance: jusqu'à une constante, moins deux fois le log-vraisemblance maximisé. Lorsque cela a du sens, la constante est choisie de sorte qu'un modèle saturé ait une déviance nulle.\n            </li>\n            <li>\n            aic\t: Une version du Critère d'Information d'Akaike, moins deux fois le log-vraisemblance maximisé plus deux fois le nombre de paramètres, calculé via le composant aic de la famille. Pour les familles binomiales et de Poisson, la dispersion est fixée à un et le nombre de paramètres est le nombre de coefficients. Pour les familles gaussiennes, Gamma et gaussiennes inverses, la dispersion est estimée à partir de la déviance résiduelle, et le nombre de paramètres est le nombre de coefficients plus un. Pour une famille gaussienne, le MLE de la dispersion est utilisé donc c'est une valeur valide de AIC, mais pour les familles Gamma et gaussiennes inverses, ce n'est pas le cas. Pour les familles ajustées par quasi-vraisemblance, la valeur est NA.\n            </li>\n            </ul>\n            <b>Paquet</b></br>\nglm</br>\n<b>Aide</b></br>\nhelp(glm, package ='stats')\n"
  }
}