{
  "title": "Heatmap",
  "navigation": "Heatmap",
  "rowVariables": "Variable cible",
  "columnVariables": "Variables de colonne",
  "options": "Options",
  "title1": "Titre de la Heatmap",
  "dendrogram": "Dendrogramme:",
  "label1": "Options de dendrogramme de ligne:",
  "plotRowYes": "Réorganiser le dendrogramme en fonction des moyennes des lignes",
  "plotRowNo": "Pas de réorganisation (le dendrogramme ne sera pas calculé)",
  "label2": "Options de dendrogramme de colonne",
  "plotColumnYes": "Réorganiser le dendrogramme en fonction des moyennes des colonnes",
  "plotColumnNo": "Non",
  "symmetric": "Dans le cas d'une matrice symétrique, traiter les colonnes comme des lignes",
  "trace": "Options pour dessiner une ligne de trace solide à travers les lignes, les colonnes, à la fois les lignes et les colonnes ou aucune",
  "density": "Options de densité:",
  "scale": "Les valeurs doivent être centrées dans la direction des lignes, la direction des colonnes ou aucune",
  "label3": "Valeurs manquantes",
  "Remove": "Supprimer toutes les lignes contenant une valeur manquante",
  "Keep": "Conserver les lignes contenant des valeurs manquantes",
  "label4": "Placer les valeurs dans la cellule",
  "valuesNo": "Oui",
  "valuesYes": "Non",
  "noteColors": "Choisissez une couleur pour les valeurs des cellules (Après la sélection de la couleur, cliquez en dehors du contrôle pour appliquer):",
  "help": {
    "title": "Heatmap",
    "r_help": "help(heatmap.2,package='gplots')",
    "body": "\n            <b>Description</b></br>\n            Une heatmap est une représentation graphique des données où les valeurs individuelles contenues dans une matrice sont représentées par des couleurs. Des facettes peuvent être créées en spécifiant une variable facteur. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y.</br>\n            Le jeu de données doit être au format column1, column2…columnN où</br>\n            column1: Identifie les sujets, par exemple, les noms des personnes dont les valeurs de cholestérol sont tracées</br>\n            column2:  Identifie les valeurs de cholestérol au temps 1</br>\n            column3:  Identifie les valeurs de cholestérol au temps 2</br>\n            column4:  Identifie les valeurs de cholestérol au temps 3</br>\n            column5:  Identifie les valeurs de cholestérol au temps 4…</br>\n            Column1 est une étiquette pour chaque ligne dans la heatmap.</br>\n            Pour Column 2 et suivantes, les valeurs de chaque ligne de la colonne sont représentées par des couleurs dans la heatmap.</br>\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            BSkyHeatMap(rowVariable=c('Sujet'),colVariables=c('chol1','chol2','chol3','chol4'),Colv=FALSE,Rowv=TRUE,dendrogram=c(\"row\"),scale=c(\"none\"),trace=c(\"none\"),density.info=c(\"none\"),na.rm=TRUE,noteForCells =FALSE,notecol =c(\"black\"),dataset=\"Dataset4\")<br/>\n            La fonction ci-dessus se trouve dans le paquet BlueSky et invoque la fonction heatmap.2 dans le paquet gplots.\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data: Le jeu de données par défaut\n            </li>\n            <li>\n            rowVariable: La variable de colonne qui contient des informations sur les sujets pour lesquels le graphique est construit, voir ci-dessus\n            </li>\n            <li>\n            colVariables:  une liste de variables de colonne qui contiennent des valeurs qui seront représentées par des couleurs dans la heatmap\n            </li>\n            <li>\n            Colv: détermine si et comment le dendrogramme de colonne doit être réorganisé. A les options comme l'argument Rowv ci-dessus et de plus, lorsque x est une matrice carrée, Colv=\"Rowv\" signifie que les colonnes doivent être traitées de manière identique aux lignes.\n            </li>\n            <li>\n            Rowv:   détermine si et comment le dendrogramme de ligne doit être réorganisé. Par défaut, c'est TRUE, ce qui implique que le dendrogramme est calculé et réorganisé en fonction des moyennes des lignes. Si NULL ou FALSE, alors aucun dendrogramme n'est calculé et aucune réorganisation n'est effectuée. Si un dendrogramme, alors il est utilisé \"tel quel\", c'est-à-dire sans aucune réorganisation. Si un vecteur d'entiers, alors le dendrogramme est calculé et réorganisé en fonction de l'ordre du vecteur.\n            </li>\n            <li>\n            na.rm: logique déterminant si les NA doivent être supprimés\n            </li>\n            <li>\n            dendrogram: chaîne de caractères indiquant s'il faut dessiner 'none', 'row', 'column' ou 'both' dendrogrammes. Par défaut, c'est 'both'. Cependant, si Rowv (ou Colv) est FALSE ou NULL et que le dendrogramme est 'both', alors un avertissement est émis et les arguments Rowv (ou Colv) sont honorés.\n            </li>\n            <li>\n            scale: chaîne de caractères indiquant si les valeurs doivent être centrées et mises à l'échelle dans la direction des lignes ou la direction des colonnes, ou aucune. La valeur par défaut est \"none\".\n            </li>\n            <li>\n            trace: chaîne de caractères indiquant si les valeurs doivent être centrées et mises à l'échelle dans la direction des lignes ou la direction des colonnes, ou aucune. La valeur par défaut est \"none\".\n            </li>\n            <li>\n            density.info: chaîne de caractères indiquant s'il faut superposer un 'histogramme', un 'graphique de densité', ou aucun graphique ('none') sur la clé de couleur.\n            </li>\n            <li>\n            noteForCells: logique indiquant si les valeurs doivent être placées dans les cellules de la heatmap.\n            </li>\n            <li>\n            notecol: couleur des notes. Si spécifié, les valeurs sont notées dans les cellules de la heatmap dans la couleur spécifiée..\n            </li>\n            </ul>\n            <b>Paquet</b></br>\n            BlueSky;gplots;</br>\n            <b>Aide</b></br>\n            help(heatmap.2,package='gplots')</br>\n            Autre: Cliquez sur le bouton d'aide R pour obtenir une aide R détaillée. Vous pouvez également entrer help(labs), help(geom_histogram), help(aes), help(facet_grid), help(theme_calc), help(coord_flip).</br>\n            Jeux de données d'exemple: Voir Heatmaps.Rdata dans le dossier Jeux de données d'exemple</br>\n     "
  }
}