{
  "title": "Histogramme avec courbes normales superposées par facette et groupe",
  "navigation": "Histogramme",
  "x": "Axe X, spécifiez une ou plusieurs variables numériques",
  "bins": "Spécifiez le nombre de bacs",
  "fill": "Spécifiez une variable de regroupement (catégorie)",
  "binwidth": "Largeur du bac",
  "barcolor": "Sélectionnez éventuellement une couleur de remplissage (Après la sélection de la couleur, cliquez en dehors du contrôle pour appliquer)",
  "alpha": "Opacité (0-1)",
  "flip": "Inverser l'axe",
  "specify_a_title": "Entrez un titre",
  "x_title": "Étiquette de l'axe X",
  "y_title": "Étiquette de l'axe Y",
  "facets_lbl" : "Facettes",
  "Facetrow": "Ligne de facette",
  "Facetcolumn": "Colonne de facette",
  "Facetwrap": "Enveloppe de facette (si choisie, toute sélection de ligne et de colonne de facette sera ignorée)",
  "Facetscale": "Échelle de facette",
  "normalCurveColor": "Sélectionnez éventuellement une couleur de courbe normale (Après la sélection de la couleur, cliquez en dehors du contrôle pour appliquer)",
  "rugPlot": "Afficher un graphique de tapis (adapté aux petits ensembles de données)",
  "normalCurve": "Afficher une courbe normale (les valeurs manquantes sont supprimées pour que la courbe s'affiche)",
  "help": {
    "title": "Histogramme",
    "r_help": "help(geom_histogram, package=ggplot2)",
    "body": "\n            <b>Description</b></br>\n            Un histogramme est une représentation graphique de la distribution de données numériques. C'est une estimation de la distribution de probabilité d'une variable continue (variable quantitative). Vous pouvez spécifier une largeur de bac ou utiliser la valeur par défaut, voir ci-dessous. Des facettes peuvent être créées en spécifiant une variable facteur. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes X et Y.</br>\n            Lorsque vous avez plusieurs variables sélectionnées pour la variable de l'axe X, nous créons un histogramme séparé pour chaque variable de l'axe X. Nous superposons éventuellement une courbe normale et un graphique de tapis.</br>\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Comptes\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data: L'ensemble de données par défaut​\n            </li>\n            <li>\n            aes(): Générer des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géométries.​\n            </li>\n            <li>\n            x: Une variable numérique/échelle à tracer pour l'histogramme.​\n            </li>\n            <li>\n            geom_histogram: Crée un histogramme, par défaut, stat_bin utilise 30 bacs - ce n'est pas un bon défaut, mais l'idée est de vous faire expérimenter avec différentes largeurs de bac..\n            </li>\n            <li>\n            geom_rug: Crée un graphique de tapis    \n            </li>\n            <li>\n            stat_function: Crée une courbe normale (Remarque : les valeurs manquantes doivent être supprimées pour que la courbe s'affiche)    \n            </li>\n            <li>\n            Labs(): Change les étiquettes des axes et les titres de légende (c'est optionnel)​\n            </li>\n            <li>\n            facet_grid(): Dispose les panneaux dans une grille (c'est optionnel)​\n            </li>\n            <li>\n            theme_calc(): Spécifie le thème de la calculatrice (c'est optionnel)​\n            </li>\n            <li>\n            coord_flip(): Inverser l'axe (c'est optionnel)\n            </li>\n            <li>\n            alpha: Prend une valeur entre 0-1, 1 signifie aucune opacité. L'opacité s'applique à la couleur de remplissage de l'histogramme\n            </li>\n            </ul>\n            <b>Package</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Aide</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Cliquez sur le bouton d'aide R pour obtenir une aide détaillée sur R. Vous pouvez également entrer help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​\n           "
  }
}