{
  "title": "Distribution hypergéométrique",
  "navigation": "Distribution hypergéométrique",
  "m": "m (nombre de boules blanches dans l'urne)",
  "n": "n (nombre de boules noires dans l'urne)",
  "k": "k (nombre de boules tirées de l'urne)",
  "labelSig": "Niveau de signification",
  "plotProb": "Tracer la fonction de masse de probabilité",
  "plotDistr": "Tracer la fonction de distribution",
  "help": {
    "title": "Distribution hypergéométrique",
    "r_help": "aide(qhyper, package=stats)",
    "body": "\n\n            <b>Description</b>\n            <br/>\n            Densité, fonction de distribution, fonction quantile et génération aléatoire pour la distribution hypergéométrique.\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code>\n                dhyper(x, m, n, k, log = FALSE)\n                <br/>\n                phyper(q, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                qhyper(p, m, n, k, lower.tail = TRUE, log.p = FALSE)\n                <br/>\n                rhyper(nn, m, n, k)\n                <br/>\n            </code>\n            <br/>\n            <b>Arguments</b>\n            <br/>\n            <ul>\n                <li>x, q : vecteur de quantiles représentant le nombre de boules blanches tirées sans remise d'une urne contenant à la fois des boules noires et blanches.</li>\n                \n                \n                <li>m : le nombre de boules blanches dans l'urne.</li>\n                \n                \n                <li>n : le nombre de boules noires dans l'urne.</li>\n                \n                \n                <li>k : le nombre de boules tirées de l'urne.</li>\n                \n                \n                <li>p : probabilité, elle doit être comprise entre 0 et 1.</li>\n                \n                \n                <li>nn : nombre d'observations. Si la longueur(nn) > 1, la longueur est considérée comme le nombre requis.</li>\n                \n                \n                <li>log, log.p : logique; si TRUE, les probabilités p sont données sous forme de log(p).</li>\n                \n                \n                <li>lower.tail : logique; si TRUE (par défaut), les probabilités sont P[X ≤ x], sinon, P[X > x].</li>\n            </ul>\n            \n            \n            \n            <br/>\n            <b>Détails</b>\n            <br/>\n            La distribution hypergéométrique est utilisée pour l'échantillonnage sans remise. La densité de cette distribution avec les paramètres m, n et k (appelés Np, N-Np et n, respectivement dans la référence ci-dessous) est donnée par\n            <br/>\n            <code>\n                p(x) = choose(m, x) choose(n, k-x) / choose(m+n, k)\n                pour x = 0, …, k.\n            </code>\n            <br/>\n            Notez que p(x) est non nul uniquement pour max(0, k-n) <= x <= min(k, m).\n            <br/>\n            Avec p := m/(m+n) (donc Np = N \times p dans la notation de la référence), les deux premiers moments sont la moyenne\n            <br/>\n            <code>E[X] = μ = k p</code>\n            <br/>\n            et la variance\n            <br/>\n            <code>Var(X) = k p (1 - p) * (m+n-k)/(m+n-1),</code>\n            <br/>\n            ce qui montre la proximité avec la Binomiale(k,p) (où l'hypergéométrique a une variance plus petite sauf si k = 1).\n            <br/>\n            Le quantile est défini comme la plus petite valeur x telle que F(x) ≥ p, où F est la fonction de distribution.\n            <br/>\n            Si l'un de m, n, k, dépasse .Machine$integer.max, l'équivalent de qhyper(runif(nn), m,n,k) est utilisé, lorsque une approximation binomiale peut être considérablement plus efficace.\n            <br/>\n            <br/><b>Valeur</b>\n            <br/>\n            dhyper donne la densité, phyper donne la fonction de distribution, qhyper donne la fonction quantile, et rhyper génère des variables aléatoires.\n            <br/>\n            Des arguments invalides entraîneront un retour de valeur NaN, avec un avertissement.\n            <br/>\n            La longueur du résultat est déterminée par n pour rhyper, et est le maximum des longueurs des arguments numériques pour les autres fonctions.\n            <br/>\n            Les arguments numériques autres que n sont recyclés à la longueur du résultat. Seuls les premiers éléments des arguments logiques sont utilisés.            \n      "
  }
}