{
  "title": "Installer le(s) paquet(s) R",
  "navigation": "Installer le(s) paquet(s) R",
  "package_name": "Veuillez entrer le(s) nom(s) d'un ou plusieurs paquet(s) séparés par une virgule",
  "instruction_text": "\nREMARQUE : Les noms des paquets R sont sensibles à la casse. Vous pouvez installer plusieurs noms de paquets en utilisant , comme séparateur\nExemple 1 : foreign\nExemple 2 : foreign, car, MASS",
  "instruction_text1": "\nREMARQUE : Vous devez avoir un accès en écriture au chemin sélectionné ci-dessous, sinon relancez l'application en sélectionnant l'option exécuter en tant que \nadministrateur",
  "repository": "Entrez l'URL du dépôt CRAN, le défaut https://cloud.r-project.org/ installe à partir du miroir CRAN le plus proche de vous.",
  "label1": "Exemple 1 : foreign",
  "label2": "REMARQUE : Le logo R qui s'affiche dans la barre de menu est la propriété de copyright de la fondation R",
  "installPath": "Sélectionnez le chemin de la bibliothèque R où le paquet R sera installé",
  "help": {
    "title": "Installer le(s) paquet(s) R",
    "r_help": "help(install.packages)",
    "body": "\n            <b>Description</b></br>\n            Installer ou mettre à jour un ou plusieurs paquets R vers le chemin de bibliothèque sélectionné.</br>\n            REMARQUE :</br>\n            1. Nous installerons tous les paquets dont dépendent, importent ou lient les paquets spécifiés.</br>\n            2. Si vous mettez à jour un paquet existant, vous devez redémarrer l'application BioStat Prime.</br>\n            3. Nous chargerons le paquet nouvellement installé/mis à jour après l'installation.</br>\n            4. Par défaut, nous installerons toujours dans la bibliothèque personnelle R de l'utilisateur sur la machine locale.</br>\n            5. Si le même paquet R est installé à la fois dans l'emplacement de la bibliothèque personnelle et dans l'emplacement de la bibliothèque système (l'emplacement de la bibliothèque système est l'emplacement d'installation par défaut qui contient les paquets \n                que nous expédions par défaut avec BioStat Prime), nous chargeons le paquet depuis l'emplacement personnel.</br>\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Chemin vers la bibliothèque utilisateur ou système\", repos = \"Chemin vers le dépôt contenant le paquet\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            pkgs : vecteur de caractères des noms des paquets dont les versions actuelles doivent être téléchargées depuis le dépôt spécifié.\n            </li>\n            <li>\n            lib : vecteur de caractères donnant le chemin de la bibliothèque sur la machine locale où installer le(s) paquet(s). Nous par défaut à l'emplacement de la bibliothèque personnelle de l'utilisateur.\n            </li>\n            <li>\n            repos : vecteur de caractères, les URL de base des dépôts à utiliser, par exemple, l'URL d'un miroir CRAN tel que \"https://cloud.r-project.org\".\n            </li>\n            <li>\n            BSkypackageinstall : C'est un indicateur que l'application BioStat Prime utilise en interne pour signaler que \n            le paquet est installé via le menu et pour le transmettre.\n            </li>\n            </ul>\n            <b>Valeur</b><br/>\n            NULL invisible.<br/>\n            <b>Exemples</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Paquet</b></br>\n            broom</br>\n            <b>Aide</b></br>\n            Pour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue\n\n"
  }
}