{
  "title": "Faire des prédictions avec KNN",
  "navigation": "Prédire avec KNN",
  "dataset_var": "Ouvrir des ensembles de données",
  "header": "KNN est un classificateur paresseux, il ne crée pas de modèle ajusté qui peut être utilisé pour prédire plus tard. Il ajuste et fait des prédictions en même temps. Vous devez suivre les étapes ci-dessous pour faire des prédictions/évaluer.",
  "NOTE1": "L'ENSEMBLE DE DONNÉES ACTIF DOIT ÊTRE L'ENSEMBLE DE DONNÉES SUR LEQUEL VOUS SOUHAITEZ CONSTRUIRE UN MODÈLE ET NON L'ENSEMBLE DE DONNÉES QUE VOUS SOUHAITEZ ÉVALUER",
  "step1": "Étape 1 : Comme d'habitude, vous devez sélectionner l'ensemble de données d'entraînement dans le Datagrid avant d'ouvrir cette boîte de dialogue.",
  "step2": "Étape 2 : Sélectionnez la variable dépendante dans l'ensemble de données d'entraînement utilisé pour ajuster le modèle.",
  "step3": "Étape 3 : Spécifiez les variables indépendantes dans l'ensemble de données d'entraînement.",
  "step4": "Étape 4 : Spécifiez le nombre de voisins à utiliser pour construire le modèle.",
  "step5": "Étape 5 : Entrez un préfixe de variable pour la nouvelle variable contenant les prédictions.",
  "step6": "Étape 6 : Spécifiez l'ensemble de données auquel ajouter les prédictions. Il doit contenir les mêmes variables indépendantes utilisées pour entraîner le modèle.",
  "dependentvar": "Variable dépendante (de l'ensemble de données d'entraînement)",
  "independentvars": "Variable(s) indépendante(s) (de l'ensemble de données d'entraînement)",
  "Seed": "Définir la graine",
  "datasetToScore": "Ensemble de données à évaluer/prédire",
  "Group2": "Paramètres de réglage pour KNN",
  "noneighbhors": "Nombre de voisins (Lorsqu'une valeur n'est pas spécifiée, la valeur par défaut est définie sur la racine carrée du nombre d'observations dans l'ensemble de données)",
  "testDatasetName": "Entrez le nom de l'ensemble de données pour faire des prédictions",
  "predictedValues": "Entrez le préfixe de variable pour les valeurs prédites. Une nouvelle variable est créée en ajoutant le préfixe au nom de la variable dépendante.",
  "help": {
    "title": "K Plus Proche Voisin",
    "r_help": "help(knn, package ='class')",
    "body": "\n                <b>Description</b></br>\nClassification par k-Plus Proche Voisin\n<br/>\n<b>Note : </b></br>\nVoir le texte d'aide sur la boîte de dialogue\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nknn(train= dataset1, test, cl, k = 1, l = 0, prob = FALSE, use.all = TRUE)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ntrain : C'est l'ensemble de données source (actif) utilisé pour créer un modèle ajusté.\n</li>\n<li>\ntest : C'est l'ensemble de données dans lequel les valeurs prédites seront enregistrées lorsque le préfixe que vous avez spécifié. Une nouvelle variable est créée en ajoutant le préfixe à la variable dépendante spécifiée à partir de l'ensemble de données source.\n</li>\n<li>\ncl : facteur des classifications réelles de l'ensemble de données utilisé pour ajuster le modèle\n</li>\n<li>\nk : nombre de voisins considérés.\n</li>\n<li>\nl : vote minimum pour une décision définitive, sinon doute. (Plus précisément, moins de k-l votes dissidents sont autorisés, même si k est augmenté par des égalités.)\n</li>\n<li>\nprob : Si cela est vrai, la proportion des votes pour la classe gagnante est renvoyée en tant qu'attribut prob.\n</li>\n<li>\nuse.all : contrôle le traitement des égalités. Si vrai, toutes les distances égales à la k-ième plus grande sont incluses. Si faux, une sélection aléatoire de distances égales à la k-ième est choisie pour utiliser exactement k voisins.\n</li>\n</ul>\n<b>Valeur</b></br>\nFacteur des classifications de l'ensemble de test. le doute sera renvoyé comme NA.</br>\n<b>Paquet</b></br>\ncaret;class</br>\n<b>Aide</b></br>\naide(knn, package ='class')\n                "
  }
}