{
  "title": "Graphique Linéaire",
  "navigation": "Points",
  "label1": "Cliquez sur l'onglet ci-dessous correspondant au type de graphique linéaire que vous souhaitez. Par défaut, il est connecté par ordre.",
  "x": "Axe X",
  "y": "Axe Y, spécifiez une ou plusieurs variables numériques",
  "color": "Groupe/Couleur, spécifiez une variable factorielle",
  "line": "Par Ordre",
  "linetype": "Un type de ligne distinct sera utilisé pour chaque niveau de la variable factorielle",
  "stair": "Marches",
  "path": "Par occurrence",
  "lineChartType": "Cliquez sur le type de Graphique Linéaire ci-dessous",
  "alpha": "Opacité (0-1)",
  "flipBox": "Inverser l'Axe",
  "specify_a_title": "Entrez un titre",
  "x_title": "Étiquette de l'axe X",
  "y_title": "Étiquette de l'axe Y",
  "Facetrow": "Ligne de Facette",
  "Facetcolumn": "Colonne de Facette",
  "Facetwrap": "Enveloppe de Facette",
  "Facetscale": "Échelle de Facette",
  "sizePoint": "Taille des points",
  "sizeLine": "Largeur de la ligne",
  "facets_lbl" : "Facettes",
  "help": {
    "title": "Graphique Linéaire",
    "r_help": "help(geom_line, package=ggplot2)",
    "body": "\n            <b>Description</b></br>\n            L'option d'utiliser un type de ligne différent pour chaque niveau de la variable factorielle spécifiée est fournie pour soutenir les publications qui ne prennent pas en charge la couleur. \n            Crée un graphique linéaire (connecté par ordre) ou un graphique en marches ou ordonne le graphique linéaire par occurrence des points dans le jeu de données. Cliquez sur l'onglet correspondant au type de graphique linéaire que vous souhaitez.</br>\n            Graphique linéaire (connecté par ordre) : Un graphique linéaire trace une ligne à travers des points définis par les coordonnées x et y et les connecte dans l'ordre des variables sur l'axe x. Lorsqu'un groupe/couleur est défini comme une variable factorielle, les points sont regroupés par couleur et une ligne distincte est générée pour chaque groupe. Des facettes peuvent être créées en spécifiant une variable factorielle. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y​</br>\n            Graphique en marches : Un graphique linéaire trace une ligne à travers des points définis par les coordonnées x et y et crée un graphique en marches, mettant en évidence exactement quand les changements se produisent. Lorsqu'une couleur est définie comme une variable factorielle, les points sont regroupés par couleur et une ligne distincte est générée pour chaque groupe de couleur. Des facettes peuvent être créées en spécifiant une variable factorielle. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y​</br>\n            Ordonné par occurrence : Un graphique linéaire trace une ligne à travers des points définis par les coordonnées x et y et les connecte dans l'ordre dans lequel les variables apparaissent dans le jeu de données. Lorsqu'une couleur est définie comme une variable factorielle, les points sont regroupés par couleur et une ligne distincte est générée pour chaque groupe de couleur. Des facettes peuvent être créées en spécifiant une variable factorielle. Vous pouvez également spécifier des thèmes, et spécifier un titre et des étiquettes pour les axes x et y​.</br>\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            #Graphique linéaire<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_line( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\", title= \"Graphique linéaire pour ...\")<br/>\n            #Graphique en marches<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_step( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Graphique linéaire pour ...\")<br/>\n            #Ordonné par occurrence<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_path( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"Graphique linéaire pour ...\")\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data: Le jeu de données par défaut​\n            </li>\n            <li>\n            aes(): Générer des mappages esthétiques qui décrivent comment les variables dans les données sont mappées aux propriétés visuelles (esthétiques) des géométries.​\n            </li>\n            <li>\n            x: Une variable numérique ou factorielle\n            </li>\n            <li>\n            y: la variable numérique/échelle pour laquelle les points sont tracés sur l'axe y​\n            </li>\n            <li>\n            color: une variable factorielle optionnelle pour regrouper les points (par couleur)​\n            </li>\n            <li>\n            labs(): Changer les étiquettes des axes et les titres de légende (C'est optionnel)​\n            </li>\n            <li>\n            facet_grid(): Disposer les panneaux dans une grille (C'est optionnel)​\n            </li>\n            <li>\n            theme_calc(): Spécifie le thème du calculateur (C'est optionnel)​\n            </li>\n            <li>\n            geom_line(): Connecter les observations ordonnées par valeur x, voir x:​\n            </li>\n            <li>\n            coord_flip(): Inverser l'axe (C'est optionnel)​\n            </li>\n            </ul>\n            <b>Package</b></br>\n            ggplot2;ggthemes;</br>\n            <b>Aide</b></br>\n            #Graphique linéaire\n            help(geom_line, package='ggplot2')\n            #Graphique linéaire en marches\n            help(geom_step, package=ggplot2)\n            #Ordre des variables\n            help(geom_path, package='ggplot2')\n            Autre : Cliquez sur le bouton Aide R pour obtenir une aide détaillée sur R. Vous pouvez également entrer help(labs), help(geom_line), help(aes), help(facet_grid), help(theme_calc), help(coord_flip)​            \n    "
  }
}