{
  "title": "Charger des modèles à partir d'un fichier",
  "navigation": "Charger des modèles",
  "filterModels": "Filtrer les modèles par classe",
  "modelSelection": "Sélectionnez un modèle à enregistrer",
  "importResp": "Sélectionnez un fichier à partir duquel charger des modèles",
  "label1": "Tous les modèles dans le fichier spécifié seront chargés en mémoire. Remarque : Si vous avez des modèles existants avec le même nom, ils seront écrasés.",
  "levelOfInterest": "Lorsque la variable à prédire a 2 niveaux, spécifiez le niveau d'intérêt. La matrice de confusion et les statistiques associées sont affichées avec le niveau d'intérêt spécifié comme référence.",
  "label12": "Résultats des tests : Dès qu'un modèle est sélectionné, nous effectuerons des tests pour voir si les variables dépendantes spécifiées dans le modèle sont \navailables dans le jeu de données à évaluer. Les résultats seront affichés ici.",
  "label2": "Enregistrer les valeurs prédites et les statistiques de soutien.",
  "label3": "Les prédictions et les probabilités prédites, le cas échéant, sont stockées dans le jeu de données évalué en tant que nouvelles variables avec le préfixe ci-dessous.",
  "label4": "**Pour les variables dépendantes avec 2 niveaux, le 2ème niveau est considéré comme le niveau positif. Voir Données > Niveaux de facteur > Réorganiser les niveaux manuellement pour changer l'ordre des niveaux de facteur et reconstruire le modèle.",
  "conflevel": "Enregistrer les intervalles de confiance pour les valeurs prédites individuelles **(Valide uniquement pour les modèles linéaires (classe lm))",
  "roctable": "Afficher le tableau ROC (**Pour les variables dépendantes binaires uniquement)",
  "colname": "Spécifiez le préfixe du nom de colonne",
  "label5": "**Cocher la case ci-dessus entraînera une pénalité de performance pour les grands ensembles de données.",
  "level": "Spécifiez le niveau de confiance",
  "confusioncheck": "Générer la matrice de confusion",
  "help": {
    "title": "Charger des modèles",
    "r_help": "help(load, package='base')",
    "body": "\n<b>Description</b></br>\nLes objets de modèle R enregistrés dans le fichier sélectionné seront chargés.</br>\nNous chargerons TOUS les objets R enregistrés dans le fichier sélectionné. Si des objets avec le même nom existent dans l'environnement global R, ils seront écrasés.</br>\nNous afficherons un message confirmant les modèles construits avec l'application BlueSky qui ont été chargés.</br>\nVous devez cliquer sur le bouton exécuter (le bouton triangle horizontal) pour charger les objets R enregistrés dans le fichier sélectionné. \n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nload(file =\"chemin du fichier\")\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nfile: nom de fichier avec chemin, les objets de modèle sélectionnés seront enregistrés dans ce fichier RData\n</li>\n</ul>\n<b>Paquet</b></br>\nbase</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante help(load, package = 'base') dans la fenêtre de l'éditeur R\n</br>\n                "
  }
}