{"title": "Charger un ensemble de données à partir d'un package R", "navigation": "Charger un ensemble de données", "label1": "Si le package R n'est pas disponible, allez dans Outils> Package> Installer le package R depuis CRAN pour l'installer.", "label2": "Si vous ne voyez pas un ensemble de données dans le menu déroulant, le package sélectionné ne contient pas l'ensemble de données.", "selectAPackage": "Sélectionnez un package R à partir duquel charger un ensemble de données", "selectADataset": "Sélectionnez un ensemble de données à charger dans la grille", "help": {"title": "Charger un ensemble de données à partir d'un package R", "r_help": "help(data,package='utils')", "body": {"descriptionTitle": "Description", "descriptionText": "Charge l'ensemble de données sélectionné dans la grille de données BlueSky Statistics. Utilise la fonction data qui charge les ensembles de données spécifiés ou liste les ensembles de données disponibles.", "usageTitle": "Utilisation", "usageCode1": "#Charge l'ensemble de données en mémoire", "usageCode2": "data(..., package = NULL, overwrite = TRUE)", "usageCode3": "#Charge l'ensemble de données dans la grille de données BlueSky Statistics", "usageCode4": "BSkyLoadRefresh(\"nom de l'ensemble de données\")", "argumentsTitle": "Arguments", "argumentsList": ["...: chaînes de caractères littérales ou noms des ensembles de données à charger", "package: un vecteur de caractères indiquant le(s) package(s) dans lequel chercher les ensembles de données, ou NULL.", "overwrite: logique: les objets existants du même nom dans envir doivent-ils être remplacés?"], "detailsTitle": "Détails", "detailsText": "Charge l'ensemble de données spécifié dans la grille de données", "valueTitle": "Valeur", "valueText": "Un cadre de données.", "examplesTitle": "Exemples", "exampleCode": "## Un exemple ridicule...data(oil)BSkyLoadRefresh(\"oil\")", "packageTitle": "Package", "packageText": "utils", "helpTitle": "Aide", "helpText": "Pour une aide détaillée, cliquez sur l'icône R en haut à droite de cette fenêtre de dialogue ou exécutez la commande suivante {{r_help}} en créant un bloc de code R en cliquant sur + dans la fenêtre de sortie"}}