{
  "title": "Analyse des valeurs manquantes, mise en page des lignes",
  "navigation": "Mise en page des lignes",
  "subsetvars": "Sélectionnez la ou les variables à analyser pour les valeurs manquantes",
  "chk1": "Trier les résultats par le nombre de valeurs manquantes",
  "chk2": "Ajouter la somme cumulative des manquants aux données",
  "help": {
    "title": "Analyse des valeurs manquantes, mise en page des lignes",
    "r_help": "help(miss_var_summary, package ='naniar')",
    "body": "\n<b>Description</b></br>\nAnalyse les valeurs manquantes et affiche les résultats en lignes, affiche les informations de synthèse des valeurs manquantes au niveau des variables et liste le nombre de valeurs manquantes sur chaque ligne pour les variables analysées. </br>\nFournit un résumé pour chaque variable du nombre, du pourcentage de manquants et de la somme cumulative des manquants dans l'ordre des variables. Par défaut, il est trié par le plus de manquants dans chaque variable.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nmiss_var_summary(data, order = FALSE, add_cumsum = FALSE, ...)\n</code> <br/>\nArguments\n<ul>\n<li>\ndata: un dataframe\n</li>\n<li>\norder: un argument logique indiquant s'il faut trier le résultat par n_miss. Par défaut TRUE. Si FALSE, l'ordre des variables est l'ordre d'entrée.\n</li>\n<li>\nadd_cumsum: argument logique indiquant s'il faut ou non ajouter la somme cumulative des manquants aux données. Cela peut être utile lors de l'exploration des motifs de non-réponse. Ceux-ci sont calculés comme la somme cumulative des manquants dans les variables telles qu'elles sont d'abord présentées à la fonction.</br>\n</li>\n</ul>\n<b>Détails</b></br>\nun tibble du pourcentage de données manquantes dans chaque variable<br/>\n<b>Paquet</b></br>\nnaniar</br>\n<b>Aide</b></br>\nhelp(miss_var_summary, package ='naniar')<br/><br/>\n<b>Description</b></br>\nFournit un résumé pour chaque cas dans les données du nombre, du pourcentage de manquants et de la somme cumulative des manquants dans l'ordre des variables. Par défaut, il est trié par le plus de manquants dans chaque variable.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nmiss_case_summary(data, order = TRUE, add_cumsum = FALSE, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndata: un dataframe\n</li>\n<li>\norder: un argument logique indiquant s'il faut trier le résultat par n_miss. Par défaut TRUE. Si FALSE, l'ordre des variables est l'ordre d'entrée.\n</li>\n<li>\nadd_cumsum: argument logique indiquant s'il faut ou non ajouter la somme cumulative des manquants aux données. Cela peut être utile lors de l'exploration des motifs de non-réponse. Ceux-ci sont calculés comme la somme cumulative des manquants dans les variables telles qu'elles sont d'abord présentées à la fonction.\n</li>\n</ul>\n<b>Valeurs</b><br/>\nun tibble du pourcentage de données manquantes dans chaque cas.<br/>\n<b>Paquet</b></br>\nnaniar</br>\n<b>Aide</b></br>\nhelp(miss_case_summary, package ='naniar')\n"
  }
}