{
  "title": "Modèle des Moindres Carrés Non Linéaires (NLS)",
  "navigation": "Moindres Carrés Non Linéaires",
  "modelname": "Nom du modèle NLS",
  "DependentVar": "Variable de réponse (dépendante)",
  "IndependentVarsformula": "Construisez ou collez n'importe quelle équation (formule) avec des variables indépendantes (prédicteurs) et des paramètres de modèle, par exemple a * exp(b * x) où a et b sont des paramètres à estimer et x est la variable prédicteur. Cela créera une équation de modèle comme y ~ a * exp(b * x) où y est la variable de réponse.",
  "IndependentVar": "Une variable indépendante (prédicteur) nécessaire pour le nuage de points et le graphique ajusté",
  "weights": "Une variable utilisée comme poids (Y) avec une valeur de puissance",
  "PowerKweight": "Puissance : pour juste Y, choisissez (-1), pour 1/Y, choisissez 1, 1/(Y^2), choisissez 2, .. 1/(Y^5), choisissez 5,..",
  "covMatrixChk": "Matrice de covariance estimée pour les paramètres",
  "resPlotChk": "Tracer les ajustements et les résidus",
  "resNormalityTestChk": "Test de normalité des résidus du modèle",
  "modelConstraintLabel": "(Optionnel) Différentes contraintes de modèle pour les estimations de paramètres",
  "pmodels": "Valeurs de départ pour les paramètres pour guider l'optimisation/convergence du modèle, par exemple param1 = 1, param2 = 10, param3 = 0 pour un modèle à trois paramètres",
  "paramConstraintsLower": "Définissez la contrainte pour la limite inférieure (doit choisir port comme algorithme) par exemple 3, -Inf, -Inf pour un modèle à trois paramètres",
  "paramConstraintsUpper": "Définissez la contrainte pour la limite supérieure (doit choisir port comme algorithme) par exemple 3, Inf, Inf, 2 pour un modèle à quatre paramètres",
  "algorithm": "Algorithme à utiliser. La valeur par défaut est un algorithme de Gauss-Newton",
  "maxIter": "Nombre maximum d'itérations autorisées pour la convergence du modèle. La valeur par défaut est 50",
  "logScaleAxis": "L'axe X est tracé en échelle logarithmique par défaut. Choisissez ' ' pour l'échelle d'origine",
  "doseInLogScaleChk": "Vérifiez si la dose/concentration est déjà en valeurs logarithmiques dans le jeu de données",
  "help": {
    "title": "Modèle des Moindres Carrés Non Linéaires (NLS)",
    "r_help": "help(nls, package ='stats')",
    "body": "\n            <b>Description</b></br> \n\t\t\tEffectuer une régression non linéaire. Construisez ou tapez n'importe quelle équation (formule) pour construire le modèle de régression non linéaire.\n\t\t\tDéterminez les estimations des paramètres du modèle non linéaire par les moindres carrés (pondérés). \n\t\t\tAnalysez l'ajustement du modèle avec des graphiques. \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tVérifiez help(nls, package ='stats') pour plus de détails \n\t\t\t</br>\n\t\t\t</br>\n\t\t\tVous pouvez essayer ce dialogue\n\t\t\t</br>\n\t\t\t</br>\t\n\t\t\tExemple 1\n\t\t\t</br>\n\t\t\tChargez le jeu de données DNase depuis le menu Charger les jeux de données (laissez tous les paquets installés dans le premier menu déroulant et choisissez DNase dans le deuxième menu déroulant)\t\t\t\n\t\t\t<br/>\n\t\t\tChoisissez (ou faites glisser) la densité comme variable de réponse\n\t\t\t<br/>\n\t\t\tTapez Asym/(1 + exp((xmid - log(conc))/scal)) dans le champ Indépendant (formule) où Asym, xmid et scal\n\t\t\tsont trois paramètres du modèle (c'est-à-dire des coefficients) à estimer \n\t\t\t<br/>\n\t\t\tVérifiez la matrice de covariance estimée\n\t\t\t</br>\n\t\t\tVérifiez les ajustements et les résidus \n\t\t\t</br>\n\t\t\tChoisissez (ou faites glisser) conc dans le champ Une variable indépendante (prédicteur) nécessaire pour le nuage de points et le graphique ajusté\n\t\t\t</br>\n\t\t\tTapez Asym = 3, xmid = 0, scal = 1 dans le champ Valeurs de départ pour les paramètres pour guider le modèle\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tExemple 2\n\t\t\t</br>\n\t\t\tChargez le jeu de données DNase depuis le menu Charger les jeux de données (laissez tous les paquets installés dans le premier menu déroulant et choisissez DNase dans le deuxième menu déroulant)\t\t\t\n\t\t\t<br/>\n\t\t\tChoisissez (ou faites glisser) la densité comme variable de réponse\n\t\t\t<br/>\n\t\t\tTapez Asym/(1 + exp((xmid - log(conc))/scal)) dans le champ Indépendant (formule)\n\t\t\t<br/>\n\t\t\tVérifiez la matrice de covariance estimée\n\t\t\t</br>\n\t\t\tVérifiez les ajustements et les résidus \n\t\t\t</br>\n\t\t\tChoisissez (ou faites glisser) conc dans le champ Une variable indépendante (prédicteur) nécessaire pour le nuage de points et le graphique ajusté\n\t\t\t</br>\n\t\t\tTapez Asym = 3, xmid = 0, scal = 1 dans le champ Valeurs de départ pour les paramètres pour guider le modèle\n\t\t\t</br>\n\t\t\tTapez Asym = 0, xmid = -Inf, scal = -Inf dans le champ contrainte pour la limite inférieure (fixez la limite inférieure pour Asym à 0 et laissez la limite inférieure de xmid et scal sans contrainte)\n\t\t\t</br>\n\t\t\tTapez Asym = Inf, xmid = 4, scal = Inf dans le champ contrainte pour la limite supérieure (fixez la limite inférieure de xmid à 0 et laissez la limite supérieure de Asym et scal sans contrainte)\n\t\t\t</br>\n\t\t\tchoisissez port dans le menu déroulant de l'algorithme à utiliser au lieu de la valeur par défaut\n\t\t\t</br>\n\t\t\t</br>\n\t\t\tExécutez le dialogue\n\t\t\t</br>\n\t\t\t</br>\n"
  }
}