{
  "title": "Nombre Optimal d'Arbres",
  "navigation": "Optimiser",
  "dependentvar": "Variable dépendante",
  "independentvars": "Variable(s) indépendante(s)",
  "label1": "Paramètres de simulation d'arbres",
  "startval": "Valeur de départ",
  "endval": "Valeur de fin",
  "stepval": "Valeur d'étape",
  "mtry": "mtry",
  "help": {
    "title": "Nombre Optimal d'Arbres",
    "r_help": "aide(randomForest, paquet='randomForest')",
    "body": "\n                <b>Description</b></br>\nEn commençant par la valeur par défaut de mtry, recherchez la valeur optimale (par rapport à l'estimation de l'erreur Out-of-Bag) de ntree (nombre d'arbres à cultiver) pour randomForest. La fonction BSkyMultiRandomForest appelle la fonction randomForest avec les arguments définis ci-dessous\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nBSkyMultiRandomForest(x , y=NULL, startval, endval, stepval, mtry)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx : un cadre de données ou une matrice de prédicteurs, ou une formule décrivant le modèle à ajuster (pour la méthode d'impression, un objet randomForest).\n</li>\n<li>\ny :  Un vecteur de réponse. Si un facteur, la classification est supposée, sinon la régression est supposée. Si omis, randomForest fonctionnera en mode non supervisé.\n</li>\n<li>\nstartval : valeur de départ pour l'argument ntree dans randomForest().\n</li>\n<li>\nendval : valeur de fin pour l'argument ntree dans randomForest().\n</li>\n<li>\nstepval : compte par lequel startval doit être incrémenté à chaque itération jusqu'à ce qu'il atteigne la valeur endval.\n</li>\n<li>\nmtry : Nombre de variables échantillonnées au hasard comme candidats à chaque division. Notez que les valeurs par défaut sont différentes pour la classification (sqrt(p) où p est le nombre de variables dans x) et la régression (p/3).\n</li>\n</ul>\n<b>Valeur</b><br/>\nImprime le nombre optimal d'arbres. Affiche également un tableau avec ntree et l'erreur Out-of-Bag correspondante<br/>\n<b>Paquet</b></br>\nrandomForest​;BlueSky</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R : aide(randomForest, paquet='randomForest')\n                "
  }
}