{
  "title": "Estimations du Niveau des Paramètres",
  "navigation": "Estimations des Paramètres",
  "label1": "Les modèles des classes suivantes sont pris en charge, les classes sont listées entre parenthèses ci-dessous",
  "label2": "Modèles linéaires (lm), Modèles linéaires généralisés (glm), Modèles log-linéaires multinomiaux (multinom), Régression quantile (rq), Régression linéaire robuste (rlm), Objet de courbe de survie (survfit), Modèle à effets mixtes linéaires (lme), Objet de régression des risques proportionnels (coxph), Modèle de régression de survie paramétrique (survreg), Régression logistique ordonnée/Probit (polr), Analyse factorielle (factanal), Modèles linéaires généralisés régularisés par Lasso et Elastic-net (glmnet)",
  "modelselector1": "Sélectionnez un modèle",
  "help": {
    "title": "Estimations du Niveau des Paramètres",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>Description</b></br>\nAffiche les estimations des paramètres du modèle sélectionné\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx: modèle ou autre objet R à convertir en un cadre de données à une seule ligne\n</li>\n</ul>\n<b>Détails</b></br>\nAffiche les estimations des paramètres des modèles suivants</br>\nModèles linéaires (classe de modèle lm)</br>\nModèles linéaires généralisés (classe de modèle glm)</br>\nModèles log-linéaires multinomiaux (classe de modèle multinom)</br>\nRégression logistique ordonnée ou Probit (classe de modèle polr)</br>\nModèles linéaires généralisés régularisés par Lasso et Elastic-Net (classe de modèle glmnet)</br>\nRégression linéaire robuste (classe de modèle rlm)</br>\nRégression quantile (classe de modèle rq)</br>\nModèle à effets mixtes linéaires (lme)</br>\nObjet de régression des risques proportionnels (coxph)</br>\nModèle de régression de survie paramétrique (survreg)</br>\nAnalyse factorielle (factanal)</br>\n<b>Valeur</b></br>\nUn tibble::tibble() avec des informations sur les composants du modèle.</br>\nterm: Le nom du terme de régression.</br>\nestimate: La valeur estimée du terme de régression.</br>\nstd.error: L'erreur standard du terme de régression.</br>\nstatistic: La valeur d'une statistique, presque toujours une statistique T, à utiliser dans une hypothèse que le terme de régression est non nul.</br>\np.value: La valeur p bilatérale associée à la statistique observée.</br>\nconf.low: L'extrémité inférieure d'un intervalle de confiance pour le terme de régression. Inclus uniquement si conf.int = TRUE.</br>\nconf.high: L'extrémité supérieure d'un intervalle de confiance pour le terme de régression. Inclus uniquement si conf.int = TRUE.</br>\nSi le modèle linéaire est un objet mlm (modèle linéaire multiple), il y a une colonne supplémentaire:</br>\nresponse: À quelle colonne de réponse les coefficients correspondent (typiquement Y1, Y2, etc.)</br>\n<b>Paquet</b></br>\nbroom</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R help(tidy, package ='broom')\n"
  }
}