{
  "title": "Analyse de survie paramétrique",
  "navigation": "Survie paramétrique",
  "timevar": "Temps jusqu'à l'événement ou censure",
  "eventvar": "Événement (1 ou plus = événement, 0 ou moins = censure)",
  "rmstChk": "Calculer le temps de survie moyen restreint (RMST)",
  "rmstSEChk": "Calculer l'erreur standard pour RMST en utilisant le bootstrap (note : cela prendra un certain temps)",
  "bootIter": "Itération bootstrap",
  "labelSurvival": "Type de graphique de survie",
  "survivalradioCI": "Survie avec IC",
  "survivalradio": "Survie",
  "survivalradioKMCI": "Survie avec superposition de Kaplan-Meier (non paramétrique) avec IC",
  "survivalradioKM": "Survie avec superposition de Kaplan-Meier (non paramétrique)",
  "labelFailure": "Type de graphique de défaillance cumulée",
  "inciradioCI": "Défaillance cumulée avec IC",
  "inciradio": "Défaillance cumulée",
  "inciradioKMCI": "Défaillance cumulée avec superposition de Kaplan-Meier (non paramétrique) avec IC",
  "inciradioKM": "Défaillance cumulée avec superposition de Kaplan-Meier (non paramétrique)",
  "spectimes": "Calculer la probabilité de survie - spécifiez les temps comme time1, time2, time3, etc. ou comme seq (1,5,by=1)",
  "specprobs": "Calculer le temps de survie jusqu'à l'événement - spécifiez le quantile (probabilité) comme 0.25, 0.50, 0.60, 0.75, etc. ou comme seq (0.2,0.9,by=0.1)",
  "labelDistribution": "Sélectionnez une fonction de distribution qui correspond le mieux aux données",
  "selectDistFuncWeibullRad": "Weibull",
  "selectDistFuncExpRad": "Exponential",
  "selectDistFuncGammaRad": "Gamma",
  "selectDistFuncLnormalRad": "Log Normal",
  "selectDistFuncPoissonRad": "Poisson",
  "selectDistFuncNBinomRad": "Binomial Négatif",
  "selectDistFuncGeomRad": "Géométrique",
  "selectDistFuncBetaRad": "Bêta",
  "selectDistFuncUnifRad": "Uniforme",
  "selectDistFuncLogisRad": "Logistique",
  "selectDistFuncLogLogisRad": "Log Logistique",
  "selectDistFuncCauchyRad": "Cauchy",
  "selectDistFuncNormRad": "Normal",
  "confidenceInterval": "Intervalles de confiance pour les estimations de maximum de vraisemblance",
  "help": {
    "title": "Régression de survie paramétrique",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n\t\t\tVoir l'ensemble de données d'exemple dans le répertoire d'installation, l'emplacement par défaut est à la lettre de lecteur:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. La variable Followup_time doit être saisie comme le temps jusqu'à l'événement ou la censure et la variable Event doit être saisie comme l'Événement (1 = événement, 0 = censure).<br/>\n            <br/>\n            <br/>\n\t\t\tLes ensembles de données d'exemple sont lung, manufacturing_data et bulb reliability <br/><br/>\t\t\n            <b>Estimations des paramètres de régression de survie paramétrique et graphiques avec superposition des courbes de survie de Kaplan-Meier (modèle nul/intercept seulement)</b>\n            <br/>\n            <br/>\n            Ceux-ci sont utilisés pour estimer le risque cumulatif de ne pas avoir un événement (ou inversement, d'avoir un événement) sur une période de temps après le début du suivi pour cet événement (ou temps zéro). Les sujets doivent être à risque pour l'événement à partir du temps zéro.\n            <br/>\n            <br/>\n            <b>Temps :</b> Durée jusqu'à un événement, si l'événement s'est produit, ou dernier suivi pour cet événement, si l'événement ne s'est pas produit, pour chaque sujet\n            <br/><br/>\n            <b>Événement :</b> Indicateur numérique de si l'événement s'est produit ou non (1=événement, 0=censure) pour chaque sujet\n            <br/><br/>\n            <b>Type de graphique :</b> Tracer la probabilité de ne pas avoir l'événement (survie) ou d'avoir l'événement (échec)\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Tableau d'estimation pour des temps ou probabilités spécifiques :</b> Option d'inclure un tableau contenant les probabilités d'estimation de survie pour un ensemble de temps sélectionné par l'utilisateur.\n\t\t\t<br/><br/>\n\t\t\t<b>Spécifiez les temps comme time1, time2, time3, etc. ou comme seq(1,5,by=1) :</b> Ce sont les temps spécifiques qui seront inclus dans le tableau pour des temps spécifiques. Ils peuvent être spécifiés individuellement avec des virgules, ou comme une séquence de valeurs également espacées.\n\t\t\t<br/><br/>\n            Les tableaux sont sortis avec la taille de l'échantillon, le nombre de sujets ayant eu l'événement, le temps médian de survie (si défini), le temps de survie moyen restreint, et le temps médian de suivi. Le temps médian de suivi est calculé en utilisant l'estimateur de Kaplan-Meier inversé, qui traite les événements réels comme des observations censurées et les observations censurées réelles comme des événements. Ainsi, l'\"événement\" dans cet estimateur est \"suivre les sujets aussi longtemps que l'étude le pourrait\".\n            <br/>\n            Un tableau des estimations de survie paramétrique et d'événements pour la distribution choisie est fourni à chaque temps observé dans l'ensemble de données, avec des intervalles de confiance donnés. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Options de style</b>\n            <br/>\n            <br/>\n            <b>Titre du graphique :</b> Titre du graphique ; supprimez tout le texte pour ne pas avoir de titre\n            <br/><br/>\n\t\t\t<b>Taille du titre du graphique :</b> Taille du titre du graphique.\n\t\t\t<br/><br/>\n            <b>Thème du graphique :</b> Style général du graphique\n            <br/><br/>\n            <b>Inclure le nombre à risque :</b> En option, inclure un tableau pour le nombre de sujets encore à risque au fil du temps en bas du graphique.  <b>Position du tableau des risques</b> spécifie si vous souhaitez que le tableau soit à l'extérieur des axes ou à l'intérieur des axes.  La <b>Taille du tableau des risques</b> contrôle la proportion de la zone de traçage que le tableau occupera. Cette option est ignorée lorsque la position du tableau des risques est à l'intérieur des axes. \n\t\t\tLa <b>Taille des valeurs du tableau des risques</b> contrôle la taille des nombres à risque. La <b>Taille du titre du tableau des risques</b> contrôle la taille du titre pour le tableau des nombres à risque.\n\t\t\tLa <b>Taille des étiquettes des axes du tableau des risques</b> contrôle la taille des étiquettes des axes.\n\t\t\tLa <b>Taille des étiquettes des marques de graduation du tableau des risques</b> contrôle la taille des étiquettes des marques de graduation pour les temps dans le tableau des nombres à risque. S'il est souhaité de supprimer tous les axes et les lignes de grille \n\t\t\tdu tableau des risques, l'option <b>Supprimer les axes et les lignes de grille du tableau des risques</b> peut être cochée. Cela n'inclura que les nombres à risque dans le tableau.\n            <br/>\n            <br/>\n            <b>Options de ligne :</b>\n            <b>Taille</b> contrôle l'épaisseur et <b>Couleur</b> contrôle la couleur de la ligne tracée. On peut éventuellement inclure un intervalle de confiance à 95 % pour les estimations dans un format <b>ribbon</b> (zone ombragée) ou <b>step</b> (ligne). <b>Transparence</b> contrôle l'obscurité du ruban et est ignorée lorsque l'option de pas est sélectionnée. <b>Temps censurés</b> (lorsque les sujets ne sont plus à risque pour l'événement) peuvent être indiqués sur la ligne avec des symboles \"+\". La taille des symboles \"+\" peut être ajustée. L'option <b>Indiquer la survie médiane</b> inclura des lignes horizontales ou verticales au moment où 50 % des sujets sont estimés avoir eu l'événement. Le temps médian est indéfini si la courbe de survie ne croise pas 50 %.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Options d'axe</b>\n            <br/> \n            <br/> \n            L'option <b>Étiquette</b> spécifie le texte de l'étiquette pour l'axe. L'<b>Intervalle des axes</b> spécifie les valeurs minimales et maximales de l'axe. L'option <b>Incréments des marques de graduation</b> contrôle l'espacement des marques de graduation sur l'axe. Les incréments sur l'axe du temps contrôlent également les temps pour le tableau optionnel des nombres à risque.\n            <br/> \n            L'axe de survie <b>Échelle</b> option spécifie si vous souhaitez que les estimations soient sur une échelle de proportion (0-1) ou de pourcentage (0-100).\n\t\t\t<br/><br/>\n\t\t\t<b>Taille des étiquettes des axes :</b>  Cela contrôle la taille des étiquettes des axes de survie et de temps.\n\t\t\t<br/><br/>\n\t\t\t<b>Taille des étiquettes des marques de graduation des axes :</b>  Cela contrôle la taille des étiquettes des marques de graduation des axes de survie et de temps.\n      "
  }
}