{
  "title": "Tracer la carte Personne-Item",
  "navigation": "Tracer la carte Personne-Item",
  "label1": "Sélectionnez un modèle (modèles de classe Rm et dRm pris en charge)",
  "label1b": "Si aucun modèle n'est disponible, vous devez d'abord créer un modèle en sélectionnant Ajustement du modèle -> IRT",
  "modelselector1": "Sélectionnez un modèle",
  "range1": "Plage pour l'axe X",
  "help": {
    "title": "Tracer la carte Personne-Item",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>Description</b></br>\n                Une carte personne-item affiche la position des paramètres d'item (et de seuil) ainsi que la distribution des paramètres de personne le long de la dimension latente. Les cartes personne-item sont utiles pour comparer la plage et la position de la distribution de mesure des items (panneau inférieur) à la plage et à la position de la distribution de mesure des personnes (panneau supérieur). Les items devraient idéalement être situés le long de l'échelle entière pour mesurer de manière significative l'‘aptitude’ de toutes les personnes.\n\n                <br/><br/>\n                <b>Utilisation</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"Carte Personne-Item\", latdim = \"Dimension Latente\",\n                pplabel = \"Personne\nParamètre\nDistribution\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>Arguments</b>\n                <br/>  \n                object: Objet de classe Rm ou dRm\n                <br/>\n                item.subset: Sous-ensemble d'items à tracer. Soit un vecteur numérique indiquant la colonne dans X, soit un vecteur de caractères indiquant le nom de la colonne. Si \"all\", tous les items sont tracés. Le nombre d'items à tracer doit être > 1.\n                <br/>\n                sorted: Si TRUE, les items sont triés par ordre croissant selon leur position sur la dimension latente.   \n                <br/>\n                main: Titre principal du tracé.\n                <br/>\n                latdim: Étiquette de l'axe des x, c'est-à-dire la dimension latente.\n                <br/>\n                pplabel: Titre pour le panneau supérieur affichant la distribution des paramètres de personne\n                <br/>\n                cex.gen: cex en tant que paramètre graphique spécifie une valeur numérique indiquant dans quelle mesure le texte et les symboles de tracé doivent être agrandis par rapport à la valeur par défaut. Ici, cex.gen s'applique à toutes les étiquettes de texte. La valeur par défaut est 0.7.\n                <br/>\n                xrange: Plage pour l'axe des x\n                <br/>\n                warn.ord: Si TRUE (par défaut), des astérisques sont affichés dans la marge droite du panneau inférieur pour indiquer les emplacements de seuil non ordonnés pour les items polytomes.\n                <br/>\n                warn.ord.colour: Les emplacements de seuil non ordonnés pour les items polytomes sont colorés avec cette couleur pour les rendre plus visibles. Cela est particulièrement utile lorsqu'il y a de nombreux items, de sorte que le tracé est assez dense. La valeur par défaut est \"noir\", de sorte qu'aucune distinction n'est faite.\n                <br/>   \n                irug: Si TRUE (par défaut), tous les seuils sont tracés sous la distribution des personnes pour indiquer où les items inclus sont les plus informatifs.                \n                <br/>\n                pp: Si non-NULL, cela contient les données de paramètres de personne de l'objet de données, évitant ainsi la nécessité de les recalculer.\n                <br/><br/>\n\n                <b>Paquets</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>Aide</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}