{
  "title": "Graphiques P-P",
  "navigation": "P-P",
  "alpha": "Opacité (0-1)",
  "x": "Axe X, spécifiez une ou plusieurs variables numériques",
  "y": "Forme, spécifiez une variable catégorielle",
  "color": "Couleur, spécifiez une variable de regroupement (catégorie)",
  "referenceline": "Ligne de référence",
  "band": "Afficher les bandes",
  "detrend": "Détendre (supprimer la tendance)",
  "showStatsTable": "Afficher le tableau des statistiques pour le test de normalité",
  "normalityTestMethod": "Méthode du test de normalité",
  "flip": "Inverser l’axe",
  "distribution": "Sélectionner une distribution",
  "x_title": "Étiquette de l’axe X",
  "y_title": "Étiquette de l’axe Y",
  "label1": "Paramètres de la distribution, par exemple pour une distribution normale, les paramètres pourraient être mean=2, sd=2 donc saisissez mean=2, sd=2. Pour une distribution exponentielle, les paramètres pourraient être rate=2, donc saisissez rate=2.",
  "dparams": "Saisir éventuellement les paramètres de distribution",
  "specify_a_title": "Entrer un titre",
  "Facetrow": "Rangée de facettes",
  "Facetcolumn": "Colonne de facettes",
  "Facetwrap": "Habillage des facettes",
  "Facetscale": "Échelle des facettes",
  "facets_lbl": "Facettes",
  "help": {
    "title": "Graphiques P-P",
    "r_help": "help(stat_pp_point,package='qqplotr')",
    "body": "\n            <b>Description</b></br>\n            Un graphique P-P (probabilité-probabilité ou pourcentage-pourcentage ou graphique des valeurs P) est un graphique de probabilité permettant d’évaluer la concordance entre deux ensembles de données, en traçant leurs fonctions de distribution cumulées l’une contre l’autre. Par défaut, nous comparons la distribution cumulative de la variable sélectionnée à la distribution normale, mais vous pouvez comparer à plusieurs autres distributions telles que bêta, cauchy, chi2, exp, f, gamma... Vous pouvez également spécifier les paramètres de la distribution associée à celle comparée. Cliquez sur le bouton options dans la boîte de dialogue principale pour sélectionner une distribution et spécifier les paramètres. Vous pouvez sélectionner une variable facteur pour regrouper la variable sélectionnée. Dans ce cas, un graphique P-P distinct est dessiné pour chaque groupe.\n            <br/>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            ggplot(data = datasetname,mapping= aes(sample = var1 ,shape = var2 ))  +stat_pp_band() + stat_pp_line() + stat_pp_point()  +labs(x = \"Points de probabilité\",y = \"Probabilité cumulée\",title =paste(\"Graphique PP pour la variable \",var1,sep=''))+facet_grid(var3 ~.)\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data : Jeu de données par défaut\n            </li>\n            <li>\n            aes() : Génère des mappings esthétiques qui décrivent comment les variables des données sont mappées aux propriétés visuelles (esthétiques) des geoms.\n            </li>\n            <li>\n            sample : La variable numérique pour laquelle tracer le graphique P-P\n            </li>\n            <li>\n            stat_pp_point : Trace les probabilités cumulées en fonction des points de probabilité. La fonction de probabilité cumulée est construite avec les données échantillon, puis évaluée pour chaque point de probabilité.\n            </li>\n            <li>\n            stat_pp_line : Trace une ligne d’identité de référence (x=y).\n            </li>\n            <li>\n            stat_pp_band : Trace des bandes de confiance. Pour l’instant, seule la version bootstrap (\"boot\") est disponible.\n            </li>\n            <li>\n            shape : Une variable facteur optionnelle qui regroupe les valeurs assignées à sample. Un graphique P-P distinct est créé pour chaque groupe selon les niveaux de la variable facteur. Chaque groupe est indiqué par une forme différente.\n            </li>\n            <li>\n            Labs() : Change les étiquettes des axes et les titres des légendes (optionnel)\n            </li>\n            <li>\n            facet_grid() : Dispose les panneaux en grille (optionnel). Voir help(facet_grid) pour plus de détails.\n            </li>\n            <li>  ​\n            coord_flip() : Inverse les axes (optionnel)\n            </li>\n            </ul>\n            <b>Packages</b></br>\n            ggplot2;ggthemes;qqplotr;\n            <br/>\n            <b>Aide</b></br>\n            help(stat_pp_point, package='qqplotr')<br/>\n            Autres : Cliquez sur le bouton d’aide R pour obtenir une aide détaillée. Vous pouvez également entrer help(labs), help(stat_pp_point), help(aes), help(facet_grid), help(coord_flip)<br/>\n            https://cran.r-project.org/web/packages/qqplotr/vignettes/introduction.html\n        "
  }
}
