{
  "label1": "Pour comparer les pentes du modèle de régression quantile, voir \"Évaluation du modèle > Comparer > Modèles de régression quantile\"",
  "title": "Régression Quantile",
  "navigation": "Quantile",
  "modelname": "Entrez le nom du modèle",
  "depvarlabel": "Variable Dépendante",
  "quantilelabel": "Quantile (0-1)",
  "estgrplabel": "Méthode d'Estimation",
  "brlabel": "Barrodale et Roberts",
  "fnlabel": "Frisch-Newton",
  "pfnlabel": "Frisch-Newton, prétraitement",
  "sfnlabel": "Frisch-Newton, épars",
  "stderrgrplabel": "Méthode d'Erreur Standard",
  "ranklabel": "Rang",
  "iidlabel": "IID",
  "nidlabel": "NID",
  "kernallabel": "Noyau",
  "bootstraplabel": "Bootstrap",
  "bootsamplabel": "Échantillons Bootstrap",
  "help": {
    "title": "Régression Quantile",
    "r_help": "aide(rq, package = 'quantreg')",
    "body": "\nCela ajuste un modèle de régression quantile, qui modélise un quantile désiré (c'est-à-dire un percentile) de la variable de résultat. Un quantile typique à modéliser est 0,5, c'est-à-dire la médiane. \nUn résumé du modèle et des estimations de paramètres avec des intervalles de confiance à 95 % sont fournis.\n<br/><br/>\n<b>Entrez le nom du modèle :</b> le nom souhaité du modèle\n<br/><br/>\n<b>Variable Dépendante :</b> Spécifiez la variable dépendante pour le modèle. Le quantile désiré de cette variable sera modélisé. Cela doit être numérique.\n<br/><br/>\n<b>Constructeur de Formule :</b> Spécifiez les termes du modèle en utilisant la notation de formule. Les variables numériques, facteurs, facteurs ordonnés et caractères sont autorisés. Les variables caractères seront converties en facteurs.\n<br/><br/>\n<b>Quantile (0-1) :</b> Spécifiez le quantile désiré à modéliser pour la variable dépendante. 0,5 (la médiane) est la valeur par défaut et est une quantité typique.\n<br/><br/>\n<b>Méthode d'Estimation :</b> Spécifiez la méthode d'estimation pour les paramètres du modèle. La méthode de Barrodale et Roberts est la valeur par défaut et est efficace pour les modèles avec \nplusieurs milliers d'observations. La méthode Frisch-Newton et la méthode Frisch-Newton, prétraitement peuvent être avantageuses pour de grands et très grands problèmes, respectivement, \nsurtout dans les cas avec un petit nombre de paramètres estimés. Pour de grandes tailles d'échantillons avec un grand nombre de paramètres, la méthode Frisch-Newton, épars peut être nécessaire. \nVoir les références dans l'aide R pour plus de détails.\n<br/><br/>\n<b>Méthode d'Erreur Standard :</b> Spécifiez la méthode utilisée pour estimer les erreurs standards et les intervalles de confiance. La méthode du Rang fournit uniquement des intervalles de confiance, peut être lente \npour des tailles d'échantillons plus grandes (n > 1000), et est basée sur l'inversion d'un test de rang. La méthode IID suppose que les erreurs sont indépendantes et identiquement distribuées (iid). La méthode NID \nsuppose une linéarité locale dans le quantile et calcule une estimation sandwich en utilisant une estimation locale de la parcimonie. La méthode Noyau utilise une estimation noyau du sandwich. \nLa méthode Bootstrap utilise une approche de bootstrap par rééchantillonnage pour estimer les erreurs standards. Voir les références dans l'aide R pour plus de détails.\n<br/><br/>\n<b>Échantillons Bootstrap :</b> Nombre désiré d'échantillons bootstrap pour l'approche d'erreur standard bootstrap. La valeur par défaut est de 2000 échantillons.\n<br/><br/>\n<b>Packages R Requis :</b> quantreg, broom\n\t\t"
  }
}