{
  "title": "Recoder des variables",
  "navigation": "Recoder",
  "oldvars": "Variables à recoder",
  "label1": "Options",
  "newvarradio": "Nouvelle variable(s)",
  "newvar": "Entrez les noms des nouvelles variables séparés par , par exemple newVar1, newVar2",
  "oldvarradio": "Écraser les variables existantes",
  "suffix": "Spécifiez un suffixe pour les variables recodées",
  "prefix": "Spécifiez un préfixe pour les variables recodées",
  "enterSuffix": "Entrez un suffixe",
  "enterPrefix": "Entrez un préfixe",
  "label3": "Lors de la spécification de plusieurs critères de recodage, utilisez ; comme séparateur.",
  "label4": "REMARQUE : LES VALEURS CHAÎNES DOIVENT ÊTRE ENFERMÉES DANS DES GUILLEMETS DOUBLE(\") ET NON DES GUILLEMETS SIMPLES(').",
  "label5": "Entrez les anciennes valeurs et les nouvelles valeurs séparées par ; par exemple \"Homme\"=\"Homme\";\"Femme\"=2;\"Houston, Texas\"=\"Texas\";\"Non disponible\"=NA ",
  "label5a": "Pour le recodage de type numérique, entrez 70=100;71=101;99=NA",
  "label5b": "Une plage de valeurs est prise en charge, par exemple 5:10=\"moyen\". Des valeurs spéciales lo et hi peuvent apparaître dans une plage, par exemple lo:10=\"bas\";11:89=\"moyen\";90:hi=\"Élevé\"",
  "label6": "Le mot-clé else peut être utilisé pour tout ce qui ne correspond pas à une spécification, par exemple else =NA",
  "dontMakeFactor": "Par défaut, la variable recodée sera un facteur si la variable source est un facteur. Pour remplacer, cochez la case",
  "oldnewvals": "Entrez les critères de recodage",
  "help": {
    "title": "Recoder des variables",
    "r_help": "help(recode, package=car)",
    "body": "\n<b>Description</b></br>\nRecodes un ou plusieurs vecteurs numériques, vecteurs de caractères ou facteurs selon les spécifications de recodage. Vous pouvez stocker les résultats en écrasant les variables existantes, en spécifiant de nouveaux noms de variables pour stocker les valeurs recodées ou en choisissant de stocker les valeurs recodées dans de nouvelles variables avec un préfixe ou un suffixe approprié. Le préfixe ou le suffixe sera appliqué au nom de la variable existante.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nBSkyRecode(colNames,newColNames,OldNewVals,NewCol=TRUE,dataSetNameOrIndex='Dataset2')\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ncolNames: Un vecteur de caractères contenant une ou plusieurs variables dans le jeu de données à recoder\n</li>\n<li>\nnewColNames: Un vecteur de caractères contenant les noms des nouvelles colonnes.\n</li>\n<li>\nOldNewVals: Une chaîne de caractères de spécifications de recodage sous la forme oldval1,newval1, oldval2,newval2\n</li>\n<li>\nNewCol: Un booléen indiquant si les valeurs recodées sont stockées dans de nouvelles variables (TRUE) ou si les variables existantes sont écrasées (FALSE).\n</li>\n<li>\nprefixOrSuffix: Spécifiez si vous souhaitez stocker les valeurs recodées dans de nouvelles variables préfixées ou suffixées avec le nom que vous spécifiez. Entrez un préfixe ou un suffixe.\n</li>\n<li>\nprefixOrSuffixString: Entrez une chaîne à utiliser comme préfixe ou suffixe au nom de la variable existante. Les valeurs recodées seront stockées dans ces variables.\n</li>\n<li>\ndataSetNameOrIndex: Le nom du jeu de données/dataframe\n</li>\n</ul>\nRemarque : Nous ne convertirons pas de numérique à facteur. Lorsqu'un numérique est recodé, il restera un numérique, lorsqu'une variable facteur est recodée, elle restera un facteur.<br/>\n<b>Package</b></br>\ncar</br>\n<b>Aide</b></br>\nTapez la ligne ci-dessous dans l'éditeur de syntaxe R de BioStat Prime</br>\nhelp(recode, package=car)\n"
  }
}