{
  "helpText": "L'ANOVA à mesures répétées nécessite que les données soient au format long. Si vos données ne sont pas au format long, consultez Ensembles de données > Reshape > Plus long",
  "modelname": "Entrez le nom du modèle",
  "title": "ANOVA à mesures répétées",
  "subjectID": "Variable à utiliser comme identifiant de sujet",
  "dependentVariable": "Variable dépendante",
  "navigation": "ANOVA, mesures répétées, long",
  "response": "Variable(s) intra-sujets e.g. Temps",
  "Fixed": "Facteur(s) entre sujets",
  "covariates": "Covariables",
  "Summary": "Moyennes marginales estimées",
  "Scatter_plot": "Posthocs",
  "Residual": "Résidu vs. Graphique ajusté",
  "Histogram": "Graphique histogramme des résidus",
  "brownForsythe": "Test de Brown-Forsythe",
  "levenesTest": "Test de Levene",
  "plotMeansCI": "Graphique des moyennes et des intervalles de confiance",
  "simpleEffectsTest": "Test des effets simples",
  "label2": "Options pour posthocs et test d'effets simples",
  "combon": "Comparer les moyennes en utilisant :",
  "adjust": "Méthode d'ajustement des p-values",
  "displayBoxMDetails": "Afficher les détails associés au test de Box (Remarque : les résultats du test de Box sont toujours affichés)",
  "help": {
    "title": "ANOVA à mesures répétées",
    "r_help": "aide(aov_ez , package='afex')",
    "body": "\n<b>Description</b></br>\nAvec l'ANOVA à mesures répétées, les statistiques F sont calculées pour chaque facteur intra-sujets, facteur entre sujets et le terme d'interaction pour l'ANOVA mixte</br>\nRecherchez les tables de valeurs ANOVA supplémentaires dans la sortie qui affichent MSE (moyenne des carrés des erreurs) et pes (eta carré partiel)</br>\nNous prenons actuellement en charge un seul facteur intra-sujets et entre sujets, le facteur entre sujets est facultatif.</br>\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"dependentVariable\", \n\tid = \"Identifier\", within = c(\"Time\"), \tbetween = c(\"Treatment\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndata: Un data.frame contenant les données. Obligatoire\n</li>\n<li>\ndv: vecteur de caractères (de longueur 1) indiquant la colonne contenant la variable dépendante dans les données.\n</li>\n<li>\nbetween: vecteur de caractères indiquant les facteurs/colonnes entre sujets dans les données. Par défaut, c'est NULL, ce qui indique qu'il n'y a pas de facteurs entre sujets.\n</li>\n<li>\nwithin: vecteur de caractères indiquant les facteurs/colonnes intra-sujets (ou mesures répétées) dans les données. Par défaut, c'est NULL, ce qui indique qu'il n'y a pas de facteurs intra-sujets.\n</li>\n<li>\ncovariate: vecteur de caractères indiquant les covariables entre sujets (c'est-à-dire, colonnes) dans les données. Par défaut, c'est NULL, ce qui indique qu'il n'y a pas de covariables. Veuillez noter que factorize doit être défini sur FALSE si la covariable est numérique et doit être traitée comme telle.\n</li>\n<li>\nanovatable: liste d'autres arguments passés à la fonction produisant la table ANOVA. \n</li>\n</ul>\n<br/>\n<b>Détails</b></br>\nVoir l'aide R détaillée</br>\n<b>Valeur</b><br/>\naov_car, aov_4 et aov_ez sont des wrappers pour Anova et aov, la valeur de retour dépend de l'argument de retour. Par défaut, un objet S3 de classe \"afex_aov\" est retourné contenant les slots suivants :<br/>\n\"anova_table\": Une table ANOVA de classe c(\"anova\", \"data.frame\").<br/>\n\"aov\": objet aov retourné par aov (ne doit pas être utilisé pour évaluer la signification des effets, mais peut être passé à emmeans pour des tests post-hoc).<br/>\n\"Anova\": objet retourné par Anova, un objet de classe \"Anova.mlm\" (si des facteurs intra-sujets sont présents) ou de classe c(\"anova\", \"data.frame\").<br/>\n\"lm\": l'objet ajusté avec lm et passé à Anova (c'est-à-dire, un objet de classe \"lm\" ou \"mlm\"). Également retourné si return = \"lm\".<br/>\n\"data\": une liste contenant : (1) long (les données éventuellement agrégées au format long utilisées pour aov), wide (les données utilisées pour ajuster l'objet lm), et idata (si des facteurs intra-sujets sont présents, l'argument idata passé à car::Anova). Également retourné si return = \"data\".<br/>\n<b>Paquet</b></br>\nafex</br>\n<b>Aide</b></br>\naide(aov_ez, package ='afex')\nCliquez sur le bouton d'aide R pour obtenir une aide R détaillée. Vous pouvez également entrer help(aov_ez, package ='afex') et appuyer sur CTRL Entrée dans l'éditeur de syntaxe R pour obtenir de l'aide\n    "
  }
}