{
  "helpText": "L'ANOVA à mesures répétées nécessite que les données soient au format long. Si vos données ne sont pas au format long, consultez Datasets > ReShape > Longer",
  "repMeasuresConfig": "Configuration",
  "modelname": "Entrez le nom du modèle",
  "title": "ANOVA à Mesures Répétées - Large",
  "subjectID": "Spécifiez éventuellement une variable à utiliser comme identifiant de sujet",
  "dependentVariable": "Variable dépendante",
  "navigation": "ANOVA, Mesures Répétées, Large",
  "response": "Variable(s) intra-sujet e.g. Temps",
  "Fixed": "Facteur inter-sujet",
  "covariates": "Covariables",
  "Summary": "Moyennes marginales estimées",
  "Scatter_plot": "Post-hocs",
  "Residual": "Graphique Résiduel vs. Ajusté",
  "Histogram": "Graphique histogramme des résidus",
  "brownForsythe": "Test de Brown-Forsythe",
  "levenesTest": "Test de Levene",
  "plotMeansCI": "Graphique des moyennes et des intervalles de confiance",
  "simpleEffectsTest": "Test des effets simples",
  "label2": "Options pour les post-hocs et le test des effets simples",
  "combon": "Comparer les moyennes en utilisant :",
  "adjust": "Méthode d'ajustement des p-values",
  "displayBoxMDetails": "Afficher les détails associés au test de Box's M (Remarque : Les résultats du test de Box's M sont toujours affichés)",
  "help": {
    "title": "ANOVA à Mesures Répétées",
    "r_help": "help(aov_ez , package='afex')",
    "body": "\n<b>Description</b></br>\nREMARQUE :<br/>\n1. Nous devons remodeler les données lors de l'exécution d'une ANOVA à mesures répétées sur un ensemble de données large<br/>\n2. Nous supportons plusieurs mesures répétées pour une seule variable e.g. Glycémie mesurée au pré-test, post-test et lors d'une visite de suivi<br/>\n3. Vous devez spécifier un nom de facteur répété e.g. Glycémie et le nombre de niveaux. Nous créerons une variable facteur e.g. nommée Glycémie avec des niveaux créés à partir des noms des variables contenant les mesures répétées e.g. les niveaux du facteur seront pré-test, post-test et suivi<br/>\n4. Vous devez spécifier un nom de mesure e.g. Valeur. Nous créerons une variable e.g. Valeur avec toutes les valeurs de Glycémie correspondant au pré-test, post-test et suivi pour chaque sujet.<br/>\n5. Nous supportons un seul facteur variable entre-sujets et intra-sujets.<br/>\n6. Les versions futures supporteront plusieurs mesures ainsi que plusieurs variables de facteurs entre-sujets et intra-sujets.<br/>\n7. Par défaut, chaque ligne de l'ensemble de données correspond à un sujet unique, vous pouvez également spécifier une variable pour l'ID du sujet.</br>\n<br/>\nAvec l'ANOVA à mesures répétées, les statistiques F sont calculées pour chaque facteur intra-sujet, facteur inter-sujet et le terme d'interaction pour l'ANOVA mixte</br>\nRecherchez les tables de valeurs ANOVA supplémentaires dans la sortie qui affichent MSE (moyenne des carrés pour l'erreur) et pes (eta carré partiel)</br>\nNous supportons actuellement un seul facteur intra-sujet et inter-sujet, le facteur inter-sujet est optionnel.</br>\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"variableDépendante\", \n\tid = \"Identifiant\", within = c(\"Temps\"), \tbetween = c(\"Traitement\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ndata: Un data.frame contenant les données. Obligatoire\n</li>\n<li>\ndv: vecteur de caractères (de longueur 1) indiquant la colonne contenant la variable dépendante dans les données.\n</li>\n<li>\nbetween: vecteur de caractères indiquant les facteurs/colonnes entre-sujets dans les données. Par défaut, c'est NULL indiquant qu'il n'y a pas de facteurs entre-sujets.\n</li>\n<li>\nwithin: vecteur de caractères indiquant les facteurs/colonnes intra-sujets (ou mesures répétées) dans les données. Par défaut, c'est NULL indiquant qu'il n'y a pas de facteurs intra-sujets.\n</li>\n<li>\ncovariate: vecteur de caractères indiquant les covariables entre-sujets (c'est-à-dire, colonnes) dans les données. Par défaut, c'est NULL indiquant qu'il n'y a pas de covariables. Veuillez noter que factorize doit être défini sur FALSE si la covariable est numérique et doit être traitée comme telle.\n</li>\n<li>\nanovatable: liste d'arguments supplémentaires passés à la fonction produisant la table ANOVA. \n</li>\n</ul>\n<br/>\n<b>Détails</b></br>\nVoir l'aide détaillée de R</br>\n<b>Valeur</b><br/>\naov_car, aov_4 et aov_ez sont des wrappers pour Anova et aov, la valeur de retour dépend de l'argument de retour. Par défaut, un objet S3 de classe \"afex_aov\" est retourné contenant les slots suivants :<br/>\n\"anova_table\": Une table ANOVA de classe c(\"anova\", \"data.frame\").<br/>\n\"aov\": objet aov retourné par aov (ne doit pas être utilisé pour évaluer la signification des effets, mais peut être passé à emmeans pour des tests post-hoc).<br/>\n\"Anova\": objet retourné par Anova, un objet de classe \"Anova.mlm\" (si des facteurs intra-sujets sont présents) ou de classe c(\"anova\", \"data.frame\").<br/>\n\"lm\": l'objet ajusté avec lm et passé à Anova (c'est-à-dire, un objet de classe \"lm\" ou \"mlm\"). Également retourné si return = \"lm\".<br/>\n\"data\": une liste contenant : (1) long (les données éventuellement agrégées au format long utilisées pour aov), large (les données utilisées pour ajuster l'objet lm), et idata (si des facteurs intra-sujets sont présents, l'argument idata passé à car::Anova). Également retourné si return = \"data\".<br/>\n<b>Package</b></br>\nafex</br>\n<b>Aide</b></br>\nhelp(aov_ez, package ='afex')\nCliquez sur le bouton Aide R pour obtenir une aide R détaillée. Vous pouvez également entrer help(aov_ez, package ='afex') et appuyer sur CTRL Entrée dans l'éditeur de syntaxe R pour obtenir de l'aide\n    "
  }
}