{
  "title": "Restructurer, large à long",
  "label2": "Choisissez les variables à restructurer ou choisissez alternativement les variables à ne pas restructurer. Dans ce dernier cas, toutes les variables restantes seront restructurées en colonne(s).",
  "navigation": "Plus long",
  "label0": "Vous pouvez choisir de sauvegarder les résultats dans un nouveau jeu de données ou de remplacer le jeu de données existant.",
  "label1": "Options",
  "advanced": "Avancé",
  "New": "Sauvegarder les résultats dans un nouveau jeu de données",
  "newdatasetname": "Entrez un nom de jeu de données",
  "Existing": "Remplacer le jeu de données existant",
  "label12": "Entrez le(s) nom(s) de variable(s) pour les nouvelles variables de facteur répétées",
  "repeatedMeasure": "REMARQUE : Lorsque vous spécifiez plusieurs noms de variables qui stockent des facteurs répétés, séparez-les par des virgules, par exemple Mois, Jour. Vous devez également cliquer sur avancé pour spécifier comment les noms de variables sont créés.",
  "repeatedValue": "Nom de la variable pour la valeur répétée, par exemple Compte",
  "labelChoice": "Sélectionnez l'une des options ci-dessous",
  "subsetvars": "Option1 : Sélectionnez la ou les variables à restructurer en une ou plusieurs variables",
  "names_sep": "Option2 : Spécifiez un caractère ou une expression régulière pour diviser les noms de colonnes afin de créer des valeurs pour les noms de variables. Prend la même spécification que separate(), et peut être soit un vecteur numérique (spécifiant les positions à casser), soit une seule chaîne (spécifiant une expression régulière à casser).",
  "names_pattern": "Option1 : Une expression régulière contenant des groupes correspondants (()). La partie correspondante de l'expression régulière entre les () sera utilisée pour créer des noms de variables.",
  "dontReshape": "Option2 : Sélectionnez la ou les variables à ne pas restructurer (toutes les autres variables restantes seront restructurées en colonne(s)).",
  "removeNA": "Supprimer les lignes où la valeur répétée est NA.",
  "makeString": "Faire du facteur répété un type de chaîne R au lieu d'un facteur",
  "label3": "S'il y a plusieurs nouvelles variables créées pour des facteurs répétés, les options ci-dessous contrôlent comment les noms de colonnes sont décomposés. Sélectionnez l'une des 2 options ci-dessous.",
  "help": {
    "title": "Restructurer (large à long)",
    "r_help": "help(pivot_longer, package=tidyr)",
    "body": "\n<b>Description</b></br>\nVoir la vidéo à <a href=\" https://youtu.be/ypLXqmFp3jY\">Restructurer large à long</a></br>\nPrend un jeu de données large et le convertit en un jeu de données long en convertissant les colonnes en paires clé-valeur.\nPivot_longer prend plusieurs colonnes et les réduit en paires clé-valeur, dupliquant toutes les autres colonnes au besoin. Vous utilisez pivot_longer() lorsque vous remarquez que vous avez des colonnes qui ne sont pas des variables.</br>\nTapez vignette(\"pivot\") dans l'éditeur R pour voir l'aide R. S'il y a plusieurs colonnes à créer, vous devez spécifier des arguments pour indiquer comment les noms de colonnes sont construits.</br>\nDans ce cas, cliquez sur avancé pour entrer une expression régulière qui spécifie comment les variables doivent être créées à partir des noms de colonnes.</br>\nREMARQUE : Lorsque vous spécifiez plusieurs variables pour les facteurs répétés, séparez-les par ,\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \npivot_longer( cols=c(col1, col2...),names_to=\"key\",values_to=\"value\",values_drop_na = TRUE)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\ncols : Colonnes à pivoter en format plus long.\n</li>\n<li>\nvalues_to : Une chaîne spécifiant le nom de la colonne à créer à partir des données stockées dans les valeurs de cellule. Si names_to est un caractère contenant le sentinelle spécial .value, cette valeur sera ignorée, et le nom de la colonne de valeur sera dérivé d'une partie des noms de colonnes existants. Si vide, toutes les variables sont sélectionnées, excluez une variable y avec -y. Lors de l'exclusion de variables, toutes les variables restantes sont pivotées en long.\n</li>\n<li>\nvalues_drop_na : Si TRUE, supprimera les lignes qui contiennent uniquement des NA dans la colonne value_to. Cela convertit effectivement les valeurs manquantes explicites en valeurs manquantes implicites et ne devrait généralement être utilisé que lorsque les valeurs manquantes dans les données ont été créées par leur structure.\n</li>\n<li>\nnames_sep : prend la même spécification que separate(), et peut être soit un vecteur numérique (spécifiant les positions à casser), soit une seule chaîne (spécifiant une expression régulière à casser).</br>\nDisons que les colonnes sont Height_1_1, Height_1_2, Weight_1_1, Weight_1_2, Sagur_1_1, Sagur_2_1 où le 1er numéro est le mois et le 2e la semaine, spécifier _ comme séparateur entraînera la création de 3 variables, la première variable avec des valeurs Height, Weight, Sagur, la deuxième avec des valeurs 1 et 2, et la 3e avec des valeurs 1 et 2.</br>\nTapez help(regex) dans l'éditeur de code R pour plus de détails.\n</li>\n<li>\nnames_pattern : prend la même spécification que extract(), une expression régulière contenant des groupes correspondants (()).\nPrend la même spécification que separate(), et peut être soit un vecteur numérique (spécifiant les positions à casser), soit une seule chaîne (spécifiant une expression régulière à casser).</br>\nDisons que les colonnes sont Height_33.1_1, Height_44.1_2, Weight_66.1_1, Weight_55.1_2, où les 2 chiffres après le 1er soulignement doivent être ignorés, le chiffre après le . est le mois et le chiffre après le dernier _ est la semaine.</br>\nLes expressions régulières qui extraient les valeurs des nouvelles variables doivent être dans (). L'expression régulière sera (.*)_.*.(.*)_(.)</br> \nRemarque : . dans une expression régulière signifie n'importe quel caractère</br> \n* signifie 0 ou plus, donc .* signifie 0 ou plus de caractères</br> \nAinsi, la chaîne peut être interprétée comme cherchant un motif de</br> \n(.*) 0 ou plus de caractères suivis de</br> \n _ un soulignement suivi de</br> \n .*. un ou plusieurs caractères suivis de . (l'échappement du . avec un  indique qu'il s'agit du caractère lui-même suivi de</br> \n.* un ou plusieurs caractères suivis de</br> \n_ soulignement suivi de</br> \n. un seul caractère.</br> \nTous les motifs entre les () forment les valeurs de chacune des 3 nouvelles variables de facteur.</br> \n</li>\n</ul>\n<b>Valeur</b><br/>\nRetourne le jeu de données restructuré\n<br/>\n<b>Paquet</b></br>\ntidyr</br>\n<b>Aide</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
  }
}