{
  "title": "Aide du package R",
  "navigation": "Aide du package R",
  "packageName": "Sélectionnez un package R installé",
  "help": {
    "title": "Aide du package R",
    "r_help": "aide()",
    "body": "\n<b>Description</b></br>\nl'aide est l'interface principale des systèmes d'aide.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \naide(sujet, package = NULL, lib.loc = NULL,\n    verbose = getOption(\"verbose\"),\n    try.all.packages = getOption(\"help.try.all.packages\"),\n    help_type = getOption(\"help_type\"))\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nsujet: généralement, un nom ou une chaîne de caractères spécifiant le sujet pour lequel de l'aide est demandée. Une chaîne de caractères (entre guillemets simples ou doubles explicites) est toujours considérée comme désignant un sujet. Si la valeur de sujet est un vecteur de caractères de longueur un, le sujet est considéré comme la valeur du seul élément. Sinon, le sujet doit être un nom ou un mot réservé (s'il est syntaxiquement valide) ou une chaîne de caractères. \n</li>\n<li>\npackage: un nom ou un vecteur de caractères donnant les packages à consulter pour la documentation, ou NULL. Par défaut, tous les packages dont les espaces de noms sont chargés sont utilisés. Pour éviter qu'un nom ne soit déparsé, utilisez par exemple (pkg_ref).\n</li>\n<li>\nlib.loc: un vecteur de caractères de noms de répertoires de bibliothèques R, ou NULL. La valeur par défaut de NULL correspond à toutes les bibliothèques actuellement connues. Si la valeur par défaut est utilisée, les packages et espaces de noms chargés sont recherchés avant les bibliothèques.\n</li>\n<li>\nverbose: logique; si TRUE, le nom du fichier est signalé.\n</li>\n<li>\ntry.all.packages: logique; voir Remarque.\n</li>\n<li>\nhelp_type: chaîne de caractères: le type d'aide requis. Les valeurs possibles sont \"texte\", \"html\" et \"pdf\". La casse est ignorée et les correspondances partielles sont autorisées.\n</li>\n</ul>\n<b>Détails</b></br>\nL'aide sur le package</br>\n<b>Exemples</b><br/>\n<code> \naide(package = \"splines\")\n</code> <br/>\n<b>Package</b></br>\nutils</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R: aide()\n                "
  }
}