{
  "title": "Fusionner des ensembles de données",
  "navigation": "Fusionner",
  "out": "Entrez le nom de l'ensemble de données fusionné",
  "in1": "Sélectionnez le 1er ensemble de données",
  "in2": "Sélectionnez le 2ème ensemble de données",
  "label1": "Options de fusion",
  "leftjoin": "Jointure gauche (Conserver uniquement les lignes du premier ensemble de données)",
  "rightjoin": "Jointure droite (Conserver uniquement les lignes du deuxième ensemble de données)",
  "innerjoin": "Jointure interne (Conserver les lignes communes aux deux ensembles de données)",
  "fulljoin": "Jointure complète (Conserver toutes les lignes de chaque ensemble de données)",
  "label2": "Remplacer la fusion effectuée sur tous les noms de colonnes communs",
  "by": "Pour remplacer le paramètre par défaut de la fusion effectuée sur tous les noms de colonnes communs, entrez un sous-ensemble des noms de colonnes communs ci-dessous, séparés par une virgule, par exemple pays, région. La fusion sera effectuée uniquement sur les noms de colonnes communs saisis. Formatez cette liste comme des valeurs séparées par une virgule, par exemple A,B,C",
  "label3": "Si les noms de colonnes sur lesquels la fusion est effectuée sont différents dans chaque ensemble de données",
  "byDiffNames": "Entrez les noms de colonnes correspondants séparés par une virgule, par exemple, 'C'='D', 'B'='A'. Veuillez utiliser des guillemets simples ( ' ) ici.",
  "label4": "S'il y a des noms de colonnes communs dans les deux ensembles de données",
  "suffix": "Par défaut, .x et .y seront utilisés comme suffixes pour les variables communes. Si vous souhaitez les changer, entrez-les ici séparés par une virgule, par exemple 1,2. Notez que tout . sera remplacé par un _ dans l'ensemble de données de sortie",
  "advOptions": "Options avancées",
  "help": {
    "title": "Fusionner des ensembles de données",
    "r_help": "aide(fusionner, paquet=dplyr)",
    "body": "\n            <b>Description</b></br>\n            La fusion d'ensembles de données vous aidera à joindre 2 ensembles de données ensemble. Par défaut, cette boîte de dialogue recherchera des noms de variables communs dans les 2 ensembles de données et fusionnera l'ensemble complet des variables communes.<br/> Si vous souhaitez fusionner sur un ensemble spécifique de variables, vous pouvez les spécifier dans le menu Avancé.<br/>\n            inner_join: renvoie toutes les lignes de x où il y a des valeurs correspondantes dans y, et toutes les colonnes de x et y. S'il y a plusieurs correspondances entre x et y, toutes les combinaisons des correspondances sont renvoyées.</br>\n            left_join: renvoie toutes les lignes de x, et toutes les colonnes de x et y. Les lignes dans x sans correspondance dans y auront des valeurs NA dans les nouvelles colonnes. S'il y a plusieurs correspondances entre x et y, toutes les combinaisons des correspondances sont renvoyées.</br>\n            right_join: renvoie toutes les lignes de y, et toutes les colonnes de x et y. Les lignes dans y sans correspondance dans x auront des valeurs NA dans les nouvelles colonnes. S'il y a plusieurs correspondances entre x et y, toutes les combinaisons des correspondances sont renvoyées.</br>\n            full_join: renvoie toutes les lignes et toutes les colonnes de x et y. Lorsqu'il n'y a pas de valeurs correspondantes, renvoie NA pour le manquant.</br>\n            <b>Utilisation</b>\n            <br/>\n            <code> \n            left_join(x, y, by = c(NULL), suffix = c(\".x\", \".y\"), ...)\n            right_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            inner_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            full_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            </code> <br/>\n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            x: ensemble de données à joindre\n            </li>\n            <li>\n            y: ensemble de données à joindre\n            </li>\n            <li>\n            by: un vecteur de caractères de variables à joindre. Si NULL, le comportement par défaut, *_join() effectuera une jointure naturelle, en utilisant toutes les variables avec des noms communs dans les deux tables. Un message liste les variables afin que vous puissiez vérifier qu'elles sont correctes (pour supprimer le message, il suffit de lister explicitement les variables que vous souhaitez joindre). Pour joindre par des variables différentes dans x et y, utilisez un vecteur nommé. Par exemple, by = c(\"a\" = \"b\") fera correspondre x.a à y.b.\n            </li>\n            <li>\n            suffix: S'il y a des variables en double non jointes dans x et y, ces suffixes seront ajoutés à la sortie pour les distinguer. Cela devrait être un vecteur de caractères de longueur 2.\n            </li>\n            </ul>\n            <b>Valeur</b><br/>\n            Un tibble.<br/>\n            <b>Paquet</b></br>\n            dplyr</br>\n            <b>Aide</b></br>\n            Pour une aide détaillée, cliquez sur l'icône R en haut à droite de cette superposition de dialogue ou exécutez la commande suivante aide(left_join, paquet=\"dplyr\") en créant un bloc de code R en cliquant sur + dans la fenêtre de sortie\n"
  }
}