{
  "title": "Taille d'échantillon, Test de deux proportions appariées",
  "navigation": "Deux proportions appariées",
  "howtouse": "Pour calculer la taille de l'échantillon (nombre de paires) : spécifiez la puissance\nPour calculer la puissance : spécifiez la taille de l'échantillon (nombre de paires)",
  "n": "Taille de l'échantillon (nombre de paires)",
  "power": "Puissance (0-1)",
  "pdisc": "Proportion de paires discordantes (PD) (0-1)",
  "pdiff": "Différence de proportions, doit être comprise entre -PD et PD",
  "siglevel": "Niveau de signification (0-1)",
  "alternativeopt": "Hypothèse alternative",
  "twosided": "Bilatéral",
  "onesided": "Unilatéral",
  "help": {
    "title": "Taille d'échantillon, Test de deux proportions appariées",
    "r_help": "help(qnorm, package ='stats')",
    "body": "\nCeci est une évaluation de la taille de l'échantillon pour un test apparié de proportions utilisant le test de McNemar. Il calcule la taille de l'échantillon (nombre de paires) ou la puissance lorsque l'utilisateur spécifie l'autre. Les calculs utilisent une approximation normale conditionnelle à la proportion de paires discordantes. Voir Connor R. J. 1987. Taille de l'échantillon pour tester les différences de proportions pour le design apparié. Biometrics 43(1):207-211.\n<br/><br/>\n<b>Taille de l'échantillon (nombre de paires) :</b> Spécifiez la taille de l'échantillon dans l'étude. C'est le nombre de sujets qui fourniront des valeurs de résultat binaires à deux moments dans un design avant-après ou le nombre de paires dans un design de sujet apparié (par exemple, étude cas-témoins appariée).\n<br/><br/>\n<b>Puissance :</b> Spécifiez la puissance souhaitée de l'étude, c'est-à-dire la probabilité que le test rejette l'hypothèse nulle si l'hypothèse alternative était vraie.\n<br/><br/>\n<b>Proportion de paires discordantes :</b> Spécifiez la proportion attendue de paires qui ne seront pas d'accord, par exemple, des réponses 'oui'/'non' ou 'non'/'oui', sur le nombre total de paires.\n<br/><br/>\n<b>Différence de proportions :</b> Spécifiez la différence dans les proportions de résultats (c'est-à-dire la proportion qui est 'oui') que vous souhaitez détecter. Par exemple, dans une étude cas-témoins appariée, c'est la différence entre la proportion de cas qui sont 'oui' et la proportion de contrôles qui sont 'oui'.\n<br/><br/>\n<b>Niveau de signification :</b> Spécifiez le niveau de signification souhaité (c'est-à-dire l'erreur de type I) du test.\n<br/><br/>\n<b>Hypothèse alternative :</b> Spécifiez si le test est bilatéral ou unilatéral.\n<br/><br/>\n<b>Packages R requis :</b> stats\n\t\t\t"
  }
}