{
  "title": "Corrélations partielles",
  "navigation": "Partiel",
  "tvarbox1": "Sélectionner des variables",
  "statistic": "Sélectionner une méthode",
  "tvarbox2": "Sélectionner des variables de contrôle",
  "help": {
    "title": "Corrélations partielles",
    "r_help": "help(pcor.test, package=ppcor)",
    "body": "\n<b>Description</b></br>\nCorrélation partielle pour deux variables données une troisième variable. Nous allons calculer la corrélation partielle paire entre chacune des variables spécifiées dans le contrôle des variables sélectionnées, en contrôlant les variables spécifiées dans le contrôle des variables de contrôle.<br/>\nNous avons écrit un wrapper autour de la fonction pcor.test qui appelle pcor.test pour chaque paire des variables spécifiées.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \npcor.test(x, y, z, method = c(\"pearson\", \"kendall\", \"spearman\"))</br>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nArguments\nx: un vecteur numérique.\n</li>\n<li>\ny: un vecteur numérique.\n</li>\n<li>\ny: un vecteur numérique.\n</li>\n<li>\nmethod: une chaîne de caractères indiquant quel coefficient de corrélation partielle doit être calculé. L'un de \"pearson\" (par défaut), \"kendall\" ou \"spearman\" peut être abrégé..\n</li>\n</ul>\n<b>Détails</b></br>\nLa corrélation partielle est la corrélation de deux variables tout en contrôlant une troisième variable. Lorsque le déterminant de la matrice de variance-covariance est numériquement nul, l'inverse généralisé de Moore-Penrose est utilisé. Dans ce cas, aucun p-valeur et aucune statistique ne seront fournies si le nombre de variables est supérieur ou égal à la taille de l'échantillon.</br>\n<b>Valeur</b><br/>\nestimation: le coefficient de corrélation partielle entre deux variables.<br/>\np.valeur: la p-valeur du test.<br/>\nn: Le nombre d'échantillons.<br/>\n<b>Exemples</b><br/>\n<code> \npcor.test(y.data$hl,y.data$disp,y.data[,c(\"deg\",\"BC\")])\n</code> <br/>\n<b>Paquet</b></br>\nppcor</br>\n<b>Aide</b></br>\nhelp(pcor.test, package=ppcor)\n"
  }
}