{
  "title": "Standardiser les variables",
  "navigation": "Standardiser",
  "label1": "Les valeurs standardisées seront enregistrées dans de nouvelles variables avec le préfixe/suffixe spécifié.",
  "dest": "Sélectionnez la ou les variables à standardiser",
  "label2": "Sélectionnez un préfixe ou un suffixe",
  "suffix": "Suffixe",
  "prefix": "Préfixe",
  "txt1": "Entrez un préfixe/suffixe",
  "label3": "Centrer et/ou échelle",
  "Center": "Centrer",
  "Scale": "Échelle",
  "help": {
    "title": "Standardiser les variables",
    "r_help": "",
    "body": "\n<b>Description</b></br>\nStandardise les variables (scores z). Les valeurs standardisées sont stockées dans de nouvelles variables avec soit le préfixe soit le suffixe des variables d'origine. L'option est fournie pour centrer et/ou échelonner.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nBSkyStandardizeVars (vars, center, scale, prefix, datasetname)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nvars: Une ou plusieurs variables à standardiser. Seules les variables numériques (pas de facteurs) sont prises en charge.\n</li>\n<li>\ncenter: Si center est TRUE, le centrage est effectué en soustrayant les moyennes des colonnes (en omettant les NAs) de x de leurs colonnes correspondantes, et si center est FALSE, aucun centrage n'est effectué.\n</li>\n<li>\nscale: Si scale est TRUE, l'échelle est effectuée en divisant les colonnes (centrées) de x par leurs écarts-types si center est TRUE, et par la racine carrée de la moyenne sinon. Si scale est FALSE, aucune échelle n'est effectuée.\n</li>\n<li>\nstingToPrefixOrSuffix: Une chaîne de caractères qui spécifie le préfixe ou le suffixe à utiliser pour les nouvelles variables standardisées (c'est-à-dire de nouvelles colonnes dans le jeu de données).\n</li>\n<li>\nprefixOrSuffix: spécifiez si vous voulez un préfixe ou un suffixe\n</li>\n<li>\ndatasetname: Le nom du jeu de données/dataframe\n</li>\n</ul>\nRemarque : Nous ne convertirons pas de numérique à facteur. Lorsqu'un numérique est recodé, il restera numérique, lorsqu'une variable facteur est recodée, elle restera un facteur.</br>\n<b>Paquet</b></br>\nBlueSky</br>\n"
  }
}