{
  "title": "Ciblage des articles, format multi-lignes",
  "navigation": "Ciblage des articles, format multi-lignes",
  "src": "Colonnes",
  "idcolname": "Nom de la variable ID de transaction",
  "itemcolname": "Variable contenant les articles de transaction",
  "prunerules": "Règles de taille",
  "graphs": "Afficher les visualisations",
  "test3": "Différence < 0",
  "txtbox2": "Hypothèse nulle (mu)",
  "txtbox1": "Niveau de confiance",
  "label1": "Générer des règles",
  "rulesobj": "Nom de l'objet de règles",
  "rulesobjhint": "Cet objet contient toutes les règles et peut être spécifié dans d'autres dialogues connexes. c'est-à-dire Afficher les règles, Tracer les règles",
  "support": "Valeur de support minimum",
  "supphint": "Le support d'un article est la fraction des transactions dans le jeu de données qui contiennent cet article.",
  "confidence": "Valeur de confiance minimum",
  "confhint": "La confiance d'une règle est la probabilité qu'elle soit vraie pour une nouvelle transaction contenant les articles sur le LHS de la règle.",
  "label2": "Ciblage des articles",
  "label3": "Entrez les articles de transaction qui vous intéressent, par exemple, si vous êtes intéressé par les articles que les gens achètent avant d'acheter du lait, entrez du lait dans la zone de texte pour le côté droit (RHS) ci-dessous. Comme tous les autres articles peuvent apparaître sur le LHS, cochez le bouton radio relatif à l'apparence par défaut sur le LHS.",
  "lhs": "Articles apparaissant sur le côté gauche",
  "rhs": "Articles apparaissant sur le côté droit",
  "both": "Articles apparaissant des deux côtés",
  "none": "Articles n'apparaissant pas du tout",
  "label4": "apparence par défaut",
  "rdboth": "les deux",
  "rdlhs": "gauche",
  "rdrhs": "droite",
  "rdnone": "aucun",
  "advoptions": "Options avancées",
  "minlen": "Nombre minimum d'articles à gauche",
  "maxlen": "Nombre maximum d'articles à gauche",
  "sortopt": "Options de tri",
  "sortby": "Trier par",
  "rd1": "Confiance",
  "rd2": "Lift",
  "rd3": "Support",
  "sortord": "Ordre de tri",
  "increasing": "Croissant",
  "decreasing": "Décroissant",
  "noofrules": "Nombre de règles à afficher",
  "rulecount": "",
  "fromto": "Afficher les règles",
  "from": "De",
  "to": "À",
  "help": {
    "title": "Ciblage des articles, format multi-lignes",
    "r_help": "aide(apriori, package='arules')",
    "body": "\n                    <b>\n                    REMARQUE: En fonction du format des données, vous choisirez soit le 'format de données de panier', soit le 'format de transaction multi-lignes' ou le format multi-variables. Un ensemble séparé de dialogues est fourni pour chacun de ces formats de données. Voir ci-dessous pour les détails:\n                    </b>\n                    <br/><br/>\n                    <b>\n                    Format de données de panier\n                    </b>\n                    <br/>\n                    Avec le format de données de panier, tous les articles d'un seul panier sont contenus dans une seule colonne du jeu de données. Plusieurs articles sont séparés par n'importe quel caractère unique comme une virgule(,) , un point-virgule (;) ou un deux-points (:), etc.\n                    <br/>\n                    <b>\n                    Exemple 1\n                    </b>\n                    <table style=\"border: 1px solid ; border-collapse: collapse;\">\n                    <tr>\n                    <th style=\"border: 1px solid ; border-collapse: collapse;\">Articles</th>\n                    </tr>\n                    <tr>\n                    <td style=\"border: 1px solid ; border-collapse: collapse;\">article10,article20,article23,article24</td>\n                    </tr>\n                    <tr>\n                    <td style=\"border: 1px solid ; border-collapse: collapse;\">article12,article13,article43</td>\n                    </tr>\n                    <tr>\n                    <td style=\"border: 1px solid ; border-collapse: collapse;\">article12,article14,article32</td>\n                    </tr>            \n                </table> \n\n                <br/>\n                <b>\n                Exemple 2\n                </b>\n                <table style=\"border: 1px solid ; border-collapse: collapse;\">\n                <tr>\n                    <th style=\"border: 1px solid ; border-collapse: collapse;\">Articles alimentaires</th>\n                </tr>\n                <tr>\n                    <td style=\"border: 1px solid ; border-collapse: collapse;\">pommes,mangues,bière</td>\n                </tr>\n                <tr>\n                    <td style=\"border: 1px solid ; border-collapse: collapse;\">lait,poulet,fromage</td>\n                </tr>\n                <tr>\n                    <td style=\"border: 1px solid ; border-collapse: collapse;\">pommes,vins,fromage</td>\n                </tr>            \n                </table>    \n                <br/>\n                <br>\n                <b>\n                Format de données de transaction multi-lignes\n                </b>\n                <br/>\n                Avec le format de transaction, chaque article d'un seul panier est représenté dans une ligne séparée. Toutes les lignes représentant des articles dans un seul panier contiennent une ID de transaction commune. L'ID de transaction est capturé dans une colonne séparée        \n                <br/>\n                <b>\n                Exemple 1\n                </b>\n                <table style=\"border: 1px solid ; border-collapse: collapse;\">\n                <tr>\n                <th style=\"border: 1px solid ; border-collapse: collapse;\">ID</th>\n                <th style=\"border: 1px solid ; border-collapse: collapse;\">Articles</th>\n                </tr>\n                <tr>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">1</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Pain</td>\n                </tr>\n                <tr>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">1</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Beurre</td>\n                </tr>\n                <tr>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">2</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Viande</td>\n                </tr>      \n                <tr>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">2</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Œufs</td>\n                </tr>\n                <tr>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">2</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Fromage</td>\n                </tr>\n                <tr>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">2</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Lait</td>\n                </tr>                              \n            </table> \n            <br/>\n            Donc le panier 1 contient du pain et du beurre et le panier 2 contient de la viande, des œufs, du fromage et du lait\n\n            <br/><br/>\n            <b>\n            Format de données multi-variables\n            </b>\n            <br/>\n            Dans ce format, chaque niveau d'une variable dans un ensemble de données représente un article. Chaque ligne de l'ensemble de données représente un panier. Voir ci-dessous\n            <br/>\n            <b>\n            Exemple 1\n            </b>\n            <table style=\"border: 1px solid ; border-collapse: collapse;\">\n            <tr>\n                <th style=\"border: 1px solid ; border-collapse: collapse;\">Produits de boulangerie</th>\n                <th style=\"border: 1px solid ; border-collapse: collapse;\">Produits laitiers</th>\n                <th style=\"border: 1px solid ; border-collapse: collapse;\">Viande</th>\n                <th style=\"border: 1px solid ; border-collapse: collapse;\">Légumes</th>        \n            </tr>\n            <tr>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Pain</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Lait</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Poulet</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Tomates</td>\n            </tr>\n            <tr>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">NA</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Fromage</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">NA</td>\n                <td style=\"border: 1px solid ; border-collapse: collapse;\">Oignons</td>\n            </tr>\n            </table> \n            <br/>\n            La case à cocher des règles de taille vous permet de tailler les règles. Lorsqu'elle est sélectionnée, les règles redondantes sont affichées et le modèle taillé avec les règles redondantes supprimées est enregistré et affiché.\n            <br/>\n            En cliquant sur la case à cocher afficher les visualisations, des graphiques sont affichés. Nous avons commenté le #plot(rule1, method =\"paracoord\",control = list(reorder=TRUE)) car cela peut prendre beaucoup de temps à exécuter. Vous pouvez coller la syntaxe et exécuter la commande manuellement.            \n            <br/>\n            <br/>\n            <b>Articles cibles</b>\n            <br/>\n            Maintenant que nous savons comment générer des règles, limitons la sortie en supprimant les règles redondantes. Supposons que nous voulions cibler des articles pour générer des règles. Il existe deux types de cibles qui pourraient nous intéresser, illustrées par un exemple de supermarché de « lait » :\n            <br/><br/>\n            Que sont susceptibles d'acheter les clients avant d'acheter du lait\n            <br/><br/>\n            Que sont susceptibles d'acheter les clients s'ils achètent du lait ?\n            <br/><br/>\n            Cela signifie essentiellement que nous voulons définir soit le côté gauche, soit le côté droit. \n            <br/><br/>\n            Si vous êtes intéressé par les articles que les gens achètent avant d'acheter du lait, entrez du lait dans la zone de texte pour le côté droit (RHS) ci-dessous. Comme tous les autres articles peuvent apparaître sur le LHS, cochez le bouton radio relatif à l'apparence par défaut sur le LHS.\n            <br/><br/>\n            N'oubliez pas que l'apparence par défaut est pertinente pour tous les articles qui ne sont pas explicitement mentionnés dans le LHS, le RHS, les articles apparaissant des deux côtés ou les articles n'apparaissant pas du tout.\n            <br/><br/>\n            Si vous êtes intéressé par ce que les clients sont susceptibles d'acheter s'ils achètent du lait, mettez du lait dans le LHS et comme n'importe quel article peut apparaître dans le RHS, cochez le bouton radio relatif à l'apparence par défaut sur le RHS.\n            <br/>\n            <br/>\n            <b>\n            Sortie\n            </b>\n            <br/>\n            Les résultats sont affichés au format tabulaire\n            <br/>\n            Les colonnes du tableau sont ci-dessous\n            <br/><br/>\n            <b>LHS:</b> Ceux-ci représentent les articles dans le panier\n            <br/><br/>\n            <b>RHS:</b> Étant donné les articles dans le panier (LHS), le RHS contient un seul article qui sera probablement acheté\n            <br/><br/>\n            <b>Support:</b> Le support est la fraction des transactions dans le jeu de données qui contiennent les articles sur le LHS\n            <br/><br/>\n            <b>Confiance:</b> La confiance est la probabilité conditionnelle qu'un client achetant des articles sur le LHS achète également l'article sur le RHS\n            <br/><br/>\n            <b>Lift:</b> Si quelqu'un achète des articles sur le LHS, quelle serait la probabilité d'acheter le produit sur le RHS ? Donc, en gros, combien notre confiance a augmenté que le RHS sera acheté étant donné que le LHS est acheté. Si le lift >1, la présence d'articles sur le LHS a augmenté la probabilité que les articles sur le RHS apparaissent dans la transaction. Si <1, la présence d'articles sur le LHS diminuera la probabilité que les articles sur le RHS apparaissent. Si =1, alors LHS et RHS sont indépendants.\n            <br/><br/>\n            Pour plus de détails, voir \n            <br/><br/>\n            http://infocenter.informationbuilders.com/wf80/index.jsp?topic=%2Fpubdocs%2FRStat16%2Fsource%2Ftopic49.htm\n            <br/><br/>\n            https://discourse.snowplowanalytics.com/t/market-basket-analysis-identifying-products-and-content-that-go-well-together/1132\n            <br/><br/>\n            http://www.listendata.com/2015/12/market-basket-analysis-with-r.html\n            <br/><br/>\n            http://www.salemmarafi.com/code/market-basket-analysis-with-r/\n            <br/><br/>\n        \n            <b>Paquet : arules</b> \n            <br/><br/>\n            <b>Description</b> \n            <br/>\n            Mine des itemsets fréquents, des règles d'association ou des hyperarêtes d'association à l'aide de l'algorithme Apriori. L'algorithme Apriori utilise une recherche par niveaux pour les itemsets fréquents. L'implémentation d'Apriori utilisée comprend certaines améliorations (par exemple, un arbre de préfixe et un tri des articles).\n            <br/><br/>\n            <b>Utilisation</b> \n            <br/>\n            <code>\n            apriori(data, parameter = NULL, appearance = NULL, control = NULL)\n            </code>\n            <br/><br/>\n        \n            <b>Arguments</b><br/>\n            <ul>\n            <li>\n            data: objet de la classe transactions ou toute structure de données pouvant être convertie en transactions (par exemple, une matrice binaire ou un data.frame).\n            </li>\n            <li>\n            parameter: objet de la classe APparameter ou liste nommée. Le comportement par défaut consiste à extraire des règles avec un support minimum de 0,1, une confiance minimum de 0,8, un maximum de 10 articles (maxlen) et un temps maximal pour la vérification des sous-ensembles de 5 secondes (maxtime).\n            </li>\n            <li>\n            appearance: objet de la classe APappearance ou liste nommée. Avec cet argument, l'apparence des articles peut être restreinte (implémente des modèles de règles). Par défaut, tous les articles peuvent apparaître sans restriction.\n            </li>\n            <li>\n            control: objet de la classe APcontrol ou liste nommée. Contrôle la performance algorithmique de l'algorithme d'extraction (tri des articles, rapport d'avancement (verbose), etc.)\n            </li>\n            </ul>\n            <br/><br/>\n            <b>Détails</b><br/>\n            Appelle l'implémentation C de l'algorithme Apriori par Christian Borgelt pour extraire des itemsets fréquents, des règles ou des hyperarêtes.\n            <br/><br/>\n        \n            <b>Remarque</b>\n            Apriori ne crée que des règles avec un article dans le RHS (Conséquence)! La valeur par défaut dans APparameter pour minlen est 1. Cela signifie que des règles avec un seul article (c'est-à-dire un antécédent/LHS vide) comme\n            <br/><br/>\n            <code>{} => {bière}</code>\n            <br/><br/>\n            seront créées. Ces règles signifient que peu importe quels autres articles sont impliqués, l'article dans le RHS apparaîtra avec la probabilité donnée par la confiance de la règle (qui est égale au support). Si vous souhaitez éviter ces règles, utilisez l'argument parameter=list(minlen=2).\n            <br/><br/>\n            <b>Remarques sur le temps d'exécution et l'utilisation de la mémoire :</b>\n            Si le support minimum est choisi trop bas pour le jeu de données, l'algorithme essaiera de créer un ensemble extrêmement large d'itemsets/règles. Cela entraînera des temps d'exécution très longs et finalement le processus manquera de mémoire. Pour éviter cela, la longueur maximale des itemsets/règles est limitée par défaut à 10 articles (via l'élément de paramètre maxlen=10) et le temps pour vérifier les sous-ensembles est limité à 5 secondes (via maxtime=5). La sortie indiquera si vous avez atteint ces limites dans la ligne \"vérification des sous-ensembles\" de la sortie. La limite de temps n'est vérifiée que lorsque la taille des sous-ensembles augmente, donc elle peut s'exécuter beaucoup plus longtemps que ce que vous spécifiez dans maxtime. Définir maxtime=0 désactive la limite de temps.\n            <br/> Interrompre l'exécution avec Control-C/Esc n'est pas recommandé. Le nettoyage de la mémoire sera empêché, ce qui entraînera une fuite de mémoire. De plus, les interruptions ne sont vérifiées que lorsque la taille des sous-ensembles augmente, donc cela peut prendre un certain temps avant que l'exécution s'arrête réellement.\n            <br/><br/>\n            <b>Valeur</b><br/><br/>\n            Renvoie un objet de classe règles ou itemsets.\n            <br/>              \n    "
  }
}