{
  "title": "Mise à jour Fusionner",
  "navigation": "Mise à jour Fusionner",
  "join": "Rejoindre le mapping",
  "description": "La mise à jour de la fusion met à jour un ensemble de données avec des valeurs d'un autre ensemble de données.",
  "out": "Entrez le nom de l'ensemble de données fusionné",
  "in1": "Sélectionnez le 1er ensemble de données",
  "in2": "Sélectionnez le 2ème ensemble de données",
  "label1": "Options de fusion",
  "upsert": "Mettre à jour les variables dans le premier (gauche) ensemble de données avec des correspondances du deuxième (droite) ensemble de données, insérer les non-correspondances",
  "update": "Mettre à jour les variables dans le premier (gauche) ensemble de données avec des correspondances du deuxième (droite) ensemble de données, ignorer les non-correspondances",
  "insert": "Insérer uniquement les non-correspondances dans le premier (gauche) ensemble de données",
  "patch": "Mettre à jour uniquement les variables avec des NAs dans le premier (gauche) ensemble de données avec des correspondances du deuxième (droite) ensemble de données",
  "delete": "Supprimer les lignes du premier (gauche) ensemble de données avec des correspondances du deuxième (droite) ensemble de données",
  "help": {
    "title": "Mise à jour Fusionner",
    "r_help": "help(rows_upsert, package=dplyr)",
    "body": "\n            <b>Description</b></br>\n            La mise à jour de la fusion met à jour un ensemble de données avec des valeurs d'un deuxième ensemble de données basé sur une correspondance exacte des noms de variables pour les observations avec des valeurs de variable de mapping de jointure correspondantes. \n\t\t\t<br/>Vous devez spécifier une ou plusieurs variables dans l'ensemble de données actif et dans l'ensemble de données cible sélectionné sur lesquelles la jointure doit être effectuée.\n\t\t\t<br/>Les résultats seront enregistrés dans un nouvel ensemble de données.\n\t\t\t<br/><br/>\n\t\t\t<b>Options de fusion</b>\n\t\t\t<br/><br/>\n\t\t\t<b>Mettre à jour les variables dans le premier (gauche) ensemble de données avec des correspondances du deuxième (droite) ensemble de données, insérer les non-correspondances :</b> C'est une combinaison de la mise à jour des variables dans l'ensemble de données gauche pour les correspondances et de la création de nouvelles lignes pour les lignes non correspondantes.\n\t\t\t<br/><br/>\n\t\t\t<b>Mettre à jour les variables dans le premier (gauche) ensemble de données avec des correspondances du deuxième (droite) ensemble de données, ignorer les non-correspondances :</b> Cela ne met à jour que les variables existantes dans les ensembles de données de gauche pour les correspondances. Les lignes non correspondantes sont ignorées.\n\t\t\t<br/><br/>\n\t\t\t<b>Insérer uniquement les non-correspondances dans le premier (gauche) ensemble de données :</b> Cela laisse intact toutes les lignes correspondantes dans l'ensemble de données gauche. Seules les lignes non correspondantes de l'ensemble de données droit sont ajoutées à l'ensemble de données gauche.\n\t\t\t<br/><br/>\n\t\t\t<b>Mettre à jour uniquement les variables avec des NAs dans le premier (gauche) ensemble de données avec des correspondances du deuxième (droite) ensemble de données, ignorer les non-correspondances :</b> Cela met à jour les lignes qui correspondent, mais uniquement lorsque les valeurs dans l'ensemble de données gauche sont NA (c'est-à-dire des valeurs manquantes).\n\t\t\t<br/><br/>\n\t\t\t<b>Supprimer les lignes du premier (gauche) ensemble de données avec des correspondances du deuxième (droite) ensemble de données :</b> Cela ne supprime que les lignes de l'ensemble de données gauche qui correspondent aux lignes de l'ensemble de données droit.\n\t\t\t<br/><br/>\n            <b>Packages R requis :</b> dplyr\n"
  }
}