{
  "title": "Facteurs d'inflation de variance",
  "navigation": "VIF",
  "modelselector1": "Sélectionnez un modèle d'une des classes suivantes (classe entre parenthèses) Modèle linéaire (lm) Modèles linéaires généralisés (glm) Régression logistique ordonnée ou Probit (polr) Modèles log-linéaires multinomiaux (multinom), Modèles de régression Cox (coxph)",
  "help": {
    "title": "Facteurs d'inflation de variance",
    "r_help": "help(vif, package='car')",
    "body": "\n                <b>Description</b></br>\nCalcule les facteurs d'inflation de variance et les facteurs d'inflation de variance généralisés pour les modèles linéaires, linéaires généralisés et autres.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code> \nvif(mod, ...)\n## Méthode S3 par défaut:\nvif(mod, ...)\n## Méthode S3 pour la classe 'merMod'\nvif(mod, ...)\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nmod: pour la méthode par défaut, un objet qui répond à coef, vcov et model.matrix, tel qu'un objet lm ou glm.\n</li>\n<li>\n... non utilisé.\n</li>\n</ul>\n<b>Détails</b></br>\nSi tous les termes dans un modèle linéaire non pondéré ont 1 df, alors les facteurs d'inflation de variance habituels sont calculés.</br>\nSi des termes dans un modèle linéaire non pondéré ont plus de 1 df, alors des facteurs d'inflation de variance généralisés (Fox et Monette, 1992) sont calculés. Ceux-ci sont interprétables comme l'inflation de la taille de l'ellipse de confiance ou de l'ellipsoïde pour les coefficients du terme par rapport à ce qui serait obtenu pour des données orthogonales.</br>\nLes VIFs généralisés sont invariants par rapport à la codification des termes dans le modèle (tant que le sous-espace des colonnes de la matrice du modèle concernant chaque terme est invariant). Pour ajuster la dimension de l'ellipsoïde de confiance, la fonction imprime également GVIF^[1/(2*df)] où df est le nombre de degrés de liberté associé au terme.</br>\nÀ travers une généralisation supplémentaire, l'implémentation ici est également applicable à d'autres types de modèles, en particulier les modèles linéaires pondérés, les modèles linéaires généralisés et les modèles à effets mixtes.</br>\n<b>Valeur</b><br/>\nUn vecteur de VIFs, ou une matrice contenant une ligne pour chaque terme dans le modèle, et des colonnes pour le GVIF, df, et GVIF^[1/(2*df)].<br/>\n<b>Exemples</b><br/>\n<code> \n## Un exemple ridicule...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>Paquet</b></br>\ncar</br>\n<b>Aide</b></br>\nPour une aide détaillée, cliquez sur l'icône R en haut à droite de cette fenêtre de dialogue ou exécutez la commande suivante dans l'éditeur de syntaxe R: help(vif, package=\"car\")\n                "
  }
}