{
  "title": "Test de variance, test F",
  "navigation": "Test de variance, deux échantillons",
  "tvarbox1": "Variable de réponse",
  "tvarbox2": "Variable facteur, avec seulement deux niveaux",
  "label1": "Hypothèse alternative",
  "test1": "Différence != 1",
  "test2": "Différence > 1",
  "test3": "Différence < 1",
  "txtbox1": "Niveau de confiance",
  "help": {
    "title": "Test de variance, test F",
    "r_help": "help(var.test, package=stats)",
    "body": "\n                <b>Description</b></br>\n                Effectue un test F pour comparer les variances de deux échantillons provenant de populations normales.\n                <br/>\n                <b>Utilisation</b>\n                <br/>\n                <code> \n                var.test(x, ...)</br>\n                ## Méthode S3 par défaut:</br>\n                var.test(x, y, ratio = 1,\n                         alternative = c(\"two.sided\", \"less\", \"greater\"),\n                         conf.level = 0.95, ...)</br>\n                ## Méthode S3 pour la classe 'formula'</br>\n                var.test(formula, data, subset, na.action, ...)\n                </code> <br/>\n                <b>Arguments</b><br/>\n                <ul>\n                <li>\n                x, y: vecteurs numériques de valeurs de données, ou objets de modèle linéaire ajustés (héritant de la classe \"lm\").\n                </li>\n                <li>\n                ratio: le ratio hypothétique des variances de population de x et y.\n                </li>\n                <li>\n                alternative: une chaîne de caractères spécifiant l'hypothèse alternative, doit être l'un de \"two.sided\" (par défaut), \"greater\" ou \"less\". Vous pouvez spécifier juste la première lettre.\n                </li>\n                <li>\n                conf.level: niveau de confiance pour l'intervalle de confiance retourné.\n                </li>\n                <li>\n                formula: une formule de la forme lhs ~ rhs où lhs est une variable numérique donnant les valeurs de données et rhs un facteur avec deux niveaux donnant les groupes correspondants.\n                </li>\n                <li>\n                data: une matrice ou un cadre de données optionnel (ou similaire : voir model.frame) contenant les variables dans la formule. Par défaut, les variables sont prises de l'environnement(formula).\n                </li>\n                <li>\n                subset: un vecteur optionnel spécifiant un sous-ensemble d'observations à utiliser.\n                </li>\n                <li>\n                na.action: une fonction qui indique ce qui doit se passer lorsque les données contiennent des NAs. Par défaut, cela correspond à getOption(\"na.action\").\n                </li>\n                <li>\n                ...: d'autres arguments à passer à ou depuis des méthodes.\n                </li>\n                </ul>\n                <b>Détails</b></br>\n                L'hypothèse nulle est que le ratio des variances des populations dont x et y ont été tirés, ou dans les données auxquelles les modèles linéaires x et y ont été ajustés, est égal au ratio.</br>\n                <b>Valeur</b><br/>\n                Une liste avec la classe \"htest\" contenant les composants suivants:\n                statistic: la valeur de la statistique de test F.\n                parameter: les degrés de liberté de la distribution F de la statistique de test.\n                p.value: la valeur p du test.\n                conf.int: un intervalle de confiance pour le ratio des variances de population.\n                estimate: le ratio des variances d'échantillon de x et y.\n                null.value: le ratio des variances de population sous l'hypothèse nulle.\n                alternative: une chaîne de caractères décrivant l'hypothèse alternative.\n                method: la chaîne de caractères \"Test F pour comparer deux variances\".\n                data.name: une chaîne de caractères donnant les noms des données.\n                <b>Exemples</b><br/>\n                <code>\n                Dataframe <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))<br/>\n                Result_Variance_Test = var.test( Age ~Gender,alternative='two.sided',conf.level=0.95,data=Dataframe )\n                </code> <br/>\n                <b>Paquet</b></br>\n                stats</br>\n                <b>Aide</b></br>\n                help(var.test, package=stats)\n    "
  }
}