{
  "title": "Test de Wilcoxon des rangs signés, un échantillon",
  "navigation": "Test de Wilcoxon, un échantillon",
  "textbox1": "Intervalle de confiance",
  "textbox2": "Hypothèse nulle (mu)",
  "help": {
    "title": "Test de Wilcoxon, un échantillon",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>Description</b></br>\nEffectue des tests de Wilcoxon à un et deux échantillons sur des vecteurs de données ; ce dernier est également connu sous le nom de test de ‘Mann-Whitney’.\n<br/>\n<b>Utilisation</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Méthode S3 par défaut :<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## Méthode S3 pour la classe 'formula'<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Arguments</b><br/>\n<ul>\n<li>\nx : vecteur numérique de valeurs de données. Les valeurs non finies (par exemple, infinies ou manquantes) seront omises.\n</li>\n<li>\ny : un vecteur numérique optionnel de valeurs de données : comme pour x, les valeurs non finies seront omises.\n</li>\n<li>\nalternative : une chaîne de caractères spécifiant l'hypothèse alternative, doit être l'un de \"two.sided\" (par défaut), \"greater\" ou \"less\". Vous pouvez spécifier juste la première lettre.\n</li>\n<li>\nmu : un nombre spécifiant un paramètre optionnel utilisé pour former l'hypothèse nulle. Voir ‘Détails’.\n</li>\n<li>\npaired : un booléen indiquant si vous souhaitez un test apparié.\n</li>\n<li>\nexact : un booléen indiquant si une valeur p exacte doit être calculée.\n</li>\n<li>\ncorrect : un booléen indiquant si une correction de continuité doit être appliquée dans l'approximation normale pour la valeur p.\n</li>\n<li>\nconf.int : un booléen indiquant si un intervalle de confiance doit être calculé.\n</li>\n<li>\nconf.level : niveau de confiance de l'intervalle.\n</li>\n<li>\nformula : une formule de la forme lhs ~ rhs où lhs est une variable numérique donnant les valeurs de données et rhs un facteur avec deux niveaux donnant les groupes correspondants.\n</li>\n<li>\ndata : une matrice ou un cadre de données optionnel (ou similaire : voir model.frame) contenant les variables dans la formule. Par défaut, les variables sont prises de environment(formula).\n</li>\n<li>\nsubset : un vecteur optionnel spécifiant un sous-ensemble d'observations à utiliser.\n</li>\n<li>\nna.action : une fonction qui indique ce qui doit se passer lorsque les données contiennent des NAs. Par défaut, cela correspond à getOption(\"na.action\").\n</li>\n<li>\n... : d'autres arguments à passer aux méthodes.\n</li>\n</ul>\n<b>Détails</b></br>\nL'interface de formule n'est applicable que pour les tests à 2 échantillons.</br>\nSi seul x est donné, ou si x et y sont donnés et que paired est TRUE, un test de rang signé de Wilcoxon de l'hypothèse nulle que la distribution de x (dans le cas d'un échantillon) ou de x - y (dans le cas de deux échantillons appariés) est symétrique autour de mu est effectué.</br>\nSinon, si x et y sont donnés et que paired est FALSE, un test de somme des rangs de Wilcoxon (équivalent au test de Mann-Whitney : voir la note) est effectué. Dans ce cas, l'hypothèse nulle est que les distributions de x et y diffèrent par un décalage de localisation de mu et l'alternative est qu'elles diffèrent par un autre décalage de localisation (et l'alternative unilatérale \"greater\" est que x est décalé vers la droite de y).</br>\nPar défaut (si exact n'est pas spécifié), une valeur p exacte est calculée si les échantillons contiennent moins de 50 valeurs finies et qu'il n'y a pas de liaisons. Sinon, une approximation normale est utilisée.</br>\nEn option (si l'argument conf.int est vrai), un intervalle de confiance non paramétrique et un estimateur pour le pseudomédian (cas d'un échantillon) ou pour la différence des paramètres de localisation x-y est calculé. (Le pseudomédian d'une distribution F est le médian de la distribution de (u+v)/2, où u et v sont indépendants, chacun ayant la distribution F. Si F est symétrique, alors le pseudomédian et le médian coïncident. Voir Hollander & Wolfe (1973), page 34.) Notez que dans le cas de deux échantillons, l'estimateur de la différence des paramètres de localisation n'est pas une estimation de la différence des médianes (une idée reçue courante) mais plutôt le médian de la différence entre un échantillon de x et un échantillon de y.</br>\nSi des valeurs p exactes sont disponibles, un intervalle de confiance exact est obtenu par l'algorithme décrit dans Bauer (1972), et l'estimateur de Hodges-Lehmann est utilisé. Sinon, l'intervalle de confiance et l'estimation du point retournés sont basés sur des approximations normales. Ceux-ci sont corrigés pour la continuité pour l'intervalle mais pas pour l'estimation (car la correction dépend de l'alternative).</br>\nAvec de petits échantillons, il peut ne pas être possible d'atteindre des couvertures d'intervalle de confiance très élevées. Si cela se produit, un avertissement sera donné et un intervalle avec une couverture inférieure sera substitué.</br>\n<b>Valeur</b><br/>\nUne liste avec la classe \"htest\" contenant les composants suivants :\nstatistic : la valeur de la statistique de test avec un nom la décrivant.</br>\nparameter : les paramètres pour la distribution exacte de la statistique de test.</br>\np.value : la valeur p pour le test.</br>\nnull.value : le paramètre de localisation mu.</br>\nalternative : une chaîne de caractères décrivant l'hypothèse alternative.</br>\nmethod : le type de test appliqué.</br>\ndata.name : une chaîne de caractères donnant les noms des données.</br>\nconf.int : un intervalle de confiance pour le paramètre de localisation. (Présent uniquement si l'argument conf.int = TRUE.)</br>\nestimate : une estimation du paramètre de localisation. (Présent uniquement si l'argument conf.int = TRUE.)</br>\n<b>Paquet</b></br>\nstats</br>\n<b>Aide</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}