{
  "title": "コックス、二項時間依存共変量",
  "navigation": "コックス、二項時間依存共変量",
  "modelname": "モデル名を入力",
  "timevar": "イベントまでの時間またはセンサー",
  "eventvar": "イベント (1 = イベント1, 0 = センサー)",
  "modelterms": "独立変数のためのモデル式ビルダー",
  "switchtimeslabel": "時間依存共変量のための曝露時間変数",
  "tdprefixlabel": "時間依存共変量のプレフィックス",
  "subjectidlabel": "被験者識別子",
  "weightvar": "重み (オプション)",
  "tiemethod": "タイムメソッド",
  "forestplotbox": "フォレストプロット",
  "diagnosticsbox": "モデル診断",
  "martscalebox": "ヌルモデルマルチンゲール残差軸最小値 (-Infから1):",
  "devbox": "偏差分析 (タイプII)",
  "devtype": "テスト統計量",
  "startstopboxlabel": "（開始、停止）時間データセットを表示",
  "startstopnamelabel": "データセット名",
  "help": {
    "title": "コックス、二項時間依存共変量",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n時間依存の1つ以上の二項「曝露」共変量を含む、検閲された観察を伴う時間-イベントデータのためのコックス比例ハザードモデルを適合させます。このタイプの\n共変量は、「はい」の発生がフォローアップの開始後に起こり、その「はい」がフォローアップの期間中ずっと「はい」である場合です。例としては、移植後のグラフトの拒絶（すなわち、拒絶が発生する前に、患者は「曝露」されていない; 拒絶が発生した後、患者は「曝露」されている）があります。\nフォローアップの開始時にこのような共変量を既知と見なすことは、未来を見通す形であり、バイアスのかかった推定値をもたらします（「不死の時間バイアス」とも呼ばれます）。\n<br/><br/>\nモデル適合統計、パラメータ推定、およびハザード比が提供されます。利用可能なオプションには、タイムメソッド、フォレストプロット、モデル診断、および作成される基礎となるカウントプロセスデータセットを表示する機能が含まれます。このデータが適切に作成されているかを確認するためのカウントプロセスデータを説明するテーブルが提供されます。\n<br/><br/>  \nカウントプロセスデータの要約:\n<br/>\n<b>早期:</b> 予測因子がフォローアップ時間の開始前に変化する時間<br/>\n<b>遅延:</b> 予測因子がフォローアップ終了後に変化する時間<br/>\n<b>内部:</b> 予測因子がフォローアップ期間内で変化する時間<br/>\n<b>先行:</b> 予測因子がフォローアップの開始時に変化する時間<br/>\n<b>後続:</b> 予測因子がフォローアップの終了時に変化する時間<br/>\n<b>境界:</b> 予測因子がフォローアップの開始または終了時に変化する時間\n<br/><br/>\nこのテーブルに関する詳細情報は、<a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a>の時間依存共変量のビネットを参照してください。\n<br/><br/>\nモデルはサバイバルパッケージのcoxph関数を使用して適合されます。\n<br/><br/>\n<b>モデル名を入力:</b> モデル結果が保存される名前\n<br/><br/>\n<b>イベントまでの時間またはセンサー:</b> イベントを経験している者のための結果イベントまでの時間、または結果イベントを経験していない者のための最後のフォローアップまでの時間\n<br/><br/>\n<b>イベント (1=イベント, 0=センサー):</b> 数値イベントインジケーター; 1=イベント, 0=センサー\n<br/><br/>\n<b>式ビルダー:</b> モデルに含める項を構築します。因子、文字列、および論理変数はダミーコーディングされます。提供されたボタンを使用して、主効果、完全因子効果（主効果と関与する変数とのすべての相互作用）、多項式、特定の相互作用を指定し、リストから項を削除できます。\n<br/><br/>\n<b>時間依存共変量のための曝露時間変数:</b> 被験者が最初に「曝露」された時間を格納する数値変数。この変数は時間変数と同じ時間スケールでなければなりません。曝露されなかった被験者には欠損値を使用する必要があります。ここで指定された各変数は、別々の時間依存共変量を作成します。指定された時間は、被験者がこの時間以前に曝露されていないことを前提とし、この時間以降に曝露されることを前提とします（すなわち、予測因子が「いいえ」から「はい」に変わるとき）。正の値のみを指定することは、被験者がフォローアップ開始後にしばらくの間曝露されていないことを意味します。正と負の時間を指定することは、フォローアップ開始前に曝露された被験者とフォローアップ開始後に曝露された被験者がいることを示します。被験者がフォローアップ開始前に曝露されていたが、正確にいつかはわからない場合は、任意の負の時間を使用すると、モデルはその被験者をフォローアップ全体の間曝露されていると正しく扱います。被験者がフォローアップ後に曝露されている場合、彼らはフォローアップ全体の間曝露されていないと正しく扱われます。\n<br/><br/>\n<b>時間依存共変量のプレフィックス:</b> <b>曝露時間変数</b>フィールドで指定された各時間依存共変量に使用される希望のプレフィックス。各時間依存共変量の名前はこのプレフィックスで始まります。\n<br/><br/>\n<b>被験者識別子:</b> 被験者識別子を格納する変数。この変数は基礎となるカウントプロセスデータセットを作成するために必要です。\n<br/><br/>\n<b>重み:</b> 観察重みのための数値変数。各レコードが1つの観察としてカウントされるべきでない状況で便利です。\n<br/><br/>\n<b>オプション:</b>\n<br/><br/>\n<b>タイムメソッド:</b> 観察された時間のタイムを解決する方法。エフロンは、タイムがあまり多くない場合には通常はより良い選択です。正確な方法は、タイムが多くある場合（離散時間の状況など）に有益ですが、モデルの適合に少し時間がかかることがあります。\n<br/><br/>\n<b>フォレストプロット:</b> ハザード比と信頼区間のフォレストプロットを作成します。\n<br/><br/>\n<b>（開始、停止）データセットを表示:</b> 計算に使用される基礎となるカウントプロセスデータセットを表示します。これは、各被験者のフォローアップ時間を、時間依存共変量が値を変更すべきときに応じて部分に分割します。\n<br/><br/>\n<b>モデル診断:</b> 選択された場合、比例ハザードテストとプロットが提供され、モデル内の各共変量の機能形式の評価が行われます。ヌルモデルマルチンゲール残差軸最小値オプションは、すべての残差がプロットに表示されるように変更する必要があるかもしれません。機能形式の評価を得るには、数値予測因子のみを指定し、欠損データがない必要があります。変数 > 欠損値 > NAsを削除してください。\n<br/><br/>\n<b>偏差分析 (タイプII):</b> モデル内の各予測因子のグローバルテスト。2つ以上のレベルを持つ効果に対して多自由度テストが提供されます。ワルドおよび尤度比テストが得られ、尤度比テストは小さなサンプル特性が優れています。\n<br/><br/>\n<b>必要なパッケージ:</b> survival, broom, survminer, car\n"
  }
}