{
  "title": "ANOVA, tek yönlü rastgele bloklarla",
  "navigation": "ANOVA, 1 yön (rastgele bloklar)",
  "tvarbox1": "Yanıt Değişkeni",
  "tvarbox2": "Sabit Etki",
  "blockVar": "Bloklama Değişken(ler)i",
  "Post_hoc": "Post-hoc analizi",
  "chk1": "Artıkların histogramı",
  "help": {
    "title": "ANOVA, tek yönlü rastgele bloklarla",
    "r_help": "help(lmer, package ='lme4')",
    "body": "\n<b>Açıklama</b></br>\nVerilere, REML veya maksimum olasılık yoluyla, bir doğrusal karışık etkiler modeli (LMM) uyarlayın.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nlmer(formula, data = NULL, REML = TRUE, control = lmerControl(),\n        start = NULL, verbose = 0L, subset, weights, na.action,\n        offset, contrasts = NULL, devFunOnly = FALSE, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nformül: modelin hem sabit etkiler hem de rastgele etkiler kısmını tanımlayan iki taraflı bir doğrusal formül nesnesi, yanıtın ~ operatörünün solunda ve terimlerin, + operatörleriyle ayrılmış olarak sağda olduğu. Rastgele etkiler terimleri, tasarım matrislerini gruplama faktörlerinden ayıran dikey çubuklar (|) ile ayrılır. Aynı gruplama değişkeni için birden fazla bağımsız rastgele etki belirtmek için iki dikey çubuk (||) kullanılabilir. (Uygulama şekli nedeniyle, ||-sözdizimi yalnızca sayısal (sürekli) tahminciler içeren tasarım matrisleri için çalışır; bağımsız kategorik etkilerle modeller uyarlamak için dummy veya afex paketinden lmer_alt fonksiyonuna bakın.)\n</li>\n<li>\ndata: formülde adı geçen değişkenleri içeren isteğe bağlı bir veri çerçevesi. Varsayılan olarak değişkenler, lmer'in çağrıldığı ortamdan alınır. Veri isteğe bağlı olsa da, paket yazarları, özellikle daha sonra güncelleme ve drop1 gibi yöntemler uygularken, kullanımını şiddetle önermektedir (bu tür yöntemlerin veri atlandığında düzgün çalışması garanti edilmez). Veri atlandığında, değişkenler formülün ortamından (bir formül olarak belirtilmişse) veya üst çerçeveden (bir karakter vektörü olarak belirtilmişse) alınacaktır.\n</li>\n<li>\nREML: mantıksal skalar - Tahminlerin REML kriterini optimize etmek için mi seçilmesi gerekiyor (log-olasılığa karşı)?\nna.action: verilerde NA'lar bulunduğunda ne olacağını belirten bir işlev. Varsayılan eylem (na.omit, 'fabrika taze' değeri getOption(\"na.action\")'dan miras alınmıştır) herhangi bir değişkende herhangi bir eksik değere sahip gözlemleri çıkarır.\n</li>\n</ul>\n<b>Değer</b></br>\nBir merMod sınıfı nesnesi (daha spesifik olarak, bir lmerMod alt sınıfı nesnesi), birçok yöntem mevcut (örneğin, methods(class=\"merMod\"))</br>\n<b>Paket</b></br>\nlme4</br>\n<b>Yardım</b></br>\nhelp(lmer, package ='lme4')</br></br>\n<b>Açıklama</b></br>\nLmerTest Paketindeki anova Fonksiyonu için Yöntemler\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \n## S4 yöntemi 'merModLmerTest' için anova(object, ... , ddf=\"Satterthwaite\", type=3)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nobject: \"merModLmerTest\" sınıfı nesnesi ... \"merModLmerTest\" sınıfı nesnesi. O zaman model karşılaştırma istatistikleri hesaplanacaktır\n</li>\n<li>\nddf: Varsayılan olarak Satterthwaite'in serbestlik derecelerine yaklaşımı hesaplanır. Eğer ddf=\"Kenward-Roger\" ise, o zaman Kenward-Roger'in yaklaşımı pbkrtest paketinden KRmodcomp fonksiyonu kullanılarak hesaplanır. Eğer ddf=\"lme4\" ise, lme4 paketinden gelen anova tablosu döndürülür.\n</li>\n<li>\nTip: test edilecek hipotez türü. type=3 veya type=2 veya type=1 olabilir (Tanım SAS teorisinden gelir) Detaylar (Goodnight, J.H. 1976) tip 3 hipotezinin eksik hücrelerle (gözlemlerin bazı faktör-seviyesi kombinasyonlarında eksik olduğu durumlarda) davranışının tam olarak incelenmediğini belirtmektedir. Bu tür durumlarda bir uyarı döndürülür.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\n(Goodnight, J.H. 1976) tip 3 hipotezinin eksik hücrelerle (gözlemlerin bazı faktör-seviyesi kombinasyonlarında eksik olduğu durumlarda) davranışının tam olarak incelenmediğini belirtmektedir. Bu tür durumlarda bir uyarı döndürülür.</br>\n<b>Paket</b></br>\nlme4;lmerTest;rcompanion;ggplot2;multcomp</br>\n<b>Yardım</b></br>\nhttps://cran.r-project.org/web/packages/lmerTest/lmerTest.pdf</br>\nhelp(nagelkerke, package ='rcompanion')</br>\nhelp(emmeans,package=\"cld\")</br>\nhelp(cld,package='emmeans')</br>\n<b>Referans materyali</b></br>\nhttp://rcompanion.org/handbook/I_07.html\n"
  }
}