{
  "title": "ANOVA ve Likelihood Oranı Testi",
  "navigation": "ANOVA ve Likelihood Oranı",
  "label1": "ANOVA, aşağıdaki sınıflara sahip modeller için gerçekleştirilir (parantez içindeki R sınıfları) Doğrusal modeller (lm), Genelleştirilmiş doğrusal modeller (glm), Negatif-binom logaritmik doğrusal modeli (negbin), Genelleştirilmiş en küçük kareler kullanarak doğrusal model (gls), Hayatta kalma regresyon modeli (survreg), Orantılı tehlike modeli (coxph), Loess regresyonu (loess)",
  "label2": "**NOT: Likelihood testi, Model Tuning (sınıf train) aracılığıyla oluşturulan modeller için desteklenmemektedir.",
  "modelselector1": "Bir model seçin",
  "help": {
    "title": "ANOVA ve Likelihood Oranı Testi",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>Açıklama</b></br>\nANOVA Tabloları: Bir model nesnesi için varyans analizi tablolarını hesaplar ve likelihood oranı testleri gerçekleştirir. Karışık etkiler modelleri için, rastgele etkiler için ANOVA benzeri tablo görüntülenir. \n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nobject:  bir model uyum fonksiyonu (örneğin, lm veya glm) tarafından döndürülen sonuçları içeren bir nesne.\n</li>\n</ul>\n<b>Değer</b><br/>\nBu (genel) fonksiyon, anova sınıfından bir nesne döndürür. Bu nesneler, varyans analizi ve sapma analizi tablolarını temsil eder. Tek bir argüman verildiğinde, model terimlerinin anlamlı olup olmadığını test eden bir tablo üretir. Bir dizi nesne verildiğinde, anova belirtilen sırada modelleri birbirine karşı test eder.<br/>\nAnova nesneleri için print yöntemi, tabloları 'güzel' bir biçimde yazdırır.<br/>\n<b>Uyarı</b><br/>\nİki veya daha fazla model arasındaki karşılaştırma yalnızca aynı veri kümesine uyum sağlanmışsa geçerli olacaktır. Bu, eksik değerler varsa ve R'nin varsayılan na.action = na.omit kullanılıyorsa bir sorun olabilir.<br/>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nDetaylı yardım için bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya R sözdizimi editöründe aşağıdaki komutu çalıştırın help(anova,package='stats')</br></br>\n<b>Açıklama</b></br>\nİç İçe Modellerin Likelihood Oranı Testi: lrtest, likelihood oranı testlerini gerçekleştirmek için genel bir fonksiyondur. Varsayılan yöntem, iç içe (genelleştirilmiş) doğrusal modelleri karşılaştırmak için kullanılabilir (aşağıda detaylara bakınız).\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Varsayılan S3 yöntemi:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## 'formül' sınıfı için S3 yöntemi<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nobject: bir nesne. Detaylar için aşağıya bakınız.\n</li>\n<li>\n...: yöntemlere iletilen daha fazla nesne tanımı. Detaylar için aşağıya bakınız.\n</li>\n<li>\nname: bir uyumlu isim/açıklama çıkarmak için bir fonksiyon. Varsayılan olarak isim, formül çağrılarak sorgulanır.\n</li>\n<li>\ndata: modeldeki değişkenleri içeren bir veri çerçevesi.\n</li>\n</ul>\n<b>Detaylar</b></br>\nlrtest, modellerin asimptotik likelihood oranı testleri aracılığıyla karşılaştırılması için genel bir fonksiyon olarak tasarlanmıştır. Varsayılan yöntem, uyum sağlanan model nesnesini, ...'da iletilen modellerle ardışık olarak karşılaştırır. ...'da uyum sağlanan model nesnelerini iletmek yerine, birkaç başka tanım da mümkündür. Güncelleme mekanizması, waldtest için olduğu gibidir: ...'da belirtilen modeller, tam sayılar, karakterler (her ikisi de önceki modelden çıkarılması gereken terimler için), güncelleme formülleri veya uyum sağlanan model nesneleri olarak belirtilebilir. Son durum dışında, bir güncelleme yönteminin varlığı varsayılmaktadır. Detaylar için waldtest'e bakınız.<br/>\nSonrasında, her iki ardışık model için bir asimptotik likelihood oranı testi gerçekleştirilir: Log-likelihood'lardaki (logLik yöntemleri tarafından türetilen) iki kat fark, bir Chi-kare dağılımı ile karşılaştırılır.<br/>\n\"formül\" yöntemi önce bir lm uyum sağlar ve ardından varsayılan yöntemi çağırır.<br/>\n<b>Değer</b><br/>\n\"anova\" sınıfından bir nesne, log-likelihood, serbestlik dereceleri, serbestlik derecelerindeki fark, likelihood oranı Chi-kare istatistiği ve karşılık gelen p değeri içerir.\n<b>Örnekler</b><br/>\n<code> \n## Greene (1993)'ten alınan verilerle:<br/>\n## verileri yükle ve gecikmeleri hesapla<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## LR testinin çeşitli eşdeğer tanımları<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n<b>Açıklama</b></br>\nRastgele Etkiler için ANOVA Benzeri Tablo: Modeldeki rastgele etki terimlerinin testleri ile birlikte ANOVA benzeri bir tablo hesaplar. Her rastgele etki terimi azaltılır veya kaldırılır ve model azaltmalarının likelihood oranı testleri drop1'e benzer bir biçimde sunulur. rand, ranova için bir takma isimdir.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nranova(model, reduce.terms = TRUE, ...)<br/>\nrand(model, reduce.terms = TRUE, ...)<br/>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nmodel: lmer() ile uyum sağlanmış bir doğrusal karışık etki modeli (lmerMod sınıfından miras alır).\n</li>\n<li>\nreduce.terms: TRUE (varsayılan) ise rastgele etki terimleri azaltılır (mümkünse). FALSE ise rastgele etki terimleri basitçe kaldırılır.\n</li>\n</ul>\n<b>Detaylar</b></br>\nModel REML ile uyum sağlanmışsa, testler REML-likelihood oranı testleridir.<br/>\n(f1 + f2 | gr) biçimindeki bir rastgele etki terimi, (f2 | gr) ve (f1 | gr) biçimindeki terimlere indirilir ve bu azaltılmış modeller orijinal modelle karşılaştırılır. reduce.terms FALSE ise (f1 + f2 | gr) bunun yerine kaldırılır.<br/>\n(f1 | gr) biçimindeki bir rastgele etki terimi (1 | gr) biçimine indirilir (reduce.terms FALSE değilse).<br/>\n(1 | gr) biçimindeki bir rastgele etki terimi azaltılmaz, yalnızca kaldırılır.<br/>\n(0 + f1 | gr) veya (-1 + f1 | gr) biçimindeki bir rastgele etki terimi, (1 | gr) biçimine indirilir (reduce.terms = TRUE ise).<br/>\n(1 | gr1/gr2) biçimindeki bir rastgele etki terimi, otomatik olarak iki terime genişletilir: (1 | gr2:gr1) ve (1 | gr1) findbars kullanılarak.<br/>\nBu açıklamada, f1 ve f2'nin faktörler veya sürekli değişkenler olup olmadığı önemli değildir.<br/>\n<b>Değer</b><br/>\nRastgele etkilerin tek terim silmeleri ile birlikte ANOVA benzeri bir tablo, anova sınıfından ve aşağıdaki sütunlara sahip bir veri çerçevesinden miras alınır:</br>\nnpar: model parametrelerinin sayısı.</br>\nlogLik: model için log-likelihood. Model REML ile uyum sağlanmışsa bu REML-logLik'tir.</br>\nAIC: model için AIC, -2*(logLik - npar) olarak değerlendirilir. Daha küçük daha iyidir.</br>\nLRT: likelihood oranı test istatistiği; log-likelihood'daki iki kat fark, asimptotik olarak chi-kare dağılımına sahiptir.</br>\nDf: likelihood oranı testi için serbestlik dereceleri: model parametreleri sayısındaki fark.</br>\nPr(>Chisq) :p-değeri.</br>\n<b>Uyarı</b></br>\nBelirli durumlarda, iç içe olmayan modellerin testleri oluşturulabilir. Bir örnek, (0 + poly(x, 2) | gr) 'nin azaltılmasıdır (varsayılan) (1 | gr) 'ye. Bilgimize göre, iç içe olmayan model karşılaştırmaları yalnızca istatistiksel saçmalık olan durumlarda oluşturulmaktadır (bu örnekte rastgele kesir bastırılmıştır).<br/>\nNot: anova, iki modeli karşılaştırmak için kullanılabilir ve genellikle ranova ile aynı testleri üretebilir. Ancak, bu her zaman geçerli değildir, örneklerde gösterildiği gibi.</br>\n<b>Örnekler</b><br/>\n<code> \n# (Günler | Denek) 'in (1 | Denek) 'e azaltılmasını test et:<br/>\nfm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy)<br/>\nranova(fm1) # 2 df testi<br/>\n# Bu test ayrıca anova() ile de gerçekleştirilebilir:<br/>\nfm2 <- lmer(Reaction ~ Days + (1|Subject), sleepstudy)<br/>\nanova(fm1, fm2, refit=FALSE)<br/>\n# reduce.test argümanını göster:<br/>\n# (Günler | Denek) 'in kaldırılmasını test et:<br/>\nranova(fm1, reduce.terms = FALSE) # 3 df testi<br/>\n# Bu durumda likelihood oranı test istatistiği:<br/>\nfm3 <- lm(Reaction ~ Days, sleepstudy)<br/>\n2*c(logLik(fm1, REML=TRUE) - logLik(fm3, REML=TRUE)) # LRT<br/>\n# anova() her zaman ranova() ile aynı testleri gerçekleştiremeyebilir,<br/>\n# örneğin:<br/>\nanova(fm1, fm3, refit=FALSE) # REML ile ML'yi karşılaştırır ve kullanılmamalıdır<br/>\nanova(fm1, fm3, refit=TRUE) # ML uyumlarının testi ve aradığımız değil<br/>\n# Ayrıca lmer-uyumunun önce gelmesi gerekir - lm-uyumu değil:<br/>\n# anova(fm3, fm1) # çalışmaz ve hata verir<br/>\n# ranova() tüm ilgili testleri üretebilir:<br/>\n# Aşağıdaki model için ranova() azaltmamamız gerektiğini belirtir:<br/>\nfm <- lmer(Coloursaturation ~ TVset * Picture + (TVset | Assessor), data=TVbo)<br/>\nranova(fm)<br/>\n# Ancak, daha uygun bir model:<br/>\nfm2 <- lmer(Coloursaturation ~ TVset * Picture + (1 | TVset:Assessor), data=TVbo)<br/>\nanova(fm, fm2, refit=FALSE)<br/>\n# fm ve fm2, verilere esasen aynı uyumu sağlarken, fm, fm'den 5 parametre daha fazla kullanır.<br/>\n</code> <br/>\n<b>Paket</b></br>\nlmerTest</br>\n<b>Yardım</b></br>\nDetaylı yardım için bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya R sözdizimi editöründe aşağıdaki komutu çalıştırın help(ranova, package ='lmerTest')\n                "
  }
}