{
  "title": "ANOVA, bloklarla tek yönlü",
  "navigation": "ANOVA, bloklarla 1 yönlü",
  "tvarbox1": "Yanıt değişkeni (bir)",
  "tvarbox2": "Sabit etki",
  "blockVar": "Bloklama değişkeni(leri)",
  "chk1": "Artıkların histogramı",
  "chk2": "Post-hoc analizi",
  "help": {
    "title": "ANOVA, bloklarla tek yönlü",
    "r_help": "help(Anova, package='car')",
    "body": "\n<b>Açıklama</b></br>\nÇeşitli İstatistiksel Modeller için Anova Tabloları​\nlm, glm, multinom (nnet paketinde), polr (MASS paketinde), coxph (survival paketinde), coxme (coxme paketinde), svyglm (survey paketinde), rlm (MASS paketinde), lmer (lme4 paketinde), lme (nlme paketinde) tarafından üretilen model nesneleri için tip-II veya tip-III varyans analizi tablolarını hesaplar ve (varsayılan yöntemle) lineer tahminci ve asimptotik normal katsayıları olan çoğu model için (aşağıda detaylara bakınız). Lineer modeller için F-testleri hesaplanır; genelleştirilmiş lineer modeller için, olasılık oranı ki-kare, Wald ki-kare veya F-testleri hesaplanır; multinomiyal logit ve orantılı-şans logit modelleri için, olasılık oranı testleri hesaplanır. lm veya manova tarafından üretilen çok değişkenli lineer modeller için çeşitli test istatistikleri sağlanır. Cox modelleri için kısmi-olasılık oranı testleri veya Wald testleri sağlanır. Lineer ve genelleştirilmiş lineer karışık etkili modellerde sabit etkiler için Wald ki-kare testleri sağlanır. Varsayılan durumda Wald ki-kare veya F testleri sağlanır.​\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nAnova(mod, type='II,...)​\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nmod: lm, aov, glm, multinom, polr mlm, coxph, coxme, lme, mer, merMod, svyglm, rlm veya diğer uygun model nesnesi.​\n</li>\n<li>\ntype: test türü, \"II\", \"III\", 2 veya 3.​\n</li>\n</ul>\n<b>Detaylar</b></br>\n\"tip-II\" ve \"tip-III\" tanımlamaları SAS'tan alınmıştır, ancak burada kullanılan tanımlar SAS tarafından kullanılanlarla tam olarak örtüşmemektedir. Tip-II testleri, marjinalite ilkesine göre hesaplanır, her terimi diğer tüm terimlerden sonra test eder, ancak terimin daha yüksek dereceli akrabalarını göz ardı eder; sözde tip-III testleri marjinaliteyi ihlal eder, modeldeki her terimi diğer tüm terimlerden sonra test eder. Bu tip-II test tanımı, tüm tahmin edicilerin faktör olduğu varyans analizi modelleri için SAS tarafından üretilen testlerle örtüşmektedir, ancak daha genel olarak (yani, nicel tahmin ediciler olduğunda) değildir. Tip-III testleri için modeli formüle ederken çok dikkatli olun, aksi takdirde test edilen hipotezler mantıklı olmayacaktır.​</br>\nBurada uygulandığı şekliyle, tip-II Wald testleri, bu testleri lineer modellerde üretmek için kullanılan lineer hipotezlerin genelleştirilmesidir.​</br>\nLineer modeller, çok değişkenli lineer modeller ve genelleştirilmiş lineer modeller için Wald testleri, Cox modelleri, karışık etkili modeller, anket verilerine uyarlanmış genelleştirilmiş lineer modeller ve varsayılan durumda, Anova test istatistiklerini modeli yeniden uyarlamadan bulur. svyglm yöntemi basitçe varsayılan yöntemi çağırır ve bu nedenle aynı argümanları alabilir.​</br>\n<b>Değer</b><br/>\n\"anova\" veya \"Anova.mlm\" sınıfından bir nesne, genellikle yazdırılır. \"Anova.mlm\" sınıfından nesneler için, MANOVA hakkında yazdırma yönteminden çok daha fazla ayrıntı sağlayan bir özet yöntemi de vardır.​​</br>\n<b>Paket</b></br>\nAnova</br>\n<b>Yardım</b></br>\nhelp(Anova, package='car')​</br></br>\n<b>Açıklama</b></br>\nPost-hoc ortalama ayırma testleri. Her ana etki faktör değişkeni için post-hoc ortalama ayırma testleri gerçekleştirmek için emmeans paketini kullanacağız. Dikkate alınan lineer model, yukarıda oluşturulan lm fonksiyonu ile oluşturulan modeldir.  \n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nlsmeans(model,\n            var1 ~ var2, \n            adjust=\"tukey\") \n</code> <br/>\n<b>Paket</b></br>\nFSA;car;emmeans;ggplot2;multcomp</br>\n<b>Yardım</b></br>\nhelp(lsmeans, package=\"emmeans\")​\n    "
  }
}