{
  "title": "Çubuk Grafik",
  "navigation": "Çubuk Grafik",
  "optionsLabels": "Etiketler için seçenekler",
  "suppressLabels": "Sayım ve yüzde için tüm etiketleri bastır",
  "suppressThreshold": "Belirtilen eşik yüzdesinin altındaki sayım ve yüzde etiketlerini bastır",
  "label1": "Sayım veya ortalamayı seçmek için aşağıdaki sekmeye tıklayın. Sayım seçildiğinde, Y değişkeni isteğe bağlıdır. Sayım seçildiğinde ve bir Y değişkeni BELİRTİLMEDİĞİNDE, X değişkeninin sayımları görüntülenir. Sayım belirtildiğinde ve bir Y değişkeni belirtildiğinde, Y değişkeninin değerleri toplanır. Ortalama seçildiğinde, bir Y ve bir X değişkeni seçmeniz gerekir. Ortalamalar Y değişkeni(leri) için hesaplanır.",
  "x": "X değişkeni, kategorik bir değişken belirtin",
  "y": "Y değişken(ler)i, sayısal değişken(ler)i belirtin",
  "fill": "Çubukları doldurmak için bir kategorik değişken belirtin",
  "dropna": "Eksik değerleri atla",
  "bottomlbl": "Çubuk Grafiği Seçin",
  "meanlbl": "Ortalama",
  "countlbl": " Sayım",
  "fill1": "Çubuklar için bir renk seçin. Not: Bu, çubukları doldurmak için bir değişken belirtildiğinde göz ardı edilir.",
  "legends": "Efsaneleri göster ve eğer öyleyse, efsanelerin konumu (varsayılan sağda)",
  "digitsCountDisplay": "Basamaklar - sayım ve yüzdeler için görüntülenecek basamak sayısı",
  "barType": "Çubuk grafik türü",
  "stackedBar": "Yığılmış çubuk grafiği",
  "sideBySide": "Grupları yan yana göster",
  "fillPercent": "Çubukları doldur",
  "errorBarOptions": "Hata çubukları",
  "noErrBars": "Hata çubuğu yok",
  "stderr": "Standart hatalar",
  "stddev": "Standart sapmalar",
  "cilevel": "Güven düzeyini belirtin:",
  "confidenceInterval": "Güven düzeyi:",
  "drawSignificance": "Her çubuk çifti arasında anlamlılık (p-değerleri) ortalama karşılaştırması ekleyin (analizi gruplamak için bir facet seçin). tukey_hsd ve games_howell_test için, p-değerleri zaten ayarlanmıştır. Ek p-değeri ayarlama yöntemi göz ardı edilir.",
  "methodForMeanDiffSignificance": "Ortalama karşılaştırması için kullanılan test yöntemi",
  "adjPvalue": "Test yöntemi tarafından üretilen ortalamaların karşılaştırılması için p-değerlerini ayarlayın",
  "pValueFromatting": "Görüntülenen p-değerlerini (anlamlılık) biçimlendirin",
  "alpha": "Opaklık (0-1)",
  "flipBox": "Eksenleri çevir",
  "specify_a_title": "Bir başlık girin",
  "x_title": "X Ekseni Etiketi",
  "y_title": "Y Ekseni Etiketi",
  "showErrorBar": "Hata çubuğunun her iki ucunu göster (varsayılan), sadece üst veya alt",
  "Facetrow": "Facet satırı",
  "Facetcolumn": "Facet sütunu",
  "Facetwrap": "Facet sarmal",
  "Facetscale": "Facet ölçeği",
  "relFreq": "Göreli frekanslar",
  "facets_lbl": "Facetler",
  "xyLimits": "X ve Y eksen sınırları",
  "label5": "X ve Y ekseni değerleri için bir aralık belirtin",
  "rangeYValues": "Y ekseni aralığını belirtin, örn. 0,100",
  "help": {
    "title": "Çubuk Grafik Yardımı",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Bir çubuk grafik, değerlerine orantılı uzunluklara sahip dikdörtgen çubuklarla gruplandırılmış verileri sunan bir grafiktir. Çubuklar dikey veya yatay olarak çizilebilir. Çubuklar isteğe bağlı bir faktör değişkeni ile gruplandırılabilir. Gruplar tek bir çubuk üzerinde yığılabilir veya yan yana gösterilebilir. Facetler, bir faktör değişkeni belirlenerek isteğe bağlı olarak oluşturulabilir. Ayrıca temalar belirleyebilir, bir başlık ve x ve y eksenleri için etiketler belirleyebilirsiniz.\n        Tek bir faktör değişkeni için bir çubuk grafik oluşturabilirsiniz, çubuklar faktör seviyesinin her bir düzeyinin sayımlarını temsil eder. Burada faktör değişkeni x ekseninde olacaktır, aşağıdaki örneğe bakın. Göreli frekans onay kutusu seçildiğinde, y ekseninde sayımlar yerine göreli frekansı gösteriyoruz.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=0.4) +\n         labs(x =\"year\",y =\"Count\",title= \"X ekseni için çubuk grafiği: yıl, Y ekseni: Sayım\")\n        </code>\n        <br />\n        Bir çubuk grafik oluşturmak için y eksenine bir ölçek/sayısal değişken yerleştirebilir ve çubukları bir faktör değişkeni ile doldurabilirsiniz. Çubuk, faktör değişkeninin her bir düzeyi için y değişkeninin değerlerini toplayarak doldurulacaktır, aşağıdaki örneğe bakın.\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=0.4,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"X ekseni için çubuk grafiği:, Y ekseni: ağırlık, Doldurma: köken\")\n        </code>\n        <br />\n        Bir x değişkeni, y değişkeni ve doldurma belirtebilirsiniz. Çubuk, y değişkeninin değerlerinin x değişkeninin her düzeyi için toplamı ile doldurulur, doldurmak için belirtilen değişkenin düzeyine göre gruplandırılır. Birden fazla x değişkeni belirtirseniz, her x değişkeni için ayrı bir çubuk grafiği oluştururuz.\n        <br />\n        Kullanım:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Varsayılan veri kümesi​\n        </li>\n        <li>\n        aes():    Verilerdeki değişkenlerin geometri estetik özelliklerine (estetik) nasıl eşlendiğini tanımlayan estetik eşlemeleri oluşturur.​\n        </li>\n        <li>\n        x: Bir faktör/kategorik değişken. Çubuğun uzunluğu, faktör değişkeninin her düzeyinin sayımlarına karşılık gelir.​\n        </li>\n        <li>\n        fill: x'teki düzeylerin sayımlarını gruplamak için isteğe bağlı bir faktör/kategorik değişken (yukarıya bakın)​\n        </li>\n        <li>\n        geom_bar(): Çubuk grafiği oluşturur, position =\"stack\" grupları tek bir çubuk üzerinde yığar, position =\"dodge\" grupları yan yana yığar, position =\"fill\" çubuğu her gruplama düzeyinin yüzdesi ile doldurur.​\n        </li>\n        <li>\n        Labs(): Eksen etiketlerini ve efsane başlıklarını değiştirir (bu isteğe bağlıdır)​\n        </li>\n        <li>\n        facet_grid(): Panelleri bir ızgarada düzenler (bu isteğe bağlıdır)​\n        </li>\n        <li>\n        theme_calc(): Hesap makinesi temasını belirtir (bu isteğe bağlıdır)​\n        </li>\n        <li>\n        coord_flip(): Eksenleri çevirir (bu isteğe bağlıdır)​\n        </li>\n        <li>\n        alpha: Opaklığı kontrol eder, 0-1 arasında değerler alır. 1, opaklık yok demektir.\n        </li>\n        </ul>\n\t\t<br />\n\t\t<br />\n\t\tEğer 'Her çubuk çifti arasında anlamlılık (p-değerleri) ortalama karşılaştırması ekle' seçeneği altında Ortalama seçilmişse, grafikteki p-değerleri için kodlar aşağıdaki gibidir:\n\t\t<br />\n\t\tns: p > 0.05\n\t\t<br />\n\t\t*: p <= 0.05\n\t\t<br />\n\t\t**: p <= 0.01\n\t\t<br />\n\t\t***: p <= 0.001\n\t\t<br />\n\t\t****: p <= 0.0001\n\t\t<br />\n\t\t<br />\n\t\tAyarlama P-değeri yöntemleri:\n\t\t<br/>\n\t\tAyarlama P-değeri yöntemleri, p-değerlerinin karşılaştırmaların sayısı ile çarpıldığı Bonferroni düzeltmesini (\"bonferroni\") içerir. Daha az muhafazakar düzeltmeler Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), Hommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" veya takma adı \"fdr\") ve Benjamini & Yekutieli (2001) (\"BY\") tarafından da dahil edilmiştir. Bir geçiş seçeneği (\"none\") de bulunmaktadır. Yöntemlerin seti, p.adjust yöntemine seçenek olarak iletilmesi gereken yöntemler için p.adjust.methods vektöründe bulunmaktadır.\n\t\t<br/>\n\t\t<br/>\n\t\tİlk dört yöntem, ailevi hata oranının güçlü kontrolünü sağlamak için tasarlanmıştır. Değiştirilmemiş Bonferroni düzeltmesini kullanmak için bir neden yok gibi görünüyor çünkü Holm'un yöntemi tarafından baskın bir şekilde geçerlidir, bu da keyfi varsayımlar altında da geçerlidir.\n\t\t<br/>\n\t\t<br/>\n\t\tHochberg'in ve Hommel'in yöntemleri, hipotez testleri bağımsız olduğunda veya negatif olmayan bir şekilde ilişkili olduklarında geçerlidir (Sarkar, 1998; Sarkar ve Chang, 1997). Hommel'in yöntemi Hochberg'den daha güçlüdür, ancak fark genellikle küçüktür ve Hochberg p-değerleri daha hızlı hesaplanır.\n\t\t<br/>\n\t\t<br/>\n\t\t\"BH\" (aka \"fdr\") ve \"BY\" yöntemleri Benjamini, Hochberg ve Yekutieli, yanlış keşif oranını kontrol eder, reddedilen hipotezler arasındaki beklenen yanlış keşif oranını. Yanlış keşif oranı, ailevi hata oranından daha az katı bir koşuldur, bu nedenle bu yöntemler diğerlerinden daha güçlüdür.\n\t\t<br/>\n\t\t<br/>\n\t\tAyrıca bakınız:\n\t\t<br />\n\t\thelp(geom_pwc, package=ggpubr)\n\t\t<br />\n\t\thelp(ggadjust_pvalue, package=ggpubr)\n\t\t<br />\n\t\t<br />\n        Paket: ggplot2, ggthemes​\n        <br />\n        Diğer: Ayrıntılı R yardımı almak için R Yardım düğmesine tıklayın. Ayrıca help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) yazabilirsiniz.​\n      "
  }
}