{
  "title": "Çubuk Grafik",
  "navigation": "Çubuk Grafik",
  "optionsLabels": "Etiketler için seçenekler",
  "suppressLabels": "Sayım ve yüzdeler için tüm etiketleri gizle",
  "suppressThreshold": "Belirtilen eşik yüzdesinin altındaki sayım ve yüzdeler için etiketleri gizle",
  "label1": "Sayım veya ortalamayı seçmek için aşağıdaki sekmeye tıklayın. Sayım seçildiğinde, Y değişkeni isteğe bağlıdır. Sayım seçildiğinde ve bir Y değişkeni belirtilmediğinde, X değişkeninin sayıları gösterilir. Sayım belirtilip bir Y değişkeni belirtilirse, Y değişkeninin değerleri toplanır. Ortalama seçildiğinde, bir Y ve bir X değişkeni seçmeniz gerekir. Ortalamalar Y değişkeni(leri) için hesaplanır.",
  "x": "X değişkeni",
  "y": "Y değişken(leri), sayısal değişken(leri) belirtin",
  "fill": "Çubukları doldurmak için bir faktör değişkeni belirtin.",
  "dropna": "Eksik değerleri atla",
  "bottomlbl": "Çubuk Grafiği Seçin",
  "meanlbl": "Ortalama",
  "countlbl": " Sayım",
  "fill1": "Çubuklar için bir renk seçin. Not: Bu, çubukları doldurmak için bir değişken belirtildiğinde göz ardı edilir.",
  "barType": "Çubuk grafik türü",
  "stackedBar": "Yığılmış çubuk grafiği",
  "sideBySide": "Grupları yan yana göster",
  "fillPercent": "Çubukları doldur",
  "errorBarOptions": "Hata çubukları",
  "noErrBars": "Hata çubuğu yok",
  "stderr": "Standart hatalar",
  "stddev": "Standart sapma",
  "cilevel": "Güven düzeyini belirtin:",
  "confidenceInterval": "Güven düzeyi:",
  "alpha": "Opaklık (0-1)",
  "flipBox": "Eksenleri çevir",
  "specify_a_title": "Bir başlık girin",
  "x_title": "X Ekseni Etiketi",
  "y_title": "Y Ekseni Etiketi",
  "hide": "Hata çubuklarının sadece üst kısmını göster (opaklığı 1 olarak ayarlamalısınız)",
  "Facetrow": "Facet satırı",
  "Facetcolumn": "Facet sütunu",
  "Facetwrap": "Facet sarmal",
  "Facetscale": "Facet ölçeği",
  "relFreq": "Göreli frekanslar",
  "facets_lbl": "Facetler",
  "help": {
    "title": "Çubuk Grafik Yardımı",
    "r_help": "help(geom_bar, package=ggplot2)",
    "body": "Bir çubuk grafik, değerleri temsil eden dikdörtgen çubuklarla gruplandırılmış verileri sunan bir grafiktir. Çubuklar dikey veya yatay olarak çizilebilir. Çubuklar isteğe bağlı bir faktör değişkenine göre gruplandırılabilir. Gruplar tek bir çubuk üzerinde yığılabilir veya yan yana gösterilebilir. Facetler, isteğe bağlı olarak bir faktör değişkeni belirtilerek oluşturulabilir. Ayrıca temalar belirleyebilir ve x ve y eksenleri için bir başlık ve etiketler belirleyebilirsiniz.\n        Tek bir faktör değişkeni için bir çubuk grafik oluşturabilirsiniz, çubuklar faktör seviyesinin her bir seviyesinin sayısını temsil eder. Burada faktör değişkeni x ekseninde olacaktır, aşağıdaki örneğe bakın. Göreli frekanslar onay kutusu seçildiğinde, y ekseninde sayılar yerine göreli frekansı gösteriyoruz.\n        <br />\n        <code> \n         ggplot(data=Dataset2,aes(x =year)) +\n         geom_bar( position =\"stack\",alpha=0.4) +\n         labs(x =\"year\",y =\"Count\",title= \"X ekseni için çubuk grafiği: yıl,Y ekseni: Sayım\")\n        </code>\n        <br />\n        Bir çubuk grafik oluşturmak için y eksenine bir ölçek/sayısal değişken yerleştirebilir ve çubukları bir faktör değişkeni ile doldurabilirsiniz. Çubuk, her faktör değişkeninin seviyesi için y değişkeninin değerlerinin toplamı ile doldurulacaktır, aşağıdaki örneğe bakın.\n        <br />\n        <code> \n        ggplot(data=Dataset2,aes(x ='',y=weight,fill=origin)) +\n         geom_bar( position =\"stack\",alpha=0.4,stat=\"identity\") +\n         labs(y =\"weight\",fill =\"origin\",title= \"X ekseni için çubuk grafiği:,Y ekseni: ağırlık,Doldurma: köken\")\n        </code>\n        <br />\n        Bir x değişkeni, y değişkeni ve doldurma belirtebilirsiniz. Çubuk, x değişkeninin her seviyesinin y değişkeninin değerlerinin toplamı ile doldurulur, doldurulacak değişkenin seviyesine göre gruplandırılır.\n        Birden fazla x değişkeni belirtildiğinde, her x değişkeni için ayrı bir çubuk grafiği oluştururuz.\n        <br />\n        Kullanım:\n        ​<br />\n        <code> \n        ggplot(data = Dataset5,aes(x = origin,fill = cylinder)) +geom_bar(position = \"stack\", alpha=1)   + labs(x = \"origin\",y = \"Count\",fill = \"cylinder\")  +theme_calc()+facet_grid(year~.)​\n        ​ggplot(data = Dataset5,aes(x = origin)) +geom_bar(position = \"stack\")​\n        </code>\n        <br />\n        <ul>\n        <li>\n        data: Varsayılan veri kümesi​\n        </li>\n        <li>\n        aes():    Verilerdeki değişkenlerin görsel özelliklere (estetik) nasıl eşlendiğini tanımlayan estetik eşlemeleri oluşturur.​\n        </li>\n        <li>\n        x: Bir faktör/kategorik değişken. Çubuğun uzunluğu, faktör değişkeninin her seviyesinin sayıları ile ilişkilidir.​\n        </li>\n        <li>\n        fill: x'deki seviyelerin sayımlarını gruplamak için isteğe bağlı bir faktör/kategorik değişken:​\n        </li>\n        <li>\n        geom_bar(): Çubuk grafiği oluşturur, position =”stack” grupları tek bir çubuk üzerinde yığar, position =”dodge” grupları yan yana yığar, position =\"fill\" çubuğu her gruplama seviyesinin yüzdesi ile doldurur.​\n        </li>\n        <li>\n        Labs(): Eksen etiketlerini ve efsane başlıklarını değiştirir (bu isteğe bağlıdır)​\n        </li>\n        <li>\n        facet_grid(): Panelleri bir ızgarada düzenler (bu isteğe bağlıdır)​\n        </li>\n        <li>\n        theme_calc(): Hesap makinesi temasını belirtir (bu isteğe bağlıdır)​\n        </li>\n        <li>\n        coord_flip(): Eksenleri çevirir (bu isteğe bağlıdır)​\n        </li>\n        <li>\n        alpha: Opaklığı kontrol eder, 0-1 arasında değer alır. 1, opaklık yok demektir.\n        </li>\n        </ul>\n        Paket: ggplot2,ggthemes​\n        <br />\n        Diğer: Ayrıntılı R yardımı almak için R Yardım düğmesine tıklayın. Ayrıca help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) yazabilirsiniz.​\n        "
  }
}