{
  "title": "Bartlett Testi",
  "navigation": "Bartlett Testi",
  "tvarbox1": "Yanıt değişkeni",
  "tvarbox2": "Sayısal veya faktör değişkenler",
  "help": {
    "title": "Bartlett Testi",
    "r_help": "help(bartlett.test, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nGruplardaki (örneklerdeki) varyansların aynı olduğu hipotezinin Bartlett testini gerçekleştirir.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nbartlett.test(x, ...)</br>\n## Varsayılan S3 yöntemi:</br>\nbartlett.test(x, g, ...)</br>\n## 'formül' sınıfı için S3 yöntemi</br>\nbartlett.test(formül, veri, alt küme, na.action, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nArgümanlar\nx: veri değerlerinin sayısal bir vektörü veya ilgili örnekleri temsil eden sayısal veri vektörlerinin bir listesi veya \"lm\" sınıfından miras alan uygun doğrusal model nesneleri.\n</li>\n<li>\ng: x'in karşılık gelen elemanları için grubu veren bir vektör veya faktör nesnesi. x bir listeyse göz ardı edilir.\n</li>\n<li>\nformül: lhs ~ rhs biçiminde bir formül, burada lhs veri değerlerini ve rhs karşılık gelen grupları verir.\n</li>\n<li>\ndata: formül içindeki değişkenleri içeren isteğe bağlı bir matris veya veri çerçevesi (veya benzeri: model.frame'e bakın). Varsayılan olarak değişkenler environment(formül)'den alınır.\n</li>\n<li>\nalt küme: kullanılacak gözlemlerin bir alt kümesini belirten isteğe bağlı bir vektör.\n</li>\n<li>\nna.action: veriler NAs içerdiğinde ne olacağını belirten bir işlev. Varsayılan olarak getOption(\"na.action\").\n</li>\n<li>\n...: yöntemlere iletilecek veya yöntemlerden alınacak daha fazla argüman.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nEğer x bir listeyse, elemanları karşılaştırılacak örnekler veya uygun doğrusal modeller olarak alınır. Bu durumda, elemanların ya tamamen sayısal veri vektörleri ya da uygun doğrusal model nesneleri olması gerekir, g göz ardı edilir ve testi gerçekleştirmek için basitçe bartlett.test(x) kullanılabilir. Eğer örnekler henüz bir listede değilse, bartlett.test(list(x, ...)) kullanın.</br>\nAksi takdirde, x bir sayısal veri vektörü olmalı ve g, x'in karşılık gelen elemanları için grubu veren x ile aynı uzunlukta bir vektör veya faktör nesnesi olmalıdır.</br>\n<b>Değer</b><br/>\nAşağıdaki bileşenleri içeren \"htest\" sınıfından bir liste:<br/>\nistatistik: Bartlett'ın K-kare test istatistiği.<br/>\nparametre: test istatistiğinin yaklaşık ki-kare dağılımının serbestlik dereceleri.<br/>\np.değeri: testin p-değeri.<br/>\nyöntem: \"Varyansların homojenliği için Bartlett testi\" karakter dizesi.<br/>\ndata.name: verilerin adlarını veren bir karakter dizesi.<br/>\n<b>Örnekler</b><br/>\n<code> \nDataset <- data.frame(Age=c(20,23,19,25,26), Weight=c(48,50,55,51,49), Gender=c('m','f','f','m','m' ))\nResult_Bartlett_Test = bartlett.test(sales ~ interaction(Dataset$Gender),data=Dataset)\n</code> <br/>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nhelp(bartlett.test, package=stats)\n"
  }
}