{
  "title": "Bonferroni Aykırı Değer Testi",
  "navigation": "Aykırı Değer Testi",
  "label1": "Aşağıdaki sınıflardan bir model seçin (parantez içindeki sınıf) - Doğrusal model (lm), Genelleştirilmiş doğrusal model (glm)",
  "modelselector1": "Bir model seçin",
  "help": {
    "title": "Bonferroni Aykırı Değer Testi",
    "r_help": "help(outlierTest, package='car')",
    "body": "\n                <b>Açıklama</b></br>\nHer bir gözlemi sırayla ortalama kayması aykırı değeri olarak test etmek için Bonferroni p-değerlerini raporlar, doğrusal (t-testleri), genelleştirilmiş doğrusal modeller (normal testler) ve doğrusal karışık modellerde Studentize edilmiş kalıntılara dayanmaktadır.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \noutlierTest(model, ...)<br/>\n## 'lm' sınıfı için S3 yöntemi<br/>\noutlierTest(model, cutoff=0.05, n.max=10, order=TRUE, \nlabels=names(rstudent), ...)<br/>\n## 'lmerMod' sınıfı için S3 yöntemi<br/>\noutlierTest(model, ...)<br/>\n## 'outlierTest' sınıfı için S3 yöntemi<br/>\nprint(x, digits=5, ...)<br/>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nmodel: bir lm, glm veya lmerMod model nesnesi; \"lmerMod\" yöntemi \"lm\" yöntemini çağırır ve aynı argümanları alabilir.\n</li>\n<li>\ncutoff: Bonferroni p-değerleri cutoff'u aşan gözlemler rapor edilmez, eğer hiçbir gözlem belirtilmemişse, en büyük Studentize edilmiş kalıntıya sahip olan rapor edilir.\n</li>\n<li>\nn.max: rapor edilecek maksimum gözlem sayısı (varsayılan, 10).\n</li>\n<li>\norder: Studentize edilmiş kalıntıları büyüklük sırasına göre azalan sırada rapor et? (varsayılan, TRUE).\n</li>\n<li>\nlabels: gözlem adlarının isteğe bağlı bir vektörü.\n</li>\n<li>\n...: yöntem fonksiyonlarına iletilen argümanlar.\n</li>\n<li>\nx: outlierTest nesnesi.\n</li>\n<li>\ndigits: rapor edilen p-değerleri için basamak sayısı.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nDoğrusal bir model için, rapor edilen p-değerleri, model için kalıntı df'sinden bir eksik serbestlik derecesi ile t dağılımını kullanır. Genelleştirilmiş bir doğrusal model için, p-değerleri standart-normal dağılıma dayanmaktadır. Bonferroni ayarlaması, olağan iki taraflı p-değerini gözlem sayısı ile çarpar. lm yöntemi glm nesneleri için çalışır. Tüm gözlemleri göstermek için cutoff=Inf ve n.max=Inf ayarlayın.<br/>\n<b>Değer</b><br/>\nnormalde sadece yazdırılan bir outlierTest nesnesi.<br/>\n<b>Örnekler</b><br/>\n<code> \noutlierTest(lm(prestige ~ income + education, data=Duncan))\n</code> <br/>\n<b>Paket</b></br>\ncar</br>\n<b>Yardım</b></br>\nDetaylı yardım için bu diyalog üst kısmındaki R simgesine tıklayın veya R sözdizimi editöründe aşağıdaki komutu çalıştırın help(outlierTest, package=\"car\")\n                "
  }
}