{
  "title": "Kutu Grafiği",
  "navigation": "Kutu Grafiği",
  "x": "X değişkeni, bir Kategori değişkeni belirtin",
  "y": "Y değişken(ler)i, bir Sayısal değişken(ler)i belirtin",
  "Fill": "Bir gruplama (Kategori) değişkeni belirtin",
  "flipaxis": "Eksenleri çevir",
  "dataPoints": "Veri noktalarını çizmek için bir seçenek seçin",
  "alpha": "Opaklık (0-1)",
  "notch": "Girinti",
  "outliers": "Aykırı Değerleri Göster (Kırmızı Olarak)",
  "barcolor": "Kutu çevresindeki çizgiler için bir renk seçin (Renk seçimini yaptıktan sonra, uygulamak için kontrolün dışına tıklayın)",
  "specify_a_title": "Bir başlık girin",
  "x_title": "X ekseni etiketi",
  "y_title": "Y ekseni etiketi",
  "angleXaxis_text": "X ekseni metin değerlerini eğmek için açı (eğme yoksa varsayılan 0)",
  "angleYaxis_text": "Y ekseni metin değerlerini eğmek için açı (eğme yoksa varsayılan 0)",
  "axisTickmarksCount": "Kaç tane eksen değeri (yani, işaret) görüntülenecek (varsayılan 10)",
  "Facetrow": "Facet satırı",
  "Facetcolumn": "Facet sütunu",
  "Facetwrap": "Facet sarmal (seçildiğinde, Facet satır ve sütun seçimleri göz ardı edilecektir)",
  "Facetscale": "Facet ölçeği",
  "facets_lbl": "Facetler",
  "label1": "Yatay çizgiler",
  "yIntercept": "Yatay çizgiler için virgülle ayrılmış Y kesişim değeri(ler)ini girin, örn. 100, 200, 300",
  "hLineColor": "Çizgi(ler) ve etiket(ler) için bir renk seçin (Renk seçimini yaptıktan sonra, uygulamak için kontrolün dışına tıklayın)",
  "lineType": "Çizgi türünü seçin",
  "horizontalLinelabel": "Yatay çizgi(ler) için virgülle ayrılmış etiketleri belirtin (tırnak işareti olmadan)",
  "horizontalLinelabel_angle_text": "Yatay çizgi etiket metnini eğmek için açı (eğme yoksa varsayılan 0)",
  "label2": "Not: Daha büyük değerler metni aşağıya, daha küçük değerler metni yukarıya taşır",
  "addHoriRefLines": "Referans çizgileri ekle",
  "xyLimits": "X ve Y ekseni sınırları",
  "label5": "X ve Y ekseni değerleri için bir aralık belirtin",
  "rangeXValues": "X ekseni aralığını belirtin, örn. 0,100 (Kategorik/faktör ekseni için boş bırakın)",
  "rangeYValues": "Y ekseni aralığını belirtin, örn. 0,100",
  "labelHori_HorizontalJustification": "Not: daha büyük değerler metni sola, daha küçük değerler metni sağa yerleştirir",
  "verticalJustification": "Etiketin dikey konumlandırmasını kontrol et",
  "hori_HorizontalJustification": "Etiketin yatay konumlandırmasını kontrol et",
  "addlLabelHlineTextPositionOffset": "Yatay çizgiler için etiket metninin konumunu ayarlamak için ek ayarlamalar",
  "horiMovementHReflineLabel": "Metni yatay olarak sola veya sağa hareket ettirin - + veya - işareti ile herhangi bir sayı kullanın (Kategorik eksen için 0 bırakın)",
  "nobreaklineHRefLabelandValueChk": "Etiket değeri ve etiket metni arasındaki satır kırılmasını kaldırmak için bu kutuyu işaretleyin",
  "vertiMovementHReflineLabel": "Metni dikey olarak yukarı veya aşağı hareket ettirin - + veya - işareti ile herhangi bir sayı kullanın (Kategorik eksen için 0 bırakın)",
  "help": {
    "title": "Kutu Grafiği",
    "r_help": "help(geom_boxplot, package=ggplot2)",
    "body": "\n        <b>Açıklama</b></br>\n        Tanımlayıcı istatistiklerde, bir kutu grafiği veya kutuplot, sayısal verilerin gruplarını çeyrekleri aracılığıyla grafiksel olarak tasvir etmenin pratik bir yoludur. Kutu grafikleri, kutulardan dikey olarak uzanan çizgiler (whiskers) ile üst ve alt çeyreklerin dışındaki değişkenliği gösterir, bu nedenle kutu ve whisker grafiği ve kutu ve whisker diyagramı terimleri kullanılır. Aykırı değerler bireysel noktalar olarak çizilebilir. Kutu ve whisker grafikleri, kutunun kullanımı açısından standarttır: kutunun alt ve üst kısmı her zaman birinci ve üçüncü çeyreklerdir ve kutunun içindeki bant her zaman ikinci çeyrek (medyan)dir. Üst whisker, menteşeden 1.5 * IQR içinde en yüksek değere kadar uzanır; burada IQR, birinci ve üçüncü çeyrekler arasındaki mesafedir. Alt whisker, menteşeden 1.5 * IQR içinde en düşük değere kadar uzanır. Whiskerlerin ucundaki veriler aykırı değerlerdir ve noktalar olarak çizilir (Tukey tarafından belirtildiği gibi).​</br>\n        Facetler, bir faktör değişkeni belirterek isteğe bağlı olarak oluşturulabilir. Ayrıca temalar belirtebilir ve x ve y eksenleri için bir başlık ve etiketler belirtebilirsiniz.​</br>\n        Veri noktalarını çizmek için seçeneği seçtiğinizde, bunu geom_dotplot kullanarak yapıyoruz.</br>\n        Varsayılan olarak, aykırı değerler siyah noktalarla gösterilir; aykırı değerleri (Kırmızı Olarak) göstermek için onay kutusunu seçtiğinizde, aykırı değerler daha belirgin hale gelir.\n        <br/>\n        <b>Kullanım</b>\n        <br/>\n        <code> \n        ggplot(data =Dataset,aes(x = var1,y = var2,fill = var3)) + geom_boxplot()  + \n        geom_dotplot(binaxis = 'y',stackdir = 'center',dotsize = 0.1)+ coord_flip()+ labs(x = \"var1\",y = \"var2\",fill = \"var3\")   +facet_grid(var4~.)​\n        </code> <br/>\n        <b>Argümanlar</b><br/>\n        <ul>\n        <li>\n        data: Varsayılan veri seti​\n        </li>\n        <li>\n        x: Y değişkeninin gruplamasını tanımlayan bir faktör/kategorik değişken​\n        </li>\n        <li>\n        y: Kutu grafiğinin hesaplandığı sayısal bir değişken​\n        </li>\n        <li>\n        fill: Mevcut grupları daha fazla gruplamak için isteğe bağlı bir faktör/kategorik değişken. Her alt grup farklı bir renkte gösterilecektir.​\n        </li>\n        <li>\n        aes():    Değişkenlerin verilerde nasıl görsel özelliklere (estetik) eşlendiğini tanımlayan estetik eşlemeleri oluşturur.​\n        </li>\n        <li>\n        geom_boxplot():Kutu grafiğini oluşturur. Üst ve alt \"menteşeler\" birinci ve üçüncü çeyrekleri (25. ve 75. yüzdeleri) karşılar.​\n        </li>\n        <li>\n        geom_dotplot: Veri noktalarını çizer\n        </li>\n        <li>\n        Labs(): Eksen etiketlerini ve efsane başlıklarını değiştirir (Bu isteğe bağlıdır)​\n        </li>\n        <li>\n        facet_grid(): Panelleri bir ızgarada düzenler (Bu isteğe bağlıdır)​\n        </li>\n        <li>\n        theme_calc(): Hesap makinesi temasını belirtir (Bu isteğe bağlıdır)​\n        </li>\n        <li>\n        coord_flip(): Eksenleri çevirir (Bu isteğe bağlıdır)​\n        </li>\n        <li>\n        notch: Girintili kutu grafikleri, medyan etrafında bir \"girinti\" veya kutunun daralmasını uygular. Girintiler, medyanların farkının anlamlılığına dair kaba bir kılavuz sunmakta faydalıdır; eğer iki kutunun girintileri örtüşmüyorsa, bu medyanlar arasında istatistiksel olarak anlamlı bir fark olduğuna dair kanıt sunar. Girintili bir kutu grafiğinde, girintiler 1.58 * IQR / sqrt(n) kadar uzanır.\n        </li>\n        </ul>\n        <b>Paket</b></br>\n        ggplot2;ggthemes;stringr</br>\n        <b>Yardım</b></br>\n        help(geom_boxplot, package=ggplot2)</br>\n        Detaylı R yardımı almak için R Yardım düğmesine tıklayın. Ayrıca help(geom_boxplot), help(labs), help(aes), help(facet_grid), help(theme_calc), help(coord_flip), help (geom_dotplot) yazabilirsiniz.\n        "
  }
}