{
  "title": "Kategorik Anlaşma",
  "navigation": "Kategorik Anlaşma",
  "ratervars": "Değerlendirici Değişkenleri:",
  "cilevel": "Güven Düzeyi:",
  "options": "Gelişmiş",
  "categLabels": "Tüm olası derecelendirmeleri virgülle ayırarak isteğe bağlı olarak belirtin, örneğin 1,2,3,4,5 veya \"düşük\",\"orta\",\"yüksek\" ",
  "weightschkbox": "Kategori ağırlıklarını göster",
  "weights": "Kategori ağırlıklarını seçin",
  "N": "Sonlu nüfus büyüklüğü (varsa)",
  "help": {
    "title": "Kategorik Anlaşma",
    "r_help": "help(fleiss.kappa.raw, package=irrCAC)",
    "body": "\n<b>Açıklama</b></br>\nBirden fazla değerlendirici (2, 3, +) arasında, her bir konu ve her değerlendirici için rapor edilen ham derecelendirmeleri temsil eden giriş verileri kullanıldığında, yüzde anlaşmayı, Conger'ın/Cohen'in kappa'sını, Fleiss'ın kappa'sını, Gwet'in AC1/AC2'sini, Krippendorff'un alpha'sını ve Brennan-Prediger katsayısını hesaplar.  Bu istatistiklerin ağırlıksız ve ağırlıklı versiyonları mevcuttur ve farklı kategori ağırlıklandırma yöntemleri ile sunulmaktadır.</br>\nEksik değerler, Gwet (2014) tarafından şansa dayalı anlaşma hesaplamalarına dahil edilmiştir.</br>\nAyrıca, derecelendirme kategorilerinin ağırlıklarını görüntüleme seçeneği sunuyoruz.</br>\nDaha fazla bilgi için, bkz: </br></br>Gwet, K.L. (2014, ISBN:978-0970806284). “Ara Değerlendirici Güvenilirliği El Kitabı,” 4. Baskı. Advanced Analytics, LLC\n</br></br>Klein, D. (2018) doi:https://doi.org/10.1177/1536867X1801800408. “Stata'da ara değerlendirici anlaşmasını değerlendirmek için genel bir çerçeve uygulamak,” The Stata Journal Cilt 18, Sayı 4, ss. 871-901.</br></br> \n<b>Kullanım</b>\n<br/>\n<br/>\n<ul>\n<li>\n<b>Değerlendirici Değişkenleri:</b> Her değerlendiriciye karşılık gelen değişkenler, her sütun bir değerlendiriciyi ve her satır bir konuyu temsil eder. Sayısal, faktör, sıralı veya karakter değişkenleri olabilir.</br>\n</li>\n<li>\n<b>Güven Düzeyi:</b> Güven aralığı ile ilişkili güven düzeyi. Varsayılan değeri 0.95'tir.</br>\n</li>\n<li>\n<b>Kategori ağırlıklarını göster:</b> Seçilen ağırlıklara göre değerlendirici kategorileri için sayısal ağırlıkları gösterir. Seçilen ağırlık, kategoriler arasındaki istenen yakınlığa karşılık gelmelidir.\n</li>\n<li>\n<b>Kategori ağırlıklarını seçin:</b> Ya bir dize değişkeni ya da bir matris olan zorunlu bir parametre. Dize, önceden tanımlanmış ağırlıklardan birini tanımlar ve \"ağırlıksız\",\"kare\", \"sıralı\", \"doğrusal\", \"radikal\", \"oran\", \"dairesel\", \"iki kutuplu\" değerlerinden birini almalıdır. </br>\nBu parametre bir matris ise, q, bir konunun sınıflandırılabileceği olası kategori sayısıdır ve qxq boyutunda kare bir matris olmalıdır. Eğer q olası kategorilerden bazıları kullanılmıyorsa, o zaman olası kategorilerin tam listesinin belirtilmesi şiddetle tavsiye edilir. Aksi takdirde, program çalışmayabilir.</br>\nNOT: Bir matris belirtmek, sözdiziminde DESTEKLENMEMEKTEDİR. Bir matris belirtmek için kodu yapıştırmanız ve düzenlemeniz gerekir.</br>\n</li>\n<li>\n<b>Sonlu nüfus büyüklüğü (varsa):</b> Nüfus büyüklüğünü temsil eden isteğe bağlı bir parametre (varsa). Varyans için sonlu nüfus düzeltmesi yapmak için kullanılabilir. Varsayılan değeri sonsuzdur.\n</li>\n<li>\n<b>Tüm olası derecelendirmeleri isteğe bağlı olarak belirtin:</b> Hiçbir değerlendirici olası bir kategoriyi kullanmadığında kullanılan isteğe bağlı bir listedir. Hiçbir şey belirtilmezse, gözlemlenen kategorilerin tüm kategori kümesini oluşturduğu varsayılır.\n</li>\n</ul>\n<b>R Paketi</b></br>\nirrCAC</br>\n<b>Yardım</b></br>\nBu diyalog, pa.coeff.raw, conger.kappa.raw, fleiss.kappa.raw, gwet.ac1.raw, krippen.alpha.raw ve bp.coeff.raw fonksiyonlarını kullanır.\nDetaylı yardım için, irrCAC paket yardımına triple dot menüsü > Yardım > R Paketi Yardımı'ndan ulaşın.\n"
  }
}