{
  "title": "Ki-kare Testi",
  "navigation": "Ki-kare Testi",
  "target": "Seçilen değişkenler",
  "proportions": "Eşit oranlara karşı test yapın veya test etmek için oranlar girin. Değişkeniniz cinsiyet ise, eşit oranları test etmek için bu kontrolü boş bırakın. %20 kadın, %80 erkek test etmek için 0.2,0.8 girin. Her seviye için bir oran girin. Oranlar toplamı 1 olmalıdır.",
  "help": {
    "title": "Ki-kare Testi",
    "r_help": "help(chisq.test, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nchisq.test, ki-kare kontenjan tablosu testleri ve uyum iyiliği testleri gerçekleştirir.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code>\nchisq.test(x, y = NULL, correct = TRUE,\n            p = rep(1/length(x), length(x)), rescale.p = FALSE,\n            simulate.p.value = FALSE, B = 2000)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nx: sayısal bir vektör veya matris. x ve y de faktör olabilir.\n</li>\n<li>\ny: sayısal bir vektör; x bir matris ise göz ardı edilir. Eğer x bir faktörse, y aynı uzunlukta bir faktör olmalıdır.\n</li>\n<li>\ncorrect: 2'ye 2 tablolar için test istatistiğini hesaplarken süreklilik düzeltmesi uygulayıp uygulamayacağını belirten mantıksal bir değer: tüm |O - E| farklarından bir yarım çıkarılır; ancak düzeltme, farkların kendisinden daha büyük olamaz. simulate.p.value = TRUE ise düzeltme yapılmaz.\n</li>\n<li>\np: x'in aynı uzunluğunda olasılık vektörü. p'nin herhangi bir girişi negatifse bir hata verilir.\n</li>\n<li>\nrescale.p: mantıksal bir skalar; TRUE ise p, 1'e toplamı olacak şekilde yeniden ölçeklenir (gerekirse). rescale.p FALSE ise ve p toplamı 1 değilse, bir hata verilir.\n</li>\n<li>\nsimulate.p.value: p-değerlerini Monte Carlo simülasyonu ile hesaplayıp hesaplamayacağını belirten mantıksal bir değer.\n</li>\n<li>\nB: Monte Carlo testinde kullanılan tekrar sayısını belirten bir tamsayı.\n</li>\n</ul>\n<b>Açıklama</b><br/>\nEğer x bir satır veya sütun içeren bir matris ise veya x bir vektör ve y verilmemişse, o zaman bir uyum iyiliği testi gerçekleştirilir (x bir boyutlu bir kontenjan tablosu olarak değerlendirilir). x'in girişleri negatif olmayan tam sayılar olmalıdır. Bu durumda, test edilen hipotez, popülasyon olasılıklarının p'deki değerlerle eşit olup olmadığıdır veya p verilmemişse hepsinin eşit olup olmadığıdır.\nEğer x en az iki satır ve sütun içeren bir matris ise, iki boyutlu bir kontenjan tablosu olarak alınır: x'in girişleri negatif olmayan tam sayılar olmalıdır. Aksi takdirde, x ve y aynı uzunlukta vektörler veya faktörler olmalıdır; eksik değerler olan durumlar kaldırılır, nesneler faktörlere dönüştürülür ve bu nesnelerden kontenjan tablosu hesaplanır. Daha sonra, 2 boyutlu bir kontenjan tablosundaki hücre sayılarının ortak dağılımının satır ve sütun marjinal ürünleri olduğu null hipotezinin Pearson ki-kare testi gerçekleştirilir.<br/>\nEğer simulate.p.value FALSE ise, p-değeri test istatistiğinin asimptotik ki-kare dağılımından hesaplanır; süreklilik düzeltmesi yalnızca 2'ye 2 durumunda kullanılır (eğer correct TRUE ise, varsayılan). Aksi takdirde, p-değeri B tekrar ile bir Monte Carlo testi için hesaplanır (Hope, 1968). Kontenjan tablosu durumunda simülasyon, verilen marjinal değerlerle tüm kontenjan tabloları kümesinden rastgele örnekleme ile yapılır ve yalnızca marjinal değerler kesin pozitif olduğunda çalışır. Süreklilik düzeltmesi asla kullanılmaz ve istatistik bu olmadan belirtilir. Bu, ki-kare testinin varsayılan örnekleme durumu değildir, daha ziyade Fisher'ın kesin testi için geçerlidir.<br/>\nUygunluk iyiliği durumunda simülasyon, p tarafından belirtilen ayrık dağılımdan rastgele örnekleme ile yapılır, her örnek n = sum(x) boyutundadır. Bu simülasyon R'de yapılır ve yavaş olabilir.<br/>\n<b>Değer</b></br>\n\"htest\" sınıfına sahip bir liste, aşağıdaki bileşenleri içerir:</br>\nistatistik: ki-kare test istatistiğinin değeri.</br>\nparametre: test istatistiğinin yaklaşık ki-kare dağılımının serbestlik dereceleri, p-değeri Monte Carlo simülasyonu ile hesaplanmışsa NA.</br>\np.değeri: test için p-değeri.</br>\nyöntem: gerçekleştirilen testin türünü ve Monte Carlo simülasyonu veya süreklilik düzeltmesinin kullanılıp kullanılmadığını belirten bir karakter dizesi.</br>\ndata.name: veri ad(lar)ını veren bir karakter dizesi.</br>\nobserved: gözlemlenen sayılar.</br>\nexpected: null hipotezi altında beklenen sayılar.</br>\nresiduals: Pearson kalıntıları, (gözlemlenen - beklenen) / sqrt(beklenen).</br>\nstdres: standartlaştırılmış kalıntılar, (gözlemlenen - beklenen) / sqrt(V), burada V kalıntı hücre varyansıdır (Agresti, 2007, bölüm 2.4.5, x bir matris olduğunda, n * p * (1 - p) aksi takdirde).​​</br>\n<b>Örnekler</b><br/>\n<code> \n## Agresti(2007) s.39'dan\nM <- as.table(rbind(c(762, 327, 468), c(484, 239, 477)))</br>\ndimnames(M) <- list(cinsiyet = c(\"K\", \"E\"),</br>\n                    parti = c(\"Demokrat\",\"Bağımsız\", \"Cumhuriyetçi\"))</br>\n(Xsq <- chisq.test(M))  # Test özetini yazdırır</br>\nXsq$observed   # gözlemlenen sayılar (M ile aynı)</br>\nXsq$expected   # null altında beklenen sayılar</br>\nXsq$residuals  # Pearson kalıntıları</br>\nXsq$stdres     # standartlaştırılmış kalıntılar</br>\n</br>\n## p-değerlerini simüle etmenin etkisi</br>\nx <- matrix(c(12, 5, 7, 7), ncol = 2)</br>\nchisq.test(x)$p.value           # 0.4233</br>\nchisq.test(x, simulate.p.value = TRUE, B = 10000)$p.value</br>\n                                # yaklaşık 0.29!</br>\n</code> <br/>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nhelp(chisq.test, package ='caret')      \n"
  }
}