{
  "title": "N Modelleri Karşılaştır",
  "navigation": "N Modelleri Karşılaştır",
  "label1": "N modellerini karşılaştırır.",
  "label2": "Aşağıdaki sınıflardan modelleri seçin (R sınıfı aşağıda parantez içinde)",
  "label3": "Doğrusal modeller (lm), Genelleştirilmiş doğrusal model (glm), Doğrusal karışık etkiler modeli (lme), Sıralı Lojistik veya Probit Regresyon (polr), Orantılı tehlike modeli (coxph), Genelleştirilmiş en küçük kareler kullanarak doğrusal model (gls), Hayatta kalma regresyon modeli (survreg), Yerel Polinom Regresyon Uygulaması (loess), Doğrusal olmayan en küçük kareler modeli (nls), Çoklu Log-Doğrusal Modeller (multinom)",
  "label4": "**NOT: Model Tuning (sınıf train) ile oluşturulan modeller desteklenmemektedir",
  "modelselector1": "Karşılaştırmak için bir veya daha fazla model seçin:",
  "help": {
    "title": "N Modelleri Karşılaştır",
    "r_help": "help(anova,package='stats')",
    "body": "\n                <b>\n2 iç içe modeli F veya Chi-kare testi kullanarak karşılaştırır. F testleri en küçük kareler tahmini için, chi-kare testleri maksimum olasılık tahmini için kullanılır. Her iki model de aynı veri kümesinde oluşturulmalıdır, çünkü eksik değerlerdeki farklılıklar sorunlara yol açabilir.</b></br>\n<b>Açıklama</b></br>\nAnova Tabloları: Bir model nesnesi için varyans analizi tablolarını hesaplar ve olasılık oranı testleri gerçekleştirir.  \n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nanova(object, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nobject:  bir model uyum fonksiyonu (örneğin, lm veya glm) tarafından döndürülen sonuçları içeren bir nesne.\n</li>\n</ul>\n<b>Değer</b><br/>\nBu (genel) fonksiyon, anova sınıfından bir nesne döndürür. Bu nesneler, varyans analizi ve sapma analizi tablolarını temsil eder. Tek bir argüman verildiğinde, model terimlerinin anlamlı olup olmadığını test eden bir tablo üretir. Bir nesne dizisi verildiğinde, anova belirtilen sırada modelleri birbirine karşı test eder.<br/>\nAnova nesneleri için print yöntemi, tabloları 'güzel' bir biçimde yazdırır.<br/>\n<b>Uyarı</b><br/>\nİki veya daha fazla model arasındaki karşılaştırma yalnızca aynı veri kümesine uyduğunda geçerli olacaktır. Bu, eksik değerler varsa ve R'nin varsayılan na.action = na.omit kullanılıyorsa bir sorun olabilir.<br/>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nDetaylı yardım için bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya R sözdizimi editöründe aşağıdaki komutu çalıştırın help(anova,package='stats')</br></br>\n<b>Açıklama</b></br>\nİç içe Modellerin Olasılık Oranı Testi: lrtest, olasılık oranı testlerini gerçekleştirmek için genel bir fonksiyondur. Varsayılan yöntem, iç içe (genelleştirilmiş) doğrusal modelleri karşılaştırmak için kullanılabilir (aşağıdaki detaylara bakın).\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nlrtest(object, ...)<br/>\n## Varsayılan S3 yöntemi:<br/>\nlrtest(object, ..., name = NULL) <br/>\n## 'formül' sınıfı için S3 yöntemi<br/>\nlrtest(object, ..., data = list())<br/>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nobject: bir nesne. Detaylar için aşağıya bakın.\n</li>\n<li>\n...: yöntemlere geçirilen daha fazla nesne tanımı. Detaylar için aşağıya bakın.\n</li>\n<li>\nname: bir uyumlu model nesnesinden uygun bir isim/açıklama çıkarmak için bir fonksiyon. Varsayılan olarak isim, formül çağrılarak sorgulanır.\n</li>\n<li>\ndata: modeldeki değişkenleri içeren bir veri çerçevesi.\n</li>\n</ul>\n<b>Detaylar</b></br>\nlrtest, modellerin asimptotik olasılık oranı testleri aracılığıyla karşılaştırılması için genel bir fonksiyon olarak tasarlanmıştır. Varsayılan yöntem, uyumlu model nesnesini, ...'da geçirilen modellerle ardışık olarak karşılaştırır. ...'da uyumlu model nesneleri geçmek yerine, birkaç başka tanım da mümkündür. Güncelleme mekanizması, waldtest için olduğu gibidir: ...'da belirtilen modeller, önceki modelden çıkarılması gereken terimler için tam sayılar, karakterler (her ikisi de), güncelleme formülleri veya uyumlu model nesneleri olarak belirtilebilir. Son durum dışında, bir güncelleme yönteminin var olduğu varsayılmaktadır. Detaylar için waldtest'e bakın.<br/>\nSonrasında, her iki ardışık model için bir asimptotik olasılık oranı testi gerçekleştirilir: Log-olasılıkların (logLik yöntemleri tarafından türetilen) iki katı farkı, bir Chi-kare dağılımı ile karşılaştırılır.<br/>\n\"formül\" yöntemi önce bir lm uydurur ve ardından varsayılan yöntemi çağırır.<br/>\n<b>Değer</b><br/>\nLog-olasılık, serbestlik dereceleri, serbestlik derecelerindeki fark, olasılık oranı Chi-kare istatistiği ve karşılık gelen p değeri içeren \"anova\" sınıfından bir nesne.<br/>\n<b>Örnekler</b><br/>\n<code> \n## Greene (1993) verileri ile:<br/>\n## verileri yükle ve gecikmeleri hesapla<br/>\ndata(\"USDistLag\")<br/>\nusdl <- na.contiguous(cbind(USDistLag, lag(USDistLag, k = -1)))<br/>\ncolnames(usdl) <- c(\"con\", \"gnp\", \"con1\", \"gnp1\")<br/>\nfm1 <- lm(con ~ gnp + gnp1, data = usdl)<br/>\nfm2 <- lm(con ~ gnp + con1 + gnp1, data = usdl)<br/>\n## LR testinin çeşitli eşdeğer tanımları<br/>\nlrtest(fm2, fm1)<br/>\nlrtest(fm2, 2)<br/>\nlrtest(fm2, \"con1\")<br/>\nlrtest(fm2, . ~ . - con1)<br/>\n</code> <br/>\n                "
  }
}