{
  "title": "Rekabetçi Riskler, grupları karşılaştır",
  "navigation": "Rekabetçi Riskler, grupları karşılaştır",
  "timevar": "Olay veya sansür için zaman",
  "eventvar": "Olaylar (0 = sansür, 1 = olay 1, 2 = olay 2, ...)",
  "groupvarlabel": "Grup",
  "eventnum": "Olay Kodu",
  "singleeventchkbox": "Tek Olay için Grafik Çiz",
  "printallest": "Tüm Zamanları İçeren Tahmin Tablosu",
  "printspecest": "Belirli Zamanlar için Tahmin Tablosu",
  "spectimes": "Zamanları time1, time2, time3, vb. olarak veya seq(1,5,by=1) şeklinde belirtin",
  "styleoptions": "Stil Seçenekleri",
  "axisoptions": "Eksen Seçenekleri",
  "titleboxall": "Grafik Başlığı (tüm olay grafikleri)",
  "titleboxsingle": "Grafik Başlığı (tek olay grafiği)",
  "plottitlesizelabel": "Grafik Başlığı Boyutu (5-50)",
  "themedropdown": "Grafik Teması",
  "label1": "Efsane",
  "legendpos": "Pozisyon",
  "keywidthlabel": "Anahtar Genişliği (cm; birleştirilmiş grafik yalnızca)",
  "legendeventslabel": "Olaylar",
  "legendtitle": "Başlık",
  "eventlabels": "Etiketler (olay kodlarının sırasına göre virgülle ayrılmış etiketleri belirtin: örneğin 'Olay 1', 'Olay 2', vb; sansür kodu değil)",
  "legendgroupslabel": "Gruplar",
  "grouplabels": "Etiketler (grupların sırasına göre virgülle ayrılmış etiketleri belirtin: örneğin 'Grup 1', 'Grup 2', vb.)",
  "legendfontsize": "Efsane Etiketleri Boyutu (5-50)",
  "wraplabelfontsize": "Olay için Grafik Etiket Boyutu (5-50)",
  "label2": "Riskteki Sayı",
  "natriskchkbox": "Riskteki Sayıyı Dahil Et",
  "risktableprop": "Risk Tablosu Yüksekliği(0-1)",
  "risktablevaluesize": "Risk Tablosu Değer Boyutu (1-15)",
  "risktabletitlesize": "Risk Tablosu Başlık Boyutu (5-50)",
  "risktableaxislabelsize": "Risk Tablosu Eksen Etiketi Boyutu (5-50)",
  "risktableticklabelsize": "Risk Tablosu İşaretleme Etiketi Boyutu (5-50)",
  "risktableclean": "Risk Tablosundan Eksenleri ve Izgara Çizgilerini Kaldır",
  "label3": "Çizgi Seçenekleri",
  "linesize": "Boyut (0-5)",
  "colorpalette": "Renk Paleti",
  "label4": "Güven Aralığı",
  "cichkbox": "95% CI Dahil Et",
  "labelblank": "",
  "cistyle": "Stil",
  "citransparency": "Şeffaflık (0-1)",
  "censorlabel": "Sansürlenmiş Zamanlar",
  "censorchkbox": "Sansürlenmiş Zamanları Dahil Et",
  "censorsize": "Boyut (0-10)",
  "pvaluelabel": "P-Değeri (tek olay grafiği yalnızca)",
  "pvaluechkbox": "p-değerini Dahil Et",
  "pvaluelocationx": "X-Eksen (Zaman) Konumu",
  "pvaluelocationy": "Y-Eksen (Olasılık) Konumu",
  "pvaluesize": "Boyut (1-20)",
  "pvalueaccuracy": "Hassasiyet (0-1)",
  "label5": "İnsidans Eksen",
  "incaxislabelall": "Etiket (tüm olay grafikleri)",
  "incaxislabelsingle": "Etiket (tek olay grafiği)",
  "label6": "Ölçek",
  "defbutton": "oran",
  "pctbutton": "yüzde",
  "label7": "Eksen Sınırları ve İşaretleme İşareti Artışları (0-1)",
  "incaxismin": "Minimum",
  "incaxismax": "Maksimum",
  "incaxisinc": "Artış",
  "label8": "Zaman Eksen",
  "timeaxislabel": "Etiket",
  "label9": "Eksen Sınırları ve İşaretleme İşareti Artışları",
  "timeaxismin": "Minimum",
  "timeaxismax": "Maksimum",
  "timeaxisinc": "Artış",
  "label10": "Not: Maksimum, Artış belirtilmeden belirtilebilir. Artış, Maksimum belirtilmeden belirtilemez.",
  "axislabelsize": "Eksen Etiketi Boyutu (5-50)",
  "ticklabelsize": "Eksen İşaretleme Etiketi Boyutu (5-50)",
  "help": {
    "title": "Rekabetçi Riskler, Grupları Karşılaştır",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n            <br/>\n            Rekabetçi bir risk, birincil ilgi olayının gerçekleşmesini engelleyen bir olaydır. Bu tür durumlarda standart Kaplan-Meier analizi yanlıdır ve olay riskini aşırı tahmin eder. Bu diyalog, bir veya daha fazla rekabetçi riskin mevcut olduğu durumlarda, takip başlangıcından (veya zaman sıfır) sonra birincil olayın kümülatif riskini tahmin etmek için kullanılır. Her olay için kümülatif insidansların toplamı, herhangi bir olay için kümülatif insidansı eşitler. Konular, zaman sıfırdan itibaren tüm olaylar için risk altında olmalıdır. Tüm olaylar için kümülatif insidans grafikleri (her olay için ayrı eğriler aynı grafikte) ve isteğe bağlı olarak belirli bir olay için sağlanır. \n            <br/>\n            Rekabetçi riskler konusuna giriş \"Rekabetçi Riskler Mevcutken Hayatta Kalma Verilerinin Analizi\" adlı Peter Austin ve diğerleri tarafından yazılmıştır, Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Olay veya sansür için zaman:</b> Her konu için, bir olay gerçekleştiyse ilk olaya kadar geçen süre veya olay gerçekleşmediyse son takip süresi.\n            <br/><br/>\n            <b>Olaylar:</b> Hangi olayın gerçekleştiğini gösteren sayısal gösterge (1=olay 1, 2=olay 2, vb.) veya olay gerçekleşmediğinde (0=sansür) her konu için\n            <br/><br/>\n            <b>Tek Olay için Grafik Çiz:</b> Belirli bir olay için kümülatif insidansı yalnızca çizmek isteyip istemediğiniz. <b>Olay Kodu</b>, çizilecek olaya karşılık gelir.\n            <br/><br/>\n            <b>Tüm Zamanları İçeren Tahmin Tablosu:</b> Veri setindeki her gözlemlenen zaman için kümülatif insidans olasılıklarını ve %95 güven aralıklarını listeleyen bir tabloyu dahil etme seçeneği\n            <br/>\n            <br/>\n\t\t\t<b>Belirli Zamanlar için Tahmin Tablosu:</b> Kullanıcı tarafından seçilen bir zaman seti için kümülatif insidans olasılıklarını içeren bir tabloyu dahil etme seçeneği.\n\t\t\t<br/><br/>\n\t\t\t<b>Zamanları time1, time2, time3, vb. olarak veya seq(1,5,by=1) şeklinde belirtin:</b> Bu, belirli zamanlar için tabloda yer alacak belirli zamanlardır. Virgülle ayrı olarak veya eşit aralıklı değerler dizisi olarak belirtilebilir.\n\t\t\t<br/><br/>\t\t\t\n            Tablolar, örnek boyutu, her olay için konu sayısı, kısıtlı ortalama süre ve medyan takip süresi ile birlikte verilir. Medyan takip süresi, gerçek olayları sansürlü gözlemler olarak ve gerçek sansürlü gözlemleri olaylar olarak ele alan ters Kaplan-Meier tahmincisi kullanılarak hesaplanır. Böylece, bu tahmincideki \"olay\", \"çalışma süresince konuları takip etme\" anlamına gelir.\n            <br/>\n            Veri setindeki her gözlemlenen zaman için %95 güven aralıkları ile birlikte kümülatif insidans tahminleri tablosu sağlanır. \n            <br/>\n            <br/>\n            <b>Gerekli R Paketleri:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n\t\t\t<br/>\n            <br/>\n            <br/>\n            <b>Stil Seçenekleri</b>\n            <br/>\n            <br/>\n            <b>Grafik Başlığı (tüm olay grafikleri):</b> Tüm olayları gösteren grafiklerin başlığı; başlık olmaması için tüm metni silin\n            <br/><br/>\n            <b>Grafik Başlığı (tek olay grafiği):</b> Seçilen tek olayı gösteren grafiğin başlığı; başlık olmaması için tüm metni silin\n\t\t\t<br/><br/>\n\t\t\t<b>Grafik Başlığı Boyutu:</b> Grafik başlıklarının boyutu.\n\t\t\t<br/><br/>\n            <b>Grafik Teması:</b> Grafiğin genel stili\n            <br/><br/>\n            <b>Efsane seçenekleri:</b>\n            <br/>\n            <b>Pozisyon</b> seçeneği, efsanenin konumunu (üst, alt, sol, sağ) kontrol eder. <b>Anahtar Genişliği</b>, tüm olayları ve tüm grupları birleştiren grafikte efsane anahtarlarının genişliğini değiştirmek için kullanılır. Bu, efsanede çizgi türlerini daha okunabilir hale getirmek için kullanılabilir.\n\t\t\t<b>Olay Başlığı</b>, olayları ayıran efsane kısmı için başlıktır. <b>Grup Başlığı</b>, grupları ayıran efsane kısmı için başlıktır. İstenmiyorsa metni silin. <b>Olay Etiketleri</b>, her sayısal olay kodu için kodlar yerine metin göstermek için kullanılır. <b>Grup Etiketleri</b>, grupların metnini değiştirmek için kullanılır. Herhangi bir etiket belirtirseniz, tüm etiketler belirtilmelidir.\n\t\t\t<b>Efsane Etiketleri Boyutu</b> seçeneği, efsanede bulunan tüm metinlerin boyutunu kontrol eder.\n\t\t\t<b>Olay için Grafik Etiket Boyutu</b> seçeneği, olay türüne göre döşenen grafikte olay adı metninin boyutunu kontrol eder.\n            <br/>\n            <br/>\n            <b>Riskteki Sayı:</b>\n\t\t\t<br/>\n\t\t\tGrafiklerin alt kısmında zamanla hala risk altında olan konu sayısı için isteğe bağlı olarak bir tablo dahil edin. Bu, alan ve okunabilirlik nedenleriyle olay döşenen grafik için sağlanmaz. <b>Risk Tablosu Yüksekliği</b>, tablonun kaplayacağı grafik alanının oranını kontrol eder.\n\t\t\t<b>Risk Tablosu Değer Boyutu</b>, riskteki sayıların boyutunu kontrol eder. <b>Risk Tablosu Başlık Boyutu</b>, riskteki sayı tablosunun başlığının boyutunu kontrol eder.\n\t\t\t<b>Risk Tablosu Eksen Etiketi Boyutu</b>, eksen etiketlerinin boyutunu kontrol eder. \n\t\t\t<b>Risk Tablosu İşaretleme Etiketi Boyutu</b>, işaretleme etiketlerinin boyutunu kontrol eder. Tüm eksenleri ve ızgara çizgilerini kaldırmak isteniyorsa, <b>Risk Tablosundan Eksenleri ve Izgara Çizgilerini Kaldır</b> seçeneği işaretlenebilir. Bu, tabloda yalnızca riskteki sayıları içerecektir.           \n            <br/><br/>\n            <b>Çizgi Seçenekleri:</b>\n            <br/>\n            <b>Boyut</b> kalınlığı kontrol eder. <b>Renk Paleti</b> seçeneği, tüm grafiklerdeki çizgiler için kullanılan renk paletini kontrol eder. Bilimsel dergileri taklit eden renk şemaları da sağlanır. Tahminler için isteğe bağlı olarak %95 güven aralığı dahil edilebilir, bu ya <b>şerit</b> (gölgelik alan) ya da <b>adım</b> (çizgi) formatında olabilir. <b>Şeffaflık</b>, şeridin ne kadar koyu olduğunu kontrol eder ve adım seçeneği seçildiğinde göz ardı edilir.\n\t\t\t<br/><br/>\n\t\t\t<b>Sansürlenmiş Zamanları Dahil Et:</b> Sansürlenmiş zamanlar (konuların olaylar için artık risk altında olmadığı zamanlar) çizgiler üzerinde artı işareti olarak dahil edilebilir. Bu, daha küçük veri setlerinde veya daha az sayıda sansürlü konu durumlarında daha faydalıdır. Tüm olayları ve grupları üst üste getiren grafikte okunabilirlik nedenleriyle sağlanmaz.\n\t\t\t<b>Boyut</b>, sansürlenmiş zaman artı işaretlerinin boyutunu kontrol eder.\n\t\t\t<br/><br/>\n\t\t\t<b>p-değerini Dahil Et</b>, seçilen olayın tek olay grafiğindeki Gray'ın testi p-değerini dahil etmek için kullanılabilir. <b>X-Eksen (Zaman) Konumu</b> ve <b>Y-Eksen (Olasılık) Konumu</b>, grafikte p-değerinin (X, Y) koordinatlarını sağlar.\n\t\t\t<b>Boyut</b>, grafikteki p-değerinin boyutunu kontrol eder. <b>Hassasiyet</b>, p-değerinin hassasiyetini kontrol eder. Örneğin, 0.0001 varsayılan değeri, p-değerlerinin 0.0001'den daha küçük olmamasını gösterir. 0.0001'den daha küçük herhangi bir p-değeri \"p<0.0001\" olarak gösterilecektir. \n            <br/><br/><br/>\n\t\t\t<b>Eksen Seçenekleri</b>\n            <br/>\n            <br/>\n            <b>Etiket</b> seçenekleri, eksen için metin etiketini belirtir. <b>Eksen Sınırları</b>, eksenin minimum ve maksimum değerlerini belirtir. <b>İşaretleme İşareti Artışları</b> seçeneği, eksendeki işaretleme işaretlerinin aralığını kontrol eder. Zaman eksenindeki artışlar, isteğe bağlı riskteki sayı tablosu için zamanları da kontrol eder.\n            <br/>\n            İnsidans ekseni <b>Ölçek</b> seçeneği, tahminlerin oran (0-1) veya yüzde (0-100) ölçeğinde olmasını isteyip istemediğinizi belirtir.\n\t\t\t<br/><br/>\n\t\t\t<b>Eksen Etiketi Boyutu:</b> Bu, hem insidans hem de zaman ekseni etiket boyutlarını kontrol eder.\n\t\t\t<br/><br/>\n\t\t\t<b>Eksen İşaretleme Etiketi Boyutu:</b> Bu, hem insidans hem de zaman ekseni işaretleme etiketi boyutlarını kontrol eder."
  }
}