{
  "title": "Hedef yanıtı elde etmek için model değişken değerlerini hesapla",
  "navigation": "Hedef yanıtı hesapla",
  "label100": "Bu diyalog, modelin hedef yanıt değerini elde etmek için model değişkenlerini hesaplar\nNot: Seçilen modelde herhangi bir sayısal olmayan değişken varsa,\n         hedef yanıt hesaplaması daha uzun sürecektir",
  "modelSelection": "Optimal değişken değerlerini hesaplamak için bir model seçin",
  "targetResponse": "Seçilen model için istenen hedef yanıt değerini (sayısal) belirtin",
  "targetResponseLower": "(İsteğe bağlı) Seçilen model için istenen alt hedef yanıt değerini (sayısal) belirtin",
  "targetResponseUpper": "(İsteğe bağlı) Seçilen model için istenen üst hedef yanıt değerini (sayısal) belirtin",
  "label200": "Hedef Yanıt Optimizatörü Kısıtlamaları",
  "label12": "Seçilen modeldeki değişkenler (faktörler) aşağıda modelde göründüğü sırayla listelenmiştir",
  "factorConstraintUseDatasetLowerChk": "Alt Sınır Kısıtlamaları: İşaretlenirse, modelde kullanılan her değişkenin minimum (sadece sayısal değişkenler için) değeri alt sınır olarak kullanılacaktır",
  "factorConstraintLower": "Alt Sınır Kısıtlamaları: (Yukarıda işaretlenirse göz ardı edilir) Model değişkeni (yani faktörler) değerleri için alt sınırda kısıtlama olmaması için boş bırakın. Aksi takdirde, her model değişkeni için virgülle ayrılmış değerler yazmalısınız. Belirli bir model değişkeninin alt sınırı yoksa, -Inf yazın örn. 0, 0.1, -Inf, 20",
  "factorConstraintUseDatasetUpperChk": "Üst Sınır Kısıtlamaları: İşaretlenirse, modelde kullanılan her değişkenin maksimum (sadece sayısal değişkenler için) değeri üst sınır olarak kullanılacaktır",
  "factorConstraintUpper": "Üst Sınır Kısıtlamaları: (Yukarıda işaretlenirse göz ardı edilir) Model değişkeni (yani faktörler) değerleri için üst sınırda kısıtlama olmaması için boş bırakın. Aksi takdirde, her model değişkeni için virgülle ayrılmış değerler yazmalısınız. Belirli bir model değişkeninin üst sınırı yoksa, Inf yazın örn. 0, 0.2, 0.9, Inf",
  "factorInitalValues": "Başlangıç Değerleri: Model değişkeni (sadece sayısal değişkenler için) değerleri için sistemin başlangıç değerlerini seçmesi için boş bırakın (varsayılan: tüm sıfırlar). Aksi takdirde, her model değişkeni için virgülle ayrılmış değerler yazmalısınız örn. 0, 0, 0, 0",
  "confidenceLevel": "Güven düzeyi",
  "showModelEquationChk": "Model denklemini göster (model kategorik değişkenler içeriyorsa, denklem görünmeyebilir)",
  "help": {
    "title": "Seçilen model için hedef yanıt için model değişkeni (faktörler) değerlerini hesapla",
    "r_help": "help(optim, package = 'stats')",
    "body": "\n        "
  }
}