{
  "title": "Hedef yanıtı elde etmek için model değişken değerlerini hesapla",
  "label100": "Bu diyalog, modelin hedef yanıt değerine ulaşmak için model değişkenlerini hesaplar\nNot: Seçilen modelde herhangi bir sayısal olmayan değişken varsa, hedef yanıt hesaplaması başarısız olacaktır",
  "navigation": "Hedef yanıtı hesapla",
  "modelSelection": "Optimal değişken değerlerini hesaplamak için bir model seçin",
  "targetResponse": "Seçilen model için istenen hedef yanıt değerini (sayısal) belirtin",
  "targetResponseLower": "(Opsiyonel) Seçilen model için istenen alt hedef yanıt değerini (sayısal) belirtin",
  "targetResponseUpper": "(Opsiyonel) Seçilen model için istenen üst hedef yanıt değerini (sayısal) belirtin",
  "label200": "Hedef Yanıt Optimizatörü Kısıtlamaları",
  "label12": "Seçilen modeldeki değişkenler (faktörler) aşağıda modelde göründüğü sırayla listelenmiştir",
  "factorConstraintUseDatasetLowerChk": "Alt Sınır Kısıtlamaları: İşaretlenirse, modelde kullanılan her değişkenin minimum değeri alt sınır olarak kullanılacaktır",
  "factorConstraintLower": "Alt Sınır Kısıtlamaları: (Yukarıda işaretlenirse göz ardı edilir) Model değişkeni (yani faktörler) değerleri için alt sınırda kısıtlama olmaması için boş bırakın. Aksi takdirde, her model değişkeni için virgülle ayrılmış değerler yazmalısınız. Belirli bir model değişkeninin alt sınırı yoksa, -Inf yazın örn. 0, 0.1, -Inf, 20",
  "factorConstraintUseDatasetUpperChk": "Üst Sınır Kısıtlamaları: İşaretlenirse, modelde kullanılan her değişkenin maksimum değeri üst sınır olarak kullanılacaktır",
  "factorConstraintUpper": "Üst Sınır Kısıtlamaları: (Yukarıda işaretlenirse göz ardı edilir) Model değişkeni (yani faktörler) değerleri için üst sınırda kısıtlama olmaması için boş bırakın. Aksi takdirde, her model değişkeni için virgülle ayrılmış değerler yazmalısınız. Belirli bir model değişkeninin üst sınırı yoksa, Inf yazın örn. 0, 0.2, 0.9, Inf",
  "factorInitalValues": "Başlangıç Değerleri: Model değişkeni (yani faktörler) değerleri için sistemin başlangıç değerlerini seçmesi için boş bırakın (varsayılan: hepsi sıfır). Aksi takdirde, her model değişkeni için virgülle ayrılmış değerler yazmalısınız örn. 0, 0, 0, 0",
  "help": {
    "title": "Seçilen model için hedef yanıt için model değişkeni (faktörler) değerlerini hesapla",
    "r_help": "help(optim, package = 'stats')",
    "body": "\n        "
  }
}