{
  "title": "Rekabetçi Riskler, bir grup",
  "navigation": "Rekabetçi Riskler, bir grup",
  "timevar": "Olay veya sansür için zaman",
  "eventvar": "Olaylar (0 = sansür, 1 = olay 1, 2 = olay 2, ...)",
  "eventnum": "Olay Kodu",
  "singleeventchkbox": "Tek Olay için Grafik Çiz",
  "printallest": "Tüm Zamanları İçeren Tahmin Tablosu",
  "printspecest": "Belirli Zamanlar için Tahmin Tablosu",
  "spectimes": "Zamanları time1, time2, time3, vb. olarak veya seq(1,5,by=1) olarak belirtin",
  "styleoptions": "Stil Seçenekleri",
  "axisoptions": "Eksen Seçenekleri",
  "label12": "Örnek veri setleri ve desteklenen veri formatı hakkında ayrıntılar için iletişim kutusunun sağ üst köşesindeki ? düğmesine tıklayın.",
  "titleboxall": "Grafik Başlığı (tüm olaylar grafiği)",
  "titleboxsingle": "Grafik Başlığı (tek olay grafiği)",
  "plottitlesizelabel": "Grafik Başlığı Boyutu (5-50)",
  "themedropdown": "Grafik Teması",
  "label1": "Efsane (tüm olaylar grafiği)",
  "legendpos": "Pozisyon",
  "legendtitle": "Başlık",
  "eventlabels": "Olay Etiketleri (olay kodlarının sırasına göre virgülle ayrılmış etiketleri belirtin: örneğin 'Olay 1', 'Olay 2', vb; sansür kodu değil)",
  "legendfontsize": "Efsane Etiketleri Boyutu (5-50)",
  "label2": "Riskteki Sayı",
  "natriskchkbox": "Riskteki Sayıyı Dahil Et",
  "risktableprop": "Risk Tablosu Yüksekliği (0-1)",
  "risktablevaluesize": "Risk Tablosu Değer Boyutu (1-15)",
  "risktabletitlesize": "Risk Tablosu Başlık Boyutu (5-50)",
  "risktableaxislabelsize": "Risk Tablosu Eksen Etiketi Boyutu (5-50)",
  "risktableticklabelsize": "Risk Tablosu İşaretleme Etiketi Boyutu (5-50)",
  "risktableclean": "Risk Tablosundan Eksenleri ve Izgara Çizgilerini Kaldır",
  "label3": "Çizgi Seçenekleri",
  "linesize": "Boyut (0-5)",
  "colorpalette": "Renk Paleti (tüm olaylar grafiği)",
  "linecolor": "Renk (tek olay grafiği)",
  "label4": "Güven Aralığı",
  "cichkbox": "95% CI dahil et",
  "labelblank": "",
  "cistyle": "Stil",
  "citransparency": "Şeffaflık (0-1)",
  "censorchkbox": "Sansürlü Zamanları Dahil Et",
  "label5": "İnsidans Eksen",
  "incaxislabelall": "Etiket (tüm olaylar grafiği)",
  "incaxislabelsingle": "Etiket (tek olay grafiği)",
  "label6": "Ölçek",
  "defbutton": "oran",
  "pctbutton": "yüzde",
  "label7": "Eksen Sınırları ve İşaretleme İşareti Artışları (0-1)",
  "incaxismin": "Minimum",
  "incaxismax": "Maksimum",
  "incaxisinc": "Artış",
  "label8": "Zaman Eksen",
  "timeaxislabel": "Etiket",
  "label9": "Eksen Sınırları ve İşaretleme İşareti Artışları",
  "timeaxismin": "Minimum",
  "timeaxismax": "Maksimum",
  "timeaxisinc": "Artış",
  "label10": "Not: Maksimum, Artış belirtilmeden belirtilebilir. Artış, Maksimum belirtilmeden belirtilemez.",
  "axislabelsize": "Eksen Etiketi Boyutu (5-50)",
  "ticklabelsize": "Eksen İşaretleme Etiketi Boyutu (5-50)",
  "help": {
    "title": "Rekabetçi Riskler, Bir Grup",
    "r_help": "help(survfit, package = 'survival')",
    "body": "\n\t\t\tYükleme dizinindeki örnek veri setine bakın, varsayılan konum sürücü harfi:\\program files\\BlueSky Statistics\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\melanoma_upd.RData. Zaman değişkeni, olay veya sansür için zaman olarak girilmeli ve ölüm değişkeni Olaylar olarak girilmelidir.<br/>\t\t\t\n            Bu veri seti, MASS paketindeki melanoma veri setinin güncellenmiş bir versiyonudur.\n            <br/>\n            <br/>\n            Rekabetçi bir risk, birincil ilgi olayının gerçekleşmesini engelleyen bir olaydır. Bu tür durumlarda standart Kaplan-Meier analizi yanlıdır ve olay riskini aşırı tahmin eder. Bu iletişim kutusu, bir veya daha fazla rekabetçi riskin mevcut olduğu durumlarda, takip başlangıcından (veya zaman sıfır) sonra birincil olayın gerçekleşme kümülatif riskini tahmin etmek için kullanılır. Her olay için kümülatif insidansların toplamı, herhangi bir olay için kümülatif insidansı eşitler. Konular, zaman sıfırdan itibaren tüm olaylar için risk altında olmalıdır. Tüm olaylar için kümülatif insidans grafikleri (her olay için ayrı eğriler aynı grafikte) ve isteğe bağlı olarak belirli bir olay için sağlanır. \n            <br/>\n            Rekabetçi riskler konusuna giriş \"Rekabetçi Risklerin Varlığında Hayat Verisi Analizi\" adlı Peter Austin ve diğerleri tarafından yazılmıştır, Circulation, 2016; 133:601-609. \n            <br/>\n            <br/>\n            <b>Olay veya sansür için zaman:</b> Her bir konu için, bir olay gerçekleştiyse ilk olay için geçen süre veya olay gerçekleşmediyse son takip süresi.\n            <br/><br/>\n            <b>Olaylar:</b> Hangi olayın gerçekleştiğini gösteren sayısal gösterge (1=olay 1, 2=olay 2, vb.) veya olay gerçekleşmediğinde (0=sansür) her bir konu için\n            <br/><br/>\n            <b>Tek Olay için Grafik Çiz:</b> Belirli bir olay için kümülatif insidansı yalnızca kendisi için çizmek isteyip istemediğinizi belirtir. <b>Olay Kodu</b>, çizilecek olaya karşılık gelir.\n            <br/><br/>\n            <b>Tüm Zamanları İçeren Tahmin Tablosu:</b> Veri setindeki her gözlemlenen zaman için kümülatif insidans olasılıklarını ve %95 güven aralıklarını listeleyen bir tablo dahil etme seçeneği\n            <br/>\n            <br/>\n\t\t\t<b>Belirli Zamanlar için Tahmin Tablosu:</b> Kullanıcı tarafından seçilen bir zaman seti için hayatta kalma tahmin olasılıklarını içeren bir tablo dahil etme seçeneği.\n\t\t\t<br/><br/>\n\t\t\t<b>Zamanları time1, time2, time3, vb. olarak veya seq(1,5,by=1) olarak belirtin:</b> Bu, belirli zamanlar için tabloda yer alacak belirli zamanlardır. Tek tek virgüllerle belirtilebilir veya eşit aralıklı değerlerin bir dizisi olarak belirtilebilir.\n\t\t\t<br/><br/>\n            Tablolar, örnek boyutu, her olayla ilgili konu sayısı, kısıtlı ortalama süre ve medyan takip süresi ile birlikte çıktılanır. Medyan takip süresi, gerçek olayları sansürlü gözlemler olarak ve gerçek sansürlü gözlemleri olaylar olarak ele alan ters Kaplan-Meier tahmincisi kullanılarak hesaplanır. Böylece, bu tahmincideki \"olay\", \"çalışmanın mümkün olduğu kadar sürece konuları takip etme\"dir.\n            <br/>\n            Veri setindeki her gözlemlenen zaman için %95 güven aralıkları ile birlikte kümülatif insidans tahminleri tablosu sağlanır. \n            <br/>\n            <br/>\n            <b>Gerekli R Paketleri:</b> survival, broom, survminer, dplyr, forcats, arsenal, ggthemes, ggsci, RColorBrewer, scales\n            <br/>\n            <br/>\n            <br/>\n            <b>Stil Seçenekleri</b>\n            <br/>\n            <br/>\n            <b>Grafik Başlığı (tüm olaylar grafiği):</b> Tüm olayları gösteren grafiğin başlığı; başlık olmaması için tüm metni silin\n            <br/><br/>\n            <b>Grafik Başlığı (tek olay grafiği):</b> Seçilen tek olayı gösteren grafiğin başlığı; başlık olmaması için tüm metni silin\n\t\t\t<br/><br/>\n\t\t\t<b>Grafik Başlığı Boyutu:</b> Grafik başlıklarının boyutu.\n\t\t\t<br/><br/>\n            <b>Grafik Teması:</b> Grafiğin genel stili\n            <br/><br/>\n            <b>Efsane seçenekleri:</b>\n            <br/>\n            <b>Pozisyon</b> seçeneği, efsanenin konumunu (üst, alt, sol, sağ) kontrol eder. <b>Başlık</b>, efsanenin başlığıdır. Başlığı kaldırmak için, metin kutusundan tüm metni kaldırın. <b>Olay Etiketleri</b>, her sayısal olay kodu için kodlar yerine metin göstermek için kullanılır. Herhangi bir etiket belirtirseniz, tüm olaylar etiketlenmelidir.\n\t\t\t<b>Efsane Etiketleri Boyutu</b> seçeneği, efsanede bulunan tüm metinlerin boyutunu kontrol eder.\n            <br/>\n            <br/>\n            <b>Riskteki Sayı:</b>\n\t\t\t<br/>\n\t\t\tGrafiklerin alt kısmında zamanla hala risk altında olan konu sayısı için isteğe bağlı olarak bir tablo dahil edin. <b>Risk Tablosu Yüksekliği</b>, tablonun alacağı grafik alanının oranını kontrol eder.\n\t\t\t<b>Risk Tablosu Değer Boyutu</b>, riskteki sayıların boyutunu kontrol eder. <b>Risk Tablosu Başlık Boyutu</b>, riskteki sayı tablosunun başlığının boyutunu kontrol eder.\n\t\t\t<b>Risk Tablosu Eksen Etiketi Boyutu</b>, eksen etiketlerinin boyutunu kontrol eder. \n\t\t\t<b>Risk Tablosu İşaretleme Etiketi Boyutu</b>, işaretleme etiketlerinin boyutunu kontrol eder. Tüm eksenleri ve ızgara çizgilerini kaldırmak isteniyorsa, <b>Risk Tablosundan Eksenleri ve Izgara Çizgilerini Kaldır</b> seçeneği işaretlenebilir. Bu, tabloda yalnızca riskteki sayıları içerecektir.           \n            <br/><br/>\n            <b>Çizgi Seçenekleri:</b>\n            <br/>\n            <b>Boyut</b>, kalınlığı kontrol eder. <b>Renk</b> seçenekleri, tüm olaylar grafiğindeki çizgilerin renk paletini ve tek olay grafiğindeki çizginin rengini kontrol eder. Bilimsel dergileri taklit eden renk şemaları da sağlanır. İsterse, tahminler için %95 güven aralığı, <b>şerit</b> (gölgelendirilmiş alan) veya <b>adım</b> (çizgi) formatında dahil edilebilir. <b>Şeffaflık</b>, şeridin ne kadar koyu olduğunu kontrol eder ve adım seçeneği seçildiğinde göz ardı edilir.\n\t\t\t<br/><br/>\n\t\t\t<b>Sansürlü Zamanları Dahil Et:</b> Sansürlü zamanlar (konuların olaylar için artık risk altında olmadığı zamanlar), her iki grafiğin zaman ekseninin yakınında bir halı olarak dahil edilebilir. Bu, daha küçük veri setlerinde veya daha az sayıda sansürlü konu durumlarında daha faydalıdır.\n            <br/><br/><br/>\n\t\t\t<b>Eksen Seçenekleri</b>\n            <br/>\n            <br/>\n            <b>Etiket</b> seçeneği, eksen için metin etiketini belirtir. <b>Eksen Sınırları</b>, eksenin minimum ve maksimum değerlerini belirtir. <b>İşaretleme İşareti Artışları</b> seçeneği, eksendeki işaretleme işaretlerinin aralığını kontrol eder. Zaman eksenindeki artışlar, isteğe bağlı riskteki sayı tablosu için zamanları da kontrol eder.\n            <br/>\n            İnsidans ekseni <b>Ölçek</b> seçeneği, tahminlerin oran (0-1) veya yüzde (0-100) ölçeğinde olup olmayacağını belirtir.\n\t\t\t<br/><br/>\n\t\t\t<b>Eksen Etiketi Boyutu:</b> Bu, hem insidans hem de zaman ekseni etiket boyutlarını kontrol eder.\n\t\t\t<br/><br/>\n\t\t\t<b>Eksen İşaretleme Etiketi Boyutu:</b> Bu, hem insidans hem de zaman ekseni işaretleme etiket boyutlarını kontrol eder.\t\t\t\t\n      "
  }
}