{
  "title": "Karakter Değişkenlerini Tarih ve Saat'e Dönüştür",
  "navigation": "Karakteri Tarih ve Saat'e Dönüştür",
  "label1": "Dönüştürülen değişkenler için bir ek veya ön ek seçin",
  "suffix": "Ek",
  "prefix": "Ön Ek",
  "prefixOrSuffix": "Bir ön ek veya ek girin",
  "Destination": "Tarihe dönüştürmek için karakter değişkenlerini seçin",
  "DateFormat": "Karakter dizisinin formatını seçin",
  "TimeZone": "Bir zaman dilimi seçin (varsayılan - hiçbir şey seçilmediğinde PC'nin yerel zaman dilimidir)",
  "advanced_lbl": "Gelişmiş",
  "help": {
    "title": "Karakteri Tarihe Dönüştür",
    "r_help": "help(strptime, package=\"base\")",
    "body": "\n<b>Açıklama</b></br>\nBir karakteri tarihe (POSIXct sınıfı) dönüştürür. Bir karakter dizisinde saklanan tarihin formatını belirtmeniz gerekir.\nYukarıdaki fonksiyon, temel paket içindeki strptime'i dahili olarak çağırır. Birden fazla değişkeni desteklemek için strftime'i genişlettik.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nBSkystrptime <-function (varNames = \"\", dateFormat = \"\", timezone = \"\", prefixOrSuffix = \"suffix\", \n    prefixOrSuffixValue = \"\", data = \"\") \n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ndata: Bir karakter dizisi olarak veri setinin adı.\n</li>\n<li>\nvarNames: Tarihe dönüştürülmesi gereken karakter sınıfı değişken adları (POSIXct sınıfı)\n</li>\n<li>\ndateFormat: Bir karakter dizisi. Format yöntemleri için varsayılan \"%Y-%m-%d %H:%M:%S\"'dir, eğer herhangi bir öğe gece yarısı olmayan bir zaman bileşenine sahipse, aksi takdirde \"%Y-%m-%d\"'dir. Eğer options(\"digits.secs\") ayarlanmışsa, saniyeler için belirtilen sayıda basamak yazdırılacaktır.\n</li>\n<li>\ntimezone: Dönüştürme için kullanılacak zaman dilimini belirten bir karakter dizisi. Sistem spesifik (bkz. as.POSIXlt), ancak \"\" mevcut zaman dilimidir ve \"GMT\" UTC'dir. Geçersiz değerler genellikle UTC olarak işlenir, bazı platformlarda bir uyarı ile.\n</li>\n<li>\nprefixOrSuffix: Dönüştürülen POSIXct sınıfı değişkenleri için bir ön ek veya ek belirtir. Ya c(\"prefix\") ya da c(\"suffix\") alır. Yeni değişkenler, orijinal değişken adının bu ön ek/ek ile oluşturulur.\n</li>\n<li>\nprefixOrSuffixValue = Kullanılacak ön ek veya ekin adını belirten bir karakter vektörü.\n</li>\n</ul>\n<b>Paket</b></br>\nbas</br>\n<b>Yardım</b></br>\nyardım(strptime)\n"
  }
}