{
  "title": "Coxcomb Grafiği",
  "navigation": "Coxcomb",
  "x": "X ekseni değişken(ler)i, bir faktör değişken(ler)i belirtin",
  "y": "Y değişkeni, bir sayısal değişken belirtin",
  "fill": "Doldurma, bir faktör değişkeni belirtin",
  "alpha": "Opaklık (0-1)",
  "width": "Genişlik",
  "rdgrp1": "Doldurma oranları",
  "flip": "Eksenleri çevir",
  "barcolor": "Çubuk rengi (Renk seçimi yaptıktan sonra kontrolün dışına tıklayın)",
  "specify_a_title": "Bir başlık girin",
  "x_title": "X Ekseni Etiketi",
  "y_title": "Y Ekseni Etiketi",
  "Facetrow": "Facet satırı",
  "Facetcolumn": "Facet sütunu",
  "Facetwrap": "Facet sarmal",
  "Facetscale": "Facet ölçeği",
  "facets_lbl": "Facetler",
  "help": {
    "title": "Coxcomb Grafiği",
    "r_help": "help(coord_polar, package='ggplot2')",
    "body": "\n            <b>Açıklama</b></br>\nCoxcomb/Bulls Eye grafiği (veya daire grafiği), sayısal oranları göstermek için dilimlere/konkav dairelere bölünmüş dairesel bir istatistiksel grafiktir. Coxcomb/Bulls Eye grafiğinde, her konkav dairenin genişliği (ve dolayısıyla alanı), temsil ettiği miktara orantılıdır. Miktar, bir sayı veya yüzde olarak temsil edilebilir.</br>​\nFacetler, bir faktör değişkeni belirterek isteğe bağlı olarak oluşturulabilir. Ayrıca temaları isteğe bağlı olarak belirtebilir ve x ve y eksenleri için bir başlık ve etiketler belirtebilirsiniz.</br>\nBirden fazla x değişkeni belirttiğinizde, her x değişkeni için ayrı bir Coxcomb/Bulls Eye oluştururuz.</br>\n<b>Kullanım</b>\n<br/>\n<code>\n#Tek bir faktör değişkeni için bir Bulls Eye grafiği oluşturabilirsiniz, her faktör değişkeninin seviyesi için bir konkav daire oluşturulacaktır. Konkav dairenin genişliği, her faktör seviyesinin sayısına orantılıdır. Burada faktör değişkeni aşağıdaki gibi doldurma ile ilişkilendirilecektir<br/>\n#penguins, equatiomatic R paketinde bir veri kümesidir\nggplot(data=penguins,aes(x ='',fill=species)) +​\n                 geom_bar(alpha=1,width =0.9) +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"Sayı\",fill =\"var1\",title= \"Doldurma ile Bulls Eye Grafiği: tür\")​</br></br>\n#Y değişkeni olarak bir ölçek/sayısal değişken ve doldurma olarak bir faktör değişkeni belirterek bir Bulls Eye grafiği oluşturabilirsiniz. Burada, doldurma faktör değişkeninin her seviyesi için bir konkav daire oluşturulur. Konkav dairenin genişliği, faktör seviyesinin her seviyesindeki y değerlerinin toplamına orantılıdır. Burada faktör değişkeni aşağıdaki gibi doldurma ile ilişkilendirilecektir<br/>\nggplot(data=penguins,aes(x ='', y = bill_length_mm, fill = species)) +​\n                 geom_bar(alpha=1,width =0.9,stat=\"identity\") +​\n                 coord_polar(\"x\") +​\n                 labs(y =\"var1\",fill =\"var2\",title= \"X estetiği ile Bulls Eye grafiği:,Y estetiği: var1,Doldurma: var2\") </br></br>\n\n#Bir x değişkeni belirterek bir Coxcomb grafiği oluşturabilirsiniz, dilimler x değişkeninin her seviyesi için oluşturulur, her dilimin yarıçapı sayıya orantılıdır<br/>\n    ggplot(data=penguins, aes(x=island, )) +\n        geom_bar( alpha=1,width=1,) +\n        coord_polar(\"x\") +\n        labs(x=\"island\",  title= \"X estetiği ile Coxcomb grafiği: island\") +\n        xlab(\"island\") + ylab(\"Sayı\")</br></br>\n\n#Bir x değişkeni ve bir doldurma belirterek bir Coxcomb grafiği oluşturabilirsiniz. Dilimler x değişkeninin her seviyesi için oluşturulur. Her dilim, belirtilen doldurma değişkeninin her seviyesindeki durumların sayısı ile doldurulur.\nggplot(data=penguins, aes(x=island,fill=species )) +\n\tgeom_bar( alpha=1, width=1) +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\",  title= \"X estetiği ile Coxcomb grafiği: island doldurma: species\") +\n\txlab(\"island\") + ylab(\"Sayı\")</br></br>\n\n\n#Bir x değişkeni, y değişkeni ve doldurma belirterek bir Coxcomb grafiği oluşturabilirsiniz. Dilimler x değişkeninin her seviyesi için oluşturulur ve belirtilen doldurma değişkeninin her seviyesindeki y değişkeninin değerlerinin toplamı ile doldurulur. Dilimler, doldurma değişkeninin seviyelerine göre bölünür. Doldurma değişkeninin her seviyesinin dilim içindeki kapladığı alan, dilim ve doldurma değişkeni ile eşleşen y değişkeninin sayılarının toplamına orantılıdır.<br/>\nggplot(data=penguins, aes(x=island,y=bill_depth_mm,fill=species )) +\n\tgeom_bar( alpha=1,width=1,stat = \"identity\") +\n\tcoord_polar(\"x\") +\n\tlabs(x=\"island\", y=\"bill_depth_mm\", title= \"X estetiği ile Coxcomb grafiği: island Y estetiği: bill_depth_mm doldurma: species\") +\n\txlab(\"island\") + ylab(\"bill_depth_mm\")</br></br>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ndata: Varsayılan veri kümesi​\n</li>\n<li>\naes(): Verilerdeki değişkenlerin görsel özelliklere (estetikler) nasıl eşlendiğini tanımlayan estetik eşlemeleri oluşturur.​\n</li>\n<li>\nx: (İsteğe bağlı) Bir faktör/kategorik değişken. Çubuğun uzunluğu, faktör değişkeninin her seviyesinin sayısına karşılık gelir.​\n</li>\n<li>\nY: (İsteğe bağlı) bir sayısal değişken\n</li>\n<li>\ndoldurma: (İsteğe bağlı) x'deki seviyelerin sayısını gruplamak için isteğe bağlı bir faktör/kategorik değişken\n</li>\n<li>\ngeom_bar(): Çubuk grafiği oluşturur, position =\"fill\" çubuğu her gruplama seviyesinin yüzdesi ile doldurur.​\n</li>\n<li>\nCoor_polar(): Kutupsal koordinat sistemi, en yaygın olarak pasta grafiklerinde kullanılır, bu da kutupsal koordinatlarda bir yığılmış çubuk grafiğidir.\n</li>\n<li>\nLabs(): Eksen etiketlerini ve efsane başlıklarını değiştirir (bu isteğe bağlıdır)​\n</li>\n<li>\nfacet_grid(): Panelleri bir ızgarada düzenler (bu isteğe bağlıdır)​\n</li>\n<li>\ntheme_calc(): Hesap makinesi temasını belirtir (bu isteğe bağlıdır)​\n</li>\n<li>\ncoord_flip(): Eksenleri çevirir (bu isteğe bağlıdır)​\n</li>\n<li>\nalpha: opaklığı kontrol eder, 0-1 arasında değerler alır. 1, opaklık yoktur.\n</li>\n</ul>\n<b>Paket</b></br>\nggplot2;ggthemes;</br>\n<b>Yardım</b></br>\nhelp(coord_polar, package=ggplot2)</br>\nDiğer: Ayrıntılı R yardımı almak için R Yardım düğmesine tıklayın. Ayrıca help(labs), help(geom_bar),help(cord_polar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) yazabilirsiniz.​\n    "
  }
}