{
  "title": "Cox, Fine-Gray",
  "navigation": "Cox, Fine-Gray",
  "modelname": "Model adını girin",
  "timevar": "Olay için süre veya sansür",
  "eventvar": "Olaylar (0 = sansür, 1 = olay 1, 2 = olay 2, ...)",
  "eventcodelabel": "Olay Kodu",
  "modelterms": "Bağımsız değişkenler için model ifadesi oluşturucu",
  "stratavarslabel": "Stratifikasyon Değişkenleri (isteğe bağlı)",
  "weightvar": "Ağırlıklar (isteğe bağlı)",
  "tiemethod": "Bağlı Zaman Yöntemi",
  "diagnosticsbox": "Model Tanılamaları",
  "martminlabel": "Null Model Martingale Kalıntı Eksen Minimum Değeri (-Inf ile 1 arasında)",
  "anovachkboxlabel": "Sapma Analizi (Tip II)",
  "help": {
    "title": "Cox, Fine-Gray",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nZamanla olay verileri için, rekabet eden risklerin mevcut olduğu durumlarda sansürlü gözlemlerle birlikte Fine-Gray Cox orantılı tehlike modelini uydurur. Fine-Gray modelleri, \ncovariate'lerin kümülatif olay fonksiyonu üzerindeki etkisini modellemektedir. Alternatif olarak, covariate'lerin neden-spesifik tehlike üzerindeki etkisini modellemek için standart Cox regresyon modelleri \n kullanılabilir. Rekabet eden riskler konusuna giriş için \"Rekabet Eden Risklerin Varlığında Hayatta Kalma Verilerinin Analizine Giriş\" adlı esere bakabilirsiniz; Peter Austin, \net. al., Circulation, 2016; 133:601-609. \n<br/><br/>\nModel uyum istatistikleri, parametre tahminleri ve tehlike oranları sağlanmaktadır. Mevcut seçenekler arasında bağlı zaman yöntemi ve model tanılamaları bulunmaktadır. Model, \nsurvival paketindeki finegray ve coxph fonksiyonları kullanılarak uyum sağlanmaktadır.\n<br/><br/>\n<b>Model adını girin:</b> Sonuçların saklanacağı modelin adını belirtin.\n<br/><br/>\n<b>Olay için süre veya sansür:</b> Olay yaşayanlar için ilk olayın süresi veya olay yaşamayanlar için son takip süresi\n<br/><br/>\n<b>Olaylar (0 = sansür, 1 = olay 1, 2 = olay 2, ...):</b> Sayısal olay göstergesi; 0=sansür, 1=olay 1, 2=olay 2, vb.\n<br/><br/>\n<b>Olay Kodu:</b> Modellemek istediğiniz ilgi olayını seçin. Seçilebilir veya yazılabilir.\n<br/><br/>\n<b>Formül Oluşturucu:</b> Modelde yer alacak terimleri oluşturun. Faktörler, dizgiler ve mantıksal değişkenler dummy kodlanacaktır. Sağlanan butonlar, ana etkileri, tam faktöryel etkileri (ana etkiler ve ilgili değişkenlerle tüm etkileşimler), polinomları, belirli etkileşimleri belirtmenizi sağlar ve listedeki terimleri silmenize olanak tanır. Stratifikasyon değişkenleri ile etkileşimlere izin verilmektedir.\n<br/><br/>\n<b>Stratifikasyon Değişkenleri:</b> Bir veya daha fazla stratifikasyon değişkeni belirtin. Bunlar sayısal, faktör, sıralı faktör veya karakter değişkenleri olabilir. Strata, \nözgül gruplara ayırarak her grubun farklı bir temel tehlike fonksiyonuna sahip olmasını sağlar. Birden fazla stratifikasyon değişkeni verildiğinde, her stratifikasyon değişkeni seviyeleri kombinasyonu için ayrı bir temel tehlike fonksiyonu kullanılır.\n<br/><br/>\n<b>Ağırlıklar:</b> Gözlem ağırlıkları için sayısal değişken. Her kaydın bir gözlem olarak sayılmaması gereken durumlarda faydalıdır. \n<br/><br/>\n<b>Bağlı Zaman Yöntemi:</b> Bağlı gözlemlenen zamanları kırma yöntemi. Efron genellikle çok fazla bağlı zaman olmadığında daha iyi bir seçimdir.\n<br/><br/>\n<b>Model Tanılamaları:</b> Seçildiğinde, orantılı tehlikelerin ve covariate'lerin fonksiyonel formunun değerlendirilmesi yapılacaktır, ilgili grafikler dahil. \nEğer stratifikasyon değişkenleri veya sayısal olmayan tahmin ediciler varsa, fonksiyonel form grafikleri üretilmeyecektir. \n<b>Null Model Martingale Kalıntı Eksen Minimum Değeri</b> tüm Martingale kalıntılarını görmek için değiştirilmesi gerekebilir.\n<br/><br/>\n<b>Sapma Analizi (Tip II):</b> Seçildiğinde, tüm değişken testleri (çok kategorili covariate'ler için çok dereceli özgürlük testleri dahil) sağlanacaktır. Wald testleri \n kullanılmaktadır.\n<br/><br/>\n<b>Gerekli R paketleri:</b> survival, broom, survminer, car, dplyr\n<br/><br/>\nR yardım butonuna tıklayarak coxph fonksiyonu hakkında ayrıntılı R yardımı alabilirsiniz. Daha fazla bilgi için Help-> R Fonksiyon Yardımı'na gidin, finegray fonksiyonu hakkında daha fazla bilgi almak için, gerekli veri kümesini oluşturan fonksiyondur.\n"
  }
}