{
  "title": "Cox, Temel",
  "navigation": "Cox, Temel",
  "helplabel": "Örnek veri setleri ve desteklenen veri formatı hakkında ayrıntılar için iletişim kutusunun sağ üst köşesindeki ? düğmesine tıklayın.",
  "modelname": "Model Adını Girin",
  "timevar": "Olay için zaman veya sansür",
  "eventvar": "Olaylar (1 = olay 1, 0 = sansür)",
  "destvars": "Bağımsız Değişkenler",
  "weightvar": "Ağırlıklar (isteğe bağlı)",
  "tiemethod": "Bağlı Zaman Yöntemi",
  "forestplotbox": "Orman Grafiği",
  "diagnosticsbox": "Model Tanılamaları",
  "martscalebox": "Null Model Martingale Artık Ekseni Minimum Değeri (-Inf ile 1):",
  "devbox": "Sapma Analizi (Tip II)",
  "devtype": "Test İstatistiği",
  "help": {
    "title": "Cox, Temel",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\n\t\t\tYükleme dizininde örnek veri setini görün, varsayılan konum sürücü harfi:&bsol;program dosyaları&bsol;BlueSky İstatistikleri&bsol;10&bsol;Örnekler_ve_Belgeler&bsol;Veri_setleri_ve_Demolar&bsol;Regresyon_Cox&bsol;mockstudy_upd.RData. Followup_time değişkeni olay için zaman veya sansür olarak girilmeli ve Event değişkeni Olaylar (1 = olay, 0 = sansür) olarak girilmelidir. Cinsiyet, yaş ve bmi bağımsız değişkenler olabilir. \n\t\t\t<br/>\n            Olay değişkeni sayısal olmalıdır, faktörlere izin verilmez. Eğer 0 ve 1 gibi 2 değere sahip bir faktör türünde olay değişkeniniz varsa, bunu sayısala dönüştürün.\n\t\t\tBu veri seti arsenal paketindeki mockstudy veri setinin güncellenmiş bir versiyonudur.\n\t\t\t<br/><br/>\n            <b>Cox Orantılı Tehlikeler Modeli</b>\n            <br/>\n            <br/>\n            Sansürlü gözlemlerle zaman-açısından olay verileri için bir Cox orantılı tehlikeler modeli uydurur. Model uyum istatistikleri, parametre tahminleri ve tehlike oranları sağlanır. Mevcut seçenekler arasında bağlı zaman yöntemi, orantılı tehlikeler ve kovaryat fonksiyonel form değerlendirmeleri gibi model tanılamaları ve güven aralıkları ile tehlike oranlarının orman grafiği bulunmaktadır. Model, survival paketindeki coxph fonksiyonu kullanılarak uyum sağlanır.\n            <br/>\n            <br/>\n            <b>Zaman:</b> Olayı yaşayanlar için olay zamanı veya olayı yaşamayanlar için son takip zamanı\n            <br/><br/>\n            <b>Olay:</b> Sayısal olay göstergesi; 1=olay, 0=sansür\n            <br/><br/>\n            <b>Bağımsız Değişkenler:</b> Modelde dahil edilecek bağımsız değişkenler. Faktörler, dizgeler ve mantıksal değişkenler dummy kodlanacaktır.\n            <br/><br/>\n            <b>Ağırlıklar:</b> Gözlem ağırlıkları için sayısal değişken. Her kaydın bir gözlem olarak sayılmadığı durumlarda faydalıdır. \n            <br/>\n            <br/>\n            <b>Gerekli paketler:</b> survival, broom, survminer, car, BlueSky\n            <br/>\n            <br/>\n            coxph fonksiyonu hakkında ayrıntılı R yardımı almak için R Yardım Al düğmesine tıklayın.\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <b>Seçenekler</b>\n            <br/>\n            <br/>\n            <b>Bağlı Zaman Yöntemi:</b>\n            <br/>\n            Bağlı gözlemlenen zamanları kırma yöntemi. Efron genellikle çok fazla bağlı zaman yoksa daha iyi bir seçimdir. Kesin yöntem, çok sayıda bağlı zaman varsa, ayrık zaman durumlarında faydalı olabilir, ancak modelin uyum sağlaması biraz daha uzun sürebilir. \n            <br/>\n            <br/>\n            <b>Orman Grafiği:</b>\n            <br/>\n            Modeldeki her tahmin edici için tehlike oranları ve güven aralıklarının grafiği.\n            <br/>\n            <br/>\n            <b>Model Tanılamaları:</b>\n            <br/>\n            Seçilirse, orantılı tehlike testleri ve grafikler sağlanacak, ayrıca modeldeki her kovaryat için fonksiyonel form değerlendirmeleri yapılacaktır. Null model Martingale artık ekseni minimum değeri seçeneği, tüm artıkların grafikte görünmesi için değiştirilmesi gerekebilir. Fonksiyonel form değerlendirmeleri almak için yalnızca sayısal tahmin edicileri belirtmeli ve eksik veri olmamalıdır. Değişkenler > Eksik Değerler > NAs'ı Kaldırın.\n            <br/>\n            <br/>\n            <b>Sapma Analizi (Tip II):</b>\n            Modeldeki her tahmin edici için küresel test. 2'den fazla seviyeye sahip etkiler için çok dereceli özgürlük testleri sağlanacaktır. Wald ve Likelihood oranı testleri elde edilebilir, likelihood oranı testleri daha iyi küçük örnek özelliklerine sahiptir.\n            \n        "
  }
}