{
  "title": "Cox, ikili zaman bağımlı değişkenler",
  "navigation": "Cox, ikili zaman bağımlı değişkenler",
  "modelname": "Model adını girin",
  "timevar": "Olay veya sansür için zaman",
  "eventvar": "Olaylar (1 = olay 1, 0 = sansür)",
  "modelterms": "Bağımsız değişkenler için model ifadesi oluşturucu",
  "switchtimeslabel": "Zaman bağımlı değişkenler için maruziyet zaman değişkenleri",
  "tdprefixlabel": "Zaman bağımlı değişkenler için önek",
  "subjectidlabel": "Denek tanımlayıcısı",
  "weightvar": "Ağırlıklar (isteğe bağlı)",
  "tiemethod": "Bağlı Zaman Yöntemi",
  "forestplotbox": "Orman Grafiği",
  "diagnosticsbox": "Model Tanılama",
  "martscalebox": "Null Model Martingale Artık Ekseni Minimum Değeri (-Inf ile 1):",
  "devbox": "Sapma Analizi (Tip II)",
  "devtype": "Test İstatistiği",
  "startstopboxlabel": "Göster (başlangıç, bitiş) zaman veri seti",
  "startstopnamelabel": "Veri seti adı",
  "help": {
    "title": "Cox, ikili zaman bağımlı değişkenler",
    "r_help": "help(coxph, package = 'survival')",
    "body": "\nZamanla olay verileri için bir Cox orantılı tehlike modeli uydurur ve bir veya daha fazla ikili zaman bağımlı \"maruziyet\" değişkenini içerir. Bu tür bir \ndeğişken, \"evet\" durumunun takip başlangıcından sonra gerçekleşebileceği ve bu \"evet\" durumu gerçekleştiğinde takip süresi boyunca \"evet\" olarak kalacağı bir değişkendir. Bir örnek \ntransplant sonrası greft reddidir (yani, reddin gerçekleşmesinden önce hasta \"maruz kalmamıştır\"; reddin gerçekleşmesinden sonra hasta \"maruz kalmıştır\"). \nBöyle bir değişkenin takip başlangıcında biliniyormuş gibi değerlendirilmesi, geleceğe bakmanın bir şeklidir ve yanlı tahminlere yol açar (aynı zamanda \"ölü zaman yanlılığı\" olarak da bilinir).\n<br/><br/>\nModel uyum istatistikleri, parametre tahminleri ve tehlike oranları sağlanır. Mevcut seçenekler arasında bağlı zaman yöntemi, orman grafikleri, model tanılama ve oluşturulan temel sayım süreci veri setini görüntüleme yeteneği bulunmaktadır. Bu verinin uygun şekilde oluşturulduğunu kontrol etmek için bir sayım süreci veri tablosu sağlanır.\n<br/><br/>  \nSayım süreci veri özetleri:\n<br/>\n<b>erken:</b> takip zamanı başlamadan önce tahmincinin değiştiği zaman<br/>\n<b>geç:</b> takip sona erdikten sonra tahmincinin değiştiği zaman<br/>\n<b>içinde:</b> takip süresi içinde tahmincinin değiştiği zaman<br/>\n<b>önde:</b> takip başlangıcında tahmincinin değiştiği zaman<br/>\n<b>arkada:</b> takip sonunda tahmincinin değiştiği zaman<br/>\n<b>sınırda:</b> takip başlangıcında veya sonunda tahmincinin değiştiği zaman\n<br/><br/>\nBu tablo hakkında daha fazla bilgi için, zaman bağımlı değişkenler hakkında bilgi için <a href=\"https://cran.r-project.org/package=survival\">https://cran.r-project.org/package=survival</a> adresine bakın.  \n<br/><br/>\nModel, survival paketindeki coxph fonksiyonu kullanılarak uyum sağlanır.\n<br/><br/>\n<b>Model adını girin:</b> Model sonuçlarının saklanacağı ad\n<br/><br/>\n<b>Olay veya sansür için zaman:</b> Olayı yaşayanlar için sonuç olayına kadar geçen zaman veya sonuç olayını yaşamayanlar için son takip zamanına kadar geçen zaman\n<br/><br/>\n<b>Olaylar (1=olay, 0=sansür):</b> Sayısal olay göstergesi; 1=olay, 0=sansür\n<br/><br/>\n<b>Formül Oluşturucu:</b> Modelde yer alacak terimleri oluşturun. Faktörler, dizeler ve mantıksal değişkenler dummy kodlanacaktır. Sağlanan düğmeler, ana etkileri, tam faktöryel etkileri (ana etkiler ve ilgili değişkenlerle tüm etkileşimler), polinomları, belirli etkileşimleri belirtmenize ve listedeki terimleri silmenize olanak tanır.\n<br/><br/>\n<b>Zaman bağımlı değişkenler için maruziyet zaman değişkenleri:</b> Deneklerin ilk \"maruz kaldığı\" zamanı depolayan sayısal değişkenler. Bu, Zaman değişkeni ile aynı zaman ölçeğinde olmalıdır. Hiç maruz kalmamış denekler için eksik değerler kullanılmalıdır. Burada belirtilen her değişken, ayrı bir zaman bağımlı değişken oluşturacaktır. Belirtilen bir zaman, bir deneğin bu zamandan önce maruz kalmadığını ve bu zamandan sonra maruz kaldığını varsayar (yani, tahminci \"hayır\"dan \"evet\"e geçtiğinde). Sadece pozitif değerler belirtmek, deneklerin takip başlangıcından sonra bir süre maruz kalmadığını gösterir. Bazı pozitif ve negatif zamanlar belirtmek, bazı deneklerin takip zamanı başlamadan önce ve bazılarını takip zamanı başladıktan sonra maruz kaldığını gösterir. Eğer bir deneğin takip başlangıcından önce maruz kaldığını biliyorsanız, ancak tam olarak ne zaman olduğunu bilmiyorsanız, o zaman herhangi bir negatif zaman kullanabilirsiniz ve model bu deneği takip süresi boyunca maruz kalmış olarak doğru bir şekilde değerlendirecektir. Eğer denekler takipten sonra maruz kalıyorsa, o zaman takip süresi boyunca maruz kalmamış olarak doğru bir şekilde değerlendirilir.\n<br/><br/>\n<b>Zaman bağımlı değişkenler için önek:</b> <b>Maruziyet zaman değişkenleri</b> alanında belirtilen her zaman bağımlı değişken için kullanılacak istenen önek. Her zaman bağımlı değişkenin adı bu önek ile başlayacaktır.\n<br/><br/>\n<b>Denek tanımlayıcısı:</b> Denek tanımlayıcısını depolayan değişken. Bu, temel sayım süreci veri setini oluşturmak için gereklidir.\n<br/><br/>\n<b>Ağırlıklar:</b> Gözlem ağırlıkları için sayısal değişken. Her kaydın bir gözlem olarak sayılmadığı durumlarda yararlıdır. \n<br/><br/>\n<b>Seçenekler:</b>\n<br/><br/>\n<b>Bağlı Zaman Yöntemi:</b> Bağlı gözlemlenen zamanları kırma yöntemi. Efron genellikle çok fazla bağlı zaman yoksa daha iyi bir seçimdir. Kesin yöntem, çok sayıda bağlı zaman varsa, ayrık zaman durumlarında faydalı olabilir, ancak modelin uyum sağlaması biraz daha uzun sürebilir.\n<br/><br/>\n<b>Orman Grafiği:</b> tehlike oranları ve güven aralıklarının orman grafiğini oluşturacaktır\n<br/><br/>\n<b>(başlangıç, bitiş) Veri Setini Göster:</b> Hesaplamalarda kullanılan temel sayım süreci veri setini gösterecektir. Bu, her deneğin takip zamanını, zaman bağımlı değişkenin değerlerini değiştirmesi gereken zamana bağlı olarak parçalara ayırır.\n<br/><br/>\n<b>Model Tanılama:</b> Seçildiğinde, modeldeki her değişken için orantılı tehlike testleri ve grafikler sağlanacaktır. Null model Martingale artık ekseni minimum değer seçeneği, tüm artıkların grafikte görünmesi için değiştirilmesi gerekebilir. Fonksiyonel form değerlendirmeleri almak için yalnızca sayısal tahmincileri belirtmeli ve eksik veri olmamalıdır. Değişkenler > Eksik Değerler > NAs'ı Kaldırın.\n<br/><br/>\n<b>Sapma Analizi (Tip II):</b> Modeldeki her tahmincinin küresel testi. 2'den fazla seviyeye sahip etkiler için çok dereceli serbestlik testleri sağlanacaktır.  \nWald ve Likelihood oranı testleri elde edilebilir, likelihood oranı testleri daha iyi küçük örnek özelliklerine sahiptir.           \n<br/><br/>\n<b>Gerekli paketler:</b> survival, broom, survminer, car\n"
  }
}