{
  "title": "Tanısal Test",
  "navigation": "Tanısal Test",
  "outvar": "Sonuç Değişkeni (1=pozitif, 0=negatif):",
  "testvar": "Test Değişkeni (1=pozitif, 0=negatif):",
  "cilevel": "Güven Düzeyi:",
  "help": {
    "title": "Tanısal Test",
    "r_help": "help(epi.tests,package=epiR)",
    "body": "\n<b>Açıklama</b></br>\nBu, bir ikili test ile bir ikili altın standart sonucu için tanısal test çalışmaları için uygun çeşitli ölçümleri hesaplar. \"Hastalık\" tespit etmek için.<br/>\nSonuç Değişkeni: Altın standart için değerleri içeren değişken. Bu, 1 = \"hastalık\" pozitif ve 0 = \"hastalık\" negatif olarak kodlanmış bir sayısal değişken olmalıdır, çünkü hesaplamalar bu sıraya bağlıdır.<br/>\nTest Değişkeni: İncelenen test için değerleri içeren değişken. Bu, 1 = \"hastalık\" pozitif ve 0 = \"hastalık\" negatif olarak kodlanmış bir sayısal değişken olmalıdır, çünkü hesaplamalar bu sıraya bağlıdır.<br/>\nGüven Düzeyi: İstenilen güven aralığı düzeyi<br/>\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nepi.tests(dat, conf.level = 0.95)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ndat: Sonuç ve test değişkenini tabulate ederek oluşturulan bireysel hücre frekanslarını içeren tablo sınıfı nesnesi. Sonuç Değişkeni, altın standart için değerleri içerir. Bu, 1 = \"hastalık\" pozitif ve 0 = \"hastalık\" negatif olarak kodlanmış bir sayısal değişken olmalıdır, çünkü hesaplamalar bu sıraya bağlıdır. Test değişkeni, incelenen test için değerleri içerir. Bu, 1 = \"hastalık\" pozitif ve 0 = \"hastalık\" negatif olarak kodlanmış bir sayısal değişken olmalıdır, çünkü hesaplamalar bu sıraya bağlıdır.\n</li>\n<li>\nGüven Düzeyi: İstenilen güven aralığı düzeyi\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nTest duyarlılığı, özgüllüğü ve pozitif ve negatif öngörücü değer için kesin binom güven sınırları hesaplanır (ayrıntılar için Collett 1999'a bakın).</br>\nPozitif ve negatif olasılık oranları için güven aralıkları, Simel ve ark. (1991) tarafından sağlanan formüllere dayanmaktadır.</br>\nTanısal doğruluk, doğru sonuç veren tüm testlerin oranı olarak tanımlanır. Tanısal oran, testin hastalığı olan hastalarda doğru bir tanı koyma olasılığının yanlış bir tanı koyma olasılığından ne kadar daha fazla olduğunu tanımlar (Scott ve ark. 2008). Tanı koymak için gereken hasta sayısı, bir doğru pozitif test vermek için test edilmesi gereken hasta sayısı olarak tanımlanır. Youden indeksi, gerçek pozitif oran ile yanlış pozitif oran arasındaki farktır. Youden indeksi -1 ile +1 arasında değişir ve hem duyarlılık hem de özgüllük yüksekse (yani 1'e yakınsa) 1'e daha yakın değerler alır.</br>\n<b>Değer</b></br>\nDönüş değerlerini tanımlayacak R yardımına erişmek için aşağıdaki ayrıntılı yardıma bakın</br>\n<b>Paket</b></br>\nepiR;DescTools</br>\n<b>Yardım</b></br>\nAyrıntılı yardım için bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya aşağıdaki komutu çalıştırarak help(epi.tests,package=epiR) R kodu parçası oluşturarak + butonuna tıklayın."
  }
}