{
  "title": "Tek değişkenli dağılımların sansürsüz verilere uyumu (P-değeri ile)",
  "navigation": "Dağılım Uyum P-değeri",
  "variableSelcted": "Dağılımı içeren bir değişken seçin",
  "label1": "Dağılımlar için uyum testinin genellikle tamamlanmasının daha uzun sürdüğünü unutmayın",
  "label2": "Çeşitli dağılımlar için uyum testi",
  "normDistChk": "Normal",
  "weibullDistChk": "Weibull",
  "lnormDistChk": "Log Normal",
  "poissonDistChk": "Poisson",
  "expDistChk": "Üstel",
  "gammaDistChk": "Gamma",
  "nbinomDistChk": "Negatif Binom",
  "geomDistChk": "Geometrik",
  "betaDistChk": "Beta",
  "unifDistChk": "Uniform",
  "logisDistChk": "Logistik",
  "cauchyDistChk": "Cauchy",
  "method": "Uyum yöntemi",
  "gof": "'mge' uyum yöntemi yukarıda seçildiğinde gerekli olan uyum iyiliği (gof)",
  "shoChiqTestChk": "Sürekli dağılım için Ki-kare testinin sonuçlarını göster",
  "showCompareTablesOnlyChk": "Sadece dağılım karşılaştırma tablolarını ve grafiklerini göster. Sadece bir dağılım seçiyorsanız bunu işaretlemeyi kaldırmalısınız",
  "bootstrapIter": "Bootstrap yöntemi p.değerinin doğruluğunu artırmak için kullanılır. Varsayılan yineleme 600'dür. Daha fazla yineleme doğruluğu artırabilir ancak hesaplama süresi uzar",
  "help": {
    "title": "Tek değişkenli dağılımların sansürsüz verilere uyumu",
    "r_help": "help(fitdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Açıklama</b></br>\n\t\t\t\tTek değişkenli dağılımların sansürsüz verilere maksimum olasılık (mle), moment eşleştirme (mme), kuantile eşleştirme (qme) veya uyum iyiliği tahminini maksimize etme (mge) ile uyumu.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDetaylı yardım için - R help(fitdist, package = fitdistrplus) ve help(gofstat, package = fitdistrplus) kullanın\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tAşağıda dört olası uyum yöntemi açıklanmaktadır:\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tYöntem = \"mle\" (varsayılan) olduğunda\n\t\t\t\tMaksimum olasılık tahmini, log-olasılığı maksimize etmeyi içerir. En iyi değerleri bulmak için mledist içinde optim ile sayısal bir optimizasyon gerçekleştirilir (detaylar için mledist'e bakın).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tYöntem = \"mme\" olduğunda\n\t\t\t\tMoment eşleştirme tahmini, teorik ve ampirik momentleri eşitlemeyi içerir. Dağılım parametrelerinin tahmin edilen değerleri, \"norm\", \"lnorm\", \"pois\", \"exp\", \"gamma\", \"nbinom\", \"geom\", \"beta\", \"unif\" ve \"logis\" için kapalı form formülü ile hesaplanır. Aksi takdirde, teorik ve ampirik momentler, gözlemlenen ve teorik momentler arasındaki kare farkların toplamının minimize edilmesi ile sayısal olarak eşleştirilir. Bu son durumda, fitdist çağrısında order ve memp gibi ek argümanlar gereklidir (detaylar için mmedist'e bakın).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tYöntem = \"qme\" olduğunda\n\t\t\t\tKuantile eşleştirme tahmini, teorik ve ampirik kuantilleri eşitlemeyi içerir. Gözlemlenen ve teorik kuantiller arasındaki kare farkların toplamını minimize etmek için qmedist içinde optim ile sayısal bir optimizasyon gerçekleştirilir. Bu yöntemin kullanımı, eşleştirilecek kuantiller için olasılıkların sayısal vektörü olarak tanımlanan ek bir argüman olan probs'i gerektirir (detaylar için qmedist'e bakın).\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tYöntem = \"mge\" olduğunda\n\t\t\t\tMaksimum uyum iyiliği tahmini, bir uyum iyiliği istatistiğini maksimize etmeyi içerir. Uyum iyiliği mesafesini minimize etmek için mgedist içinde optim ile sayısal bir optimizasyon gerçekleştirilir. Bu yöntemin kullanımı, seçilen uyum iyiliği mesafesi için gof kodlaması gibi ek bir argüman gerektirir. Klasik Cramer-von Mises mesafesini (\"CvM\"), klasik Kolmogorov-Smirnov mesafesini (\"KS\"), dağılımın kuyruklarına daha fazla ağırlık veren klasik Anderson-Darling mesafesini (\"AD\") veya bu son mesafenin Luceno (2006) tarafından önerilen varyantlarından birini kullanabilirsiniz (detaylar için mgedist'e bakın). Bu yöntem, ayrık dağılımlar için uygun değildir.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tYöntem = \"mse\" olduğunda\n\t\t\t\tMaksimum uyum iyiliği tahmini, ortalama log aralığını maksimize etmeyi içerir. Sayısal bir optimizasyon, msedist içinde optim ile gerçekleştirilir.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tKonsantrasyon, optim/constrOptim'in aşağıda tanımlanan veya kullanıcı tarafından kullanıcı sağlanan optimizasyon fonksiyonunda tanımlanan bir tamsayı kodudur. 0, başarılı bir konsantrasyonu gösterir. 1, optim'in yineleme sınırına ulaştığını gösterir. 10, Nealder-Mead simplex'inin bozulmasını gösterir. 100, optim'in bir iç hata ile karşılaştığını gösterir.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tUyum iyiliği istatistikleri gofstat() ile hesaplanır. Ki-kare istatistiği, argüman chisqbreaks tarafından tanımlanan hücreler veya verilerden otomatik olarak tanımlanan hücreler kullanılarak hesaplanır, böylece her hücrede yaklaşık olarak aynı gözlem sayısına ulaşılır, yaklaşık olarak meancount argümanına eşit veya bazı bağlamalar varsa biraz daha fazla.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tSürekli dağılımlar için, Kolmogorov-Smirnov, Cramer-von Mises ve Anderson-Darling istatistikleri de hesaplanır, Stephens (1986) tarafından tanımlandığı gibi.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tÖnemli istatistikler, sürekli dağılımlar için Cramer-von Mises, Anderson-Darling ve Kolmogorov istatistikleri ve ayrık olanlar için Ki-kare istatistikleridir (\"binom\", \"nbinom\", \"geom\", \"hyper\" ve \"pois\")\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Dağılım uyumu hakkında iyi bir genel bakış için https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best adresine bakın</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Dağılım uyumu hakkında iyi bir genel bakış için https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best adresine bakın</a>\n\t\t\t\t<br/>\n\t\t\t"
  }
}