{
  "title": "Cullen ve Frey grafiği ile sansürlenmemiş veriler için ampirik dağılımın tanımlayıcıları",
  "navigation": "Dağılım Analizi (Cullen ve Frey grafiği)",
  "variableSelcted": "Dağılımı içeren bir değişken seçin",
  "boot": "(Opsiyonel) Çarpıklık ve basıklık için boot değerleri. Belirtilirse 10'dan büyük bir tam sayı olmalıdır",
  "discreteChk": "Kesikli - uniform, normal, lojistik, lognormal, beta ve gamma için varsayılan olarak işaretlenmemiştir. Poisson ve negatif binom için işaretlenmiştir",
  "method": "İstatistiklerin tarafsız tahmin değerleri veya örnek için örnek değerleri için tarafsız (varsayılan)",
  "help": {
    "title": "Sansürlenmemiş veriler için ampirik dağılımın tanımı",
    "r_help": "help(descdist, package = fitdistrplus)",
    "body": "\n\t\t\t\t<b>Açıklama</b></br>\n\t\t\t\tSansürlenmemiş veriler için ampirik bir dağılımın tanımlayıcı parametrelerini hesaplar ve bir çarpıklık-basıklık grafiği sağlar\n\t\t\t\t<br/>\n\t\t\t\tDetaylı yardım için - R help(descdist, package = fitdistrplus) kullanın\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tMinimum, maksimum, medyan, ortalama, örnek sd ve örnek (eğer method==\"sample\") veya varsayılan olarak tarafsız tahminler \n\t\t\t\tsyıklık ve Pearson'un basıklık değerleri yazdırılır (Sokal ve Rohlf, 1995). Cullen ve Frey (1999) tarafından önerilen \n\t\t\t\tçarpıklık-basıklık grafiği, ampirik dağılım için verilir. Bu grafikte, veriye uyacak dağılımların seçimine yardımcı olmak için \n\t\t\t\tyaygın dağılımlar için değerler de gösterilmektedir. Bazı dağılımlar (normal, uniform, lojistik, üstel örneğin) için, \n\t\t\t\tçarpıklık ve basıklık için yalnızca bir olası değer vardır (örneğin, normal dağılım için, çarpıklık = 0 ve basıklık = 3) ve \n\t\t\t\tdağılım bu nedenle grafikte bir nokta ile temsil edilir. Diğer dağılımlar için, olası değerlerin alanları temsil edilir, \n\t\t\t\tçizgiler (gamma ve lognormal dağılımlar örneğin) veya daha büyük alanlar (beta dağılımı örneğin) şeklinde. \n\t\t\t\tWeibull dağılımı grafikte temsil edilmez ancak bu dağılımla yakın şekillerin lognormal ve gamma dağılımlarına \n\t\t\t\tulaşabileceği belirtilmiştir.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tÇarpıklık ve basıklık tahmin değerlerinin belirsizliğini hesaba katmak için, veri seti \n\t\t\t\t10'dan büyük bir tam sayıya boot argümanını sabitleyerek bootstrap edilebilir. Boot bootstrap örneklerine karşılık gelen \n\t\t\t\tçarpıklık ve basıklık boot değerleri hesaplanır ve çarpıklık-basıklık grafiğinde mavi renkte rapor edilir.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tEğer discrete TRUE ise, temsil edilen dağılımlar Poisson, negatif binom dağılımları ve önceki kesikli dağılımların \n\t\t\t\tyaklaştığı normal dağılımdır. Eğer discrete FALSE ise, bunlar uniform, normal, lojistik, lognormal, beta ve gamma dağılımlarıdır.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<a href=\"https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best\">Dağılım uyumu hakkında iyi bir genel bakış için, https://stats.stackexchange.com/questions/132652/how-to-determine-which-distribution-fits-my-data-best adresine bakın</a>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\t-x-\n\t\t\t"
  }
}