{
  "title": "Deney Tasarımı (DoE) işlevinin hızlı bir genel görünümü",
  "navigation": "DoE Genel Bakış",
  "lbl1": "1. DOE -> tasarım oluşturma menüsü altında herhangi bir Tasarım oluşturmak için önce tasarımı oluşturmak için faktör ayrıntılarına sahip bir veri kümesine ihtiyacınız var.",
  "lbl2": "2. Başlamak için, uygulamanızın kurulum dizinindeki örnek veri kümesi dizininde sağlanan örnek veri kümelerinden birini (excel dosyası) seçin veya DOE -> DoE Faktör Ayrıntıları Oluştur menüsü ile anında bir faktör ayrıntı tablosu/veri kümesi oluşturabilirsiniz.",
  "lbl3": "3. Yukarıdaki 2. adımda bir veri kümesi dosya açma menüsü ile açıldığında veya anında oluşturulduğunda, uygun bir tasarım oluşturmak için DOE -> tasarım oluşturma menüsüne gidin.",
  "lbl4": "4. Bir tasarım başarıyla oluşturulduktan sonra, veri kümesi UI ızgarasında görünecektir. Yeni oluşturulan tasarımı incelemek için DOE -> Tasarımı İncele menüsünü kullanabilirsiniz.",
  "lbl5": "5. Tasarımı bir dosya sistemi dizinine DOE -> Tasarımı Dışa Aktar menüsü ile dışa aktaralım. Belirtilen dosya dizini yolundaki UI ızgarasındaki tasarım veri kümesi ile aynı isimlere sahip üç dosya (.csv, .rda, .html) otomatik olarak oluşturulacaktır.",
  "lbl6": "6. 5. adımda dışa aktarılan csv dosyası, tasarımda belirtilen şekilde gerçek dünyada deneyleri kurmak için kullanılmakta ve daha sonraki analizler için sonuçları toplamak/kaydetmek amacıyla kullanılmaktadır.",
  "lbl7": "7. Sonuçlar kaydedilir ve csv dosyasındaki DoE sözlüğünde yanıtlar olarak adlandırılan ayrı sütunlar olarak eklenir. Csv dosyasının uzantısını başka bir dosya formatına değiştirmeyin. Kendi csv dosyanızda yanıt sütunları oluşturmak için kopyalamak üzere sonuç/yanıt sütunları için değerleri almak amacıyla DoE için örnek veri kümesi dizininde resp ile etiketlenmiş csv dosyalarının örneklerine bakın.",
  "lbl8": "8. Yanıt sütunları eklenmiş csv tasarım dosyasını uygulamaya geri yüklemek için DOE -> Tasarım Yanıtını İçe Aktar menüsünü kullanalım.",
  "lbl9": "9. 8. adımda tasarım csv dosyasını içe aktarmak için, orijinal tasarımın (dışa aktarılan) veri kümesi UI ızgarasında mevcut olması gerekir. Eğer mevcut değilse, 5. adımda tasarım dışa aktarmanın bir parçası olarak oluşturulan .rda dosyasını yüklemek için dosya açma menüsünü kullanın.",
  "lbl10": "10. Csv dosyası doğru/aktif tasarım veri kümesine karşı başarıyla içe aktarıldıktan ve yanıt sütunları ile yeni bir tasarım oluşturulduktan sonra, yanıt sütunları ile tasarımı incelemek için DOE -> Tasarımı İncele menüsünü kullanabilirsiniz.",
  "lbl11": "11. Artık yanıt sütunları ile tasarım, çeşitli analiz yöntemleri (örneğin, doğrusal model, yanıt yüzeyi modeli vb.) ile analiz için hazırdır. DOE -> Tasarım Analizi menüsünü kullanabilirsiniz."
}