{
  "title": "Varyansların Eşitliği",
  "navigation": "Varyansların Eşitliği",
  "label1": "Testleri seçin",
  "bartlett": "Bartlett Testi",
  "levene": "Levene Testi",
  "fligner": "Fligner–Killeen Testi",
  "normal_distribution": "Normal dağılıma dayalı test",
  "pairwiseLeveneTest": "İkili Levene testi",
  "label2": "Veri formatı",
  "wide": "Geniş format",
  "long": "Uzun format",
  "label3": "Güven düzeyi",
  "label4": "Alternatif hipotez",
  "alt1": "İki taraflı",
  "alt2": "Büyüktür",
  "alt3": "Küçüktür",
  "label5": "P-değeri ayarlama yöntemi (ikili Levene testi için)",
  "padj1": "Holm",
  "padj2": "Hochberg",
  "padj3": "Hommel",
  "padj4": "Bonferroni",
  "padj5": "BH",
  "padj6": "BY",
  "padj7": "FDR",
  "padj8": "Hiçbiri",
  "help": {
    "title": "Varyansların Eşitliği için Testler",
    "r_help": "help(bartlett.test, package=stats); help(leveneTest, package=car); help(fligner.test, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nVaryansların eşitliğini test eder. Aşağıdaki formatlarda verileri destekler<br/>\ngeniş: Her değişken ölçümleri içerir, örneğin değişken 1 makine A'dan ölçümleri, değişken 2 makine B'den ölçümleri içerir...<br/>\nuzun: Bir değişken içindeki ölçümler bir veya daha fazla değişken tarafından gruplandırılır, örneğin Test puanları cinsiyet ve sınıfa göre gruplandırılır. <br/>\nİkili Levene testi seçildiğinde yalnızca P-değeri ayarlama yöntemi uygulanır.<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"wide\" ),<br/>\n    cols_to_compare = c('A','B','C'),<br/>\n    response_col = NULL,<br/>\n    group_col = NULL,<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"two.sided\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n    Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset1\"<br/>\n)<br/>\nBSky_variance_analysis (<br/>\n    data_format = c(\"long\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Score'),<br/>\n    group_col = c('Gender','Class'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"two.sided\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset2\"<br/>\n)<br/>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ndata_format: Geniş veya uzun olabilir\n</li>\n<li>\ncols_to_compare: Veri seti geniş formatta olduğunda varyansları karşılaştırmak için değişkenler, uzun formatta NULL\n</li>\n<li>\nresponse_col: Gruplar arasında varyansları karşılaştırmak için ölçüm değişkeni. Geniş veri için NULL\n</li>\n<li>\ngroup_col: Ölçüm değişkenini gruplamak için kullanılan bir veya daha fazla değişken, gruplar arasında varyansların eşitliğini test ederiz\n</li>\n<li>\nconf_level: Güven aralığı\n</li>\n<li>\nalt_hypothesis: iki.sided olarak ayarlanır\n</li>\n<li>\np_adjust_method: p değerini ayarlamak için kullanılan yöntem\n</li>\n<li>\nnormal_distribution: eğer TRUE ise, normal dağılım varsayılır\n</li>\n<li>\nFligner_Killeen: eğer TRUE ise, Fligner_Killeen testi yapılır\n</li>\n<li>\npairwiseComparison: İkili Levene testi yap\n</li>\n<li>\ndatasetname: x,y ve katmanların (değişkenlerin) seçildiği veri setinin adı\n</li>\n</ul>\n<b>Değer</b></br>\nBelirtilen güven aralıkları için Bonferroni güven aralıkları. Çoklu karşılaştırma testleri için test sonuçları (normalite varsayılmadığında) ve diğer testlerin sonuçları\n<br/>\n<b>Örnek</b></br>\n<code> \nBSky_variance_analysis (<br/>\n    data_format = c(\"long\" ),<br/>\n    cols_to_compare = NULL,<br/>\n    response_col = c('Score'),<br/>\n    group_col = c('Gender','Class'),<br/>\n    conf_level = 0.95,<br/>\n    alt_hypothesis = \"two.sided\",<br/>\n    p_adjust_method = \"holm\",<br/>\n    normal_distribution =FALSE,<br/>\n     Fligner_Killeen =FALSE,<br/>\n  pairwiseComparison=FALSE,<br/>\n    data_name=\"Dataset2\"<br/>\n)<br/>\n</code> <br/>\n\n<b>Ayrıntılar</b></br>\nÇoklu karşılaştırma testi</br>\n“Normal dağılıma dayalı testi kullan” seçmediğinizde kullanılır – yani, normal dağılımlara karşı dayanıklı yöntemleri tercih edersiniz. </br>\nEğer k > 2 grup varsa, iki aralığın örtüşmediği durumlarda standart sapmaların önemli ölçüde farklı olduğunu hesaplarız.</br> \nK = 2 örnek için, hipotez edilen oran = 1 olan iki varyans testi için Bonett yöntemini kullanır. </br>\nGenel çoklu karşılaştırma testi anlamlı olduğunda, örtüşmeyen aralıklara karşılık gelen standart sapmalar istatistiksel olarak farklıdır.</br>\nAvantajlar: Birçok durumda Levene yönteminden daha güçlüdür (sürekli dağılımlar için). Ancak örnek boyutları küçükse (< 20) veya dağılımlar aşırı çarpık/ağır kuyrukluysa, tip I hata oranı artabilir.</br>\nTest için p-değeri</br>\nEğer tasarımda 2 örnek varsa, o zaman iki varyans testi için Bonett yöntemini kullanarak çoklu karşılaştırma testi için p-değerini hesaplarız ve hipotez edilen oran, Ρo, 1’dir.</br>\nEğer tasarımda k > 2 örnek varsa, o zaman Pij, herhangi bir çift (i, j) örneği için testin p-değeridir. Varyansların eşitliği için genel bir test olarak çoklu karşılaştırma prosedürünün p-değeri aşağıdaki gibi verilir:</br>\nP =min{Pij, 1<=i<j<=k}\n</br>\nLevene test istatistiği</br>\nLevene testi, varyansların gruplar arasında eşit olduğu (H₀: tüm varyanslar eşit) ve en az bir varyansın farklı olduğu alternatif hipotezini test etmek için kullanılır. </br>\nNormalite varsayımına göre daha dayanıklıdır (örneğin, Bartlett testine göre). </br>\nÖzellikle, iyileştirilmiş dayanıklılık için örnek medyanından (ortalama yerine) mutlak sapmalar kullanarak Brown-Forsythe modifikasyonunu kullanıyoruz. </br>\nYorum: Eğer p-değeri < α ise, H₀'ı reddediyorsunuz ve varyansların eşit olmadığını sonuçlandırıyorsunuz. </br>\n</br>\nBartlett test istatistiği</br>\nBartlett testi, verilerin normal dağıldığı durumlarda varyansların eşitliğini test etmek için tasarlanmıştır. H₀: tüm varyanslar eşit. K > 2 grup olduğunda,\n“normal dağılıma dayalı testi kullan” seçildiğinde Bartlett testini kullanırız. </br>\nTest istatistiği (genellikle B ile gösterilir), örnek varyanslarının ağırlıklı aritmetik ortalaması ile ağırlıklı geometrik ortalamasını karşılaştırmaya dayanır. </br>\nİstatistik, k-1 df ile (yaklaşık olarak) bir ki-kare dağılımını takip eder. </br>\nBartlett testi normalite varsayımına dayandığı için, normaliteden sapmalara karşı hassastır (yani, normal olmayan veya ağır kuyruklu dağılımlar yanıltıcı sonuçlara yol açabilir)</br>\n</br>\nF-test istatistiği</br>\nTam olarak iki grup olduğunda (k = 2), “normal dağılıma dayalı testi kullan” seçildiğinde Bartlett yerine F-testini kullanırız. </br>\nH₀: varyanslar eşittir (σ₁² = σ₂²). </br>\nF-istatistiği, iki örnek varyansının oranı (büyüğün küçüğe oranı) olarak hesaplanır. Daha sonra p-değeri alternatif hipoteze bağlıdır\n (tek taraflı “küçüktür” veya “büyüktür”, veya iki taraflı). </br>\nYorum: Eğer p-değeri < α ise, H₀'ı reddediyorsunuz ve varyansların farklı olduğunu sonuçlandırıyorsunuz. Bu yalnızca normalite varsayımı altında geçerlidir.</br>\n<b>Değer</b><br/>\n\n<b>Paket</b></br>\nBlueSky</br>\n<b>Yardım</b></br>\nEk bilgi için lütfen support@blueskystatistics.com ile iletişime geçin.\n    "
  }
}