{
  "title": "Fleiss' Kappa",
  "navigation": "Fleiss' Kappa",
  "ratervars": "Değerlendirici Değişkenler:",
  "cilevel": "Güven Düzeyi:",
  "options": "Gelişmiş",
  "categLabels": "Tüm olası derecelendirmeleri virgülle ayırarak belirtin, örneğin 1,2,3,4,5 veya \"düşük\",\"orta\",\"yüksek\" ",
  "freqlistchkbox": "Değerlendirici değişkenlerin ağırlıklarını çapraz tabloya dökün",
  "weights": "Önceden tanımlanmış bir ağırlık seçin",
  "N": "Seçenekel bir parametre, popülasyon boyutunu temsil eder (varsa)",
  "help": {
    "title": "Fleiss' Kappa",
    "r_help": "help(fleiss.kappa.raw, package=irrCAC)",
    "body": "\n<b>Açıklama</b></br>\nFleiss' genel kappa, birden fazla değerlendirici (2, 3, +) arasında, giriş verileri her bir konu ve her değerlendirici için rapor edilen ham derecelendirmeleri temsil ettiğinde.</br>\nEğer herhangi bir değerlendiricinin bir gözlem için eksik bir değeri varsa, o gözlem analizden çıkarılır.</br>\nAyrıca değerlendirici değişkenlerin ağırlıklarını çapraz tabloya dökme seçeneği de sunuyoruz.</br>\n<b>Kullanım</b>\n<br/>\n<code> \nfleiss.kappa.raw(ratings = dataset1[ , c('var1','var2','var3')], weights = \"unweighted\", categ.labels = NULL,</br>\n  conflev = 0.95, N = Inf)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nratings:  Her değerlendiriciye karşılık gelen değişkenler, her sütun bir değerlendiriciyi ve her satır bir konuyu temsil eder. Sayısal, faktör veya sıralı değişkenler olabilir.</br>\n</li>\n<li>\nweights: Zorunlu bir parametre, ya bir dize değişkeni ya da bir matris olmalıdır. Dize, önceden tanımlanmış ağırlıklardan birini tanımlar ve \"ağırlıksız\", \"kare\", \"sıralı\", \"doğrusal\", \"radikal\", \"oran\", \"dairesel\", \"bipolar\" değerlerinden birini almalıdır.</br>\nEğer bu parametre bir matris ise, o zaman q, bir konunun sınıflandırılabileceği olası kategorilerin sayısıdır ve qxq kare bir matris olmalıdır. Eğer q olası kategorilerden bazıları kullanılmıyorsa, o zaman kategorilerin tam listesini parametre categ.labels'da bir vektör olarak belirtmek şiddetle tavsiye edilir. Aksi takdirde, program çalışmayabilir.</br>\nNOT: Bir matris belirtmek, sözdiziminde DESTEKLENMİYOR. Kodu yapıştırmanız ve bir matris belirtmek için düzenlemeniz gerekir.</br>\n</li>\n<li>\nconflev:  Güven aralığı ile ilişkili güven düzeyi. Varsayılan değeri 0.95'tir.</br>\n</li>\n<li>\nN: Seçenekel bir parametre, popülasyon boyutunu temsil eder (varsa). Nihai popülasyon düzeltmesini varyansa uygulamak için kullanılabilir. Varsayılan değeri sonsuzdur.\n</li>\n</ul>\n<b>Değer</b></br>\n3 nesne içeren bir veri listesi: (1) istenen anlaşma katsayısını içeren çeşitli istatistikleri içeren bir satırlık veri çerçevesi, (2) hesaplamalarda kullanılan ağırlık matrisi (varsa) ve (3) analizde kullanılan kategoriler. Bunlar, değerlendiriciler tarafından rapor edilen kategoriler veya değerlendiricilerin kullandıkları veya kullanmadıkları kategoriler olabilir. </br>Çıktı veri çerçevesi aşağıdaki değişkenleri içerir: \"coeff.name\" (katsayı adı-burada \"Fleiss' Kappa\" olacak), \"pa\" (yüzde anlaşma), \"pe\" (yüzde şans anlaşması), coeff.val (anlaşma katsayısı tahmini-Fleiss' Kappa), \"coeff.se\" (standart hata), \"conf.int\" (Fleiss Kappa'nın güven aralığı), \"p.value\"(Fleiss Kappa'nın p-değeri), \"w.name\"(ağırlıkların tanımlanması).\n<b>Paket</b></br>\nirrCAC</br>\n<b>Yardım</b></br>\nDetaylı yardım için bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya aşağıdaki komutu çalıştırarak help(fleiss.kappa.raw, package=irrCAC) oluşturun ve çıktı penceresinde + tıklayarak bir R kodu bloğu oluşturun.\n"
  }
}