{
  "title": "Orman Grafiği",
  "navigation": "Orman Grafiği",
  "modelselectorlabel": "Model Adını Seçin",
  "plotvarslabel": "Grafikte Gösterilecek Değişkenler (hiçbiri belirtilmezse tüm değişkenler gösterilir)",
  "varlabelslabel": "Değişken Etiketleri (varname='etiket' formatında, virgülle ayrılmış olarak belirtin, örn. yaş='Yaş (yıl)', bmi='Vücut Kitle İndeksi'); etiket içinde satır sonları için \\n kullanılabilir",
  "notelabel": "NOT: Etiketleri değiştirmek, modelin yeniden uyum sağlamasını gerektirir, bu nedenle büyük veriler zaman alabilir",
  "label3": "NOT: MODEL AYARLAMASI (EĞİTİM) KULLANILARAK OLUŞTURULAN MODELLER DESTEKLENMEMEKTEDİR",
  "estimateoptlabel": "Tahmin Seçenekleri",
  "estimatelabellabel": "Etiket",
  "exponentiatelabel": "Parametre Tahmininin Üstel Olarak Gösterilmesi",
  "linecolorlabel": "Çizgi Rengi",
  "pointshapelabel": "Nokta Şekli",
  "pointsizelabel": "Nokta Boyutu (0-10 mm)",
  "styleoptlabel": "Stil Seçenekleri",
  "factorseplinelabel": "Faktör İsimlerini Ayrı Satırlarda Göster",
  "plotbandslabel": "Grafik Bantları",
  "textsizelabel": "Metin Boyutu (1-10 mm)",
  "estticklabelsizelabel": "Tahmin Tık İşareti Etiket Boyutu (1-50)",
  "help": {
    "title": "Orman Grafiği",
    "r_help": "help(forest_model, package = 'forestmodel')",
    "body": "\nBu, bir regresyon modelinden model katsayılarının veya üstel katsayılarının grafiğini oluşturur. Her değişken, toplamlar, parametre tahminleri, \n%95 güven aralıkları ve p-değerleri ile kendi satırında gösterilir. Değişkenler, daha güzel bir sunum sağlamak için etiketlenebilir. Şu anda, lm (doğrusal modeller), glm (genelleştirilmiş doğrusal modeller, \nlojistik ve Poisson dahil), coxph (Cox orantılı tehlikeler) ve rq (kuantil regresyon) sınıfındaki modeller desteklenmektedir.\n<br/><br/>\n<b>Model Adını Seçin:</b> Modelin uyum sağlandığı sırada belirtilen model adını seçin. Bu zorunlu bir alandır.\n<br/><br/>\n<b>Grafikte Gösterilecek Değişkenler:</b> Modeli oluşturan verilere erişiminiz varsa, grafikte yer alacak değişkenlerin bir alt kümesini belirtebilirsiniz. Hiçbir değişken belirtilmezse, tüm dahil edilen değişkenler varsayılan olarak gösterilir.\n<br/><br/>\n<b>Değişken Etiketleri:</b> Değişken adlarının yerine kullanmak için daha güzel etiketler belirtin. Bir değişken etiketlenmezse, değişken adı veya modelin uyum sağlandığı sırada kullanılan mevcut değişken etiketi (varsa) gösterilecektir. Bunlar, virgülle ayrılmış olarak bir variablename=\"etiket\" formatında belirtilmelidir. Bir etikette \\n kullanmak, etiket içinde bir satır sonu zorlar. Bu, çok satırlı etiketler belirtmenizi sağlar ve uzun etiketler için avantajlı olabilir, çünkü uzun etiketlerin tek satırda bırakılması tahminler için daha az alan bırakır. Modeli Özetleme -> Bir Modeli Özetle -> Bir Modeli Özetle ile model değişkenlerini yazdırmak için modelin özetini alabilirsiniz. NOT: Cox modellerindeki faktörler için değişken etiketlerini kullanmayan forestmodel R paketinde mevcut bir hata vardır - paket geliştiricisine bildirilmiştir. Paket düzeltilene kadar alternatif, modeli faktörler yerine dummy kodlu değişkenlerle yeniden uyum sağlamaktır.\n<br/><br/><br/>\n<b>Tahmin Seçenekleri:</b>\n<br/><br/>\n<b>Etiket:</b> Grafikteki tahmin sütunu için isteğe bağlı etiket. Lojistik regresyon ve Cox modelleri otomatik olarak algılanacak ve tahminler \"Odds Ratio\" ve \n\"Hazard Ratio\" olarak etiketlenecektir. Diğer modeller, herhangi bir şey belirtmezseniz \"Tahmin\" varsayılanını kullanacaktır.\n<br/><br/>   \n<b>Parametre Tahmininin Üstel Olarak Gösterilmesi:</b> Bu seçeneği seçerek exp(katsayı) değerlerinin gösterilmesini zorlayabilirsiniz, yani katsayının üssü olarak 2.718. Üstel \nkatsayılar, Cox orantılı tehlike modellerinde (tehlike oranları için), lojistik regresyonda (oran oranları için), log-binominal modellerde (göreli riskler için) ve Poisson \nregresyonda (oran oranları için) yaygın olarak kullanılır. Varsayılan olarak, lojistik regresyon ve Cox modelleri otomatik olarak algılanacak ve exp(katsayı) kullanılacaktır.\n<br/><br/>\n<b>Çizgi Rengi:</b> Güven aralıkları için çizgi rengi.\n<br/><br/>\n<b>Nokta Şekli:</b> Grafikteki parametre tahminleri için noktaların şekli.\n<br/><br/>\n<b>Nokta Boyutu (0-10 mm):</b> Grafikteki parametre tahminleri için noktaların boyutu, milimetre cinsinden. 0 mm noktaları kaldırır. Varsayılan 4 mm'dir.\n<br/><br/><br/>\n<b>Stil Seçenekleri:</b>\n<br/><br/>\n<b>Faktör İsimlerini Ayrı Satırlarda Göster:</b> Bu seçeneği seçerek faktör değişken isimlerini faktör seviyelerinden ayrı bir satırda gösterin.\n<br/><br/>\n<b>Grafik Bantları:</b> Bu seçeneği seçerek grafiğin her satırı için alternatif gölgeli bölgeleri gösterin.\n<br/><br/>\n<b>Metin Boyutu (1-10 mm):</b> Grafikteki metin boyutu, milimetre cinsinden. Varsayılan 4 mm'dir.\n<br/><br/>\nNot: Grafiğin genel boyutunu değiştirmek istiyorsanız, grafik boyutu üç nokta menüsündeki Temalar düğmesi kullanılarak ayarlanabilir.\n<br/><br/>\n<b>Tahmin Tık İşareti Etiket Boyutu (1-50):</b> Tahmin ekseni için tık işareti etiketlerinin boyutu.\n<br/><br/>\n<b>Gerekli R Paketleri:</b>  forestmodel, arsenal, survival, quantreg, insight\n"
  }
}