{
  "title": "Friedman Testi",
  "navigation": "Friedman Testi",
  "tvarbox1": "Yanıt Değişkenleri, 2 veya daha fazla",
  "help": {
    "title": "Friedman Testi",
    "r_help": "help(friedman.test, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nTekrarsız bloklanmış verilerle Friedman sıralama toplam testi gerçekleştirir.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nfriedman.test(y, ...)\n## Varsayılan S3 yöntemi:\nfriedman.test(y, gruplar, bloklar, ...)\n## 'formül' sınıfı için S3 yöntemi\nfiredman.test(formül, veri, alt küme, na.eylem, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ny: ya bir veri değerleri sayısal vektörü ya da bir veri matrisidir.\n</li>\n<li>\ngruplar: eğer y bir vektörse, y'nin karşılık gelen elemanları için grubu veren bir vektör; y bir matris ise göz ardı edilir. Eğer bir faktör nesnesi değilse, birine dönüştürülür.\n</li>\n<li>\nbloklar: eğer y bir vektörse, y'nin karşılık gelen elemanları için bloğu veren bir vektör; y bir matris ise göz ardı edilir. Eğer bir faktör nesnesi değilse, birine dönüştürülür.\n</li>\n<li>\nformül: a ~ b | c biçiminde bir formül, burada a, b ve c veri değerlerini ve karşılık gelen grupları ve blokları verir.\n</li>\n<li>\ndata: formül formülündeki değişkenleri içeren isteğe bağlı bir matris veya veri çerçevesi (veya benzeri: model.frame'e bakın). Varsayılan olarak değişkenler environment(formül)'den alınır.\n</li>\n<li>\nalt küme: kullanılacak gözlemlerin bir alt kümesini belirten isteğe bağlı bir vektör.\n</li>\n<li>\nna.eylem: veriler NA içerdiğinde ne olacağını belirten bir işlev. Varsayılan olarak getOption(\"na.action\").\n</li>\n<li>\n...: yöntemlere iletilmesi veya yöntemlerden alınması gereken daha fazla argüman.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nfriedman.test, normalite varsayımının ihlal edilebileceği tekrarsız tam blok tasarımlarını analiz etmek için kullanılabilir (y'de grupların ve blokların seviyelerinin her kombinasyonu için tam olarak bir gözlem vardır).</br>\nNull hipotez, blokların etkisi dışında, y'nin konum parametresinin her bir grupta aynı olduğudur.\nEğer y bir matris ise, gruplar ve bloklar sırasıyla sütun ve satır indekslerinden elde edilir. Gruplarda veya bloklarda NA'lar kabul edilmez; eğer y NA'lar içeriyorsa, karşılık gelen bloklar kaldırılır.</br>\n<b>Değer</b><br/>\n\"htest\" sınıfına sahip bir liste, aşağıdaki bileşenleri içerir:<br/>\nistatistik: Friedman's chi-kare istatistiğinin değeri.<br/>\nparametre: test istatistiğinin yaklaşık chi-kare dağılımının serbestlik dereceleri.<br/>\np.değeri: testin p-değeri.<br/>\nyöntem: \"Friedman sıralama toplam testi\" karakter dizesi.<br/>\ndata.ismi: verilerin isimlerini veren bir karakter dizesi.​<br/>\n<b>Örnekler</b><br/>\n<code> \nDataframe <- data.frame(Giderler=c(20,23,19,25,26), Satışlar=c(48,50,55,51,49), Cinsiyet=c('e','k','k','e','e'), Departman=c('Muhasebe', 'İK', 'Satış','Pazarlama','BT'))<br/>\nmy_samples <- na.omit( with(Dataframe,cbind(Satışlar,Giderler)))<br/>\nSonuç_Friedman_Test = friedman.test(my_samples)<br/>\n</code> <br/>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nhelp(friedman.test, package=stats)\n"
  }
}