{
  "title": "Genelleştirilmiş Doğrusal Model",
  "navigation": "GLZM",
  "modelname": "Model adı",
  "dependent": "Bağımlı değişken",
  "offset": "Ofset",
  "weights": "Ağırlıklar",
  "formulaBuilder": "Formül oluşturucu",
  "family": "Bir aile ve bağlantı fonksiyonu seçin",
  "theta": "Theta değerini belirtin (sadece negatif binom aile için uygulanır)",
  "expCoefficients": "Katsayıları üstel hale getirin",
  "help": {
    "title": "Genelleştirilmiş Doğrusal Model",
    "r_help": "help(glm, package ='stats')",
    "body": "\n            <b>Açıklama</b></br>\n            glm, doğrusal tahmincinin sembolik tanımını ve hata dağılımının tanımını vererek genelleştirilmiş doğrusal modelleri uyarlamak için kullanılır.\n            <br/>\nNOT 1: Theta'nın başlangıç değerini belirtmek için bir metin kutusu sağlanmıştır, bu yalnızca negatif binom ailesi için geçerlidir. Atlandığında, bir Poisson GLM kullanarak yapılan başlangıç uyumundan sonra bir anlık tahminci kullanılır.<br/>\nHesaplanan başlangıç theta'sı, GLM özet tablosunun üzerinde görüntülenir.<br/>\nNOT 2: Ağırlıkları içeren bir değişken belirtirken, modeli oluşturmak için na.exclude seçeneğini kullandığımızdan, tüm NA değerlerinin bağımlı ve bağımsız değişkenlerden otomatik olarak kaldırıldığını unutmayın.<br/> \nBu, NA değerlerinin ağırlık değişkeninden otomatik olarak kaldırılmadığı için bir uyumsuzluğa neden olabilir. <br/>\nBu durumda, değişken uzunluklarının farklı olduğu hatasını göreceksiniz (ağırlıklar için bulundu).<br/>\nBu hatayı gidermek için Değişkenler>Eksik Değerler>NA'ları Kaldır'a gidin ve bağımlı, bağımsız değişkenleri ve eksik değerleri kaldırmak için ağırlık değişkenini seçin ve modeli yeniden oluşturun.<br/>\nNOT 3: Dummy kod faktör değişkenleri, negatif binom ailesini kullanırken, Değişkenler > Hesapla > Dummy Kod'a bakın.<br/>\nNOT 4: Kesir varsayılan olarak dahildir, kesiri kaldırmak için formül oluşturucusuna -1 girin.\n            <br/>\n            <b>Kullanım</b>\n            <br/>\n            <code> \n            glm(formül, aile = gaussian, veri, ağırlıklar, alt küme,\n                na.eylem, başlangıç = NULL, etastart, mustart, ofset,\n                kontrol = liste(...), model = TRUE, yöntem = \"glm.fit\",\n                x = FALSE, y = TRUE, singular.ok = TRUE, kontrastlar = NULL, ...)\n            </code> <br/>\n            <b>Argümanlar</b><br/>\n            <ul>\n            <li>\n            formül: \"formül\" sınıfının bir nesnesi (veya o sınıfa dönüştürülebilen bir nesne): uyarlanacak modelin sembolik tanımı. Model spesifikasyonu ile ilgili ayrıntılar 'Ayrıntılar'da verilmiştir.\n            </li>\n            <li>\n            aile: modelde kullanılacak hata dağılımı ve bağlantı fonksiyonunun tanımı. glm için bu, bir aile fonksiyonunu adlandıran bir karakter dizesi, bir aile fonksiyonu veya bir aile fonksiyonuna yapılan bir çağrının sonucu olabilir. Sadece üçüncü seçenek glm.fit için desteklenmektedir. (Aile fonksiyonlarının ayrıntıları için aileye bakın.)\n            </li>\n            <li>\n            veri: modeldeki değişkenleri içeren isteğe bağlı bir veri çerçevesi, liste veya ortam (veya as.data.frame ile veri çerçevesine dönüştürülebilen bir nesne). Veri içinde bulunamazsa, değişkenler genellikle glm'in çağrıldığı ortamdan alınır.\n            </li>\n            <li>\n            ağırlıklar: uyum sürecinde kullanılacak isteğe bağlı 'öncelikli ağırlıklar' vektörü. NULL veya sayısal bir vektör olmalıdır.\n            </li>\n            <li>\n            alt küme: uyum sürecinde kullanılacak gözlemlerin bir alt kümesini belirten isteğe bağlı bir vektör.\n            </li>\n            <li>\n            na.eylem: veriler NA içerdiğinde ne olacağını belirten bir işlev. Varsayılan, seçeneklerin na.eylem ayarı ile belirlenir ve ayar yapılmamışsa na.fail'dir. 'fabrika-taze' varsayılanı na.omit'tir. Diğer bir olası değer NULL'dır, hiçbir işlem yok. na.exclude değeri yararlı olabilir.\n            </li>\n            </ul>\n            <b>Ayrıntılar</b><br/>\n            Tipik bir tahminci, response ~ terms biçimindedir; burada response (sayısal) yanıt vektörüdür ve terms, yanıt için bir doğrusal tahminciyi belirten bir dizi terimdir. Binom ve quasibinom aileleri için yanıt, bir faktör olarak da belirtilebilir (ilk seviye başarısızlığı, diğer tüm seviyeler ise başarıyı belirtir) veya başarı ve başarısızlık sayılarını veren iki sütunlu bir matris olarak belirtilebilir. first + second biçimindeki bir terim tanımı, ilk terimlerdeki tüm terimleri, ikinci terimlerdeki tüm terimlerle birlikte, herhangi bir kopya kaldırılarak belirtir.<br/>\n            <b>Değer</b><br/>\n            \"glm\" sınıfının bir nesnesi, en azından aşağıdaki bileşenleri içeren bir listedir:\n            <ul>\n            <li>\n            katsayılar: adlandırılmış bir katsayı vektörü\n            </li>\n            <li>\n            kalıntılar: çalışma kalıntıları, yani IWLS uyumunun son iterasyonundaki kalıntılar. Sıfır ağırlıklı durumlar hariç tutulduğundan, çalışma kalıntıları NA'dır.\n            </li>\n            <li>\n            uyumlu.değerler: doğrusal tahmincileri bağlantı fonksiyonunun tersine dönüştürerek elde edilen uyumlu ortalama değerler.\n            </li>\n            <li>\n            sıralama: uyumlu doğrusal modelin sayısal sıralaması.\n            </li>\n            <li>\n            aile: kullanılan aile nesnesi.\n            </li>\n            <li>\n            doğrusal.tahminciler: bağlantı ölçeğindeki doğrusal uyum.\n            deviance: bir sabite kadar, maksimum log-likelihood'un iki katı eksi. Mantıklı olduğunda, sabit, doygun bir modelin deviance'ının sıfır olacak şekilde seçilir.\n            </li>\n            <li>\n            aic\t: Akaike Bilgi Kriteri'nin bir versiyonu, maksimum log-likelihood'un iki katı eksi, parametre sayısının iki katı, ailenin aic bileşeni aracılığıyla hesaplanır. Binom ve Poisson aileleri için dağılım bir olarak sabitlenmiştir ve parametre sayısı katsayı sayısıdır. Gaussian, Gamma ve ters gaussian aileleri için dağılım, kalıntı deviance'ından tahmin edilir ve parametre sayısı katsayı sayısının bir fazlasıdır. Gaussian ailesi için dağılımın MLE'si kullanılır, bu nedenle bu AIC'nin geçerli bir değeridir, ancak Gamma ve ters gaussian aileleri için değildir. Quasi-likelihood ile uyumlu aileler için değer NA'dır.\n            </li>\n            </ul>\n            <b>Paket</b></br>\nglm</br>\n<b>Yardım</b></br>\nhelp(glm, package ='stats')\n"
  }
}