{
    "title": "Normal Eğrili Histogram",
    "navigation": "Histogram",
    "x": "X ekseni, sayısal değişken(ler) belirtin",
    "bins": "Kutu sayısını belirtin",
    "fill": "Bir gruplama (Kategori) değişkeni belirtin",
    "binwidth": "Kutu genişliği",
    "barcolor": "İsteğe bağlı olarak dolgu rengi seçin (Renk seçildikten sonra uygulamak için kontrolün dışına tıklayın)",
    "alpha": "Opaklık (0-1 arası)",
    "flip": "Ekseni Ters Çevir",
    "specify_a_title": "Bir başlık girin",
    "x_title": "X ekseni etiketi",
    "y_title": "Y ekseni etiketi",
    "facets_lbl": "Facetler",
    "Facetrow": "Facet satırı",
    "Facetcolumn": "Facet sütunu",
    "Facetwrap": "Facet wrap (seçilirse, Facet satır ve sütun seçimi göz ardı edilir)",
    "Facetscale": "Facet ölçeği",
    "normalCurveColor": "Normal eğri rengi seçin (Renk seçildikten sonra uygulamak için kontrolün dışına tıklayın)",
    "rugPlot": "Rug grafiği göster (küçük veri setleri için uygundur)",
    "normalCurve": "Normal eğri göster (Eğriyi göstermek için eksik değerler kaldırılır)",
    "normalCurveHeightScaleFactor": "Normal eğrinin yüksekliğini ölçeklendirmek için herhangi bir sayı, ondalıklı olabilir (üst üste binen bar için). Ölçeklendirme için 0 girin",
    "showCountsChk": "Kutulardaki sayıları göster (grup veya facet seçildiyse sayılar gösterilmez)",
    "histogramBarPosition": "Bir grup seçildiyse çubuk konumu (üst üste veya yan yana)",
    "histogramBinDetailsChk": "Histogram kutu detaylarını tablo olarak göster",
    "help": {
        "title": "Histogram",
        "r_help": "help(geom_histogram, package=ggplot2)",
        "body": "<b>Açıklama</b></br>Histogram, sayısal verilerin dağılımını grafiksel olarak gösteren bir temsildir. Sürekli bir değişkenin (nicel değişken) olasılık dağılımının bir tahminidir. Kutu genişliğini belirtebilir veya varsayılanı kullanabilirsiniz, aşağıya bakınız. Facetler, bir faktör değişkeni belirtilerek opsiyonel olarak oluşturulabilir. Ayrıca temalar, başlık ve x ile y ekseni etiketleri isteğe bağlı olarak belirtilebilir.</br>Birden fazla X ekseni değişkeni seçildiğinde, her x ekseni değişkeni için ayrı bir histogram oluşturulur. İsteğe bağlı olarak normal eğri ve rug grafiği üst üste bindirilir.</br><br/><b>Kullanım</b><br/><code>ggplot(data=Dataset2,aes(x=engine)) + geom_histogram(binwidth=10) + labs(x=\"engine\", y=\"Sayı\") + xlab(\"\")</code><br/><b>Argümanlar</b><br/><ul><li>data: Varsayılan veri seti</li><li>aes(): Verideki değişkenlerin görsel özelliklere (estetik) nasıl eşlendiğini tanımlar.</li><li>x: Histogram çizimi için sayısal/değişken</li><li>geom_histogram: Histogram oluşturur, varsayılan olarak stat_bin 30 kutu kullanır - bu iyi bir varsayılan değildir, ancak farklı kutu genişlikleri ile deneme yapmanızı sağlar.</li><li>geom_rug: Rug grafiği oluşturur</li><li>stat_function: Normal eğri oluşturur (Not: Eğriyi göstermek için eksik değerlerin kaldırılması gerekir)</li><li>Labs(): Eksen etiketleri ve lejant başlıklarını değiştirir (isteğe bağlı)</li><li>facet_grid(): Panelleri ızgara halinde düzenler (isteğe bağlı)</li><li>theme_calc(): Hesap makinesi temasını belirler (isteğe bağlı)</li><li>coord_flip(): Ekseni ters çevirir (isteğe bağlı)</li><li>alpha: 0-1 arası değer alır, 1 opaklık yok anlamına gelir. Opaklık histogram dolgu rengine uygulanır.</li></ul><b>Paket</b>: ggplot2; ggthemes; stringr<br/><b>Yardım</b>: help(geom_histogram, package=ggplot2)"
    }
}
