{
  "title": "Overlay Normal Eğrileri ile Histogram",
  "navigation": "Histogram",
  "x": "X ekseni, bir veya daha fazla sayısal değişken belirtin",
  "bins": "Kutu sayısını belirtin",
  "fill": "Bir gruplama (Kategori) değişkeni belirtin",
  "binwidth": "Kutu genişliği",
  "barcolor": "İsteğe bağlı olarak bir dolgu rengi seçin (Renk seçimini yaptıktan sonra, kontrolün dışına tıklayarak uygulayın)",
  "alpha": "Opaklık (0-1)",
  "flip": "Eksenleri Çevir",
  "specify_a_title": "Bir başlık girin",
  "x_title": "X ekseni etiketi",
  "y_title": "Y ekseni etiketi",
  "Facetrow": "Facet satırı",
  "Facetcolumn": "Facet sütunu",
  "Facetwrap": "Facet sarma (seçilirse, Facet satır ve sütun seçimleri göz ardı edilecektir)",
  "Facetscale": "Facet ölçeği",
  "normalCurveColor": "İsteğe bağlı olarak bir normal eğri rengi seçin (Renk seçimini yaptıktan sonra, kontrolün dışına tıklayarak uygulayın)",
  "rugPlot": "Küçük veri setleri için uygun bir halı grafiği gösterin",
  "normalCurve": "Bir normal eğri gösterin (Eğrinin gösterilmesi için eksik değerler kaldırılır)",
  "showCountsChk": "Kutu üzerindeki sayıları göster (grup veya facet seçilirse sayılar gösterilmeyecektir)",
  "histogramBarPosition": "Bir grup seçildiğinde çubuk pozisyonu (üst üste veya yan yana)",
  "histogramBinDetailsChk": "Histogram Kutu detaylarını bir tabloda göster",
  "help": {
    "title": "Histogram",
    "r_help": "help(geom_histogram, package=ggplot2)",
    "body": "\n            <b>Açıklama</b></br>\n            Histogram, sayısal verilerin dağılımının grafiksel bir temsilidir. Sürekli bir değişkenin (nicel değişken) olasılık dağılımının bir tahminidir. Bir kutu genişliği belirtebilir veya varsayılanı kullanabilirsiniz, aşağıya bakın. Facet'ler, isteğe bağlı olarak bir faktör değişkeni belirterek oluşturulabilir. Ayrıca temaları isteğe bağlı olarak belirtebilir ve x ve y eksenleri için bir başlık ve etiketler belirtebilirsiniz.</br>\n            X ekseni değişkeni için birden fazla değişken seçtiğinizde, her x ekseni değişkeni için ayrı bir histogram oluşturuyoruz. İsteğe bağlı olarak bir normal eğri ve bir halı grafiği üst üste bindiriyoruz.</br>\n            <br/>\n            <b>Kullanım</b>\n            <br/>\n            <code> \n            ggplot(data=Dataset2,aes(x=engine) )+  geom_histogram(binwidth=10) +labs(x=\"engine\",y=\"Counts\") +  xlab(\"\")​\n            </code> <br/>\n            <b>Argümanlar</b><br/>\n            <ul>\n            <li>\n            data: Varsayılan veri seti​\n            </li>\n            <li>\n            aes(): Verilerdeki değişkenlerin geometri özelliklerine (estetik) nasıl eşlendiğini tanımlayan estetik eşlemeleri oluşturur.​\n            </li>\n            <li>\n            x: Histogramı çizmek için bir sayısal/ölçek değişkeni.​\n            </li>\n            <li>\n            geom_histogram: Varsayılan olarak, stat_bin 30 kutu kullanır - bu iyi bir varsayılan değildir, ancak fikir, farklı kutu genişlikleri ile denemeler yapmanızı sağlamaktır..\n            </li>\n            <li>\n            geom_rug: Bir halı grafiği oluşturur    \n            </li>\n            <li>\n            stat_function: Bir normal eğri oluşturur (Not: Eğrinin gösterilmesi için eksik değerlerin kaldırılması gerekir)    \n            </li>\n            <li>\n            Labs(): Eksen etiketlerini ve efsane başlıklarını değiştirir (Bu isteğe bağlıdır)​\n            </li>\n            <li>\n            facet_grid(): Panelleri bir ızgarada düzenler (Bu isteğe bağlıdır)​\n            </li>\n            <li>\n            theme_calc(): Hesap makinesi temasını belirtir (Bu isteğe bağlıdır)​\n            </li>\n            <li>\n            coord_flip(): Eksenleri çevirir (Bu isteğe bağlıdır)\n            </li>\n            <li>\n            alpha: 0-1 arasında bir değer alır, 1 opaklık yoktur. Opaklık, histogramın dolgu rengine uygulanır\n            </li>\n            </ul>\n            <b>Paket</b></br>\n            ggplot2;ggthemes;stringr</br>\n            <b>Yardım</b></br>\n            help(geom_histogram, package=ggplot2)</br>\n            Detaylı R yardımı almak için R Yardım butonuna tıklayın. Ayrıca help(labs), help(geom_bar), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) yazabilirsiniz.​\n           "
  }
}