{
  "title": "R Paket(ler)ini Yükle",
  "navigation": "R Paket(ler)ini Yükle",
  "package_name": "Lütfen bir veya daha fazla paket adını virgülle ayırarak girin",
  "instruction_text": "\nNOT: R paket adları büyük/küçük harf duyarlıdır. Birden fazla paket adını , ile ayırarak yükleyebilirsiniz\nÖrnek 1: foreign\nÖrnek 2: foreign, car, MASS",
  "instruction_text1": "\nNOT: Aşağıda seçilen yola yazma erişiminiz olmalıdır, aksi takdirde uygulamayı yönetici olarak çalıştırma seçeneğini seçerek yeniden başlatın",
  "repository": "CRAN deposunun URL'sini girin, varsayılan https://cloud.r-project.org/ en yakın CRAN aynasından yükler.",
  "label1": "Örnek 1: foreign",
  "label2": "NOT: Menü çubuğunda görüntülenen R logosu R vakfının telif hakkı mülküdür",
  "installPath": "R paketinin yükleneceği R kütüphane yolunu seçin",
  "help": {
    "title": "R Paket(ler)ini Yükle",
    "r_help": "help(install.packages)",
    "body": "\n            <b>Açıklama</b></br>\n            Seçilen kütüphane yoluna bir veya daha fazla R paketini yükleyin veya güncelleyin.</br>\n            NOT:</br>\n            1. Belirtilen paketlerin bağımlı olduğu, içe aktardığı veya bağlandığı tüm paketleri yükleyeceğiz.</br>\n            2. Mevcut bir paketi güncelleyiyorsanız, BlueSky Statistics uygulamasını yeniden başlatmalısınız.</br>\n            3. Yükleme işleminden sonra yeni yüklenen/güncellenen paketi yükleyeceğiz.</br>\n            4. Varsayılan olarak, her zaman yerel makinedeki kullanıcıların kişisel R kütüphanesine yükleme yapacağız.</br>\n            5. Aynı R paketi kişisel ve sistem kütüphane konumuna yüklendiğinde (Sistem kütüphane konumu, BlueSky Statistics ile birlikte gönderdiğimiz paketleri içeren varsayılan yükleme konumudur), paketi kişisel konumdan yükleriz.</br>\n            <br/>\n            <b>Kullanım</b>\n            <br/>\n            <code> \n            install.packages(pkgs = c(\"package1\", \"package2\", lib = \"Kullanıcı veya sistem kütüphanesi için yol\", repos = \"Paketin bulunduğu depo yolu\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Argümanlar</b><br/>\n            <ul>\n            <li>\n            pkgs: belirtilen depodan indirilmesi gereken paketlerin adlarının karakter vektörü.\n            </li>\n            <li>\n            lib: paketin yükleneceği yerel makinedeki kütüphane yolunu veren karakter vektörü. Her zaman kullanıcı kişisel kütüphane konumuna varsayılan olarak ayarlanır.\n            </li>\n            <li>\n            repos: kullanılacak depo URL'lerinin karakter vektörü, örneğin \"https://cloud.r-project.org\" gibi bir CRAN aynasının URL'si.\n            </li>\n            <li>\n            BSkypackageinstall: BlueSky Statistics uygulamasının menü aracılığıyla paketin yüklendiğini belirtmek için dahili olarak kullandığı bir bayraktır ve bunu geçmek için kullanılır.\n            </li>\n            </ul>\n            <b>Değer</b><br/>\n            Görünmez NULL.<br/>\n            <b>Örnekler</b><br/>\n            <code> \n            install.packages(pkgs = c('package1','package2'), lib = \"C:/Users/user1/Documents\", repos = \"https://cloud.r-project.org/\", BSkypackageinstall = TRUE)\n            </code> <br/>\n            <b>Paket</b></br>\n            broom</br>\n            <b>Yardım</b></br>\n            Ayrıntılı yardım için bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın\n\n"
  }
}