{
  "title": "Kaplan-Meier Tahmini, Grupları Karşılaştır",
  "navigation": "Kaplan-Meier Tahmini, Grupları Karşılaştır",
  "timevar": "Olay veya sansür için zaman",
  "eventvar": "Olay (1 = olay, 0 = sansür)",
  "groupvar": "Grup",
  "label1": "Grafik Türü",
  "survivalradio": "Hayatta Kalma",
  "inciradio": "Başarısızlık",
  "allesttable": "Tüm Zamanları İçeren Tahmin Tablosu",
  "printspecest": "Belirli Zamanlar için Tahmin Tablosu",
  "spectimes": "Zamanları time1, time2, time3, vb. olarak veya seq(1,5,by=1) olarak belirtin",
  "styleoptions": "Stil Seçenekleri",
  "axisoptions": "Eksen Seçenekleri",
  "label12": "Örnek veri setleri ve desteklenen veri formatı hakkında ayrıntılar için iletişim kutusunun sağ üst köşesindeki ? düğmesine tıklayın.",
  "titlebox": "Grafik Başlığı",
  "plottitlesizelabel": "Grafik Başlığı Boyutu (5-50)",
  "themedropdown": "Grafik Teması",
  "label2": "Riskteki Sayı",
  "natriskchkbox": "Riskteki Sayıyı Dahil Et",
  "risktableprop": "Risk Tablosu Yüksekliği (0-1)",
  "risktablepos": "Risk Tablosu Pozisyonu",
  "risktabletext": "Katman etiketlerini dahil et",
  "risktablevaluesize": "Risk Tablosu Değer Boyutu (1-15)",
  "risktabletitlesize": "Risk Tablosu Başlık Boyutu (5-50)",
  "risktableaxislabelsize": "Risk Tablosu Eksen Etiketi Boyutu (5-50)",
  "risktableticklabelsize": "Risk Tablosu Tık Etiketi Boyutu (5-50)",
  "risktableclean": "Risk Tablosundan Eksenleri ve Izgara Çizgilerini Kaldır",
  "label2b": "Açıklama",
  "legendpos": "Pozisyon",
  "legendtitle": "Başlık",
  "legendlabels": "Değer Etiketleri (varsayılan NULL'dır; katman sırasına göre verin; örn. c('Erkek', 'Kadın')):",
  "legendfontsize": "Açıklama Etiketleri Boyutu (5-50)",
  "label3": "Çizgi Seçenekleri",
  "linesize": "Boyut (0-5)",
  "linecolor": "Renk paleti",
  "label4": "Güven Aralığı",
  "cichkbox": "95% CI dahil et",
  "cistyle": "Stil",
  "citransparency": "Şeffaflık (0-1)",
  "label5": "Sansürlü Zamanlar",
  "censorchkbox": "Sansürlü Zamanları Dahil Et",
  "censorsize": "Boyut (0-10)",
  "medsurvivalline": "Medyan Hayatta Kalmayı Göster (h=horizontal, v=vertical)",
  "label5b": "P-Değeri",
  "pvaluechkbox": "P-değerini dahil et",
  "label5c": "Tür",
  "logrank": "Log-Rank",
  "gehanbreslow": "Gehan-Breslow (Wilcoxon)",
  "taroneware": "Tarone-Ware",
  "petopeto": "Peto-Peto",
  "modpetopeto": "Modifiye Peto-Peto",
  "flemharr": "Flemington-Harrington",
  "pvaluelocation": "Konum ((x,y), örn. c(zaman, oran)):",
  "pvaluesize": "Boyut",
  "label6": "Hayatta Kalma Eksen",
  "survaxislabel": "Etiket",
  "label7": "Ölçek",
  "defbutton": "oran",
  "pctbutton": "yüzde",
  "survaxislimits": "Oran ölçeğinde eksen sınırları (0-1) - 'c(min, max)' girin",
  "survtickinc": "Tık İşareti Artışları (0-1)",
  "label8": "Zaman Eksen",
  "timeaxislabel": "Etiket",
  "timeaxislimits": "Eksen Sınırları (NULL varsayılandır, değiştirmek için 'c(min,max)' girin, örn. 'c(0,20)')",
  "timetickinc": "Tık İşareti Artışları (NULL varsayılandır, değiştirmek için bir sayı girin, min=0)",
  "axislabelsize": "Eksen Etiketi Boyutu (5-50)",
  "ticklabelsize": "Eksen Tık İşareti Etiketi Boyutu (5-50)",
  "help": {
    "title": "Kaplan-Meier Tahmini, Grupları Karşılaştır",
    "r_help": "help(ggsurvplot, package = 'survminer')",
    "body": "\n\t\t\tYükleme dizininde örnek veri setini görün, varsayılan konum sürücü harfi:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\survival\\mockstudy_upd.RData. Followup_time değişkeni olay veya sansür için zaman olarak girilmeli ve Event değişkeni Olay (1 = olay, 0 = sansür) olarak girilmelidir. sex değişkeni grup değişkeni olmalıdır.<br/>\n            Bu veri seti arsenal paketindeki mockstudy veri setinin güncellenmiş bir versiyonudur.<br/><br/>\t\t\t\n            <b>Kaplan-Meier hayatta kalma eğrilerinin karşılaştırılması</b>\n            <br/>\n            <br/>\n            Bunlar, bir olayın olmaması (veya tersine, bir olayın olması) riskini tahmin etmek için kullanılır. Olay için takip süresinin başlangıcından itibaren risk altında olmaları gerekir.\n            <br/>\n            <br/>\n            <b>Zaman:</b> Olayın gerçekleştiği süre veya olayın gerçekleşmediği son takip süresi, her bir konu için\n            <br/><br/>\n            <b>Olay:</b> Olayın gerçekleşip gerçekleşmediğini gösteren sayısal gösterge (1=olay, 0=sansür) her bir konu için\n            <br/><br/>\n            <b>Grup:</b> Karşılaştırmak istediğiniz gruplar\n            <br/><br/>\n            <b>Grafik Türü:</b> Olayın olmama olasılığını (hayatta kalma) veya olayın olma olasılığını (başarısızlık) çizmek isteyip istemediğiniz\n            <br/><br/>\n            <b>Tüm Zamanları İçeren Tahmin Tablosu:</b> Veri setindeki her gözlemlenen zaman için hayatta kalma ve olay tahmin olasılıklarını içeren bir tablo dahil etme seçeneği\n            <br/>\n            <br/>\n\t\t\t<b>Belirli Zamanlar için Tahmin Tablosu:</b> Kullanıcı tarafından seçilen bir zaman seti için hayatta kalma tahmin olasılıklarını içeren bir tablo dahil etme seçeneği.\n\t\t\t<br/><br/>\n\t\t\t<b>Zamanları time1, time2, time3, vb. veya seq(1,5,by=1) olarak belirtin:</b> Bu, belirli zamanlar için tabloda yer alacak belirli zamanlardır. Virgülle bireysel olarak belirtilebilir veya eşit aralıklı değerler dizisi olarak belirtilebilir.\n\t\t\t<br/><br/>\n            Bir tablo, örnek büyüklüğü, olay olan konu sayısı, medyan hayatta kalma süresi (tanımlıysa) ve grup ve genel olarak medyan takip süresi ile birlikte çıktı verir. Medyan takip süresi, \"tipik\" takip süresinin bir tahminidir. Gerçek olayları sansürlü gözlemler olarak ve gerçek sansürlü gözlemleri olaylar olarak ele alan ters Kaplan-Meier tahmincisi kullanılarak hesaplanır. Böylece, bu tahmincideki \"olay\", \"çalışmaların mümkün olduğu kadar uzun süre boyunca katılımcıları takip etme\"dir.\n            <br/>\n            Hayatta kalma eğrileri, log-rank ve Gehan-Breslow (Wilcoxon) en yaygın olarak rapor edilen yöntemlerle karşılaştırılır.\n            Veri setindeki her gözlemlenen zaman için Kaplan-Meier hayatta kalma ve olay tahminleri tablosu, %95 güven aralıkları ile sağlanır. \n            <br/>\n            <br/>\n            <b>Gerekli Paketler:</b> survival, broom, survminer, dplyr, arsenal, ggthemes, RColorBrewer, ggsci\n            <br/><br/>\n            <br/>\n            <b>Stil Seçenekleri</b>\n            <br/>\n            <br/>\n            <b>Grafik Başlığı:</b> Grafiğin başlığı; başlık olmaması için tüm metni silin\n            <br/><br/>\n\t\t\t<b>Grafik Başlığı Boyutu:</b> Grafik başlığının boyutu.\n\t\t\t<br/><br/>\t\t\t\n            <b>Grafik Teması:</b> Grafiğin genel stili\n            <br/><br/>\n            <b>Riskteki Sayı:</b> İsteğe bağlı olarak, grafiğin alt kısmında zamanla riskteki konu sayısını gösteren bir tablo dahil etme seçeneği.  <b>Risk Tablosu Pozisyonu</b>, tablonun eksenlerin dışında mı yoksa içinde mi olmasını istediğinizi belirtir.  <b>Risk Tablosu Yüksekliği</b>, tablonun kaplayacağı grafik alanının oranını kontrol eder.  <b>Katman etiketlerini dahil et</b> seçeneği, katman etiketlerinin dahil edilip edilmeyeceğini kontrol eder. Eğer dahil edilmezse, katmanlar yalnızca renk ile farklılaştırılacaktır. Tablo pozisyonu ve katman etiketleri seçenekleri, risk tablosu pozisyonu eksenlerin içindeyken göz ardı edilir.\n\t\t\t<b>Risk Tablosu Değer Boyutu</b>, riskteki sayıların boyutunu kontrol eder. <b>Risk Tablosu Başlık Boyutu</b>, riskteki sayı tablosunun başlığının boyutunu kontrol eder.\n\t\t\t<b>Risk Tablosu Eksen Etiketi Boyutu</b>, eksen etiketlerinin boyutunu kontrol eder. \n\t\t\t<b>Risk Tablosu Tık Etiketi Boyutu</b>, tık işareti etiketlerinin boyutunu kontrol eder. Tüm eksenleri ve ızgara çizgilerini kaldırmak isteniyorsa, <b>Risk Tablosundan Eksenleri ve Izgara Çizgilerini Kaldır</b> seçeneği işaretlenebilir. Bu, tabloda yalnızca riskteki sayıları dahil edecektir.           \n            <br/><br/>\n            <b>Açıklama seçenekleri:</b>\n            <br/>\n            <b>Pozisyon</b> seçeneği, açıklamanın konumunu (üst, alt, sol, sağ) kontrol eder.  <b>Başlık</b>, açıklamanın başlığıdır. Başlığı kaldırmak için, metin kutusundan tüm metni kaldırın.  <b>Değer Etiketleri</b>, katmanların açıklamada gösterileceği etiketleri belirler.  Önemli: Varsayılanı değiştirmek istiyorsanız, bunlar açıklamadaki görünüm sırasına göre belirtilmelidir. Etiketleri değiştirmek, her katmanla ilişkili rengi değiştirmez.\n\t\t\t<b>Açıklama Etiketleri Boyutu</b> seçeneği, açıklamada bulunan tüm metinlerin boyutunu kontrol eder.\n            <br/>\n            <br/>\n            <b>Çizgi Seçenekleri:</b>\n            <br/>\n            <b>Boyut</b>, kalınlığı kontrol eder ve <b>Renk Paleti</b>, çizilen çizgilerin renklerini kontrol eder. \"gri\" seçeneklerinden birini seçerek gri tonlamalı bir palet elde edebilirsiniz. Bilimsel dergileri taklit eden renk şemaları da sağlanmaktadır. Tahminler için isteğe bağlı olarak %95 güven aralığını bir <b>şerit</b> (gölgelendirilmiş alan) veya <b>adım</b> (çizgi) formatında dahil edebilirsiniz. <b>Şeffaflık</b>, şeridin ne kadar koyu olduğunu kontrol eder ve adım seçeneği seçildiğinde göz ardı edilir. <b>Sansürlü Zamanlar</b> (katılımcıların olay için artık risk altında olmadığı zamanlar) çizgi üzerinde \"+\" sembolleri ile gösterilebilir. \"+\" sembollerinin boyutu ayarlanabilir. <b>Medyan Hayatta Kalmayı Göster</b> seçeneği, %50'sinin olay yaşadığı tahmin edilen zamanda yatay veya dikey çizgiler dahil edecektir. Medyan zaman, hayatta kalma eğrisi %50'yi geçmediğinde tanımsızdır.\n            <br/>\n            <br/>\n            <b>P-Değeri seçenekleri:</b>\n            <br/>\n            İsteğe bağlı olarak, eğrileri karşılaştıran p-değerini grafikte dahil edebilirsiniz. <b>Tür</b>, istenen p-değerini kontrol eder; Log-Rank ve Gehan-Breslow (Wilcoxon) en yaygın olarak rapor edilenlerdir. <b>Konum</b>, p-değerinin grafikte nerede yer alacağını kontrol eder, (x,y)=(zaman,oran) konumunda. <b>Boyut</b>, çizilen p-değerinin boyutunu belirler.\n            <br/>\n            <br/>\n            <br/>      \n            <b>Eksen Seçenekleri</b>\n            <br/>\n            <br/>\n            <b>Etiket</b> seçeneği, eksen için metin etiketini belirtir. <b>Eksen Sınırları</b>, eksenin minimum ve maksimum değerlerini belirtir. <b>Tık İşareti Artışları</b> seçeneği, eksendeki tık işaretlerinin aralığını kontrol eder. Zaman eksenindeki artışlar, isteğe bağlı riskteki sayı tablosu için zamanları da kontrol eder.\n            <br/>\n            Hayatta kalma ekseni <b>Ölçek</b> seçeneği, tahminlerin oran (0-1) veya yüzde (0-100) ölçeğinde olmasını isteyip istemediğinizi belirtir.\n\t\t\t<br/><br/>\n\t\t\t<b>Eksen Etiketi Boyutu:</b> Bu, hem hayatta kalma hem de zaman ekseni etiket boyutlarını kontrol eder.\n\t\t\t<br/><br/>\n\t\t\t<b>Eksen Tık İşareti Etiketi Boyutu:</b> Bu, hem hayatta kalma hem de zaman ekseni tık işareti etiket boyutlarını kontrol eder.\t\t\t\n      "
  }
}