{
  "title": "Kruskal-Wallis Sıralama Toplam Testi",
  "navigation": "Kruskal-Wallis Testi",
  "tvarbox1": "Yanıt değişkeni",
  "tvarbox2": "Faktör değişkeni",
  "label1": "Tahmin yöntemi",
  "default": "Asimptotik",
  "exact": "Kesin NOT: faktör değişkeninin tam olarak 2 seviyeye sahip olması gerekir, aksi takdirde bir hata görüntülenecektir",
  "normal": "Monte Carlo",
  "header": "NOT: Kesin tahmin yöntemini seçerken, faktör değişkeninin tam olarak 2 seviyeye sahip olması gerekir, aksi takdirde bir hata görüntülenecektir",
  "padjust": "Çoklu karşılaştırma ayarlaması",
  "ties": "Bağlantılarla başa çıkma seçenekleri",
  "simulations": "Simülasyon sayısını girin",
  "help": {
    "title": "Kruskal-Wallis Sıralama Toplam Testi",
    "r_help": "help(kruskal.test, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nKruskal-Wallis sıralama toplam testini gerçekleştirir.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nkruskal.test(x, ...)\n## Varsayılan S3 yöntemi:\nkruskal.test(x, g, ...)\n## 'formül' sınıfı için S3 yöntemi\nkruskal.test(formül, veri, alt küme, na.action, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nArgümanlar\nx: veri değerlerinin sayısal bir vektörü veya sayısal veri vektörlerinin bir listesi. Bir listenin sayısal olmayan elemanları bir uyarı ile zorlanacaktır.\n</li>\n<li>\ng: x'in karşılık gelen elemanları için grubu veren bir vektör veya faktör nesnesi. x bir liste ise bir uyarı ile göz ardı edilir.\n</li>\n<li>\nformül: yanıt ~ grup biçiminde bir formül, burada yanıt veri değerlerini ve grup karşılık gelen grupların bir vektörünü veya faktörünü verir.\n</li>\n<li>\ndata: formül formülündeki değişkenleri içeren isteğe bağlı bir matris veya veri çerçevesi (veya benzeri: model.frame'e bakın). Varsayılan olarak değişkenler environment(formül)'den alınır.\n</li>\n<li>\nalt küme: kullanılacak gözlemlerin bir alt kümesini belirten isteğe bağlı bir vektör.\n</li>\n<li>\nna.action: veriler NA içerdiğinde ne olacağını belirten bir işlev. Varsayılan olarak getOption(\"na.action\").\n</li>\n<li>\n...: yöntemlere iletilmesi gereken veya yöntemlerden iletilmesi gereken daha fazla argüman.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nkruskal.test, x'in dağılımının konum parametrelerinin her grupta (örnek) aynı olduğu varsayımının Kruskal-Wallis sıralama toplam testini gerçekleştirir. Alternatif, en az birinin farklı olduğudur.</br>\nEğer x bir liste ise, elemanları karşılaştırılacak örnekler olarak alınır ve bu nedenle sayısal veri vektörleri olmalıdır. Bu durumda, g göz ardı edilir ve testi gerçekleştirmek için basitçe kruskal.test(x) kullanılabilir. Örnekler henüz bir listede yer almıyorsa, kruskal.test(list(x, ...)) kullanın.</br>\nAksi takdirde, x bir sayısal veri vektörü olmalı ve g, x'in karşılık gelen elemanları için grubu veren x ile aynı uzunlukta bir vektör veya faktör nesnesi olmalıdır.</br>\n<b>Değer</b><br/>\n\"htest\" sınıfına sahip bir liste, aşağıdaki bileşenleri içerir:<br/>\nistatistik: Kruskal-Wallis sıralama toplam istatistiği<br/>\nparametre: test istatistiğinin yaklaşık ki-kare dağılımının serbestlik dereceleri<br/>\np.değeri: testin p-değeri<br/>\nyöntem: \"Kruskal-Wallis sıralama toplam testi\" karakter dizisi<br/>\ndata.name: verilerin adlarını veren bir karakter dizisi<br/>\n<b>Açıklama</b></br>\nÇoklu Karşılaştırma Ayarlaması</br>\nAyarlama yöntemleri, p-değerlerinin karşılaştırma sayısı ile çarpıldığı Bonferroni düzeltmesini (\"bonferroni\") içerir. Daha az korumalı düzeltmeler de Holm (1979) (\"holm\"), Hochberg (1988) (\"hochberg\"), Hommel (1988) (\"hommel\"), Benjamini & Hochberg (1995) (\"BH\" veya takma adı \"fdr\") ve Benjamini & Yekutieli (2001) (\"BY\") tarafından dahil edilmiştir. Bir geçiş seçeneği (\"none\") de dahil edilmiştir. Yöntemler, p.adjust yöntemine iletilmesi gereken yöntem olarak bir seçenek olarak ihtiyaç duyan yöntemler için p.adjust.methods vektöründe yer almaktadır.</br>\nİlk dört yöntem, ailevi hata oranını güçlü bir şekilde kontrol etmek için tasarlanmıştır. Değiştirilmemiş Bonferroni düzeltmesini kullanmak için bir neden yoktur çünkü Holm'un yöntemi tarafından baskın bir şekilde kullanılmaktadır, bu da keyfi varsayımlar altında geçerlidir.</br>\nHochberg'in ve Hommel'in yöntemleri, hipotez testleri bağımsız olduğunda veya negatif olmayan bir şekilde ilişkili olduğunda geçerlidir (Sarkar, 1998; Sarkar ve Chang, 1997). Hommel'in yöntemi Hochberg'den daha güçlüdür, ancak fark genellikle küçüktür ve Hochberg p-değerleri daha hızlı hesaplanır.</br>\nBenjamini, Hochberg ve Yekutieli'nin \"BH\" (aka \"fdr\") ve \"BY\" yöntemi, yanlış keşif oranını kontrol eder, reddedilen hipotezler arasındaki yanlış keşiflerin beklenen oranını. Yanlış keşif oranı, ailevi hata oranından daha az katı bir koşuldur, bu nedenle bu yöntemler diğerlerinden daha güçlüdür.</br>\n</br>\nİkili grup karşılaştırmaları için test yöntemi:</br>\nVarsayılan: örnekler 50'den az sonlu değer içeriyorsa ve bağlantı yoksa kesin bir p-değeri hesaplanır. Aksi takdirde, normal bir yaklaşım kullanılır.</br>\nKesin: kesin bir p-değeri hesaplanır; hesaplama süresi nedeniyle büyük örnek boyutları için önerilmez</br>\nNormal Yaklaşım: normal bir yaklaşım kullanılarak p-değerleri hesaplanır</br>\nSüreklilik Düzeltmesi ile: süreklilik düzeltmesi ile normal bir yaklaşım kullanılarak p-değerleri hesaplanır </br>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nhelp(kruskal.test, package=stats)\n"
  }
}