{
  "title": "Bırakma Birini Dışarıda Çapraz Doğrulama",
  "navigation": "Bırakma Birini Dışarıda Çapraz Doğrulama",
  "modelname": "Ayarlanmış model için ad girin",
  "dependent": "Tahmin Edilecek Değişken",
  "independent": "Bağımsız Değişkenler",
  "levelOfInterest": "Tahmin edilecek değişkenin 2 seviyesi olduğunda, ilgi düzeyini belirtin. Karışıklık matrisinin ve ilgili istatistiklerin belirtilen ilgi düzeyi referans olarak görüntülenir.",
  "label1": "BİRKAÇ MODEL, KAYIP DEĞERLER VEYA BAĞIMLI DEĞİŞKENLERİN FAKTÖRLER OLDUĞU DURUMLARA TEPKİ GÖSTERİR. KAYIP DEĞERLERLE İLGİLİ İŞLEMLER İÇİN [ DEĞİŞKENLER > KAYIP DEĞERLER ] VE FAKTÖR DEĞİŞKENLERİN DUMMY KODLAMASI İÇİN [ DEĞİŞKENLER > HESAPLA > DUMMY KODU ]'NA BAKIN. Ayrıntılar için diyalog kutusunun sağ üst köşesindeki ? simgesine tıklayın.",
  "ModelSelection": "Bir model kategorisi seçin ve ardından model türünü seçin",
  "help": {
    "title": "Bırakma Birini Dışarıda Çapraz Doğrulama",
    "r_help": "help(train, package=caret)",
    "body": "\n<b>Açıklama</b></br>\nBırakma Birini Dışarıda Çapraz Doğrulama, caret paketindeki trainControl ve train fonksiyonlarını kullanarak ayarlanmış/optimize edilmiş bir model oluşturur.<br/>\nAyarlanmış bir model, ayarlama parametreleri boyunca yeniden örnekleme sonuçları ile oluşturulur. Ayarlama sonuçları, çıktının altındaki tabloların altında görüntülenir.<br/>\nAyarlanmış model oluşturulduktan sonra, modelin oluşturulmasında kullanılan eğitim veri setine karşı ayarlanmış model ile tahminler yapılır ve karışıklık matrisinin ve ilgili istatistiklerin görüntülenir.<br/>\nNOT: Dummy kodlaması gerektiren bağımlı değişkenler ve desteklenen bağımlı değişkenler için ilgili gereksinimler hakkında ayrıntılar için https://www.blueskystatistics.com/Articles.asp?ID=330 adresini ziyaret edin. Ayrıca bazı modeller kayıp değerleri desteklemez, model oluşturulurken hata mesajları görüntülenirse, kayıp değerleri kaldırın.<br/>\nAyarlanmış model, metin kutusu kontrolünde belirttiğiniz bir isimle train sınıfının nesnesinde saklanır.<br/>\nSon ayarlanmış model için seçilen parametre değerleri, çıktının altında görüntülenir.<br/>\nİki seviyeli tahmin ediciler durumunda, referans düzeyini/ilgi düzeyini seçme seçeneğiniz vardır.<br/>\nKarışıklık matrisi ve ilgili istatistikler, belirtilen ilgi düzeyi kullanılarak oluşturulur.<br/>\n<code> \ntrain_control <- caret::trainControl(method=\"LOOCV\")<br/>\n# Genel sözdizimi<br/>\ntunedModel <- caret::train(x = modeli eğitmek için örnek veri, y = bağımlı değişken, trControl = train_control, method = \"kullanılacak model\", prob.model = TRUE )<br/>\n# Örnek doldurulmuş sözdizimi<br/>\ntunedModel <- caret::train(as.data.frame(TrainData), dependentVariable, trControl = train_control, method = \"adaboost\", preProcess = NULL, prob.model = TRUE )<br/>\n</code>\nAyarlanmış model için bir karışıklık matrisi ve model doğruluk istatistikleri oluşturuyoruz. Bu aşağıdaki gibi yapılır\n<ul>\n<li>\nOptimizasyon modelinin sınıfı train olan modelden tahmin edilen değerleri elde etmek için predict fonksiyonunu çağırarak eğitim veri setinden tahmin edilen değerleri oluşturuyoruz.<br/>\n<code> \npredictedValues = predict(tunedModel train fonksiyonu tarafından döndürülen)<br/>\n</code> <br/>\n</li>\n<li>\nAşağıda oluşturulan karışıklık matrisinden doğruluk istatistiklerini hesaplıyoruz<br/>\n<code> \ncaret::confusionMatrix (tahminler = predictedValues, referans = model bağımlı değişken)<br/>\n</code> \n</li>\n</ul>\nSon ayarlanmış/optimize edilmiş modeli bir veri setini puanlamak için kullanabilirsiniz. Bunu yapmak için, aşağıdaki adımları izleyin<br/>\n1.  Puanlamak istediğiniz veri setine gidin. Not: Puanlanacak veri setindeki değişken adları (yani bağımsız değişkenler), ayarlanmış modeli oluşturmak için kullandığınız veri setindeki değişken adlarıyla eşleşmelidir. Aksi takdirde bir hata görüntülenecektir. Bu hata mesajı, Model puanlama diyalog kutusundaki tanılama testleri bölümünün altında görüntülenecektir, aşağıdaki 2. noktaya bakın. <br/>\n2.\tModel Değerlendirme>Tahmin>Model Puanlama altında Model Puanlama diyalog kutusunu açın. <br/>\n3.\tPuanlamak için kullanmak istediğiniz bir modeli seçin. Oluşturduğunuz modelleri sınıfa göre filtreleyebilirsiniz. <br/>\n4.\tModeli seçtikten sonra, tahmin edilen değerleri saklamak için bir ön ek belirtin. Tahminler için güven aralıklarını kaydedebilir ve bir karışıklık matrisi oluşturabilirsiniz. Tahminleri/sıralamaları içeren değişken için bir ön ek belirtmelisiniz. Tahminler ve tahmin edilen olasılıklar, uygulanabilir olduğunda, veri setinin sonunda yeni değişkenler olarak saklanır. Örneğin, belirtilen ön ek AA ise, tahminler AA_orijinal bağımlı değişken adı_Tahminler değişkeninde, tahmin edilen olasılıklar AA_Düzey1_TahminEdilenOlasılıklar değişkeninde saklanır. <br/>\n5.  Veri setini puanlamak için Çalıştır düğmesine tıklayın. <br/>\n<b>Paket</b></br>\ncaret</br>\n<b>Yardım</b></br>\nAyrıntılı yardım için bu diyalog kutusunun sağ üst köşesindeki R simgesine tıklayın veya R Editör penceresinde help(train, package ='caret') komutunu çalıştırın\n"
  }
}