{
  "title": "Lojistik Regresyon",
  "navigation": "Lojistik, ileri düzey",
  "modelname": "Model adını girin",
  "dependent": "Bağımlı değişken",
  "independent": "Bağımsız değişken(ler)",
  "generateplotchk": "Artıklar ile uyumlu, normal Q-Q, ölçek-lokasyon ve artıklar ile etki arasındaki grafiği oluştur",
  "destination2": "Ağırlıklarla bir değişken belirtin",
  "help": {
    "title": "Lojistik Regresyon",
    "r_help": "help(glm, package ='stats')",
    "body": "\n<b>Açıklama</b></br>\nBir formül oluşturucu kullanarak ikili lojistik regresyon modeli oluşturur. glm fonksiyonunu family =binomial(link='logit') parametresi ile kullanıyoruz. Modelin bir özetini, varyans analizi tablolarını ve McFadden R2'yi gösteriyoruz.<br/>\nModeli, ana uygulama ekranının sağ üst köşesindeki oluşturulan modeli seçerek ve Skor butonunu seçerek puanlayabilirsiniz. Bir karmaşıklık matrisini ve bir ROC eğrisini görüntülemeyi seçebilirsiniz.<br/>\nVarsayılan model adı Logistic1'dir, bunu değiştirebilirsiniz.<br/><br/>\nNOT: Ağırlıkları içeren bir değişken belirtirken, modeli oluşturmak için na.exclude seçeneğini kullandığımızdan, tüm NA değerleri bağımlı ve bağımsız değişkenlerden otomatik olarak kaldırılır.<br/> \nBu, ağırlık değişkeninden NA değerlerinin otomatik olarak kaldırılmaması nedeniyle bir uyumsuzluğa neden olabilir. <br/>\nBu durumda, değişken uzunluklarının farklı olduğu hatasını göreceksiniz (ağırlıklar için bulundu)<br/>\nBu hatayı gidermek için Değişkenler>Eksik Değerler>NA'ları Kaldır'a gidin ve bağımlı, bağımsız değişkenleri ve eksik değerleri kaldırmak için ağırlık değişkenini seçin ve modeli yeniden oluşturun.<br/>\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nmodelname <- glm(dependentVariable ~ var1+var2+var3...,family =binomial(link='logit'),data=datasetName)\n#Modeli özetleme<br/>\nsummary(modelname)<br/>\n#Anova tablosunu görüntüleme<br/>\nanova(modelname)<br/>\n#Artıklar ile uyumlu, normal Q-Q, ölçek-lokasyon, artıklar ile etki arasındaki grafiği oluştur<br/>\nplot(modelname)<br/>\n#McFadden R2<br/>\npR2(Logistic1)<br/>\n#oran oranı ve %95 güven aralığı<br/>\nexp(cbind(OR=coef(Logistic1), confint(Logistic1,level=0.95)))<br/>\n#Modeli çiz<br/>\nplot(Logistic1)<br/>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ndepVar: Bağımlı değişkenin adı. Eğer bir cars veri kümesine sahipseniz ve tahmin etmek istediğiniz bir değişken sınıf ise (bağımlı değişken sınıf) sınıfı girin.\n</li>\n<li>\nindepVars: Bağımsız değişkenlerin adları, + ile ayrılmış. Eğer bir cars veri kümesine sahipseniz ve bağımsız değişkenler beygir gücü, motor hacmi ise, beygir gücü+motor hacmi olarak belirtin. Kategorik değişkenler otomatik olarak dummy kodlanır.​\n</li>\n<li>\ndata: Veri çerçevesinin adı. Veri çerçevelerini veya veri setlerini açtığınızda, örneğin csv, Excel dosyaları, SAS dosyaları BlueSky İstatistiklerinde Dataset1, Dataset2, Dataset3 olarak adlandırılır. Bu nedenle data=Dataset1​ girin.\n</li>\n</ul>\n<b>Paket</b></br>\nglm</br>\n<b>Yardım</b></br>\nhelp(glm, package ='stats')</br>\n<b>Kaynaklar</b></br>\nhttps://datascienceplus.com/perform-logistic-regression-in-r/</br>\nhttps://www.machinelearningplus.com/machine-learning/logistic-regression-tutorial-examples-r/</br>\n<b>Diğer</b></br>\nDetaylı R yardımı almak için R Yardım simgesine tıklayın​</br>\n\t\t\t"
  }
}