{
  "ProjectTitleStr": "Proje",
  "Source_variables": "Kaynak değişkenler",
  "Source_Datasets": "Kaynak Veri Setleri",
  "Source_Datasets_rerun": "Kaynak Veri Setleri",
  "jsoncomment000": "=======Aşağıdaki Formül Oluşturucu=======",
  "FBStr0": "Formül Oluşturucu",
  "FBStr1": "Aşağıdaki bir düğmeye tıklayın ve ifadeyi oluşturmak için değişkenleri sürükleyip bırakın.",
  "FBStr2": " Seçilen bir düğmeye tıklamak durumu değiştirecektir.",
  "FBStr3": " Bir konuma eklemek için, imleci o konuma yerleştirin ve değişken(ler)i sürükleyip bırakın/hareket ettirin.",
  "FBStr4": " Yardım için bir düğmenin üzerine gelin.",
  "FBStr5": " Tüm N yolu düğmesini değiştiremezsiniz.",
  "FBttip1": " + düğmesine tıklayın, ardından + ile ayırmak istediğiniz değişkenleri hareket ettirin. Sadece + eklemek için, üzerine çift tıklayın.",
  "FBttip2": " - düğmesine tıklayın, ardından - ile ayırmak istediğiniz değişkenleri hareket ettirin. Sadece - eklemek için, üzerine çift tıklayın.",
  "FBttip3": " * düğmesine tıklayın, ardından * ile ayırmak istediğiniz değişkenleri hareket ettirin. Sadece * eklemek için, üzerine çift tıklayın.",
  "FBttip4": " / düğmesine tıklayın, ardından / ile ayırmak istediğiniz değişkenleri hareket ettirin. Sadece / eklemek için, üzerine çift tıklayın.",
  "FBttip5": " Ekleme için ( düğmesine tıklayın.",
  "FBttip6": " Ekleme için ) düğmesine tıklayın.",
  "FBttip7": " %in% düğmesine tıklayarak %in% ekleyin.",
  "FBttip8": " Ekleme için | düğmesine tıklayın.",
  "FBttip9": " : düğmesine tıklayın, ardından : ile ayırmak istediğiniz değişkenleri hareket ettirin. Sadece : eklemek için, üzerine çift tıklayın.",
  "FBbtnlbl10a": "Tüm 2 yolu",
  "FBbtnlbl10b": "Tüm 3 yolu",
  "FBbtnlbl10c": "Tüm 4 yolu",
  "FBbtnlbl10d": "Tüm 5 yolu",
  "FBbtnlbl10e": "Tüm 6 yolu",
  "FBbtnlbl10f": "Tüm 7 yolu",
  "FBbtnlbl10g": "Tüm 8 yolu",
  "FBbtnlbl10h": "Tüm 9 yolu",
  "FBbtnlbl10i": "Tüm 10 yolu",
  "FBttip10": "Tüm N-yolu seçeneğine tıklayın ve ardından değişkenleri hareket ettirerek N-yolu etkileşimleri oluşturun. Devre dışı bırakmak için başka bir düğmeye tıklayın.",
  "FBbtnlbl11": "Polinom terimleri",
  "FBttip11": "Bir sayı seçin, düğmeye tıklayın ve derece N polinom terimlerini eklemek için değişkenleri hareket ettirin.",
  "FBbtnlbl12": "Spline için df",
  "FBttip12": "Spline'lar için bir serbestlik derecesi belirtin.",
  "FBbtnlbl13": "Polinom derecesi",
  "FBttip13": "Bir polinom derecesi belirtin.",
  "FBbtnlbl14": "B-spline",
  "FBttip14": "B-spline'a tıklayın, ardından bir veya daha fazla değişkeni hareket ettirin. Genel kod eklemek için, üzerine çift tıklayın.",
  "FBbtnlbl15": "Doğal spline",
  "FBttip15": "Doğal spline'a tıklayın, ardından bir veya daha fazla değişkeni hareket ettirin. Genel kod eklemek için, üzerine çift tıklayın.",
  "FBbtnlbl16": "Ortogonal polinom",
  "FBttip16": "Ortogonal polinom düğmesine tıklayın, ardından bir veya daha fazla değişkeni hareket ettirin. Genel kod eklemek için, üzerine çift tıklayın.",
  "FBbtnlbl17": "Ham polinom",
  "FBttip17": "Ham polinom düğmesine tıklayın, ardından bir veya daha fazla değişkeni hareket ettirin. Genel kod eklemek için, üzerine çift tıklayın.",
  "jsoncomment001": "=======Aşağıdaki Hesap Oluşturucu=======",
  "CBStr1": "Aşağıdaki bir düğmeye tıklayın ve ifadeyi oluşturmak için değişkenleri sürükleyip bırakın.",
  "CBStr2": " Seçilen bir düğmeye tıklamak durumu değiştirecektir.",
  "CBStr3": " Bir konuma eklemek için, imleci o konuma yerleştirin ve değişken(ler)i sürükleyip bırakın/hareket ettirin.",
  "CBStr4": " Yardım için bir düğmenin üzerine gelin.",
  "CBtabArithmetic": "Aritmetik",
  "CBtabLogical": "Mantıksal",
  "CBtabMath": "Matematik",
  "CBtabString1": "Dize(1)",
  "CBtabString2": "Dize(2)",
  "CBtabConversion": "Dönüşüm",
  "CBtabStatistical": "İstatistiksel",
  "CBtabRandomNumbers": "Rastgele Sayılar",
  "CBtabDate1": "Tarih(1)",
  "CBtabDate2": "Tarih(2)",
  "CBtabDate3": "Tarih(3)",
  "CBtabDate4": "Tarih(4)",
  "CBttip1": "+ butonuna tıklayın, ardından ayırmak istediğiniz değişkenleri + ile hareket ettirin. Sadece + eklemek için, çift tıklayın",
  "CBttip2": "- butonuna tıklayın, ardından ayırmak istediğiniz değişkenleri - ile hareket ettirin. Sadece - eklemek için, çift tıklayın",
  "CBttip3": "* butonuna tıklayın, ardından ayırmak istediğiniz değişkenleri * ile hareket ettirin. Sadece * eklemek için, çift tıklayın",
  "CBttip4": "/ butonuna tıklayın, ardından ayırmak istediğiniz değişkenleri / ile hareket ettirin. Sadece / eklemek için, çift tıklayın",
  "CBttip5": "^ butonuna tıklayın ve üslü sayılar için değişkenleri hareket ettirin, genel kod eklemek için çift tıklayın",
  "CBbtnlbl6": "karekök",
  "CBttip6": "SQRT butonuna tıklayın ve karekök hesaplamak için değişkenleri hareket ettirin, genel kod eklemek için çift tıklayın",
  "CBbtnlbl7": "log",
  "CBttip7": "LOG butonuna tıklayın ve doğal logaritma hesaplamak için değişkenleri hareket ettirin, genel kod eklemek için çift tıklayın",
  "CBbtnlbl8": "log10",
  "CBttip8": "LOG10 butonuna tıklayın ve logaritma tabanı 10 hesaplamak için değişkenleri hareket ettirin, genel kod eklemek için çift tıklayın",
  "CBbtnlbl9": "log2",
  "CBttip9": "LOG2 butonuna tıklayın ve logaritma tabanı 2 hesaplamak için değişkenleri hareket ettirin, genel kod eklemek için çift tıklayın",
  "CBbtnlbl10": "mod",
  "CBttip10": "MOD butonuna tıklayın ve değişkenleri bölmek ve kalanı hesaplamak için hareket ettirin, genel kod eklemek için çift tıklayın",
  "CBbtnlbl11": "mutlak",
  "CBttip11": "abs butonuna tıklayın ve mutlak değer hesaplamak için değişkenleri hareket ettirin, genel kod eklemek için çift tıklayın",
  "CBbtnlbl12": "exp",
  "CBttip12": "exp butonuna tıklayın ve üstel hesaplamak için değişkenleri hareket ettirin, genel kod eklemek için çift tıklayın",
  "CBbtnlbl13": "",
  "CBttip13": "> sembolünü eklemek için tıklayın",
  "CBbtnlbl14": "",
  "CBttip14": "< sembolünü eklemek için tıklayın",
  "CBbtnlbl15": "",
  "CBttip15": ">= sembolünü eklemek için tıklayın",
  "CBbtnlbl16": "",
  "CBttip16": "<= sembolünü eklemek için tıklayın",
  "CBbtnlbl17": "",
  "CBttip17": "== sembolünü eklemek için tıklayın (eşitlik testi)",
  "CBbtnlbl18": "",
  "CBttip18": "!= (eşit değil) sembolünü eklemek için tıklayın",
  "CBbtnlbl19": "",
  "CBttip19": "| (mantıksal veya) sembolünü eklemek için tıklayın",
  "CBbtnlbl20": "",
  "CBttip20": "& (mantıksal ve) sembolünü eklemek için tıklayın",
  "CBbtnlbl21": "%/%",
  "CBttip21": "Tam sayı bölümü (%/%) sembolünü eklemek için tıklayın",
  "CBbtnlbl22": "isTRUE",
  "CBttip22": "isTRUE'ya tıklayın ve TRUE değerlerini kontrol etmek için değişkeni seçin ve hareket ettirin. TRUE/FALSE döner, genel kod eklemek için çift tıklayın",
  "CBbtnlbl23": "is.na",
  "CBttip23": "is.na'ya tıklayın ve NA değerlerini kontrol etmek için değişkeni seçip taşıyın. TRUE/FALSE döner, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl24": "%in%",
  "CBttip24": "%in% butonuna tıklayın ve %in% eklemek için değişkenleri taşıyın",
  "CBbtnlbl25": "yuvarla",
  "CBttip25": "yuvarla'ya tıklayın ve yuvarlamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl26": "tavan",
  "CBttip26": "tavan'a tıklayın ve tavan hesaplamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl27": "taban",
  "CBttip27": "taban'a tıklayın ve taban hesaplamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl28": "önemli",
  "CBttip28": "önemli'ye tıklayın ve belirtilen önemli basamak sayısına yuvarlamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl29": "gamma",
  "CBttip29": "gamma'ya tıklayın ve gamma fonksiyonu hesaplamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl30": "lgamma",
  "CBttip30": "lgamma'ya tıklayın ve lgamma fonksiyonu hesaplamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl31": "beta",
  "CBttip31": "beta'ya tıklayın ve beta fonksiyonu hesaplamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl32": "lbeta",
  "CBttip32": "lbeta'ya tıklayın ve lbeta fonksiyonu hesaplamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl33": "faktöriyel",
  "CBttip33": "faktöriyel'e tıklayın ve faktöriyel hesaplamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl34": "pigamma",
  "CBttip34": "pigamma'ya tıklayın ve pigamma fonksiyonu hesaplamak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl35": "büyüt",
  "CBttip35": "büyüt'e tıklayın ve büyük harfe dönüştürmek için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl36": "küçült",
  "CBttip36": "küçült'e tıklayın ve küçük harfe dönüştürmek için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl37": "Doldur",
  "CBttip37": "Doldur'a tıklayın ve bir karakter ile doldurmak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl38": "Kırp",
  "CBttip38": "Kırp'a tıklayın ve soldan, sağdan veya her iki uçtan boşlukları kaldırmak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl39": "Uzunluk",
  "CBttip39": "Uzunluk'a tıklayın ve dizgedeki karakter sayısını döndürmek için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl40": "Say(uygun)",
  "CBttip40": "Say(uygun)'a tıklayın ve bir desen/alt dize eşleşmelerini saymak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl41": "Alt Dize Çıkar",
  "CBttip41": "Alt Dize Çıkar'a tıklayın ve bir alt dize çıkarmak için değişkenleri taşıyın (başlangıç ve bitiş pozisyonunu tam sayılarla değiştirin), genel kodu eklemek için çift tıklayın",
  "CBbtnlbl42": "Birleştir",
  "CBttip42": "Birleştir'e tıklayın ve isteğe bağlı bir ayırıcı ile birleştirmek için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl43": "Deseni Değiştir",
  "CBttip43": "Deseni Değiştir'e tıklayın ve bir deseni değiştirmek için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl44": "Deseni Değiştir(TÜM)",
  "CBttip44": "Deseni Değiştir(TÜM)'e tıklayın ve tüm desenleri değiştirmek için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl45": "Bir Sayı Çıkar",
  "CBttip45": "Bir Sayı Çıkar'a tıklayın ve bir sayı çıkarmak için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl46": "Sayısala Dönüştür",
  "CBttip46": "Sayısala Dönüştür'e tıklayın ve sayısal hale dönüştürmek için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl47": "Karaktere Dönüştür",
  "CBttip47": "Karaktere Dönüştür'e tıklayın ve bir karaktere dönüştürmek için değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl48": "Faktörleştir",
  "CBttip48": "Faktörleştirmek için ToFactor'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl49": "Sıralı",
  "CBttip49": "Sıralı bir faktör oluşturmak için ToOrdered'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl50": "Mantıksal",
  "CBttip50": "Mantıksal bir değişken oluşturmak için ToLogical'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl51": "Maksimum",
  "CBttip51": "Maksimum değeri hesaplamak için MAX'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl52": "Minimum",
  "CBttip52": "Minimum değeri hesaplamak için MIN'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl53": "Ortalama",
  "CBttip53": "Ortalama değeri hesaplamak için MEAN'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl54": "Medyan",
  "CBttip54": "Medyan değeri hesaplamak için MEDIAN'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl55": "Standart Sapma",
  "CBttip55": "Standart sapmayı hesaplamak için SD'ye tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl56": "Toplam",
  "CBttip56": "Toplamı hesaplamak için SUM'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl57": "Varyans",
  "CBttip57": "Varyansı hesaplamak için VARIANCE'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl58": "runif",
  "CBttip58": "RUNIF'e çift tıklayın ve minimum ve maksimum ile uniform dağılımdan rastgele sayılar oluşturulacaktır.",
  "CBbtnlbl59": "örnek",
  "CBttip59": "Rastgele örnekler oluşturmak için SAMPLE'a tıklayın ve değişkenleri taşıyın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl60": "rnorm",
  "CBttip60": "Belirtilen ortalama ve standart sapma ile normal dağılımdan değişkenler oluşturmak için rnorm'a çift tıklayın",
  "CBbtnlbl61": "Haftanın Günü",
  "CBttip61": "Haftanın gününü (Pazartesi..) çıkarmak istediğiniz tarih değişkenini taşımak için Haftanın Günü'ne tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl62": "Ayın Günü",
  "CBttip62": "Ayın gününü (1-31) çıkarmak istediğiniz tarih değişkenini taşımak için Ayın Günü'ne tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl63": "Yılın Günü",
  "CBttip63": "Yılın gününü (001-366) çıkarmak istediğiniz tarih değişkenini taşımak için Yılın Günü'ne tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl64": "Yılın Haftası",
  "CBttip64": "Yılın haftasını (00-53) çıkarmak istediğiniz tarih değişkenini taşımak için Yılın Haftası'na tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl65": "Ay",
  "CBttip65": "Ayı (Ocak..) çıkarmak istediğiniz tarih değişkenini taşımak için Ay'a tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl66": "Ay(ondalık)",
  "CBttip66": "Ayı (01-12) çıkarmak istediğiniz tarih değişkenini taşımak için Ay(onaldık)'a tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl67": "Çeyrekler",
  "CBttip67": "Çeyrekleri (Q1, Q2..) çıkarmak istediğiniz tarih değişkenini taşımak için Çeyrekler'e tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl68": "Yıl(XXXX)",
  "CBttip68": "Yılı (1980) çıkarmak istediğiniz tarih değişkenini taşımak için Yıl(XXXX)'ya tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl69": "Yıl(XX)",
  "CBttip69": "Yılı (80) çıkarmak istediğiniz tarih değişkenini taşımak için Yıl(XX)'ye tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl70": "Saat(00-12)",
  "CBttip70": "Saati (00) çıkarmak istediğiniz tarih değişkenini taşımak için Saat(00-12)'ye tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl71": "Saat(00-23)",
  "CBttip71": "Saati çıkarmak istediğiniz tarih değişkenini taşımak için Saat(00-23)'ye tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl72": "Dakikalar",
  "CBttip72": "Dakikaları çıkarmak istediğiniz tarih değişkenini taşımak için Dakikalar'a tıklayın, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl73": "Saniyeler",
  "CBttip73": "Saniyeler'e tıklayın ve saniyeleri çıkarmak istediğiniz tarih değişkenini hareket ettirin, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl74": "String'den Tarih",
  "CBttip74": "String'den Tarih'e tıklayın ve tarih olarak dönüştürmek istediğiniz bir string değişkenini hareket ettirin, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl75": "Tarih Farkı",
  "CBttip75": "Tarih Farkı'na tıklayın ve bir tarih değişkenini başka bir tarih değişkeninden çıkarmak için hareket ettirin, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl76": "Sayısalı Tarihe Dönüştür",
  "CBttip76": "Sayısalı Tarihe Dönüştür'e tıklayın ve tarih olarak dönüştürmek istediğiniz bir sayısal değişkeni hareket ettirin, genel kodu eklemek için çift tıklayın",
  "CBbtnlbl77": "String'i Tarihe Dönüştür",
  "CBttip77": "String'i Tarihe Dönüştür'e tıklayın ve tarih olarak dönüştürmek istediğiniz bir string değişkenini hareket ettirin, genel kodu eklemek için çift tıklayın",
  "jsoncomment002": "=======bu satırın altındaki switchCase=======",
  "SCStr0": "Çoklu Koşul Oluşturucu",
  "SCStr1": "Bir düğmeye tıklayın ve ifadeyi oluşturmak için değişkenleri sürükleyip bırakın.",
  "SCStr2": "Seçilen bir düğmeye tıklamak durumu değiştirecektir.",
  "SCStr3": "Belirlenen bir konuma eklemek için, doğrudan o konuma sürükleyip bırakın.",
  "SCStr4": "Yardım için bir düğmenin üzerine gelin.",
  "SCifthenbtn": "EĞER O ZAMAN",
  "SCelsebtn": "DEĞİLSE",
  "SCIFlbl": "EĞER",
  "SCTHENlbl": "O ZAMAN",
  "SCELSElbl": "DEĞİLSE",
  "SCtabArithmetic": "Aritmetik",
  "SCtabLogical": "Mantıksal",
  "SCtabMath": "Matematik",
  "SCtabString1": "String(1)",
  "SCtabString2": "String(2)",
  "SCtabConversion": "Dönüşüm1",
  "SCtabStatistical": "İstatistiksel",
  "SCtabRandomNumbers": "Rastgele Sayılar",
  "SCtabDate1": "Tarih(1)",
  "SCtabDate2": "Tarih(2)",
  "SCtabDate3": "Tarih(3)",
  "SCtabDate4": "Tarih(4)",
  "SCttip1": " + sembolüne tıklayın ve ayırmak istediğiniz değişkenleri + ile hareket ettirin. Sadece + eklemek için, çift tıklayın",
  "SCttip2": " - sembolüne tıklayın ve ayırmak istediğiniz değişkenleri - ile hareket ettirin. Sadece - eklemek için, çift tıklayın",
  "SCttip3": " * sembolüne tıklayın ve ayırmak istediğiniz değişkenleri * ile hareket ettirin. Sadece * eklemek için, çift tıklayın",
  "SCttip4": " / sembolüne tıklayın ve ayırmak istediğiniz değişkenleri / ile hareket ettirin. Sadece / eklemek için, çift tıklayın",
  "SCttip5": " ^ sembolüne tıklayın ve üslü hale getirmek için değişkenleri hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl6": "karekök",
  "SCttip6": "SQRT'e tıklayın ve karekök hesaplamak için değişkenleri hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl7": "log",
  "SCttip7": "LOG'a tıklayın ve doğal logaritmayı hesaplamak için değişkenleri hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl8": "log10",
  "SCttip8": "LOG10'a tıklayın ve log tabanı 10'u hesaplamak için değişkenleri hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl9": "log2",
  "SCttip9": "LOG2'ye tıklayın ve log tabanı 2'yi hesaplamak için değişkenleri hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl10": "mod",
  "SCttip10": "MOD'a tıklayın ve değişkenleri bölmek ve kalanı hesaplamak için hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl11": "mutlak",
  "SCttip11": "abs'ye tıklayın ve mutlak değeri hesaplamak için değişkenleri hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl12": "exp",
  "SCttip12": "exp'e tıklayın ve değişkenleri bir üstel hesaplamak için taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl13": "",
  "SCttip13": "> sembolünü eklemek için tıklayın",
  "SCbtnlbl14": "",
  "SCttip14": "< sembolünü eklemek için tıklayın",
  "SCbtnlbl15": "",
  "SCttip15": ">= sembolünü eklemek için tıklayın",
  "SCbtnlbl16": "",
  "SCttip16": "<= sembolünü eklemek için tıklayın",
  "SCbtnlbl17": "",
  "SCttip17": "== sembolünü eklemek için tıklayın (eşitlik testi)",
  "SCbtnlbl18": "",
  "SCttip18": "!= sembolünü eklemek için tıklayın",
  "SCbtnlbl19": "",
  "SCttip19": "| (mantıksal veya) sembolünü eklemek için tıklayın",
  "SCbtnlbl20": "",
  "SCttip20": "& (mantıksal ve) sembolünü eklemek için tıklayın",
  "SCbtnlbl21": "%/%",
  "SCttip21": "Tam sayı bölümü (%/%) sembolünü eklemek için tıklayın",
  "SCbtnlbl22": "isTRUE",
  "SCttip22": "isTRUE'ya tıklayın ve TRUE değerlerini kontrol etmek için değişkeni seçin ve taşıyın. TRUE/FALSE döndürür, genel kod eklemek için çift tıklayın",
  "SCbtnlbl23": "is.na",
  "SCttip23": "is.na'ya tıklayın ve NA değerlerini kontrol etmek için değişkeni seçin ve taşıyın. TRUE/FALSE döndürür, genel kod eklemek için çift tıklayın",
  "SCbtnlbl24": "%in%",
  "SCttip24": "%in%'i eklemek için tıklayın. %in% bir değişkenin değerleri içerip içermediğini kontrol etmek için kullanılır, örneğin var1 %in% c(1,2)",
  "SCbtnlbl25": "round",
  "SCttip25": "round'a tıklayın ve değişkenleri yuvarlamak için taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl26": "ceiling",
  "SCttip26": "ceiling'a tıklayın ve değişkenleri üst sınır hesaplamak için taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl27": "floor",
  "SCttip27": "floor'a tıklayın ve değişkenleri alt sınır hesaplamak için taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl28": "signif",
  "SCttip28": "signif'a tıklayın ve belirli sayıda anlamlı basamağa yuvarlamak için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl29": "gamma",
  "SCttip29": "gamma'ya tıklayın ve bir gamma fonksiyonu hesaplamak için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl30": "lgamma",
  "SCttip30": "lgamma'ya tıklayın ve bir lgamma fonksiyonu hesaplamak için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl31": "beta",
  "SCttip31": "beta'ya tıklayın ve bir beta fonksiyonu hesaplamak için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl32": "lbeta",
  "SCttip32": "lbeta'ya tıklayın ve bir lbeta fonksiyonu hesaplamak için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl33": "factorial",
  "SCttip33": "factorial'a tıklayın ve faktöriyel hesaplamak için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl34": "pigamma",
  "SCttip34": "pigamma'ya tıklayın ve bir pigamma fonksiyonu hesaplamak için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl35": "toupper",
  "SCttip35": "toupper'a tıklayın ve büyük harfe dönüştürmek için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl36": "tolower",
  "SCttip36": "tolower'a tıklayın ve küçük harfe dönüştürmek için değişkenleri taşıyın, genel kod eklemek için çift tıklayın",
  "SCbtnlbl37": "Pad",
  "SCttip37": "Pad'e tıklayın ve değişkenleri bir karakter ile Pad'e taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl38": "Trim",
  "SCttip38": "Trim'e tıklayın ve değişkenleri soldan, sağdan veya her iki uçtan boşlukları kaldırmak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl39": "Length",
  "SCttip39": "Length'e tıklayın ve değişkenleri dizedeki karakter sayısını döndürmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl40": "Count(matches)",
  "SCttip40": "Count(matches)'e tıklayın ve değişkenleri bir desen/alt dize eşleşmelerini saymak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl41": "Extract Substring",
  "SCttip41": "Extract Substring'e tıklayın ve değişkenleri bir alt dize çıkarmak için taşıyın (başlangıç ve bitiş pozisyonunu tam sayılarla değiştirin), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl42": "Concatenate",
  "SCttip42": "Concatenate'e tıklayın ve değişkenleri isteğe bağlı bir ayırıcı ile birleştirmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl43": "Replace Pattern",
  "SCttip43": "Replace Pattern'e tıklayın ve değişkenleri bir deseni değiştirmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl44": "Replace Pattern(ALL)",
  "SCttip44": "Replace Pattern(ALL)'e tıklayın ve değişkenleri tüm desenleri değiştirmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl45": "Extract a Number",
  "SCttip45": "Extract a Number'a tıklayın ve değişkenleri bir sayı çıkarmak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl46": "ToNumeric",
  "SCttip46": "ToNumeric'e tıklayın ve değişkenleri sayısal bir değere dönüştürmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl47": "ToCharacter",
  "SCttip47": "ToCharacter'a tıklayın ve değişkenleri bir karaktere dönüştürmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl48": "ToFactor",
  "SCttip48": "ToFactor'a tıklayın ve değişkenleri bir faktöre dönüştürmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl49": "ToOrdered",
  "SCttip49": "ToOrdered'a tıklayın ve değişkenleri sıralı bir faktöre dönüştürmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl50": "ToLogical",
  "SCttip50": "ToLogical'a tıklayın ve değişkenleri mantıksal bir değere dönüştürmek için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl51": "MAX",
  "SCttip51": "MAX'e tıklayın ve değişkenleri maksimum değeri hesaplamak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl52": "MIN",
  "SCttip52": "MIN'e tıklayın ve değişkenleri minimum değeri hesaplamak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl53": "MEAN",
  "SCttip53": "MEAN'e tıklayın ve değişkenleri ortalama değeri hesaplamak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl54": "MEDIAN",
  "SCttip54": "MEDIAN'e tıklayın ve değişkenleri medyan değeri hesaplamak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl55": "SD",
  "SCttip55": "SD'ye tıklayın ve değişkenleri standart sapmayı hesaplamak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl56": "SUM",
  "SCttip56": "SUM'a tıklayın ve değişkenleri toplamı hesaplamak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl57": "VARIANCE",
  "SCttip57": "VARIANCE'e tıklayın ve değişkenleri varyansı hesaplamak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl58": "runif",
  "SCttip58": "RUNIF'e çift tıklayın ve belirli bir minimum ve maksimum ile uniform dağılımdan rastgele sayılar üretilecektir",
  "SCbtnlbl59": "sample",
  "SCttip59": "SAMPLE'e tıklayın ve değişkenleri ikame ile/ikamesiz rastgele örnekler oluşturmak için taşıyın, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl60": "rnorm",
  "SCttip60": "rnorm'a çift tıklayın ve belirli bir ortalama ve standart sapma ile normal dağılımdan değişkenler oluşturun",
  "SCbtnlbl61": "Day of Week",
  "SCttip61": "Day of Week'e tıklayın ve bir tarih değişkenini taşıyın, haftanın gününü (Pazartesi..) çıkarmak için, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl62": "Ayın Günü",
  "SCttip62": "Ayın Gününe tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (1-31), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl63": "Yılın Günü",
  "SCttip63": "Yılın Gününe tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (001-366), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl64": "Yılın Haftası",
  "SCttip64": "Yılın Haftasına tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (00-53), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl65": "Ay",
  "SCttip65": "Aya tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (Ocak..), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl66": "Ay(ondalık)",
  "SCttip66": "Ay(onaldık) tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (01-12), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl67": "Çeyrekler",
  "SCttip67": "Çeyreklere tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (Q1, Q2..), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl68": "Yıl(XXXX)",
  "SCttip68": "Yıl(XXXX) tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (1980), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl69": "Yıl(XX)",
  "SCttip69": "Yıl(XX) tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (80), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl70": "Saat(00-12)",
  "SCttip70": "Saat(00-12) tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin (00), genel kodu eklemek için çift tıklayın",
  "SCbtnlbl71": "Saat(00-23)",
  "SCttip71": "Saat(00-23) tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl72": "Dakikalar",
  "SCttip72": "Dakikalara tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl73": "Saniyeler",
  "SCttip73": "Saniyelere tıklayın ve almak istediğiniz tarih değişkenini hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl74": "String'den Tarih",
  "SCttip74": "String'den Tarih'e tıklayın ve tarih olarak dönüştürmek istediğiniz bir string değişkenini hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl75": "Tarih Farkı",
  "SCttip75": "Tarih Farkı'na tıklayın ve bir tarih değişkeninden başka bir tarih değişkenini çıkarmak için hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl76": "Sayısalı Tarihe",
  "SCttip76": "Sayısalı Tarihe tıklayın ve tarih olarak dönüştürmek istediğiniz bir sayısal değişkeni hareket ettirin, genel kodu eklemek için çift tıklayın",
  "SCbtnlbl77": "String'den Tarihe",
  "SCttip77": "String'den Tarihe tıklayın ve tarih olarak dönüştürmek istediğiniz bir string değişkenini hareket ettirin, genel kodu eklemek için çift tıklayın",
  "jsoncomment003": "=======Rep Ölçümleri CTRL bu satırın altında=======",
  "RMstr0": "İçinde-özne faktörü ve ölçüm için yapılandırmayı görüntülemek/gizlemek için tıklayın",
  "RMstr0a": "Not",
  "RMstr1": "1. Uygulama, geniş bir veri kümesinde tekrarlanan ölçümler ANOVA'sı çalıştırırken verileri yeniden şekillendirmelidir",
  "RMstr2": "2. Tek bir değişken için birden fazla tekrarlanan ölçümü destekliyoruz, örneğin, ön test, son test ve takip ziyaretinde ölçülen Kan Şekeri",
  "RMstr3": "3. Uygulamanın verileri yeniden şekillendirmesi için, bir tekrarlanan faktör adı belirtmeniz gerekir, örneğin, Kan Şekeri ve seviye sayısı. Tekrar ölçümleri içeren değişkenlerin adlarından oluşturulan seviyelerle birlikte Kan Şekeri adında bir faktör değişkeni oluşturacağız, örneğin, faktörün seviyeleri ön test, son test ve takip olacaktır",
  "RMstr4": "4. Bir ölçüm adı belirtmeniz gerekir, örneğin, Değer. Her bir denek için ön test, son test ve takip ile ilgili tüm Kan Şekeri değerleri ile birlikte Değer adında bir değişken oluşturacağız.",
  "RMstr5": "5. Tek bir arasında-özne ve içinde-özne faktör değişkenini destekliyoruz.",
  "RMstr6": "6. Gelecek sürümler birden fazla ölçümü ve birden fazla arasında-özne ve içinde-özne faktör değişkenini destekleyecektir.",
  "RMlbl1": "İçinde-Özne Faktör Adı",
  "RMlbl2": "Seviye Sayısı",
  "RMaddbtn": "Ekle",
  "RMlbl3": "Yeni İçinde-özne faktör değişkeni",
  "RMdelbtn": "Sil",
  "RMlbl4": "Ölçüm Adı",
  "RMlbl5": "Yeni ölçüm değişkeni",
  "RMdefinebtn": "Tanımla",
  "RMmsgboxTitle1": "Faktör için yanlış seviyeler",
  "RMmsgboxMsg1": "Birden fazla seviyeye sahip bir Faktör adı belirtmelisiniz.",
  "RMmsgboxTitle2": "Birden fazla içsel faktör belirtildi",
  "RMmsgboxMsg2": "Şu anda tek bir içsel faktörü destekliyoruz. Çoklu içsel faktör değişkenlerini yakında bir güncellemede destekleyeceğiz.",
  "RMmsgboxTitle3": "Birden fazla ölçüm belirtildi",
  "RMmsgboxMsg3": "Şu anda tek bir ölçümü destekliyoruz. Çoklu ölçümleri yakında bir güncellemede destekleyeceğiz.",
  "RMmsgboxTitle4": "Ölçüm değişkeni belirtilmedi",
  "RMmsgboxMsg4": "Ölçüm değişkeni adı belirtilmedi. Bir ölçüm adı belirtmeli ve ekle butonuna tıklamalısınız.",
  "RMmsgboxTitle5": "İçsel faktör değişkeni belirtilmedi",
  "RMmsgboxMsg5": "Tekrar eden bir faktör değişkeni adı ve ölçüm adı girdikten sonra Tanımla butonuna tıklamalısınız.",
  "jsoncomment004": "=======Aşağıdaki Satırda Dataset Seçin=======",
  "SelDSsrclbl1": "Değişkenler ",
  "SelDSsrclbl2": "aktif (sol) ",
  "SelDSsrclbl3": "seçilen (sağ)",
  "SelDSsrclbl4": " veri seti",
  "SelDSsrclbl5": "Bir veri seti seçin ve birleştirin ",
  "SelDSsrclbl6": " ile",
  "jsoncomment005": "=======aşağıdaki satırda birleştirme=======",
  "MJlbl1": "Aktif veri setinden bir değişken ve seçilen veri setinde bir değişken seçin ve Ekle'ye tıklayın",
  "MJbtn1": "Ekle",
  "MJbtn2": "Sil",
  "jsoncomment006": "=======aşağıdaki satırda seçenekler=======",
  "OptVarDefaultLbl": "Seçenekler",
  "jsoncomment007": "=======aşağıdaki satırda dosya/klasör seçin=======",
  "fileOpenLbl": "Seçin",
  "fileSaveLbl": "Belirleyin veya birini seçin",
  "jsoncomment008": "=======aşağıdaki satırda kontrol sarmalayıcı=======",
  "wrapCtrllabel1": "Toplanmış veri setinde sayıları göster",
  "wrapCtrllabel2": "Sayılar ve toplanmış değişkenler için isteğe bağlı olarak adlar girin, virgülle (,) ayırın",
  "colpickerttip1": "Bir renk seçmek için tıklayın",
  "sixSigmaOvrViewLbl1": "Pyzdek Enstitüsü'nün Altı Sigma eğitimi",
  "sixSigmaOvrViewLink1": "Altı Sigma nedir ve nasıl çalışır?",
  "sixSigmaOvrViewLbl2": "R Paketi (QCC) - kalite kontrol grafiği eğitimi",
  "sixSigmaOvrViewLink2": "R kalite kontrol grafiği eğitimi",
  "sixSigmaOvrViewLbl3": "İnternette bulunan ek Altı Sigma eğitimi (R SixSigma Paketi'ne dayalı)",
  "sixSigmaOvrViewLink3": "Bölüm-1",
  "sixSigmaOvrViewLink4": "Bölüm-2",
  "sixSigmaOvrViewLink5": "Bölüm-3",
  "sixSigmaOvrViewLink6": "Bölüm-4",
  "sixSigmaOvrViewLink7": "Bölüm-5",
  "OKBtnTxt": "Tamam",
  "CancelBtnTxt": "İptal",
  "FBRulVoiMsg": "Devam etmek için: Formül Oluşturucu etiketli kontrol doldurulmalıdır",
  "SCruleVoilationMsgTitle1": "Girdi kural ihlali",
  "SCruleVoilationMsgTitle2": "Koşullu girdi kural ihlali",
  "SCruleVoilationMsg1": "Etiketli kontrol içinde bir if koşulu",
  "SCruleVoilationMsg2": "Etiketli kontrol içinde bir then koşulu",
  "SCruleVoilationMsg3": "Etiketli kontrol içinde bir else koşulu",
  "SCruleVoilationMsg4": "Etiketli koşullu girdi",
  "dstVarRuleViolationMsgTitle": "Hedef değişken listesi kural ihlali",
  "dstVarRuleViolationMsg1": "Bir Hedef değişken listesi etiketli",
  "dstVarRuleViolationMsg2": "devam etmek için doldurulması gerekiyor",
  "dstVarRuleViolationMsg3": "şunu içermelidir",
  "dstVarRuleViolationMsg4": "değişkenler",
  "advTxtBxRulViolationMSgTitle1": "Üzerine Yazma Uyarısı",
  "advTxtBxRulViolationMSgTitle2": "Girdi alanı kural ihlali",
  "advTxtBxRulViolationMSg1": "etiketi olan alanda belirtilen değer",
  "advTxtBxRulViolationMSg2": "mevcut değişkeni üzerine yazacaktır",
  "advTxtBxRulViolationMSg3": "etiketi olan alanda belirtilen değer",
  "advTxtBxRulViolationMSg4": "veri kümesini üzerine yazacaktır",
  "advTxtBxRulViolationMSg5": "etiketi olan alan",
  "advTxtBxRulViolationMSg6": "devam etmek için doldurulması gerekiyor",
  "advTxtBxRulViolationMSg7": "devam etmek için sayısal bir değerle doldurulması gerekiyor",
  "advTxtBxRulViolationMSg8": "devam etmek için karakter değeri ile doldurulması gerekiyor",
  "advTxtBxRulViolationMSg9": "etiketi olan girdi alanı",
  "advTxtBxRulViolationMSg10": "bir sayı ile başlayamaz. Bir değişken, veri kümesi veya model adı bir sayı ile başlayamaz.",
  "advTxtBxRulViolationMSg11": "boşluk içeremez. Bir değişken, veri kümesi veya model adı boşluk içeremez.",
  "advTxtBxRulViolationMSg12": "yalnızca harfler, sayılar ve nokta veya alt çizgi karakterlerini içermelidir. Bir harf veya sayı ile takip edilmeyen bir nokta ile başlamalıdır.",
  "chkboxRulVoiMsgTitle": "Onay kutusu kural ihlali",
  "chkboxRulVoiMsg1": "etiketi olan onay kutusu",
  "chkboxRulVoiMsg2": "devam etmek için başka bir kontrolün doldurulmasını gerektirir",
  "comboboxRulVoiTitle": "Kombinasyon kutusu kontrol kural ihlali",
  "comboboxRulVoiMsg1": "etiketi olan Kombinasyon kutusunda bir seçim yapmalısınız",
  "comboboxWchildRulVoiTitle": "Kombinasyon kutusu kural ihlali",
  "comboboxWchildRulVoiMsg1": "etiketi olan Kombinasyon kutusunda bir seçim yapılması gerekiyor",
  "CBuilderRulVoiTitle": "Girdi kural ihlali",
  "CBuilderRulVoiMsg1": "etiketi olan kontrol",
  "CBuilderRulVoiMsg2": "devam etmek için doldurulması gerekiyor",
  "fileOpnRulVoiTitle": "Dosya girdi alanı kural ihlali",
  "fileOpnRulVoiMsg1": "etiketi olan gözat butonundan bir dosya seçin",
  "fileOpnRulVoiMsg2": "ve yeniden çalıştırın",
  "fileOpnRulVoiMsg3": "etiketi olan gözat butonundan bir klasör seçin",
  "fileOpnRulVoiMsg4": "etiketi olan gözat butonu",
  "fileOpnRulVoiMsg5": "mevcut olmayan bir yol içeriyor",
  "fileSavRulVoiMsg1": "etiketi olan butonla bir dosya seçmelisiniz",
  "fileSavRulVoiMsg2": "devam etmek için",
  "handlerRulVoiTitle1": "Uyumsuz türler",
  "handlerRulVoiTitle2": "Desteklenmiyor",
  "handlerRulVoiTitle3": "Hata",
  "handlerRulVoiTitle4": "Yanlış belirtilmiş değişkenleri birleştir",
  "handlerRulVoiMsg1": "Bir eşitlik kısıt seti, tüm faktör yüklemelerini, kovaryans ilişkilerini veya yapısal ilişkileri içermelidir. Taşıdığınız öğelerin farklı türleri var.",
  "handlerRulVoiMsg2": "Bir eşitlik kısıt seti, tüm faktör yüklemelerini, kovaryans ilişkilerini veya yapısal ilişkileri içermelidir. Tek bir sette türleri birleştiremezsiniz.",
  "handlerRulVoiMsg3": "Bir arabuluculuk setinde 2'den fazla değişkeni desteklemiyoruz. Bu yeteneğe ihtiyacınız varsa lütfen destekle iletişime geçin.",
  "handlerRulVoiMsg4": "Aracılık ilişki değişkenleri A->B ve B->C biçiminde olmalıdır",
  "handlerRulVoiMsg5": "Aracılık ilişki değişkenleri A->B ve B->C veya B->C ve A->B biçiminde olmalıdır",
  "handlerRulVoiMsg6": "Hedef kontrol, etiketi olan kaynaktan değişkenlerin bırakılmasına izin vermiyor",
  "handlerRulVoiMsg7": "Birleştirmek için hem aktif veri kümesinden hem de hedef veri kümesinden tek bir değişken seçmelisiniz",
  "inSpinerRulVoiMsg1": "sınırların dışında",
  "inSpinerRulVoiMsg2": "değer girilmesi gerekiyor",
  "inSpinerRulVoiMsg3": "sayısal değer girilmesi gerekiyor",
  "inSpinerRulVoiMsg4": "karakter değeri girilmesi gerekiyor",
  "mergejoinRulVoiTitle1": "Kontrol kuralı ihlali seçin",
  "mergejoinRulVoiMsg1": "Etiketli Join eşleme kontrolünde bir seçim yapmalısınız",
  "radioRulVoiTitle1": "Radyo butonu kuralı ihlali",
  "radioRulVoiMsg1": "Etiketli radyo butonu",
  "radioRulVoiMsg2": "ilerlemek için başka bir kontrolün doldurulmasını gerektirir",
  "selectRulVoiMsg1": "Etiketli Seçim kontrolünde bir seçim yapmalısınız",
  "semCtrlRulVoiMsg1": "Etiketli kontrol içinde 2 aracılık ilişkisi belirtmelisiniz",
  "semCtrlRulVoiMsg2": "Etiketli kontrol içinde bir eşitlik kısıtlaması",
  "semCtrlRulVoiMsg3": "2'den az değişken var.",
  "semCtrlRulVoiMsg4": "Latent özelliklerin isimlerinden biri",
  "semCtrlRulVoiMsg5": "kontrol doldurulmamıştır.",
  "semCtrlRulVoiMsg6": "Yüksek düzey faktörlerin isimlerinden biri",
  "semCtrlRulVoiMsg7": "kontrol doldurulmamıştır.",
  "semCtrlRulVoiMsg8": "Latent özelliklerin isimlerinden birinde bir sayı girdiniz",
  "semCtrlRulVoiMsg9": "kontrol. Lütfen geçerli bir isim girin.",
  "semCtrlRulVoiMsg10": "Latent özelliği oluşturan değişkenler belirtilmemiştir",
  "semCtrlRulVoiMsg11": "kontrol. Lütfen değişken ekleyin veya kontrolü silin.",
  "semCtrlRulVoiMsg12": "Hiçbir latent özellik belirtilmemiştir",
  "semCtrlRulVoiMsg13": "kontrol. Lütfen latent özellikler ekleyin veya kontrolü silin.",
  "semCtrlAddBtn": "Ekle",
  "semModTermRulVoiTitle": "İlişki hatası",
  "semModTermRulVoiMsg1": "Değişkenler arasında bir ilişki tanımladınız",
  "semModTermRulVoiMsg2": "yapısal parametreler ve kovaryanslar içinde. İlişkiyi bir kez tanımlamalısınız",
  "wrapCtrlRulVoiTitle": "Sarmal kontrol kuralı ihlali",
  "wrapCtrlRulVoiMsg1": "Etiketli sarmal kontrol",
  "wrapCtrlRulVoiMsg2": "beklenmeyen sayıda değişken aldı (beklenen",
  "wrapCtrlRulVoiMsg3": "İlerlemek için doldurulması gerekir",
  "utilityRulVoiTitle1": "Ölçüm değişkeni belirtilmemiş",
  "utilityRulVoiTitle2": "Aynı isim girildi",
  "utilityRulVoiTitle3": "Yanlış isim belirtilmiş",
  "utilityRulVoiMsg1": "Ölçüm değişkeni için isim belirtilmemiştir. Bir ölçüm ismi belirtmeli ve ekle butonuna tıklamalısınız.",
  "utilityRulVoiMsg2": "Bir arabuluculuk setinden fazlasını desteklemiyoruz. Bu yeteneğe ihtiyacınız varsa lütfen destekle iletişime geçin.",
  "utilityRulVoiMsg3": "Zaten girilmiş bir latent değişken ismi veya yüksek düzey faktör ismi girdiniz. Tüm latent değişken isimleri ve yüksek düzey faktör isimleri benzersiz olmalıdır",
  "utilityRulVoiMsg4": "Bir latent değişken ismi veya yüksek düzey faktör ismi bir veri seti değişkeninin ismiyle eşleşemez.",
  "utilityRulVoiMsg5": "Etiketli kontrol içinde bir seçim yapmalısınız",
  "utilityRulVoiMsg6": "ve",
  "utilityRulVoiMsg7": "taşınma butonuna tıklamadan önce.",
  "utilityRulVoiMsg8": "Etiketli kontrol içinde aynı değişkeni seçemezsiniz",
  "utilityRulVoiMsg9": "Lütfen farklı seçimler yapın.",
  "utilityRulVoiMsg10": "taşınma butonuna tıklamadan önce.",
  "utilityRulVoiMsg11": "Zaten arasında bir ilişki var",
  "utilityRulVoiMsg12": "Aynı değişkenler arasında 2 ilişki olamaz.",
  "errormessageIPCmsg1": "Bir faktör ismi olarak kullanmak için boş olmayan bir dize belirtmelisiniz",
  "errormessageIPCmsg2": "Silmek için önce bir giriş seçmelisiniz, ardından silme butonuna tıklayın",
  "errormessageIPCmsg3": "Bir ölçüm ismi olarak kullanmak için boş olmayan bir dize belirtmelisiniz",
  "errormessageIPCmsg4": "Birden fazla seviyeye sahip bir Faktör ismi belirtmelisiniz.",
  "errormessageIPCmsg5": "Şu anda tek bir içindeki denek faktörünü destekliyoruz. Yakında birden fazla içindeki denek faktör değişkenini destekleyeceğiz.",
  "errormessageIPCmsg6": "Şu anda tek bir ölçümü destekliyoruz. Yakında birden fazla ölçümü destekleyeceğiz.",
  "errormessageIPCmsg7": "İçindeki denek faktörünün ölçümlerini yakalamak için zaten bir hedef değişken var",
  "errormessageIPCmsg8": "Bu alan sayısal bekliyor, dize değil",
  "errormessageIPCmsg9": "Bu alan bir sayı değil, bir dize bekliyor",
  "errormessageIPCmsg10": "Değişken ",
  "errormessageIPCmsg11": "taşınamaz, hedef bu tür değişkenlere izin vermiyor",
  "errormessageIPCmsg12": "Silme düğmesine tıklamadan önce silmek için bir giriş seçmelisiniz",
  "errormessageIPCTitle1": "Beklenmeyen Tür",
  "projLaunchLoadMsg1": "Önceki projenizi yüklemek istiyor musunuz ",
  "projLaunchLoadMsg2": "Bu biraz zaman alabilir.",
  "projSwitchMsg1": "Şu anda üzerinde çalıştığınız aynı projeye geçerseniz, mevcut kaydedilmemiş değişiklikleriniz kaybolacak ve son kaydedilen proje yüklenecektir.",
  "projSwitchMsg2": "Devam etmek istiyor musunuz?",
  "projSwitchMsg3": "Uyarı: Son kaydedilen sürüm için aynı projeyi yeniden yükleme. Kaydedilmemiş değişiklikler kaybolacak.\n",
  "projSwitchMsg4": "Bu biraz zaman alabilir.",
  "projValidMsg1": "Uyarı: Geçersiz veya bozuk proje yükleniyor",
  "projValidMsg2": "Proje ",
  "projValidMsg3": " geçersiz veya bozuk bir projedir ve listeden kaldırılacaktır",
  "projSwitchSaveCurrnentMsg1": "Farklı bir projeye geçmek biraz zaman alabilir. Geçici olarak boş bir ekran görebilirsiniz.",
  "projSwitchSaveCurrnentMsg2": "Mevcut projedeki değişiklikleri, varsa, '",
  "projSwitchSaveCurrnentMsg3": "'dan önce kaydetmek istiyor musunuz",
  "projSwitchSaveCurrnentMsg4": " farklı bir projeye geçmeden önce ",
  "projSwitchSaveCurrnentMsg5": " 'YENİ' bir projeye geçerken?",
  "projSwitchSaveCurrnentMsg6": " uygulamadan çıkarken?",
  "projSwitchSaveCurrnentMsg7": " başka bir projeyi açarken?",
  "projSaveRSpcTitle": "Dosya şu anda başka bir uygulama tarafından kullanılıyor",
  "projSaveRSpcMsg1": "Görünüşe göre ",
  "projSaveRSpcMsg2": " dosyası şu anda başka bir uygulama tarafından kullanılıyor.",
  "projSaveRSpcMsg3": "Lütfen ",
  "projSaveRSpcMsg4": " dosyasını başka bir uygulamada kapatın ve ardından tekrar deneyin",
  "projAsknameTitle": "Aynı isimde bir proje zaten proje açılır menüsünde mevcut",
  "projAsknameTitle2": "Uyarı: Geçersiz veya bozuk proje açılıyor",
  "projAsknameMsg1": "Proje ",
  "projAsknameMsg2": "şu konumda",
  "projAsknameMsg3": "zaten mevcut.",
  "projAsknameMsg4": "kaydettiğiniz proje şu konumda kaydedilecektir",
  "projAsknameMsg5": "Mevcut projeyi yeni olanla değiştirmek istiyor musunuz?",
  "projAsknameMsg6": "geçersiz veya bozuk bir projedir.",
  "jsoncomment0010": "=======Bu satırın altındaki üst düzey menüler ve alt menü açılır menüsü=======",
  
  "agreement_top_level_title": "Anlaşma",
  "professional_Agreement_Menu": "Anlaşma",
  "agreement_Method": "Yöntem",
  "professional_Method": "Yöntem",
  "agreement_Scale": "Ölçek",
  "analysis_top_level_title": "Analiz",
  "contribution_Analysis_Menu": "Analiz",
  "professional_Analysis_Menu": "Analiz",
  "sixsigmapro_Analysis_Menu": "Analiz",
  "analysis_Association_Rules": "İlişki Kuralları",
  "analysis_Cluster": "Küme",
  "analysis_Correlations": "Korelasyonlar",
  "analysis_Crosstab": "Çapraz Tablo",
  "professional_Crosstab": "Çapraz Tablo",
  "analysis_Distribution_Analysis": "Dağılım Analizi",
  "sixsigmapro_Distribution_Analysis": "Dağılım Analizi",
  "analysis_Factor_Analysis": "Faktör Analizi",
  "analysis_Means": "Ortalama",
  "sixsigmapro_Means": "Ortalama",
  "analysis_Moments": "Anlar",
  "analysis_Non_Parametric": "Parametrik Olmayan",
  "analysis_Proportions": "Oranlar",
  "analysis_Summary": "Özet",
  "professional_Summary": "Özet",
  "sixsigmapro_Summary": "Özet",
  "analysis_Survival": "Sağkalım",
  "contribution_Survival": "Sağkalım",
  "professional_Survival": "Sağkalım",
  "analysis_Tables": "Tablolar",
  "contribution_Tables": "Tablolar",
  "analysis_Variance": "Varyans",
  "contribution_Sample_Size_Menu": "Örneklem Büyüklüğü",
  "contribution_Precision": "Hassasiyet",
  "contribution_Tests": "Testler",
  "contribution_Datasets_Menu": "Veri Setleri",
  "datasets_top_level_title": "Veri Setleri",
  "datasetspro_Datasets_Menu": "Veri Setleri",
  "professional_Datasets_Menu": "Veri Setleri",
  "contribution_Subset": "Alt Küme",
  "datasets_Subset": "Alt Küme",
  "professional_Subset": "Alt Küme",
  "datasets_group_by": "Grupla",
  "datasets_Matching": "Eşleştirme",
  "professional_Matching": "Eşleştirme",
  "datasets_Merge": "Birleştirme",
  "professional_Merge": "Birleştirme",
  "datasets_ReShape": "Yeniden Şekillendirme",
  "datasets_Sampling": "Örnekleme",
  "datasets_Sort": "Sıralama",
  "professional_Sort": "Sıralama",
  "datasets_Transpose": "Transpoz",
  "distribution_top_level_title": "Dağılım",
  "sixsigmapro_Distribution_Menu": "Dağılım",
  "distribution_Beta": "Beta",
  "distribution_Binomial": "Binom",
  "distribution_Cauchy": "Cauchy",
  "distribution_Chi_squared": "Ki-kare",
  "distribution_Exponential": "Üstel",
  "distribution_F": "F",
  "distribution_Gamma": "Gamma",
  "distribution_Geometric": "Geometrik",
  "distribution_Gumbel": "Gumbel",
  "distribution_Hypergeometric": "Hipergeometrik",
  "distribution_Logistic": "Lojistik",
  "distribution_Lognormal": "Lognorm",
  "distribution_Negative_Binomial": "Negatif Binom",
  "distribution_Normal": "Normal",
  "sixsigmapro_Normal": "Normal",
  "distribution_Poisson": "Poisson",
  "distribution_t": "t",
  "distribution_Uniform": "Uniform",
  "distribution_Weibull": "Weibull",
  "doe_top_level_title": "DoE",
  "doe_Create_DoE_Factor_Table": "DoE Faktör Tablosu Oluştur",
  "doe_Create_Design": "Tasarım Oluştur",
  "doe_Inspect_Design": "Tasarımı İncele",
  "doe_Modify_Design": "Tasarımı Değiştir",
  "doe_Analyze_Design": "Tasarımı Analiz Et",
  "file_top_level_title": "Dosya",
  "modelfitting_File": "Dosya",
  "outputpro_File_Menu": "Dosya",
  "projectspace_File_Menu": "Dosya",
  "utility_File_Menu": "Dosya",
  "utilitypro_File_Menu": "Dosya",
  "forecasting_top_level_title": "Tahmin",
  "graphics_top_level_title": "Grafikler",
  "graphicspro_Graphics_Menu": "Grafikler",
  "graphics_Distribution": "Dağılım",
  "graphicspro_Distribution": "Dağılım",
  "graphics_Line_Charts": "Çizgi Grafikleri",
  "graphics_Maps": "Haritalar",
  "graphics_Pie_Charts": "Pasta Grafikleri",
  "graphics_Scatter_Plot": "Saçılım Grafiği",
  "graphicspro_Scatter_Plot": "Saçılım Grafiği",
  "modelevaluation_top_level_title": "Model Değerlendirme",
  "contribution_Model_Evaluation_Menu": "Model Değerlendirme",
  "professional_Model_Evaluation_Menu": "Model Değerlendirme",
  "modelevaluation_Compare": "Karşılaştır",
  "modelevaluation_Fit": "Uyum",
  "modelevaluation_IRT": "IRT",
  "modelevaluation_Predict": "Tahmin Et",
  "modelevaluation_Summarize": "Özetle",
  "modelfitting_top_level_title": "Model Uydurma",
  "contribution_Model_Fitting_Menu": "Model Uydurma",
  "modelfittingpro_Model_Fitting_Menu": "Model Uydurma",
  "professional_Model_Fitting_Menu": "Model Uydurma",
  "modelfitting_Contrasts": "Karşıtlıklar",
  "modelfitting_IRT": "IRT",
  "modelfitting_KNN": "KNN",
  "modelfitting_Regression": "Regresyon",
  "contribution_Regression": "Regresyon",
  "professional_Regression": "Regresyon",
  "modelfitting_Neural_Nets": "Sinir Ağları",
  "modelfitting_Trees": "Ağaçlar",
  "modelfitting_File_Model": "Model",
  "modelfitting_Nonlinear_Regression": "Doğrusal Olmayan Regresyon",
  "modeltuning_top_level_title": "Model Ayarlama",
  "projectspace_Open_Project": "Projeyi Aç",
  "projectspace_Save_Project": "Projeyi Kaydet",
  "projectspace_SaveAs_Project": "Farklı Kaydet",
  "sixsigma_top_level_title": "Altı Sigma",
  "sixsigmapro_Six_Sigma_Menu": "Altı Sigma",
  "sixsigma_Pareto_Chart": "Pareto Çizelgesi",
  "sixsigmapro_Pareto_Chart": "Pareto Çizelgesi",
  "sixsigma_MSA": "MSA",
  "sixsigmapro_MSA": "MSA",
  "sixsigma_Process_Capability": "Süreç Yeteneği",
  "sixsigmapro_Process_Capability": "Süreç Yeteneği",
  "sixsigma_Shewhart_Charts": "Shewhart Çizelgeleri",
  "sixsigmapro_Shewhart_Charts": "Shewhart Çizelgeleri",
  "variables_top_level_title": "Değişkenler",
  "contribution_Variables_Menu": "Değişkenler",
  "professional_Variables_Menu": "Değişkenler",
  "variables_Box_Cox": "Box-Cox",
  "variables_Compute": "Hesapla",
  "contribution_Compute": "Hesapla",
  "variables_Convert": "Dönüştür",
  "variables_Factor_Levels": "Faktör Seviyeleri",
  "contribution_Factor_Levels": "Faktör Seviyeleri",
  "analysis_Missing_Values": "Eksik Değerler",
  "professional_Missing_Values": "Eksik Değerler",
  "Note00": "=============Aşağıdaki menü üstteki 2 menüden farklıdır===========",
  "variables_Missing_Values": "Eksik Değerler"
}