{
  "title": "Veri Setlerini Birleştir",
  "navigation": "Birleştir (eski)",
  "description": "Veri setlerini birleştirmek, 2 veri setini bir araya getirmenize yardımcı olacaktır. Varsayılan olarak, bu iletişim kutusu 2 veri seti içindeki ortak değişken adlarını arayacak ve ortak değişkenlerin tam kümesi üzerinde birleştirme yapacaktır.",
  "out": "Birleştirilmiş veri setinin adını girin",
  "in1": "1. veri setini seçin",
  "in2": "2. veri setini seçin",
  "label1": "Birleştirme Seçenekleri",
  "leftjoin": "Sol Birleştirme (sadece ilk veri setindeki satırları koru)",
  "rightjoin": "Sağ Birleştirme (sadece ikinci veri setindeki satırları koru)",
  "innerjoin": "İç Birleştirme (her iki veri setinde de ortak olan satırları koru)",
  "fulljoin": "Tam Birleştirme (her iki veri setindeki tüm satırları koru)",
  "label2": "Tüm ortak sütun adları üzerinde gerçekleştirilen birleştirmeyi geçersiz kıl",
  "by": "Varsayılan olarak, birleştirmenin tüm ortak sütun adları üzerinde gerçekleştirildiğini geçersiz kılmak için, aşağıda virgülle ayrılmış ortak sütun adlarının bir alt kümesini girin. Örneğin, ülke,bölge. Birleştirme yalnızca girilen ortak sütun adları üzerinde gerçekleştirilecektir. Bu listeyi virgülle ayrılmış değerler olarak biçimlendirin, örneğin A,B,C",
  "label3": "Birleştirmenin yapıldığı sütun adları her veri setinde farklıysa",
  "byDiffNames": "Eşleşen sütun adlarını virgülle ayırarak girin, örneğin, 'C'='D', 'B'='A'. Lütfen burada tek tırnak ( ' ) kullanın.",
  "label4": "Her iki veri setinde de ortak sütun adları varsa",
  "suffix": "Varsayılan olarak, ortak değişkenler için .x ve .y son ekleri kullanılacaktır. Bunları değiştirmek istiyorsanız, burada virgülle ayrılmış olarak girin, örneğin 1,2. Not: Herhangi bir . çıkış veri setinde _ ile değiştirilecektir.",
  "advOptions": "Gelişmiş Seçenekler",
  "help": {
    "title": "Veri Setlerini Birleştir",
    "r_help": "help(join, package=dplyr)",
    "body": "\n            <b>Açıklama</b></br>\n            Veri setlerini birleştirmek, 2 veri setini bir araya getirmenize yardımcı olacaktır. Varsayılan olarak, bu iletişim kutusu 2 veri seti içindeki ortak değişken adlarını arayacak ve ortak değişkenlerin tam kümesi üzerinde birleştirme yapacaktır.<br/> Belirli bir değişken seti üzerinde birleştirme yapmak istiyorsanız, bunları Gelişmiş menüsünde belirtebilirsiniz.<br/>\n            inner_join: x'ten y'de eşleşen değerler varsa tüm satırları ve x ve y'den tüm sütunları döndürür. x ve y arasında birden fazla eşleşme varsa, eşleşmelerin tüm kombinasyonları döndürülür.</br>\n            left_join: x'ten tüm satırları ve x ve y'den tüm sütunları döndürür. y'de eşleşmesi olmayan x'teki satırlar yeni sütunlarda NA değerlerine sahip olacaktır. x ve y arasında birden fazla eşleşme varsa, eşleşmelerin tüm kombinasyonları döndürülür.</br>\n            right_join: y'den tüm satırları ve x ve y'den tüm sütunları döndürür. x'te eşleşmesi olmayan y'deki satırlar yeni sütunlarda NA değerlerine sahip olacaktır. x ve y arasında birden fazla eşleşme varsa, eşleşmelerin tüm kombinasyonları döndürülür.</br>\n            full_join: hem x hem de y'den tüm satırları ve tüm sütunları döndürür. Eşleşmeyen değerler varsa, eksik olan için NA döndürür.</br>\n            <b>Kullanım</b>\n            <br/>\n            <code> \n            left_join(x, y, by = c(NULL), suffix = c(\".x\", \".y\"), ...)\n            right_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            inner_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            full_join ( x , y , by = c( NULL ), suffix=c('.x','.y') )\n            </code> <br/>\n            <b>Argümanlar</b><br/>\n            <ul>\n            <li>\n            x: birleştirilecek veri seti\n            </li>\n            <li>\n            y: birleştirilecek veri seti\n            </li>\n            <li>\n            by: birleştirme için bir karakter vektörü. NULL ise, varsayılan olarak, *_join() doğal bir birleştirme yapacaktır, iki tablo arasında ortak adlara sahip tüm değişkenleri kullanarak. Değişkenlerin doğru olduğunu kontrol etmek için bir mesaj listelenir (mesajı bastırmak için, birleştirmek istediğiniz değişkenleri açıkça listeleyin). x ve y üzerinde farklı değişkenlerle birleştirmek için adlandırılmış bir vektör kullanın. Örneğin, by = c(\"a\" = \"b\") x.a'yı y.b ile eşleştirecektir.\n            </li>\n            <li>\n            suffix: x ve y'de birleştirilmemiş yinelenen değişkenler varsa, bu son ekler çıktıya eklenecektir. Uzunluğu 2 olan bir karakter vektörü olmalıdır.\n            </li>\n            </ul>\n            <b>Değer</b><br/>\n            Bir tibble.<br/>\n            <b>Paket</b></br>\n            dplyr</br>\n            <b>Yardım</b></br>\n            Ayrıntılı yardım için, bu iletişim kutusunun sağ üst köşesindeki R simgesine tıklayın veya aşağıdaki komutu çalıştırarak help(left_join, package=\"dplyr\") oluşturun ve çıktı penceresinde + tıklayarak bir R kodu parçası oluşturun.\n"
  }
}