{
  "title": "Çok Boyutlu Ölçekleme",
  "navigation": "Çok Boyutlu Ölçekleme",
  "betRows": "Satırlar arası",
  "betVariables": "Değişkenler arası",
  "textSize": "Metin boyutu",
  "textPos": "Metin konumu",
  "destination": "Değişkenleri seçin",
  "maxDimensions": "Maksimum boyutlar",
  "label1": "Mesafe matris",
  "computationMethod": "Hesaplama yöntemi",
  "power": "Minkowski mesafesinin gücü",
  "dispDist": "Mesafe matrisini göster",
  "saveDims": "Boyutları yeni bir veri setine kaydet",
  "datasetName": "Boyutları kaydetmek için isteğe bağlı olarak bir veri seti adı girin",
  "label2": "Gelişmiş seçenekler",
  "scalingMethod": "Ölçekleme yöntemi",
  "maxIter": "Maksimum iterasyon sayısı (*Klasik metrik için geçerli değil)",
  "plotResults": "Sonuçları çiz",
  "help": {
    "title": "Çok Boyutlu Ölçekleme",
    "r_help": "help(cmdscale, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nFarklı MDS algoritmaları vardır, bunlar arasında</br>\n<b>Klasik çok boyutlu ölçekleme</b></br>\nNoktalar arasındaki orijinal mesafe ölçüsünü mümkün olduğunca korur. Yani, MDS haritasındaki uygun mesafeler ile orijinal mesafeler aynı ölçüde olmalıdır. Klasik MDS, sözde metrik çok boyutlu ölçekleme kategorisine aittir.</br>\nAynı zamanda ana bileşenler analizi olarak da bilinir. Nicel veriler için uygundur.</br></br>\n<b>Metrek olmayan çok boyutlu ölçekleme</b></br>\nAynı zamanda sıralı MDS olarak da bilinir. Burada, bir mesafe değerinin metriği önemli veya anlamlı değildir, ancak diğer nesne çiftleri arasındaki mesafelere göre değeri önemlidir.</br>\nSıralı MDS, orijinal mesafe ile aynı sıralama düzeninde uygun mesafeler oluşturur. Örneğin, 1 ve 5 nesneleri arasındaki mesafe orijinal mesafe verilerinde beşinci sıradaysa, MDS konfigürasyonunda da beşinci sırada olmalıdır.</br>\nNitel veriler için uygundur.</br>\nAşağıdaki R fonksiyonlarını kullanıyoruz</br>\ncmdscale() [istatistik paketi]: Klasik (metrik) çok boyutlu ölçekleme hesapla.</br>\nisoMDS() [MASS paketi]: Kruskal'ın metrik olmayan çok boyutlu ölçeklemesini hesapla (metrik olmayan MDS'nin bir biçimi).</br>\nsammon() [MASS paketi]: Sammon'un doğrusal olmayan haritalamasını hesapla (metrik olmayan MDS'nin bir biçimi).</br>\nTüm bu fonksiyonlar ana argüman olarak bir mesafe nesnesi alır ve k, ölçeklenmiş çıktıda istenen boyut sayısıdır. Varsayılan olarak, iki boyutlu çözümler döndürürler, ancak bunu varsayılan olarak 2 olan k parametresi aracılığıyla değiştirebiliriz.</br>\n<br/>\nMesafe matrisini görüntüleme, boyutları yeni bir veri setine kaydetme ve boyutları çizme seçenekleri seçilebilir. </br>\nKlasik metrik ölçekleme yöntemi seçildiğinde, öz değerleri, uyum iyiliği istatistiği ve screeplot'u gösteririz. Diğer ölçekleme yöntemleri için stres değerini gösteririz.\n<b>Yardım</b></br>\nDetaylı yardım için aşağıdaki komutları çalıştırın help(dist, package=\"stats\") veya help(cmdscale, package ='stats') veya help(isoMDS, package = \"MASS\") veya help(sammon, package =\"MASS\") BlueSky Statistics R editöründe.           \n<br/>\n<br/>"
  }
}