{
  "title": "Çoklu Logit",
  "navigation": "Çoklu Logit",
  "modelname": "Model adını girin",
  "dependent": "Bağımlı değişken",
  "independent": "Bağımsız değişken(ler)",
  "generateplotchk": "Artıklar ile uygun değerler, normal Q-Q, ölçek-lokasyon ve artıklar ile etki arasındaki grafiği oluştur",
  "destination2": "Ağırlıklarla bir değişken belirtin",
  "help": {
    "title": "Çoklu Logit",
    "r_help": "help(multinom, package=nnet)",
    "body": "\n            <b>Açıklama</b></br>\n            Sinir ağları aracılığıyla çoklu log-lineer modelleri uydurur.\n            <br/>\n            <b>Kullanım</b>\n            <br/>\n            <code> \n            multinom(formül, veri, ağırlıklar, alt küme, na.action,<br/>\n                     kontrastlar = NULL, Hess = FALSE, summ = 0, sansürlü = FALSE,<br/>\n                     model = FALSE, ...)<br/>\n            </code> <br/>\n            <b>Argümanlar</b><br/>\n            <ul>\n            <li>\n            formül: regresyon modelleri için formül ifadesi, yanıt ~ tahmin ediciler biçiminde. Yanıt bir faktör veya K sütunlu bir matris olmalıdır, bu da K sınıfının her biri için sayım olarak yorumlanacaktır. İlk sınıf için sıfır katsayıları ile bir log-lineer model uydurulur. Bir offset dahil edilebilir: bu, yanıt bir K sütunlu matris veya K >= 2 sınıfı olan bir faktör ise K sütunlu bir sayısal matris olmalıdır veya 2 seviyeli bir yanıt faktörü için bir sayısal vektör olmalıdır. Diğer ayrıntılar için formula() belgelerine bakın.\n            </li>\n            <li>\n            veri: formülde geçen değişkenleri yorumlamak için isteğe bağlı bir veri çerçevesi.\n            </li>\n            <li>\n            ağırlıklar: uyumda isteğe bağlı durum ağırlıkları.\n            </li>\n            <li>\n            alt küme: uyumda hangi veri satırlarının kullanılacağını belirten ifade. Varsayılan olarak tüm gözlemler dahil edilir.\n            </li>\n            <li>\n            na.action: eksik verileri filtrelemek için bir işlev.\n            </li>\n            <li>\n            kontrastlar: model formülünde değişken olarak görünen bazı veya tüm faktörler için kullanılacak kontrastlar listesi.\n            </li>\n            <li>\n            Hess: Hessian'ın (gözlemlenen/beklenen bilgi matrisinin) döndürülüp döndürülmeyeceği için mantıksal.\n            </li>\n            <li>\n            summ: tamsayı; sıfırdan farklıysa, tekrar eden satırları silerek özetleyin ve ağırlıkları ayarlayın. Yöntem 1 ve 2 hızda farklılık gösterir (2 C kullanır); yöntem 3 ayrıca aynı X ve farklı Y'ye sahip satırları birleştirir, bu da sapma için temel çizgiyi değiştirir.\n            </li>\n            <li>\n            sansürlü: Eğer Y K sütunlu bir matris ise, girişleri olası sınıflar için bir, imkansız sınıflar için sıfır olarak yorumlayın, sayım olarak değil.\n            </li>\n            <li>\n            model: mantıksal. Eğer doğruysa, model çerçevesi döndürülen nesnenin bileşeni model olarak kaydedilir.\n            </li>\n            <li>\n            ... nnet için ek argümanlar\n            </li>\n            </ul>\n            <b>Ayrıntılar</b></br>\n            multinom nnet'i çağırır. Formülün sağ tarafındaki değişkenler yaklaşık olarak [0,1] aralığında ölçeklenmelidir, aksi takdirde uyum yavaş olur veya hiç yakınsama olmayabilir.</br>\n            <b>Değer</b><br/>\n            Ek bileşenlere sahip bir nnet nesnesi:<br/>\n            <li>\n            sapma: tam doymuş model ile karşılaştırıldığında artık sapması (bireysel gözlemleri tam olarak açıklayan). Ayrıca, eksi iki kat log-olasılık.\n            </li>\n            <li>\n            edf: model tarafından kullanılan (etkili) serbestlik derecesi sayısı\n            </li>\n            <li>\n            AIC: bu uyum için AIC.\n            </li>\n            <li>\n            Hessian: (eğer Hess doğruysa).\n            </li>\n            <li>\n            model: (eğer model doğruysa).\n            </li>\n            <b>Örnekler</b><br/>\n            <code> \n            options(contrasts = c(\"contr.treatment\", \"contr.poly\"))<br/>\n            library(MASS)<br/>\n            example(birthwt)<br/>\n            (bwt.mu <- multinom(low ~ ., bwt))<br/>\n            </code>\n            <b>Paket</b></br>\n            nnet</br>\n            <b>Yardım</b></br>\n            Ayrıntılı yardım için bu diyalog üst kısmındaki R simgesine tıklayın veya aşağıdaki komutu çalıştırarak help(multinom, package=nnet) oluşturun ve çıktı penceresinde + tıklayarak bir R kodu bloğu oluşturun\n           "
  }
}