{
  "title": "Parametre Düzeyi Tahminleri",
  "navigation": "Parametre Tahminleri",
  "label1": "Aşağıda parantez içinde listelenen sınıfların modelleri desteklenmektedir",
  "label2": "Doğrusal modeller (lm), Genelleştirilmiş doğrusal modeller (glm), Çoklu log-lineer (multinom), Kuantil regresyonu (rq), Dayanıklı doğrusal regresyon (rlm), Hayatta kalma eğrisi nesnesi (survfit), Doğrusal karışık etkiler modeli (lme), Orantılı tehlikeler regresyon nesnesi (coxph), Parametrik hayatta kalma regresyon modeli (survreg), Sıralı lojistik/Probit regresyon (polr), Faktör analizi (factanal), Lasso ve Elastik-net düzenlenmiş genelleştirilmiş doğrusal modeller (glmnet)",
  "modelselector1": "Bir model seçin",
  "help": {
    "title": "Parametre Düzeyi Tahminleri",
    "r_help": "help(tidy, package ='broom')",
    "body": "\n                <b>Açıklama</b></br>\nSeçilen modelin parametre tahminlerini gösterir\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \ntidy(x, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nx: tek satırlık veri çerçevesine dönüştürülecek model veya diğer R nesnesi\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nAşağıdaki modellerin parametre tahminlerini gösterir</br>\nDoğrusal modeller (model sınıfı lm)</br>\nGenelleştirilmiş doğrusal modeller (model sınıfı glm)</br>\nÇoklu Log-Doğrusal Modeller (model sınıfı multinom)</br>\nSıralı lojistik veya Probit Regresyon (model sınıfı polr)</br>\nLasso ve Elastik-Net Düzenlenmiş Genelleştirilmiş Doğrusal Modeller (model sınıfı glmnet)</br>\nDayanıklı doğrusal regresyon (model sınıfı rlm)</br>\nKuantil Regresyonu (model sınıfı rq)</br>\ndoğrusal karışık etkiler modeli (lme)</br>\nOrantılı tehlikeler regresyon nesnesi (coxph)</br>\nParametrik hayatta kalma regresyon modeli (survreg)</br>\nFaktör analizi (factanal)</br>\n<b>Değer</b></br>\nModel bileşenleri hakkında bilgi içeren bir tibble::tibble()'dir.</br>\nterim: Regresyon teriminin adı.</br>\ntahmin: Regresyon teriminin tahmin edilen değeri.</br>\nstd.hata: Regresyon teriminin standart hatası.</br>\nistatistik: Regresyon teriminin sıfırdan farklı olduğu hipotezinde kullanılacak istatistik değeri, genellikle bir T-istatistiği.</br>\np.değeri: Gözlemlenen istatistik ile ilişkili iki taraflı p-değeri.</br>\nconf.low: Regresyon terimi için bir güven aralığının düşük ucu. Sadece conf.int = TRUE ise dahil edilir.</br>\nconf.high: Regresyon terimi için bir güven aralığının yüksek ucu. Sadece conf.int = TRUE ise dahil edilir.</br>\nEğer doğrusal model bir mlm nesnesi (çoklu doğrusal model) ise, ek bir sütun vardır:</br>\ncevap: Katsayıların hangi yanıt sütununa karşılık geldiği (genellikle Y1, Y2, vb.)</br>\n<b>Paket</b></br>\nbroom</br>\n<b>Yardım</b></br>\nDetaylı yardım için bu diyalog üst örtüsünün sağ üst köşesindeki R simgesine tıklayın veya R sözdizimi editöründe aşağıdaki komutu çalıştırın help(tidy, package ='broom')\n"
  }
}