{
  "title": "Parametrik Hayatta Kalma Regresyonu",
  "navigation": "Parametrik Hayatta Kalma Regresyonu",
  "modelname": "Model Adını Girin",
  "timevar": "Olay için zaman veya sansür",
  "eventvar": "Olay (1 veya daha yüksek = olay, 0 veya daha düşük = sansür)",
  "destvars": "Bağımsız Değişkenler",
  "weightvar": "Ağırlıklar (isteğe bağlı)",
  "rmstChk": "Kısıtlı ortalama hayatta kalma süresini (RMST) hesapla",
  "rmstSEChk": "RMST için standart hatayı bootstrap ile hesapla (not: bu biraz zaman alacaktır)",
  "bootIter": "Bootstrap İterasyonu",
  "HazardRatioChk": "Tehlike Oranlarını Hesapla",
  "labelSurvival": "Hayatta Kalma Grafik Türü",
  "survivalradioCI": "CI ile Hayatta Kalma",
  "survivalradio": "Hayatta Kalma",
  "survivalradioKMCI": "Kaplan-Meier (parametrik olmayan) ile CI ile Hayatta Kalma",
  "survivalradioKM": "Kaplan-Meier (parametrik olmayan) ile Hayatta Kalma",
  "labelFailure": "Kümülatif Başarısızlık Grafik Türü",
  "inciradioCI": "CI ile Kümülatif Başarısızlık",
  "inciradio": "Kümülatif Başarısızlık",
  "inciradioKMCI": "Kaplan-Meier (parametrik olmayan) ile CI ile Kümülatif Başarısızlık",
  "inciradioKM": "Kaplan-Meier (parametrik olmayan) ile Kümülatif Başarısızlık",
  "spectimes": "Hayatta Kalma Olasılığını Hesapla - zamanları time1, time2, time3, vb. veya seq (1,5,by=1) olarak belirtin",
  "specprobs": "Olay için Hayatta Kalma Süresini Hesapla - olasılığı 0.25, 0.50, 0.60, 0.75, vb. olarak belirtin veya seq (0.2,0.9,by=0.1) olarak belirtin",
  "coVarValues": "Boş bırakılırsa, bağımsız değişkenlerin (Kovaryatlar) ortalama değerleri kullanılacaktır. Aksi takdirde, olasılıkları tahmin etmek ve grafik oluşturmak için kullanılacak virgülle ayrılmış değerleri belirtin",
  "labelDistribution": "Verilere en uygun dağılım fonksiyonunu seçin",
  "selectDistFuncWeibullRad": "Weibull",
  "selectDistFuncExpRad": "Üstel",
  "selectDistFuncGammaRad": "Gamma",
  "selectDistFuncLnormalRad": "Log Normal",
  "selectDistFuncPoissonRad": "Poisson",
  "selectDistFuncNBinomRad": "Negatif Binom",
  "selectDistFuncGeomRad": "Geometrik",
  "selectDistFuncBetaRad": "Beta",
  "selectDistFuncUnifRad": "Uniform",
  "selectDistFuncLogisRad": "Logistik",
  "selectDistFuncLogLogisRad": "Log Logistik",
  "selectDistFuncCauchyRad": "Cauchy",
  "selectDistFuncNormRad": "Normal",
  "confidenceInterval": "Maksimum olasılık tahminleri için güven aralıkları",
  "help": {
    "title": "Parametrik Hayatta Kalma Regresyonu",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n\t\t\tYükleme dizinindeki örnek veri kümesine bakın, varsayılan konum sürücü harfi:\\program files\\BioStat Prime\\10\\Samples_and_Documents\\Datasets_and_Demos\\Survival\\mockstudy_upd.RData. Followup_time değişkeni olay için zaman veya sansür olarak girilmeli ve Event değişkeni Olay (1 = olay, 0 = sansür) olarak girilmelidir.<br/>\n            <br/>\n            <br/>\n\t\t\tÖrnek veri kümeleri akciğer, üretim verileri ve ampul güvenilirliği <br/><br/>\t\t\n            <b>Parametrik Hayatta Kalma Regresyonu parametre tahminleri ve Kaplan-Meier hayatta kalma (null/intercept sadece model) eğrileri ile birlikte</b>\n            <br/>\n            <br/>\n            Bunlar, bir olayın olmaması (veya tersine, bir olayın olması) için kümülatif riski tahmin etmek amacıyla kullanılır. Olay için takip süresinin başlangıcından itibaren bir süre boyunca risk altında olmaları gerekir.\n            <br/>\n            <br/>\n            <b>Zaman:</b> Olayın gerçekleşip gerçekleşmediğine bağlı olarak olay için geçen süre veya o olay için son takip süresi\n            <br/><br/>\n            <b>Olay:</b> Olayın gerçekleşip gerçekleşmediğini gösteren sayısal gösterge (1=olay, 0=sansür) her bir konu için\n            <br/><br/>\n            <b>Grafik Türü:</b> Olayın olmaması (hayatta kalma) veya olayın olması (başarısızlık) olasılığını grafikle gösterin\n            <br/><br/>\n           <br/>\n            <br/>\n\t\t\t<b>Belirli Zamanlar veya olasılık için Tahmin Tablosu:</b> Kullanıcı tarafından seçilen bir zaman seti için hayatta kalma tahmin olasılıklarını içeren bir tablo ekleme seçeneği.\n\t\t\t<br/><br/>\n\t\t\t<b>Zamanları time1, time2, time3, vb. veya seq(1,5,by=1) olarak belirtin:</b> Bu, belirli zamanlar için tabloda yer alacak belirli zamanlardır. Tek tek virgüllerle veya eşit aralıklı değerlerin bir dizisi olarak belirtilebilir.\n\t\t\t<br/><br/>\n            Tablolar, örneklem büyüklüğü, olay olan konu sayısı, medyan hayatta kalma süresi (tanımlıysa), kısıtlı ortalama hayatta kalma süresi ve medyan takip süresi ile birlikte çıktılanır. Medyan takip süresi, gerçek olayları sansürlü gözlemler olarak ve gerçek sansürlü gözlemleri olaylar olarak ele alan ters Kaplan-Meier tahmincisi kullanılarak hesaplanır. Böylece, bu tahmincideki \"olay\", \"çalışmaları mümkün olduğunca takip etmek\" anlamına gelir.\n            <br/>\n            Parametrik Hayatta Kalma ve seçilen dağılım için olay tahminleri, veri kümesindeki her gözlemlenen zamanda sağlanan güven aralıkları ile birlikte sağlanır. \n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>           \n            <b>Stil Seçenekleri</b>\n            <br/>\n            <br/>\n            <b>Grafik Başlığı:</b> Grafiğin başlığı; başlık olmaması için tüm metni silin\n            <br/><br/>\n\t\t\t<b>Grafik Başlık Boyutu:</b> Grafik başlığının boyutu.\n\t\t\t<br/><br/>\n            <b>Grafik Teması:</b> Grafiğin genel stili\n            <br/><br/>\n            <b>Riskteki Sayıyı Dahil Et:</b> İsteğe bağlı olarak, grafiğin alt kısmında zamanla risk altında kalan konu sayısını gösteren bir tablo ekleyin.  <b>Risk Tablosu Pozisyonu</b>, tablonun eksenlerin dışında mı yoksa içinde mi olmasını istediğinizi belirtir.  <b>Risk Tablosu Yüksekliği</b>, tablonun grafik alanının ne kadarını kaplayacağını kontrol eder. Bu seçenek, risk tablosu pozisyonu eksenlerin içindeyse göz ardı edilir. \n\t\t\t<b>Risk Tablosu Değer Boyutu</b>, riskteki sayıların boyutunu kontrol eder. <b>Risk Tablosu Başlık Boyutu</b>, riskteki sayı tablosunun başlığının boyutunu kontrol eder.\n\t\t\t<b>Risk Tablosu Eksen Etiket Boyutu</b>, eksen etiketlerinin boyutunu kontrol eder.\n\t\t\t<b>Risk Tablosu İşaretleme Etiket Boyutu</b>, riskteki sayı tablosundaki zamanlar için işaretleme etiketlerinin boyutunu kontrol eder. Eğer risk tablosundaki tüm eksenleri ve ızgara çizgilerini kaldırmak isteniyorsa, <b>Risk Tablosundan Eksenleri ve Izgara Çizgilerini Kaldır</b> seçeneği işaretlenebilir. Bu, tabloda yalnızca riskteki sayıları içerir.\n            <br/>\n            <br/>\n            <b>Çizgi Seçenekleri:</b>\n            <b>Boyut</b>, çizginin kalınlığını kontrol eder ve <b>Renk</b>, çizilen çizginin rengini kontrol eder. Tahminler için isteğe bağlı olarak %95 güven aralığı dahil edilebilir, bu ya <b>şerit</b> (gölgelik alan) ya da <b>adım</b> (çizgi) formatında olabilir. <b>Şeffaflık</b>, şeridin ne kadar koyu olduğunu kontrol eder ve adım seçeneği seçildiğinde göz ardı edilir. <b>Sansürlü Zamanlar</b> (konuların olay için artık risk altında olmadığı zamanlar) çizgide \"+\" sembolleri ile gösterilebilir. \"+\" sembollerinin boyutu ayarlanabilir. <b>Medyan Hayatta Kalmayı Göster</b> seçeneği, %50'sinin olay yaşadığı tahmin edilen zamanda yatay veya dikey çizgiler ekler. Medyan zaman, hayatta kalma eğrisi %50'yi geçmediğinde tanımsızdır.\n            <br/>\n            <br/>\n            <br/>   \n            <b>Eksen Seçenekleri</b>\n            <br/> \n            <br/> \n            <b>Etiket</b> seçeneği, eksen için metin etiketini belirtir. <b>Eksen Sınırları</b>, eksenin minimum ve maksimum değerlerini belirtir. <b>İşaretleme İşareti Aralıkları</b> seçeneği, eksendeki işaretleme işaretlerinin aralığını kontrol eder. Zaman eksenindeki artışlar, isteğe bağlı riskteki sayı tablosu için zamanları da kontrol eder.\n            <br/> \n            Hayatta kalma ekseni <b>Ölçek</b> seçeneği, tahminlerin oran (0-1) veya yüzde (0-100) ölçeğinde olmasını isteyip istemediğinizi belirtir.\n\t\t\t<br/><br/>\n\t\t\t<b>Eksen Etiket Boyutu:</b> Bu, hem hayatta kalma hem de zaman ekseni etiket boyutlarını kontrol eder.\n\t\t\t<br/><br/>\n\t\t\t<b>Eksen İşaretleme Etiket Boyutu:</b> Bu, hem hayatta kalma hem de zaman ekseni işaretleme etiket boyutlarını kontrol eder.\n        "
  }
}