{
  "title": "Kısmi Kredi Modeli",
  "navigation": "Kısmi Kredi Modeli",
  "modelname": "Model adını girin",
  "destinationvars": "Hedef değişken(ler)",
  "estimationlbl": "Tahmin",
  "rad1": "CML tahminini kullan",
  "chk1": "Standart hata hesapla",
  "chk2": "Parametreleri toplam (0) olacak şekilde normalize et",
  "rad2": "MML tahminini kullan",
  "help": {
    "title": "Kısmi Kredi Modeli",
    "r_help": "help(PCM, package='eRm')",
    "body": "\n            <b>Açıklama</b>\n            <br/>\n            Kısmi kredi modeli için parametre tahminleri üretir\n            <br/><br/>\n            CML tahmini için, polytomous madde yanıtları için kısmi kredi modelinin parametre tahminlerini hesaplamak üzere eRm::PCM'i çağırıyoruz.\n            <br/><br/>\n            MML tahmini için, aşağıda belirtilen uygun parametrelerle tam.mml'i çağırıyoruz.\n            <br/><br/>\n            <b>CML tahmini için kullanım</b>\n            <br/>\n            <code>\n            eRm::PCM(X,se=FALSE,sum0=FALSE) \n            </code>    \n            <br/><br/>\n            <b>Argümanlar</b>\n            <br/>       \n            <ul>\n\n            <li>\n            X:  Girdi 0/1 veri matris veya veri çerçevesi; satırlar bireyleri, sütunlar maddeleri temsil eder. Eksik değerler NA olarak eklenir.\n            </li>\n            <li>\n            W:  Rasch modeli için tasarım matrisidir. Atlandığında, fonksiyon W'yi otomatik olarak hesaplayacaktır.\n            </li>\n            <li>\n            se: Eğer DOĞRU ise, standart hatalar hesaplanır.\n            </li>\n            <li>\n            sum0: Eğer DOĞRU ise, parametreler uygun bir W belirterek toplam-0 olacak şekilde normlanır. Eğer YANLIŞ ise, ilk parametre 0'a kısıtlanır.\n            </li>\n            <li>\n            etaStart: Eta parametreleri için başlangıç değerleri vektörü belirtilebilir. Atlandığında, 0 vektörü kullanılır.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>MML tahmini için kullanım</b>\n            <br/>\n            <code>\n            tam.mml(resp,irtmodel=\"PCM\",verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Argümanlar</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Polytomous madde yanıtları içeren veri çerçevesi k=0,...,K. Eksik yanıtlar NA olarak belirtilmelidir.\n            </li>\n            <li>\n            irtmodel: Sabit madde eğimleri için (tam.mml'de) seçenekler PCM (kısmi kredi modeli), PCM2 (ConQuest parametrizasyonu 'madde+madde*adım' ile kısmi kredi modeli) ve RSM (derecelendirme ölçeği modeli; ConQuest parametrizasyonu 'madde+adım'). \n            <br/>\n            Tahmin edilen madde eğimleri (sadece tam.mml.2pl'de mevcut) seçenekler 2PL (tüm madde kategorilerinin eğimleri tahmin edilir; Nominal Madde Yanıt Modeli), GPCM (her madde için bir ve yalnızca bir eğim parametresi olan genelleştirilmiş kısmi kredi modeli) ve 2PL.gruplar (madde alt kümleri aynı madde eğimi tahminlerine sahip olur) ve genelleştirilmiş kısmi kredi modelinde (GPCM.tasarım, Örnekler için bakınız) madde eğimlerinde bir tasarım matrisidir. Ancak, madde eğimleri, tam.mml.mfr fonksiyonu kullanılarak yüzeysel tasarımlarla tahmin edilemez. Ancak, önceden belirlenmiş tasarım matrislerini kullanmak ve tam.mml.2pl'e bazı kısıtlamalar uygulamak kolaydır.\n            </li>\n            <li>\n            verbose: İterasyonlar sırasında çıktının yazdırılıp yazdırılmayacağını belirten mantıksal bir değer. \n            </li>\n            </ul>\n            <br/><br/>\n            <b>Paketler</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>\n            <b>Yardım</b>\n            <br/>\n            help(PCM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
  }
}