{
  "title": "Kişi-Öğe Haritasını Çiz",
  "navigation": "Kişi-Öğe Haritasını Çiz",
  "label1": "Bir model seçin (Rm ve dRm sınıfı modelleri desteklenmektedir)",
  "label1b": "Hiç model yoksa, önce Model Uygulama -> IRT seçerek bir model oluşturmanız gerekir",
  "modelselector1": "Bir model seçin",
  "range1": "X ekseni için aralık",
  "help": {
    "title": "Kişi-Öğe Haritasını Çiz",
    "r_help": "help(plotPImap, package='eRm')",
    "body": "\n                <b>Açıklama</b></br>\n                Kişi-öğe haritası, öğe (ve eşik) parametrelerinin konumunu ve kişi parametrelerinin dağılımını gizli boyut boyunca gösterir. Kişi-öğe haritaları, öğe ölçüm dağılımının (alt panel) aralığını ve konumunu, kişi ölçüm dağılımının (üst panel) aralığı ve konumuyla karşılaştırmak için yararlıdır. Öğeler, tüm kişilerin 'yeteneklerini' anlamlı bir şekilde ölçmek için ideal olarak tüm ölçek boyunca yerleştirilmelidir.\n\n                <br/><br/>\n                <b>Kullanım</b>\n                <br/>\n                <code>\n                plotPImap(object, item.subset = \"all\", sorted = FALSE,\n                main = \"Kişi-Öğe Haritası\", latdim = \"Gizli Boyut\",\n                pplabel = \"Kişi\nParametre\nDağılımı\", cex.gen = 0.7,\n                xrange = NULL, warn.ord = TRUE, warn.ord.colour = \"black\",\n                irug = TRUE, pp = NULL)\n                </code>\n                <br/><br/>\n                <b>Argümanlar</b>\n                <br/>  \n                object: Rm veya dRm sınıfının nesnesi\n                <br/>\n                item.subset: Çizilecek öğelerin alt kümesi. X'teki sütunu belirten bir sayısal vektör veya sütun adını belirten bir karakter vektörü. \"all\" ise, tüm öğeler çizilir. Çizilecek öğe sayısı > 1 olmalıdır.\n                <br/>\n                sorted: Eğer TRUE ise, öğeler gizli boyuttaki konumlarına göre artan sırada sıralanır.   \n                <br/>\n                main: Grafiğin ana başlığı.\n                <br/>\n                latdim: x-ekseni etiketi, yani gizli boyut.\n                <br/>\n                pplabel: Kişi parametre dağılımını gösteren üst panel için başlık\n                <br/>\n                cex.gen: cex, grafiksel bir parametre olarak, çizim metni ve sembollerinin varsayılan değere göre ne kadar büyütüleceğini belirten sayısal bir değer verir. Burada cex.gen tüm metin etiketlerine uygulanır. Varsayılan 0.7'dir.\n                <br/>\n                xrange: x-ekseni için aralık\n                <br/>\n                warn.ord: Eğer TRUE ise (varsayılan), alt panelin sağ kenarında polytomous öğeler için ordinal olmayan eşik konumlarını belirtmek için yıldızlar gösterilir.\n                <br/>\n                warn.ord.colour: Polytomous öğeler için ordinal olmayan eşik konumları, daha görünür hale getirmek için bu renkle renklendirilir. Bu, grafiğin oldukça yoğun olduğu durumlarda özellikle yararlıdır. Varsayılan \"siyah\" olduğundan, herhangi bir ayrım yapılmaz.\n                <br/>   \n                irug: Eğer TRUE ise (varsayılan), tüm eşikler, dahil edilen öğelerin en bilgilendirici olduğu yeri göstermek için kişi dağılımının altında çizilir.                \n                <br/>\n                pp: NULL olmayan bir değer ise, bu, veri nesnesinin kişi.parametre verilerini içerir ve yeniden hesaplama gereksinimini ortadan kaldırır.\n                <br/><br/>\n\n                <b>Paketler</b>\n                <br/>\n                eRm\n                <br/><br/>\n                <b>Yardım</b>\n                <br/>\n                help(plotPImap, package='eRm')\n                "
  }
}