{
  "title": "Proses Yetenekliliği",
  "navigation": "Proses Yetenekliliği",
  "summaryPlotChk": "Proses yetenekliliğini hesaplamak için kullanılan temel xbar ve I grafiklerini çizin.",
  "displaySLlineonPlotChk": "Temel grafiklerde LSL ve USL çizgilerini göster.",
  "printObjectSummaryChk": "Proses yetenekliliği için QCC nesne özetini yazdır.",
  "label1": "İki seçenek - ya bir değişken seçin (gerekirse bir gruplama değişkeni ile) ya da zaten gruplandırılmışsa veri setindeki değişkenleri seçin.",
  "label2": "Gelişmiş seçenekler",
  "selectVariableRad": "Seçenek 1: Veri setinden bir değişken seçin (isteğe bağlı olarak gruplandırılması gerekebilir).",
  "variableSelcted": "Analiz etmek için bir değişken (gözlemlenen veriler) seçin.",
  "groupingVariable": "Gruplama değişkeni (isteğe bağlı - verilerin gruplandırılması gerekiyorsa).",
  "variableControlLimits": "Gruplama öncesinde atılacak veri satırları (örneğin, 1:25 veya 1,4,5,7:12 olarak belirtin).",
  "displayGroupsChk": "Referans için veri seti UI ızgarasında gruplamaları göster.",
  "selectDatasetRad": "Seçenek 2: Zaten gruplandırılmışsa veri setinden değişkenleri seçin.",
  "variablelistSelcted": "Analiz etmek için bir veya daha fazla gruplandırılmış değişken (gözlemlenen veriler) seçin.",
  "rowsTobeUsed": "Proses yetenekliliğini analiz etmek için kullanılacak seçilen (gruplandırılmış) satırlar (örneğin, 1:25 veya 1,4,5,7:12 olarak belirtin).",
  "nsigmas": "Sigma - kontrol limitlerini hesaplamak için kullanılacak sigma sayısı.",
  "confidence_level": "Güven aralıklarını hesaplamak için kullanılacak 0 ile 1 arasında bir sayısal değer.",
  "stddev": "xbar'ı hesaplamak için standart sapma yöntemi (grup boyutu > 1 için).",
  "stddevXbarOne": "I-MR'yi hesaplamak için standart sapma yöntemi.",
  "DoNotUseUnbiasingConstantChk": "Genel proses yeteneklilik indeksleri için standart sapmayı tahmin etmek için tarafsızlaştırma sabitini kullanmayın.",
  "lower": "LSL - alt spesifikasyon limitinin sayısal değeri (tek taraflı spesifikasyon limitlerini belirtmek için NA yazın).",
  "upper": "USL - üst spesifikasyon limitinin sayısal değeri (tek taraflı spesifikasyon limitlerini belirtmek için NA yazın).",
  "target": "Hedef - sürecin hedefini belirten isteğe bağlı bir değer.",
  "addlSpecLines": "Grafikte ek spesifikasyon çizgileri ekleyin (virgülle ayrılmış örneğin 73.98, 74.01, 74.03).",
  "addlSpecLinesLabel": "Ek spesifikasyon çizgileri için etiket (virgülle ayrılmış örneğin Spec 1, Spec 2, Spec 3).",
  "digits": "Haneler - görüntülenecek hane sayısı.",
  "help": {
    "title": "Proses Yetenekliliği (qcc paketi)",
    "r_help": "help(process.capability, package = qcc)",
    "body": "\n\t\t\t\t<b>Açıklama</b></br>\n\t\t\t\tqcc fonksiyonu, yetenek indekslerini hesaplar.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tDetaylı yardım için R help(process.capability, package = qcc), help(qcc, package = qcc), help(sd.xbar, package = qcc) ve help(sd.xbar.one, package = qcc) kullanın.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\tBunu denemek için, qcc paketinden pistonrings adlı veri setini Yükle Veri Seti menüsü ile yükleyebilirsiniz, qcc paketini seçip ardından pistonrings veri setini seçin.\n\t\t\t\t<br/>\n\t\t\t\tSeçenek 1, gözlemlenen değişken için çapı seçin, gruplama değişkeni için örnek seçin,\n\t\t\t\t<br/>\n\t\t\t\tKullanılacak gruplandırılmış satırlara 1:25 yazın.\n\t\t\t\t<br/>\n\t\t\t\tProses yetenekliliği analizi için LSL'ye 73.95, USL'ye 74.05 ve Hedef Limit'e 74.0 yazın.\n\t\t\t\t<br/>\n\t\t\t\t<br/>\n\t\t\t\thttps://cran.r-project.org/web/packages/qcc/vignettes/qcc_a_quick_tour.html adresindeki qcc eğitimini takip edin.\n\t\t\t\t<br/>\n\t\t\t"
  }
}