{
  "title": "Tek Örnek Oran Testi",
  "navigation": "Tek örnek",
  "tvarbox1": "Sadece 2 seviyeli/değerli sayısal veya faktör",
  "label1": "Alternatif hipotez",
  "test1": "Oran != Varsayılan oran",
  "test2": "Oran > Varsayılan oran",
  "test3": "Oran < Varsayılan oran",
  "txtbox1": "Güven düzeyi",
  "txtbox2": "Null hipotez (Varsayılan oran 0-1 aralığında)",
  "chkbox1": "Süreklilik düzeltmesi ile",
  "dataInCols": "Bir veya daha fazla değişken örnekler içerir",
  "summarized": "Özetlenmiş veri",
  "noOfEvents": "Olay sayısı",
  "noOfTrials": "Deneme sayısı",
  "method": "Yöntemi seçin",
  "help": {
    "title": "Tek Örnek Oran Testi",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nprop.test, birkaç gruptaki oranların (başarı olasılıkları) aynı olduğunu veya belirli verilen değerlere eşit olduğunu test etmek için kullanılabilir.<br/>\nmethod = \"Exact\" olduğunda, Bernoulli deneyinde başarı olasılığı hakkında basit bir null hipotezinin kesin testi yapılır.<br/>\nmethod =\"Normal approximation\" olduğunda, normal dağılım, binom dağılımı için bir yaklaşım olarak kullanılır (örnek boyutu yeterince büyük olduğunda)<br/>\n<code> \nBSky_Single_Sample_Proportion_Test = stats::binom.test( x =5, n =20 , alternative='two.sided', p=0.5, conf.level=0.95)\n</code> <br/>\n<code> \nBSky_Single_Sample_Proportion_Test = BSkyNormalApprox( x =6, n =26 , alternative='two.sided', p=0.5, conf.level=0.95)\n</code> <br/>\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nx: başarıların sayılarının bir vektörü, iki girişli bir tek boyutlu tablo veya başarı ve başarısızlık sayılarının verildiği 2 sütunlu iki boyutlu bir tablo (veya matris).\n</li>\n<li>\nn: denemelerin sayılarının bir vektörü; x bir matris veya tabloysa göz ardı edilir.\n</li>\n<li>\np: başarı olasılıklarının bir vektörü. p'nin uzunluğu, x tarafından belirtilen grup sayısıyla aynı olmalı ve elemanları 0'dan büyük ve 1'den küçük olmalıdır.\n</li>\n<li>\nalternative: alternatif hipotezi belirten bir karakter dizesi, \"two.sided\" (varsayılan), \"greater\" veya \"less\" olmalıdır. Sadece ilk harfi belirtebilirsiniz. Sadece bir oran belirli bir değere eşit olduğu veya iki oran eşit olduğu için null testi için kullanılır; aksi takdirde göz ardı edilir.\n</li>\n<li>\nconf.level: döndürülen güven aralığının güven düzeyi. 0 ile 1 arasında tek bir sayı olmalıdır. Sadece bir oran belirli bir değere eşit olduğu veya iki oran eşit olduğu için null testi için kullanılır; aksi takdirde göz ardı edilir.\n</li>\n<li>\ncorrect: Yates'in süreklilik düzeltmesinin mümkün olduğunda uygulanıp uygulanmayacağını belirten mantıksal bir değer.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nSadece sonlu başarı ve başarısızlık sayıları olan gruplar kullanılır. Başarı ve başarısızlık sayıları negatif olmamalıdır ve dolayısıyla pozitif olmalıdır. Tüm sonlu sayılar tam sayılar olmalıdır.</br>\nEğer p NULL ise ve birden fazla grup varsa, test edilen null, her gruptaki oranların aynı olduğudur. Eğer iki grup varsa, alternatifler, ilk gruptaki başarı olasılığının ikinci gruptaki başarı olasılığından daha az, eşit olmaması veya daha fazla olduğu şeklindedir, alternatif tarafından belirtilmiştir. Belirtilen güven düzeyine göre güven aralığı döndürülür ve [-1,1] aralığına sıkıştırılır. Süreklilik düzeltmesi yalnızca örnek oranları arasındaki mutlak değerdeki farkı aşmadığı takdirde kullanılır. Aksi takdirde, eğer 2'den fazla grup varsa, alternatif her zaman \"two.sided\"dir, döndürülen güven aralığı NULL'dır ve süreklilik düzeltmesi asla kullanılmaz.</br>\nEğer yalnızca bir grup varsa, test edilen null, başarı olasılığının p olduğu veya p verilmemişse 0.5 olduğu şeklindedir. Alternatif, başarı olasılığının p veya 0.5'ten daha az, eşit olmaması veya daha fazla olduğu şeklindedir, alternatif tarafından belirtilmiştir. Belirtilen güven düzeyine göre güven aralığı döndürülür ve [0,1] aralığına sıkıştırılır. Süreklilik düzeltmesi yalnızca örnek ve null oranları arasındaki mutlak değerdeki farkı aşmadığı takdirde kullanılır. Güven aralığı, puan testini tersine çevirerek hesaplanır.</br>\nSon olarak, eğer p verilmişse ve 2'den fazla grup varsa, test edilen null, başarı olasılıklarının p tarafından verilen değerler olduğudur. Alternatif her zaman \"two.sided\"dir, döndürülen güven aralığı NULL'dır ve süreklilik düzeltmesi asla kullanılmaz.</br>\n<b>Değer</b><br/>\nAşağıdaki bileşenleri içeren \"htest\" sınıfına sahip bir liste:</br>\nistatistik: Pearson'ın ki-kare test istatistiğinin değeri.</br>\nparametre: test istatistiğinin yaklaşık ki-kare dağılımının serbestlik dereceleri.</br>\np.değeri: testin p-değeri.</br>\nestimate: örnek oranları x/n ile bir vektör.</br>\nconf.int: eğer bir grup varsa gerçek oran için bir güven aralığı, veya 2 grup varsa ve p verilmemişse oranlar arasındaki fark için, aksi takdirde NULL. NULL olmayan durumlarda, döndürülen güven aralığı, belirtilen alternatif hipoteze uygun olarak, belirtilen güven düzeyine göre asimptotik bir güven düzeyine sahiptir.</br>\nnull.value: null tarafından belirtilen p'nin değeri, aksi takdirde NULL.</br>\nalternative: alternatifi tanımlayan bir karakter dizesi.</br>\nmethod: kullanılan yöntemi ve Yates'in süreklilik düzeltmesinin uygulanıp uygulanmadığını belirten bir karakter dizesi.</br>\ndata.name: verilerin adlarını veren bir karakter dizesi.</br>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nhelp(prop.test, package ='stats')\n"
  }
}