{
  "title": "Tekil Örneklem Oran Testi",
  "navigation": "Tekil örneklem (Süreklilik Düzeltmesi)",
  "tvarbox1": "Sadece 2 seviyeye/değere sahip sayısal veya faktör",
  "label1": "Alternatif hipotez",
  "test1": "Oran != Varsayılan oran",
  "test2": "Oran > Varsayılan oran",
  "test3": "Oran < Varsayılan oran",
  "txtbox1": "Güven düzeyi",
  "txtbox2": "Null hipotez (Varsayılan oran 0-1 aralığında)",
  "chkbox1": "Süreklilik düzeltmesi ile",
  "dataInCols": "Bir veya daha fazla değişken örnekler içerir",
  "summarized": "Özetlenmiş veri",
  "noOfEvents": "Olay sayısı",
  "noOfTrials": "Deneme sayısı",
  "help": {
    "title": "Tekil Örneklem Oran Testi",
    "r_help": "help(prop.test, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nprop.test, birkaç gruptaki oranların (başarı olasılıkları) aynı olduğunu veya belirli verilen değerlere eşit olduğunu test etmek için kullanılabilir.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nprop.test(x, n, p = NULL,\n            alternative = c(\"two.sided\", \"less\", \"greater\"),\n            conf.level = 0.95, correct = TRUE)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nx: başarıların sayım vektörü, iki girişli bir boyutsal tablo veya başarı ve başarısızlık sayımlarını sırasıyla veren 2 sütunlu bir iki boyutlu tablo (veya matris).\n</li>\n<li>\nn: denemelerin sayım vektörü; x bir matris veya tabloysa göz ardı edilir.\n</li>\n<li>\np: başarı olasılıklarının vektörü. p'nin uzunluğu, x tarafından belirtilen grup sayısıyla aynı olmalı ve elemanları 0'dan büyük ve 1'den küçük olmalıdır.\n</li>\n<li>\nalternative: alternatif hipotezi belirten bir karakter dizisi, \"two.sided\" (varsayılan), \"greater\" veya \"less\"'dan biri olmalıdır. Sadece ilk harfi belirtebilirsiniz. Tek bir oranın belirli bir değere eşit olduğu veya iki oranın eşit olduğu null hipotezini test etmek için kullanılır; aksi takdirde göz ardı edilir.\n</li>\n<li>\nconf.level: döndürülen güven aralığının güven düzeyi. 0 ile 1 arasında tek bir sayı olmalıdır. Tek bir oranın belirli bir değere eşit olduğu veya iki oranın eşit olduğu null hipotezini test ederken kullanılır; aksi takdirde göz ardı edilir.\n</li>\n<li>\ncorrect: Yates'in süreklilik düzeltmesinin mümkün olduğunda uygulanıp uygulanmayacağını belirten mantıksal bir değer.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nSadece sonlu başarı ve başarısızlık sayısına sahip gruplar kullanılır. Başarı ve başarısızlık sayımları negatif olmamalıdır ve dolayısıyla pozitif olmalıdır. Tüm sonlu sayımlar tam sayılar olmalıdır.</br>\nEğer p NULL ise ve birden fazla grup varsa, test edilen null hipotez, her gruptaki oranların aynı olduğudur. Eğer iki grup varsa, alternatifler, birinci gruptaki başarı olasılığının ikinci gruptaki başarı olasılığından daha az, eşit veya daha fazla olduğu şeklindedir. Güven düzeyi conf.level ile belirtilen oranlar arasındaki fark için bir güven aralığı [-1,1] olarak döndürülür. Süreklilik düzeltmesi, örnek oranlarının mutlak değerdeki farkını aşmadığı sürece kullanılır. Aksi takdirde, 2'den fazla grup varsa, alternatif her zaman \"two.sided\"'dır, döndürülen güven aralığı NULL'dır ve süreklilik düzeltmesi asla kullanılmaz.</br>\nEğer sadece bir grup varsa, test edilen null hipotez, temel başarı olasılığının p olduğu veya p verilmemişse 0.5 olduğu anlamına gelir. Alternatif, başarı olasılığının p veya 0.5'ten daha az, eşit veya daha fazla olduğu anlamına gelir. Güven düzeyi conf.level ile belirtilen temel oran için bir güven aralığı [0,1] olarak döndürülür. Süreklilik düzeltmesi, örnek ve null oranları arasındaki mutlak değerdeki farkı aşmadığı sürece kullanılır. Güven aralığı, puan testini tersine çevirerek hesaplanır.</br>\nSon olarak, p verilirse ve 2'den fazla grup varsa, test edilen null hipotez, temel başarı olasılıklarının p tarafından verilenler olduğudur. Alternatif her zaman \"two.sided\"'dır, döndürülen güven aralığı NULL'dır ve süreklilik düzeltmesi asla kullanılmaz.</br>\n<b>Değer</b><br/>\n\"htest\" sınıfı ile aşağıdaki bileşenleri içeren bir liste:</br>\nstatistic: Pearson'ın ki-kare test istatistiğinin değeri.</br>\nparameter: test istatistiğinin yaklaşık ki-kare dağılımının serbestlik dereceleri.</br>\np.value: testin p-değeri.</br>\nestimate: örnek oranları x/n ile bir vektör.</br>\nconf.int: bir grup varsa gerçek oran için bir güven aralığı, veya 2 grup varsa ve p verilmemişse oranlar arasındaki fark için bir güven aralığı, aksi takdirde NULL. NULL olmayan durumlarda, döndürülen güven aralığı, conf.level ile belirtilen asimptotik güven düzeyine sahiptir ve belirtilen alternatif hipoteze uygundur.</br>\nnull.value: null ile belirtilen p'nin değeri veya aksi takdirde NULL.</br>\nalternative: alternatifi tanımlayan bir karakter dizisi.</br>\nmethod: kullanılan yöntemi belirten bir karakter dizisi ve Yates'in süreklilik düzeltmesinin uygulanıp uygulanmadığı.</br>\ndata.name: verilerin adlarını veren bir karakter dizisi.</br>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nhelp(prop.test, package ='stats')\n"
  }
}