{
  "title": "Rastgele Bölme",
  "navigation": "Rastgele Bölme",
  "traindataset": "Eğitim veri kümesinin adını girin",
  "testdataset": "Test veri kümesinin adını girin",
  "split": "Bölme yüzdesini girin",
  "replace": "Örnekleme, yerine koyma ile mi olmalı",
  "seed": "Tohum ayarla",
  "dependent": "Stratifiye örnekler oluşturulacak değişken",
  "help": {
    "title": "Rastgele Bölme",
    "r_help": "help(sample, package=\"base\")",
    "body": "\n<b>Açıklama</b></br>\nsample, x'in elemanlarından belirtilen boyutta bir örnek alır, ister yerine koyma ile ister koymadan.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nsample(x, size, replace = FALSE, prob = NULL)\nsample.int(n, size = n, replace = FALSE, prob = NULL)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nx: Seçilecek bir veya daha fazla elemanın vektörü veya pozitif bir tam sayı. 'Ayrıntılar'a bakın.\n</li>\n<li>\nn: Seçilecek öğe sayısı olan pozitif bir sayı. 'Ayrıntılar'a bakın.\n</li>\n<li>\nsize: Seçilecek öğe sayısını veren negatif olmayan bir tam sayı.\n</li>\n<li>\nreplace: Örnekleme, yerine koyma ile mi olmalı?\n</li>\n<li>\nprob: Örnekleme yapılan vektörün elemanlarını elde etmek için olasılık ağırlıkları vektörü.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nEğer x'in uzunluğu 1 ise, sayısal (is.numeric anlamında) ve x >= 1 ise, örnekleme sample 1:x'ten yapılır. Bu kolaylık özelliği, x'in uzunluğunun değişken olduğu durumlarda istenmeyen davranışlara yol açabilir. Örnekler için sample(x) gibi çağrılara bakın.<br/>\nAksi takdirde x, uzunluk ve tam sayılarla alt küme oluşturmanın mantıklı olduğu herhangi bir R nesnesi olabilir: Bu işlemler için S3 veya S4 yöntemleri uygun şekilde çağrılacaktır.<br/>\nÖrnekleme için varsayılan boyut, ilk argümandan çıkarılan öğe sayısıdır, böylece sample(x) x'in elemanlarının rastgele bir permütasyonunu (veya 1:x) üretir.<br/>\nBoyut = 0 örnekleri istemek mümkündür, n = 0 veya uzunluğu sıfır olan x ile, ancak aksi takdirde n > 0 veya pozitif length(x) gereklidir.<br/>\nPozitif tam sayı olmayan n veya x değerleri, .Machine$integer.max'tan daha büyük olmamak kaydıyla bir sonraki en küçük tam sayıya kesilecektir.<br/>\nİsteğe bağlı prob argümanı, örnekleme yapılan vektörün elemanlarını elde etmek için ağırlıklar vektörü vermek için kullanılabilir. Toplamları bir olmasına gerek yoktur, ancak negatif olmamalı ve hepsi sıfır olmamalıdır. Eğer replace doğruysa, 200'den fazla makul olasılığa sahip değer olduğunda Walker'ın takas yöntemi (Ripley, 1987) kullanılır: bu, R < 2.2.0'dan gelen sonuçlarla uyumsuz sonuçlar verir.<br/>\nEğer replace yanlışsa, bu olasılıklar sırasıyla uygulanır, yani bir sonraki öğeyi seçme olasılığı, kalan öğeler arasındaki ağırlıklara orantılıdır. Bu durumda sıfırdan büyük ağırlık sayısı en az boyut kadar olmalıdır.<br/>\nsample.int, hem n hem de boyutun tam sayılar olarak sağlanması gereken bir arayüzdür.<br/>\nR 3.0.0'dan itibaren, n, tam sayı türündeki en büyük tam sayıdan daha büyük olabilir, en büyük temsil edilebilir tam sayıya kadar. Sadece uniform örnekleme desteklenmektedir. Büyük tam sayıların uniform örneklemesini sağlamak için iki rastgele sayı kullanılır.<br/>\n<b>Paket</b></br>\nbas\n<b>Yardım</b></br>\nhelp(sample, package=\"base\")\n"
  }
}