{
  "title": "Rastgele Orman",
  "label1": "Rastgele orman, denetimli veya denetimsiz düğümde çalıştırılabilir. Denetimsiz modda çalıştırmak için, bağımlı bir değişken belirtmeyin.",
  "navigation": "Rastgele Orman",
  "modelname": "Model adını girin",
  "dependentvar": "Bağımlı değişken",
  "independentvars": "Bağımsız değişken(ler)",
  "ntree": "Ağaç sayısı",
  "mtry": "mtry",
  "proximity": "Yakınlık:",
  "newds": "Yakınlığı saklamak için veri seti adını belirtin:",
  "predictor": "Tahmin edilen değerleri kaydet:",
  "newcolname": "Tahmin edilen değerler için yeni sütun adını belirtin:",
  "help": {
    "title": "Rastgele Orman",
    "r_help": "help(randomForest,package='randomForest')",
    "body": "\n                <b>Açıklama</b></br>\nrastgeleOrman, sınıflandırma ve regresyon için Breiman'ın rastgele orman algoritmasını (Breiman ve Cutler'ın orijinal Fortran koduna dayanmaktadır) uygular. Ayrıca, veri noktaları arasındaki yakınlıkları değerlendirmek için denetimsiz modda da kullanılabilir.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nrastgeleOrman(x, y=NULL,  ntree=500, önem=FALSE, yakınlık, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nx : Bir veri çerçevesi veya bir tahminci matris, ya da uyacak modelin formülünü tanımlayan bir formül (print yöntemi için, bir rastgeleOrman nesnesi).\n</li>\n<li>\ny: Bir yanıt vektörü. Eğer bir faktörse, sınıflandırma varsayılır, aksi takdirde regresyon varsayılır. Atlandığında, rastgeleOrman denetimsiz modda çalışacaktır.\n</li>\n<li>\nntree : Büyütülecek ağaç sayısı. Her giriş satırının en az birkaç kez tahmin edilmesini sağlamak için bu sayı çok küçük olmamalıdır.\n</li>\n<li>\nönem : Tahmincilerin öneminin değerlendirilmesi gerekir mi? \n</li>\n<li>\nyakınlık : Satırlar arasındaki yakınlık ölçüsü hesaplanmalı mı?\n</li>\n<li>\n... : düşük seviyeli rastgeleOrman.default fonksiyonuna geçirilecek isteğe bağlı parametreler.\n</li>\n</ul>\n<b>Değer</b><br/>\nBir randomForest sınıfı nesnesi, aşağıdaki bileşenlerle bir listedir:<br/>\nçağrı: randomForest'a yapılan orijinal çağrı<br/>\ntip: regresyon, sınıflandırma veya denetimsiz olanlardan biri.<br/>\ntahmin edilen: giriş verilerinin tahmin edilen değerleri, çantadan çıkarılan örnekler temelinde.<br/>\nönem:\ta matris, nclass + 2 (sınıflandırma için) veya iki (regresyon için) sütun. Sınıflandırma için, ilk nclass sütunları, doğrulukta ortalama azalma olarak hesaplanan sınıf spesifik ölçümlerdir. nclass + 1. sütun, tüm sınıflar üzerindeki ortalama azalmadır. Son sütun, Gini indeksindeki ortalama azalmadır. Regresyon için, ilk sütun ortalama azalmadır ve ikinci sütun MSE'deki ortalama azalmadır. Eğer önem=FALSE ise, son ölçüm hala bir vektör olarak döndürülür.<br/>\nönemSD: Permütasyon tabanlı önem ölçüsünün “standart hataları”. Sınıflandırma için, önem matrisinin ilk nclass + 1 sütununa karşılık gelen p'ye nclass + 1 matris. Regresyon için, uzunluk p vektörü.<br/>\nlocalImp: p'ye n matris, durum bazında önem ölçümlerini içerir, [i,j] elemanı i'inci değişkenin j'inci durum üzerindeki önemidir. localImp=FALSE ise NULL.<br/>\nntree: büyütülen ağaç sayısı.<br/>\nmtry: her düğümde bölme için örneklenen tahminci sayısı.<br/>\norman: (tüm ormanı içeren bir liste; rastgeleOrman denetimsiz modda çalıştırıldığında veya keep.forest=FALSE ise NULL.<br/>\nerr.rate: (sınıflandırma sadece) giriş verilerinin tahminindeki hata oranları vektörü, i'inci eleman, i'inci ağaç için (OOB) hata oranıdır.<br/>\nkarmaşa: (sınıflandırma sadece) tahminin karmaşa matrisidir (OOB verilerine dayalı).<br/>\noylar: (sınıflandırma sadece) her giriş veri noktası için bir satır ve her sınıf için bir sütun içeren bir matris, rastgele ormandan (OOB) ‘oyların’ oranını veya sayısını verir.<br/>\noob.times: durumların ‘çanta dışı’ (ve böylece OOB hata tahminini hesaplamak için kullanılan) kaç kez olduğu<br/>\nyakınlık: eğer randomForest çağrıldığında yakınlık=TRUE ise, girişler arasındaki yakınlık ölçülerinin bir matrisidir (veri noktalarının aynı terminal düğümlerinde bulunma sıklığına dayanmaktadır).<br/>\nmse\t: (regresyon sadece) ortalama kare hatalarının vektörü: kareli kalıntıların toplamı n'e bölünmüştür.<br/>\nrsq\t: (regresyon sadece) “pseudo R-kare”: 1 - mse / Var(y).<br/>\ntest: test seti verildiğinde (xtest veya ek olarak ytest argümanları aracılığıyla), bu bileşen, test seti için karşılık gelen tahmin edilen, hata oranı, karmaşa, oylar (sınıflandırma için) veya tahmin edilen, mse ve rsq (regresyon için) içeren bir listeyi içerir. Eğer yakınlık=TRUE ise, ayrıca test seti ile eğitim verileri arasındaki yakınlığı içeren bir bileşen vardır.<br/>\n<b>Paket</b></br>\nrastgeleOrman​;MaviGökyüzü</br>\n<b>Yardım</b></br>\nDetaylı yardım için, bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya R sözdizimi editöründe aşağıdaki komutu çalıştırın</br>\nyardım(rastgeleOrman,paket='rastgeleOrman')\n                "
  }
}