{
  "title": "Güvenilirlik Analizi (Cronbach Alpha)",
  "navigation": "Cronbachs Alpha",
  "tvarbox1": "Tüm Öğeler",
  "tvarbox2": "Ters puanlanan öğeleri yukarıda girin",
  "help": {
    "title": "Cronbach Alpha",
    "r_help": "help(alpha, package=psych)",
    "body": "\n            <b>Güvenilirlik istatistikleri tablosu size şunu verir:</b></br>\n•\tCronbach'ın alpha'sı: Cronbach'ın α'sı (değerler ≥ .7 veya .8 iyi güvenilirlik gösterir; Kline (1999))</br>\n•\tstd.alpha: Korelasyonlara dayanan standartlaştırılmış alpha</br>\n•\tGuttman'ın lambda 6'sı (kare çoklu korelasyondan veya 'smc'den hesaplanmıştır)</br>\n•\taverage_r: ortalama madde korelasyonu (bu std.alpha'yı hesaplamak için kullanılır)</br>\n•\tmean: ölçek ortalaması (tüm bireylerin ortalamalarının ortalaması)</br>\n•\tsd: ölçek standart sapması</br></br>\n<b>Bir öğe çıkarıldığında güvenilirliği nasıl yorumlarsınız?</b></br>\n•\tBu, belirli bir öğe (satırdaki) çıkarıldığında genel Cronbach'ın alpha'sına atıfta bulunur</br>\n•\tHerhangi bir satırın ham Cronbach'ın alpha değerleri, yukarıdaki güvenilirlik istatistikleri tablosundaki genel α'dan büyükse, bu, o belirli öğenin çıkarılmasının ölçeğin genel Cronbach'ın alpha'sını artıracağı anlamına gelir.</br>\n•\tBu tablonun diğer sütunları, o belirli öğe çıkarıldığında diğer istatistiklerin nasıl değişeceğine atıfta bulunur.</br>\n<b>'Öğe istatistikleri' nasıl yorumlanır?</b></br>\n•\traw.r: Her öğenin toplam puanla olan korelasyonu, öğe örtüşmesi için düzeltilmemiştir.</br>\n•\tr.drop: o öğe olmadan madde-toplam korelasyonu (yani, madde-kalan korelasyonu veya düzeltilmiş madde-toplam korelasyonu); düşük madde-toplam korelasyonları, öğenin genel ölçekle iyi bir şekilde korelemediğini gösterir</br>\n•\tr.cor: madde-toplam korelasyonu, madde örtüşmesi ve ölçek güvenilirliği için düzeltilmiştir</br>\n•\tmean ve sd: o öğe çıkarıldığında ölçeğin ortalaması ve sd'si</br>\n•\tTüm öğeler toplam puanla korele olmalıdır, bu nedenle genel ölçekten elde edilen toplam puanla iyi bir şekilde korele etmeyen öğeleri arıyoruz. Eğer r.drop değerleri yaklaşık .3'ten azsa, bu belirli öğenin genel ölçekle çok iyi bir şekilde korele etmediği anlamına gelir.</br></br>\n<b>Son sıklık tablosu nasıl yorumlanır?</b></br>\n•\tBu tablo, her bir öğeye verilen her yanıtın yüzdesini (yani, 5 puanlık bir ölçeğiniz varsa, o zaman 1, 2, 3, 4 veya 5 yanıtlarının ne kadar yüzdesinin olduğunu) bize söyler.</br>\n•\tBu, yanıtların dağılımını kontrol etmenize ve herkesin aynı yanıtları verip vermediğini (bu da düşük güvenilirliğe yol açar) kontrol etmenize yardımcı olur.</br>\nEğer ölçeğiniz ters puanlanan öğeler içeriyorsa, bunları belirtmeniz gerekir. Anahtarlar argümanı bunu yapmanıza olanak tanır.</br> </br> \n\n<b>Açıklama</b></br>\nGüvenilirliğin iki tahminini bulun: Cronbach'ın alpha'sı ve Guttman'ın Lambda 6'sı.</br>\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nalpha(x, keys=NULL,cumulative=FALSE, title=NULL, max=10,na.rm = TRUE,​\n   check.keys=FALSE,n.iter=1,delete=TRUE,use=\"pairwise\",warnings=TRUE,n.obs=NULL)​\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nx​: Bir veri çerçevesi veya veri matrisi, veya bir kovaryans veya korelasyon matrisi​\n</li>\n<li>\nkeys​: Eğer bazı öğeler ters anahtarlıyorsa, o zaman ya tüm öğelerin yönünü belirtin ya da sadece ters çevrilecek öğelerin bir vektörünü belirtin​\n</li>\n<li>\ntitle​: Bu çalışmayı tanımlamak için herhangi bir metin dizesi​\n</li>\n<li>\ncumulative​: ortalamalar öğelerin toplamını mı yoksa öğelerin ortalamasını mı yansıtmalıdır. Varsayılan değer ortalamalardır.​\n</li>\n<li>\nmax​: kategori sıklıklarını raporlarken dikkate alınacak kategori/sayı sayısı. Varsayılan 10'dur, link{response.frequencies}'e geçmiştir.​\n</li>\n<li>\nna.rm​: Varsayılan, eksik değerleri kaldırmak ve çiftler arası korelasyonları bulmaktır​\n</li>\n<li>\ncheck.keys​: eğer TRUE ise, o zaman ilk ana bileşeni bulur ve negatif yüklemeleri olan öğeleri ters anahtarlayın. Eğer bu olursa bir uyarı verin.​\n</li>\n<li>\nn.iter​: Bootstrapped güven aralıkları isteniyorsa yineleme sayısı​\n</li>\n<li>\ndelete​: Varyansı olmayan öğeleri silin ve bir uyarı verin​\n</li>\n<li>\nuse​: cor fonksiyonuna geçilecek seçenekler: \"her şey\", \"tüm.gözlemler\", \"tam.gözlemler\", \"na.ya.da.tamam\", veya \"çiftler.tamam.gözlemler\". Varsayılan \"çiftler\"dir​\n</li>\n<li>\nwarnings​: Varsayılan olarak bir uyarı ve öğelerin ters çevrildiğine dair bir mesaj yazdırır. Eğer warnings = FALSE ise mesajı bastırın​\n</li>\n<li>\nn.obs​: Korelasyon matrislerini girdi olarak kullanıyorsanız, gözlem sayısını belirtirseniz, güven aralıklarını bulabiliriz​\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nAlpha, bir testin iç tutarlılık güvenilirliğinin birkaç tahmininden biridir.​​</br>\n<b>Değer</b><br/>\ntotal​: bir liste içerir​​</br>\nraw_alpha​: kovaryanslara dayanan alpha​​</br>\nstd.alpha​: Korelasyonlara dayanan standartlaştırılmış alpha​​</br>\nG6(smc)​: Guttman'ın Lambda 6 güvenilirliği​​</br>\naverage_r​: Ortalama madde korelasyonu​​</br>\nmean​: Veri matrisleri için, öğelerin toplamı ile oluşturulan ölçeğin ortalaması​​</br>\nsd​: Veri matrisleri için, toplam puanın standart sapması​​</br>\nalpha.drop​: Her öğenin birer birer çıkarılması durumunda yukarıdakilerin tümü için bir veri çerçevesi.​​</br>\nitem.stats​: Aşağıdakileri içeren bir veri çerçevesi​​</br>\nn​: öğe için tamamlanan durumların sayısı​​</br>\nraw.r​: Her öğenin toplam puanla olan korelasyonu, madde örtüşmesi için düzeltilmemiştir.​​</br>\nstd.r​: Tüm öğeler standartlaştırılmışsa, her öğenin toplam puanla olan korelasyonu (madde örtüşmesi için düzeltilmemiştir)​​</br>\nr.cor​: Madde bütün korelasyonu, madde örtüşmesi ve ölçek güvenilirliği için düzeltilmiştir​​</br>\nr.drop​: Bu öğenin, bu öğe olmadan ölçekle olan korelasyonu​​</br>\nmean​: Veri matrisleri için, her öğenin ortalaması​​</br>\nsd​: Veri matrisleri için, her öğenin standart sapması​​</br>\nresponse.freq​: Veri matrisleri için, her öğe yanıtının sıklığı (20'den azsa)​​</br>\nboot​: bootstrapped yeniden örneklenmiş değerlerin 6 sütunlu bir n.iter matrisidir​​</br>\nUnidim​: Tek boyutluluğun bir indeksi​​</br>\nFit​: Off diagonal matrisin uyumu​​</br>\n<b>Paket</b></br>\npsych</br>\n<b>Yardım</b></br>\nDetaylı yardım için, bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya aşağıdaki komutu çalıştırarak help(alpha, package=psych) yazın ve çıktı penceresinde + tıklayarak bir R kodu bloğu oluşturun.\n\n\t\t\t"
  }
}