{
  "helpText": "Tekrar ölçümler ANOVA'sı, verilerin uzun formatta olmasını gerektirir. Verileriniz uzun formatta değilse, Datasets > ReShape > Daha Uzun'a bakın.",
  "repMeasuresConfig": "Yapılandırma",
  "modelname": "Model adını girin",
  "title": "Tekrar Ölçümler ANOVA - Geniş",
  "subjectID": "İsteğe bağlı olarak bir denek tanımlayıcı olarak kullanılacak bir değişken belirtin",
  "dependentVariable": "Bağımlı değişken",
  "navigation": "ANOVA, Tekrar Ölçümler, Geniş",
  "response": "İçinde denek değişken(leri) örneğin Zaman",
  "Fixed": "Denekler arası faktör",
  "covariates": "Kovaryatlar",
  "Summary": "Tahmin edilen marjinal ortalamalar",
  "Scatter_plot": "Posthoclar",
  "Residual": "Artık vs. Uygun plot",
  "Histogram": "Artıkların histogram grafiği",
  "brownForsythe": "Brown-Forsythe testi",
  "levenesTest": "Levene testi",
  "plotMeansCI": "Ortalama ve güven aralıklarının grafiği",
  "simpleEffectsTest": "Basit etkiler testi",
  "label2": "Posthoclar ve basit etkiler testi için seçenekler",
  "combon": "Ortalama Karşılaştırması kullanarak:",
  "adjust": "p-değerlerini ayarlama yöntemi",
  "displayBoxMDetails": "Box'ın M testine ilişkin detayları göster (Not: Box'ın M testinin sonuçları her zaman gösterilir)",
  "help": {
    "title": "Tekrar Ölçümler ANOVA",
    "r_help": "help(aov_ez , package='afex')",
    "body": "\n<b>Açıklama</b></br>\nNOT:<br/>\n1. Geniş bir veri kümesinde tekrar ölçümler ANOVA'sı çalıştırırken verileri yeniden şekillendirmemiz gerekiyor.<br/>\n2. Tek bir değişken için birden fazla tekrar ölçümünü destekliyoruz, örneğin, Kan Şekeri ön test, son test ve takip ziyareti sırasında ölçülür.<br/>\n3. Tekrar eden bir faktör adı belirtmeniz gerekiyor, örneğin, Kan Şekeri ve seviye sayısını. Tekrar ölçümleri içeren değişkenlerin adlarından oluşturulan seviyelerle birlikte Kan Şekeri adında bir faktör değişkeni oluşturacağız, örneğin, faktörün seviyeleri ön test, son test ve takip olacaktır.<br/>\n4. Bir ölçüm adı belirtmeniz gerekiyor, örneğin, Değer. Her bir denek için ön test, son test ve takip için tüm Kan Şekeri değerleri ile birlikte bir değişken oluşturacağız, örneğin, Değer.<br/>\n5. Tek bir denekler arası ve içinde denek faktör değişkenini destekliyoruz.<br/>\n6. Gelecek sürümler birden fazla ölçümü ve birden fazla denekler arası ve içinde denek faktör değişkenini destekleyecektir.<br/>\n7. Varsayılan olarak, veri kümesinin her satırı benzersiz bir deneğe karşılık gelir, ayrıca denek kimliği için bir değişken belirtebilirsiniz.</br>\n<br/>\nTekrar ölçümler ANOVA'sında F istatistikleri, her bir içinde denek faktörü, denekler arası faktör ve karışık ANOVA için etkileşim terimi için hesaplanır.</br>\nÇıktıda MSE (hata için ortalama kare toplamı) ve pes (kısmi eta kare) değerlerini gösteren ek ANOVA değerleri tablolarını arayın.</br>\nŞu anda tek bir içinde denek ve denekler arası faktörü destekliyoruz, denekler arası faktör isteğe bağlıdır.</br>\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \naov_ez(data = dataset1, dv = \"dependentVariable\", \n\tid = \"Identifier\", within = c(\"Time\"), \tbetween = c(\"Treatment\"),  \n\tanova_table = list(es = \"pes\"))\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ndata: Verileri içeren bir data.frame. Zorunlu\n</li>\n<li>\ndv: verilerde bağımlı değişkeni içeren sütunu belirten karakter vektörü (uzunluk 1).\n</li>\n<li>\nbetween: verilerdeki denekler arası faktör(ler)/sütun(lar)ı belirten karakter vektörü. Varsayılan NULL, denekler arası faktör yok demektir.\n</li>\n<li>\nwithin: verilerdeki içinde denek(ler) (veya tekrar ölçüm) faktör(ler)/sütun(lar)ı belirten karakter vektörü. Varsayılan NULL, içinde denek faktörü yok demektir.\n</li>\n<li>\ncovariate: verilerdeki denekler arası kovaryat(lar)ı (yani, sütun(lar)) belirten karakter vektörü. Varsayılan NULL, kovaryat yok demektir. Lütfen, kovaryat sayısal ise ve bu şekilde işlenmesi gerekiyorsa, factorize'nin FALSE olarak ayarlanması gerektiğini unutmayın.\n</li>\n<li>\nanovatable: ANOVA tablosunu üreten fonksiyona iletilen daha fazla argümanların listesi.\n</li>\n</ul>\n<br/>\n<b>Ayrıntılar</b></br>\nDetaylı R yardımına bakın</br>\n<b>Değer</b><br/>\naov_car, aov_4 ve aov_ez, Anova ve aov için sarmalayıcılardır, dönen değer return argümanına bağlıdır. Varsayılan olarak, \"afex_aov\" sınıfına ait bir S3 nesnesi döndürülür ve aşağıdaki slotları içerir:<br/>\n\"anova_table\": c(\"anova\", \"data.frame\") sınıfına ait bir ANOVA tablosu.<br/>\n\"aov\": aov'den dönen aov nesnesi (etkilerin önemini değerlendirmek için kullanılmamalıdır, ancak post-hoc testler için emmeans'e iletilebilir).<br/>\n\"Anova\": Anova'dan dönen nesne, içinde denek faktörleri varsa \"Anova.mlm\" sınıfına ait bir nesne veya c(\"anova\", \"data.frame\") sınıfına ait bir nesnedir.<br/>\n\"lm\": lm ile uyumlu hale getirilen nesne ve Anova'ya iletilen nesne (yani, \"lm\" veya \"mlm\" sınıfına ait bir nesne). Ayrıca return = \"lm\" ise döndürülür.<br/>\n\"data\": aşağıdakileri içeren bir liste: (1) uzun (aov için kullanılan uzun formatta muhtemelen toplanmış veri), geniş (lm nesnesini uyumlu hale getirmek için kullanılan veri) ve idata (içinde denek faktörleri varsa, car::Anova'ya iletilen idata argümanı). Ayrıca return = \"data\" ise döndürülür.<br/>\n<b>Paket</b></br>\nafex</br>\n<b>Yardım</b></br>\nhelp(aov_ez, package ='afex')\nDetaylı R yardımını almak için R Yardım butonuna tıklayın. Ayrıca help(aov_ez, package ='afex') yazarak R sözdizimi editöründe CTRL Enter tuşuna basarak yardım alabilirsiniz."
  }
}