{
  "title": "Yeniden Şekillendir, genişten uzun",
  "label2": "Yeniden şekillendirmek için değişkenleri seçin veya alternatif olarak yeniden şekillendirmeyecek değişkenleri seçin. İkinci durumda, kalan tüm değişkenler sütun(lar) haline getirilecektir.",
  "navigation": "Daha Uzun",
  "label0": "Sonuçları yeni bir veri kümesine kaydetmeyi veya mevcut veri kümesini üzerine yazmayı seçebilirsiniz.",
  "label1": "Seçenekler",
  "advanced": "Gelişmiş",
  "New": "Sonuçları yeni bir veri kümesine kaydet",
  "newdatasetname": "Bir veri kümesi adı girin",
  "Existing": "Mevcut veri kümesini üzerine yaz",
  "label12": "Yeni tekrarlanan faktör değişkeni(leri) için değişken adı(ları) girin",
  "repeatedMeasure": "NOT: Tekrarlanan faktörleri depolayan birden fazla değişken adı belirtirken, bunları virgülle ayırın, örneğin Ay, Gün. Ayrıca, değişken adlarının nasıl oluşturulacağını belirtmek için gelişmiş seçeneğine tıklamanız gerekir.",
  "repeatedValue": "Tekrarlanan değer için değişken adı, örneğin Sayım",
  "labelChoice": "Aşağıdaki seçeneklerden birini seçin",
  "subsetvars": "Seçenek1: Bir veya daha fazla değişkeni yeniden şekillendirmek için değişken(ler)i seçin",
  "names_sep": "Seçenek2: Değişken adları oluşturmak için sütun adlarını ayırmak üzere bir karakter veya düzenli ifade belirtin. separate() ile aynı tanımı alır ve ya bir sayısal vektör (bölünecek pozisyonları belirtir) ya da bir dize (bölünecek bir düzenli ifade belirtir) olabilir.",
  "names_pattern": "Seçenek1: Eşleşen grupları (()) içeren bir düzenli ifade. () arasındaki düzenli ifadenin eşleşen kısmı, değişken adlarını oluşturmak için kullanılacaktır.",
  "dontReshape": "Seçenek2: Yeniden şekillendirmeyecek değişken(ler)i seçin (kalan tüm değişkenler sütun(lar) haline getirilecektir.)",
  "removeNA": "Tekrarlanan değeri NA olan satırları kaldır.",
  "makeString": "Tekrarlanan faktörü bir faktör yerine R dize türü yap",
  "label3": "Tekrarlanan faktörler için birden fazla yeni değişken oluşturulursa, aşağıdaki seçenekler sütun adlarının nasıl bölüneceğini kontrol eder. Aşağıdaki 2 seçenekten birini seçin.",
  "help": {
    "title": "Yeniden Şekillendir (genişten uzun)",
    "r_help": "help(pivot_longer, package=tidyr)",
    "body": "\n<b>Açıklama</b></br>\n<a href=\" https://youtu.be/ypLXqmFp3jY\">Genişten uzun şekillendirme</a> videosuna bakın</br>\nGeniş bir veri kümesini alır ve sütunları anahtar-değer çiftlerine dönüştürerek uzun bir veri kümesine dönüştürür.\nPivot_longer, birden fazla sütunu alır ve anahtar-değer çiftlerine çökertir, gerektiğinde diğer tüm sütunları çoğaltır. Değişken olmayan sütunlarınız olduğunu fark ettiğinizde pivot_longer() kullanırsınız.</br>\nR editöründe vignette(\"pivot\") yazın ve R yardımını görün. Birden fazla sütun oluşturulacaksa, sütun adlarının nasıl oluşturulacağını belirtmek için argümanlar belirtmeniz gerekir.</br>\nBu durumda, değişkenlerin sütun adlarından nasıl oluşturulacağını belirtmek için bir düzenli ifade girmek için gelişmiş seçeneğine tıklayın.</br>\nNOT: Tekrarlanan faktörler için birden fazla değişken belirtirken, bunları virgülle ayırın,\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \npivot_longer( cols=c(col1, col2...),names_to=\"anahtar\",values_to=\"değer\",values_drop_na = TRUE)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ncols: Daha uzun formata dönüştürülecek sütunlar.\n</li>\n<li>\nvalues_to: Hücre değerlerinde depolanan verilerden oluşturulacak sütunun adını belirten bir dize. Eğer names_to, özel .value işaretini içeren bir karakterse, bu değer göz ardı edilecektir ve değer sütununun adı mevcut sütun adlarının bir kısmından türetilir. Boşsa, tüm değişkenler seçilir, bir değişkeni -y ile hariç tutabilirsiniz. Değişkenleri hariç tutarken, kalan tüm değişkenler uzun formata dönüştürülür.\n</li>\n<li>\nvalues_drop_na: Eğer TRUE ise, değer_to sütununda yalnızca NA içeren satırları kaldırır. Bu, açıkça kaybolan değerleri örtük kaybolan değerlere dönüştürür ve genellikle yalnızca verilerde kaybolan değerlerin yapısı tarafından oluşturulduğunda kullanılmalıdır.\n</li>\n<li>\nnames_sep: separate() ile aynı tanımı alır ve ya bir sayısal vektör (bölünecek pozisyonları belirtir) ya da bir dize (bölünecek bir düzenli ifade belirtir) olabilir.</br>\nDiyelim ki sütunlar Height_1_1, Height_1_2, Weight_1_1, Weight_1_2, Sagur_1_1, Sagur_2_1, burada 1. sayı ayı ve 2. sayı haftayı belirtir, _ ayırıcı olarak belirtmek 3 değişkenin oluşturulmasına neden olacaktır, ilk değişkenin değerleri Height, Weight, Sagur, ikincisi 1 ve 2, üçüncüsü 1 ve 2 olacaktır.</br>\nDaha fazla ayrıntı için R kod editöründe help(regex) yazın\n</li>\n<li>\nnames_pattern: extract() ile aynı tanımı alır, eşleşen grupları (()) içeren bir düzenli ifade. separate() ile aynı tanımı alır ve ya bir sayısal vektör (bölünecek pozisyonları belirtir) ya da bir dize (bölünecek bir düzenli ifade belirtir) olabilir.</br>\nDiyelim ki sütunlar Height_33.1_1, Height_44.1_2, Weight_66.1_1, Weight_55.1_2, burada 1. alt çizgi sonrası 2 rakamı göz ardı edilecektir, . sonrası rakam ayı ve son _ sonrası rakam haftayı belirtir.</br>\nYeni değişkenlerin değerlerini çıkarmak için düzenli ifadeler () içinde olmalıdır. Düzenli ifade (.*)_.*.(.*) olacaktır.</br> \nNot: Düzenli ifadede . herhangi bir karakteri ifade eder.</br> \n* 0 veya daha fazlasını ifade eder, bu nedenle .* 0 veya daha fazla karakteri ifade eder.</br> \nBu nedenle dize, aşağıdaki kalıbı aramak için yorumlanabilir:</br> \n(.*) 0 veya daha fazla karakter ardından</br> \n _ bir alt çizgi ardından</br> \n .*. bir veya daha fazla karakter ardından . (düzenli ifadede .'yi kaçırarak, karakterin kendisi olduğunu belirtir) ardından</br> \n.* bir veya daha fazla karakter ardından</br> \n_ bir alt çizgi ardından</br> \n. bir tek karakter ardından</br> \n() içindeki tüm kalıplar, her bir 3 yeni faktör değişkeninin değerlerini oluşturur.</br> \n</li>\n</ul>\n<b>Değer</b><br/>\nYeniden şekillendirilmiş veri kümesini döndürür\n<br/>\n<b>Paket</b></br>\ntidyr</br>\n<b>Yardım</b></br>\nhelp(pivot_longer, package=tidyr)<br/>\nvignette(\"pivot\")\n"
  }
}