{
  "title": "Risk Set Eşleştirme",
  "navigation": "Risk Set Eşleştirme",
  "newdatasetnamelabel": "Eşleştirilmiş verileri saklamak için veri seti adı",
  "groupvarlabel": "Olay değişkeni (1=olay, 0=sansür)",
  "timevarlabel": "Zaman değişkeni",
  "calipervarslabel": "Eşleştirme için değişkenler (sayısal)",
  "caliperslabel": "Eşleştirme değişkenlerinin virgülle ayrılmış sırasına göre kaliperleri belirtin, örneğin 5, 2; tam eşleşmeler için 0 belirtin",
  "ratiolabel": "Her vaka için kontrol sayısı",
  "repeatcontrolslabel": "Kontrollerin birden fazla kez eşleştirilmesine izin ver",
  "supercontrolslabel": "Vakıaların diğer vakalarla eşleştirilmesine izin verme",
  "help": {
    "title": "Risk Set Eşleştirme",
    "body": "\n            Bir kohort içinde risk seti özne eşleştirmesi gerçekleştirir. Olayı olanlar (vakalar), olay yaşamamış olanlarla (kontroller) eşleştirilir ve vaka olay zamanında risk setinde bulunurlar. Bu, iç içe geçmiş bir vaka/kontrol tasarımıdır. Kohort girişinde bilinen temel değişkenler de vakaları ve kontrolleri eşleştirmek için kullanılır.\n\t\t\t<br/><br/>\n\t\t\tTam olarak eşleşmesi gereken temel değişkenler ve sayısal kaliperler içinde eşleşen değerler desteklenmektedir. Kontroller, her vaka için uygun tüm kontroller arasından rastgele seçilir.\n\t\t\t<br/><br/>\n\t\t\tEşleştirilmiş verileri içeren çıktı veri seti, orijinal değişkenleri, olay göstergesini (\"başarısız\") ve eşleştirilmiş seti tanımlayan bir değişkeni (\"eşleşme.num\") içerecektir.\n\t\t\t<br/><br/>\n\t\t\tEşleştirme sürecinde yer alan değişkenler için herhangi bir eksik değere sahip gözlemler, eşleştirmeden önce kaldırılır.\n\t\t\t<br/><br/>\n\t\t\tİç içe geçmiş vaka/kontrol tasarımlarına kısa bir giriş için şuraya bakabilirsiniz:\n\t\t\tEssebag V, ve diğerleri. Kardiyolojide iç içe geçmiş vaka-kontrol çalışması. Am Heart J 2003;146:581–90.\n\t\t\t<br/><br/>\n\t\t\t<b>Eşleştirilmiş verileri saklamak için veri seti adı:</b>\n\t\t\t<br/>Eşleştirilmiş özne setlerini içeren çıktı veri setinin adı.\n\t\t\t<br/><br/>\n\t\t\t<b>Olay değişkeni (1=olay, 0=sansür):</b>\n\t\t\t<br/>Olayları gösteren değişkenin adı. 1=olay ve 0=sansür ile sayısal olmalıdır.\n\t\t\t</br><br/>\n\t\t\t<b>Eşleştirme için değişkenler:</b>\n\t\t\t<br/>Vaka/kontrol setlerinin eşleştirilmesini istediğiniz temel değişkenleri belirtin. Bunlar sayısal olmalıdır.\n\t\t\t<br/><br/>\n\t\t\t<b>Eşleştirme değişkenlerinin sırasına göre kaliperleri belirtin:</b>\n\t\t\t<br/>Her bir değişken için sayısal kaliper değerlerini belirtin, değişkenlerin sırasına göre. Tam eşleşmeler için 0 kaliper kullanılmalıdır. \n\t\t\tÖrneğin, yaş (yıl cinsinden) 5 kaliper ile belirtilirse, bu, kontrollerin eşleştirilen vakalarının +/- 5 yıl içinde olması gerektiği anlamına gelir.\n\t\t\tHer eşleştirme değişkeninin bir kaliper değeri belirtilmelidir.\n\t\t\t<br/><br/>\n\t\t\t<b>Her vaka için kontrol sayısı:</b>\n\t\t\t<br/>Bu, her vaka için eşleştirilecek maksimum kontrol sayısıdır. Uygun eşleşmeler bulunamazsa, bazı eşleştirilmiş setler bu değerden daha az olabilir.\n            <br/><br/>\n\t\t\t<b>Kontrollerin birden fazla kez eşleştirilmesine izin ver:</b>\n\t\t\t<br/>Kontrollerin birden fazla vaka ile eşleştirilip eşleştirilmeyeceğini belirtin. Biası önlemek için bu seçeneğin seçilmesini öneriyoruz.\n            <br/><br/>\n\t\t\t<b>Vakıaların diğer vakalarla eşleştirilmesine izin verme:</b>\n\t\t\t<br/>Vakıaların olay zamanından önce kontroller olarak değerlendirilmesine izin verilip verilmeyeceğini belirtin. Biası önlemek için bu seçeneğin seçilmemesini öneriyoruz. Bu seçeneğin seçilmemesi, bir vakanın kontrol risk seti havuzunda olduğu ve olay zamanına kadar başka bir vaka ile eşleştirilebileceği anlamına gelir.\n            <br/><br/>\n            <b>Gerekli R paketleri:</b> dplyr, tidyr\n"
  }
}