{
  "title": "Tahmin Edilen parametrik hayatta kalma olasılıkları",
  "label100": "Bu diyalog, bir veya daha fazla belirtilen zamanda tahmin edilen hayatta kalma olasılığını çıktılar. Aşağıdaki gereklilikler yerine getirilmelidir.\n1. 1 veya daha yüksek değer = olay, 0 veya daha düşük değer = sansür olan bir veri kümesi üzerinde bir flexsurvreg parametrik hayatta kalma regresyon modeli oluşturmuş olmalısınız.\n2. Tahminler oluşturmak istediğiniz veri kümesi, orijinal modeli oluşturmak için kullanılan tüm bağımsız değişkenlere sahip olmalıdır.\n3. Zaman için kullanılan zaman ölçeği, orijinal modeli oluşturmak için kullanılan zaman ölçeği ile eşleşmelidir.\n4. Tek bir gözlem için tahminler istiyorsanız, o tek gözlemle yeni bir veri kümesi oluşturmalısınız.",
  "navigation": "parametrik hayatta kalma puanlama",
  "filterModels": "Modelleri sınıfa göre filtrele",
  "modelSelection": "Bir veri kümesini puanlamak için bir model seçin",
  "label1": "Tanısal testler",
  "followUpTime": "Bir veya daha fazla zaman belirtin, örneğin 200, 1200, 1250, her zaman için tahmin edilen hayatta kalma ve başarısızlık olasılıkları oluşturulacaktır",
  "levelOfInterest": "Tahmin edilecek değişkenin 2 seviyesi olduğunda, ilgi seviyesini belirtin. Karışıklık matrisi ve ilgili istatistikler, belirtilen ilgi seviyesi referans olarak görüntülenir",
  "label12": "Test sonuçları: Bir model seçildiği anda, modelde belirtilen bağımlı değişkenlerin puanlanacak veri kümesinde mevcut olup olmadığını görmek için testler yapacağız. Sonuçlar burada görüntülenecektir",
  "label2": "Hayatta kalma ve başarısızlık olasılıklarını kaydedin.",
  "label3": "Tahmin edilen olasılıklar yeni değişkenler olarak (belirtilmişse ön ek ile) saklanır",
  "label4": "**2 seviyeli bağımlı değişkenler için, 2. seviye pozitif seviye olarak kabul edilir. Faktör seviyelerini değiştirmek ve modeli yeniden oluşturmak için Veri > Faktör Seviyeleri > Seviyeleri Manuel Olarak Yeniden Sırala'ya bakın.",
  "conflevel": "Bireysel tahmin edilen değerler için güven aralıklarını kaydedin **(Sadece doğrusal modeller (sınıf lm) için geçerlidir)",
  "roctable": "ROC tablosunu göster (**Sadece ikili bağımlı değişkenler için)",
  "colname": "Sütun adı ön ekini belirtin",
  "label5": "**Yukarıdaki onay kutusunu işaretlemek, büyük veri kümeleri için bir performans cezası doğuracaktır.",
  "level": "Güven seviyesini belirtin",
  "confusioncheck": "Karışıklık Matrisi Oluştur",
  "help": {
    "title": "Bir flexsurvreg (parametrik hayatta kalma) Modeli Kullanarak Bir Veri Kümesini Puanlama",
    "r_help": "help(flexsurvreg, package = 'flexsurv')",
    "body": "\n    BİRKAÇ ZAMAN DİLİ BELİRTİLDİĞİNDE, YALNIZCA İLK ZAMAN DİLİ İÇİN BİR KARŞIKLIK MATRİSİ VE ROC EĞRİSİ ÜRETİLİR\n    <b>Açıklama</b></br>\n    Model puanlama şunları yapar</br>\n    1. Seçilen önceden oluşturulmuş modeli kullanarak mevcut veri kümesini puanlar. Tahminleri belirtilen ön ek ile mevcut veri kümesine belirtilen güven aralığı ile saklar.</br>\n    2. İsteğe bağlı olarak bir karışıklık matrisi ve bir ROC eğrisi oluşturur</br>\n    3. Bağımlı değişkenin/öngörülecek değişkenin bulunduğu bir eğitim veri kümesini puanladığınızda ve bağımlı değişkenin 2 seviyesi olduğunda, referans seviyesi/ilgi seviyesini seçme seçeneğiniz vardır.<br/>\n    4. Karışıklık matrisi ve ilgili istatistikler belirtilen ilgi seviyesi kullanılarak oluşturulur.<br/>\n    Tahmin fonksiyonu ve karışıklık matrisi hakkında daha fazla bilgi için aşağıya bakın\n    <br/>\n    <br/>\n    <b>Açıklama</b></br>\n    predict, seçilen model kullanılarak tahminler yapmak için genel bir işlevdir. \n    <br/>\n    <b>Kullanım</b>\n    <br/>\n    <code> \n    BSkyPredict(modelname, prefix, datasetname)\n    </code> <br/>\n    <b>Argümanlar</b><br/>\n    <ul>\n    <li>\n    modelname: tahmin edilmek istenen bir model nesnesi.\n    </li>\n    <li>\n    prefix: tahminleri içeren yeni değişkenler oluşturmak için kullanılacak ön ek dizesi.\n    </li>\n    <li>\n    datasetname: puanlamak ve tahminleri kaydetmek için mevcut veri kümesidir.\n    </li>\n    </ul>\n    <b>Ayrıntılar</b></br>\n    Belirtilen güven aralığı ile mevcut veri kümesinde tahminleri belirtilen ön ek ile saklar.</br>\n    <b>Paket</b></br>\n    stats</br>\n    <b>Yardım</b></br>\n    Ayrıntılı yardım için, bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya R editör penceresinde aşağıdaki komutu çalıştırın help(predict, package ='stats')\n    </br>\n    </br>\n    <b>Açıklama</b></br>\n    Gözlemlenen ve tahmin edilen sınıfları çapraz tablo oluşturarak bir karışıklık matrisi oluşturur. \n    <br/>\n    <b>Kullanım</b>\n    <br/>\n    <code> \n    BSkyConfusionMartix(modelname,showCofusionMatrix,predictions,datasetname)\n    </code> <br/>\n    <b>Argümanlar</b><br/>\n    <ul>\n    <li>\n    modelname : karışıklık matrisinin istenildiği bir model nesnesi.\n    </li>\n    <li>\n    showCofusionMatrix: mantıksal, eğer DOĞRU ise karışıklık matrisi oluşturulur (uygulanıyorsa), eğer YANLIŞ ise karışıklık matrisi oluşturulmaz.\n    </li>\n    <li>\n    predictions : predict() çağrısının sonucu olarak döndürülen bir nesne.\n    </li>\n    <li>\n    datasetname: tahmin yapmak istediğimiz mevcut veri kümesidir.\n    </li>\n    </ul>\n    <b>Ayrıntılar</b></br>\n    caret paketindeki confusionMatrix fonksiyonunu kullanarak karışıklık matrisini görüntüler</br>\n    <b>Paket</b></br>\n    caret</br>\n    <b>Yardım</b></br>\n    Ayrıntılı yardım için, bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya R editör penceresinde aşağıdaki komutu çalıştırın help(confusionMatrix, package ='caret')\n                "
  }
}