{
  "title": "Basit Rasch Modeli",
  "navigation": "Basit Rasch Modeli",
  "modelname": "Model adını girin",
  "destinationvars": "Hedef değişken(ler)",
  "estimationlbl": "Tahmin",
  "rad1": "CML tahminini kullan",
  "chk1": "Standart hata hesapla",
  "chk2": "Parametreleri toplam (0) olacak şekilde normalize et",
  "rad2": "MML tahminini kullan",
  "help": {
    "title": "Basit Rasch Modeli",
    "r_help": "help(RM, package='eRm')",
    "body": "\n            <b>Açıklama</b>\n            <br/>\n            CML veya MML tahmini kullanarak Basit Rasch modeli oluşturur.\n            <br/><br/>\n            CML tahmini için, ikili madde yanıtları için bir Rasch modelinin parametre tahminlerini hesaplamak üzere eRm::RM fonksiyonunu çağırıyoruz.\n            <br/><br/>\n            MML tahmini için, tek boyutlu bir modelin parametre tahminlerini oluşturmak üzere TAM::tam.mml fonksiyonunu çağırıyoruz.\n            <br/><br/>\n            <b>CML tahmini için kullanım</b>\n            <br/>\n            <code>\n            eRm::RM(X, se = TRUE, sum0 = TRUE, etaStart) \n            </code>\n            <br/><br/>\n            <b>Argümanlar</b>\n            <br/>          \n            <ul>\n            <li>\n            X:  Girdi 0/1 veri matrisi veya veri çerçevesi; satırlar bireyleri, sütunlar maddeleri temsil eder. Eksik değerler NA olarak eklenir.\n            </li>\n            <li>\n            W:  Rasch modeli için tasarım matrisi. Atlandığında, fonksiyon W'yi otomatik olarak hesaplayacaktır.\n            </li>\n            <li>\n            se: Eğer TRUE ise, standart hatalar hesaplanır.\n            </li>\n            <li>\n            sum0: Eğer TRUE ise, parametreler uygun bir W belirterek toplam-0 olacak şekilde normlanır. Eğer FALSE ise, ilk parametre 0'a kısıtlanır.\n            </li>\n            <li>\n            etaStart: Eta parametreleri için başlangıç değerleri vektörü belirtilebilir. Atlandığında, 0 vektörü kullanılır.\n            </li>\n            </ul>\n            <br/><br/><br/>\n            <b>MML tahmini için kullanım</b>\n            <br/>\n            <code>\n            tam.mml(resp,verbose=FALSE )\n            </code>\n            <br/><br/>\n            <b>Argümanlar</b>\n            <br/>             \n            <ul>\n            <li>\n            resp: Polytomous madde yanıtları içeren veri çerçevesi k=0,...,K. Eksik yanıtlar NA olarak belirtilmelidir.\n            </li>\n            <li>\n            irtmodel: Sabit madde eğimleri için (tam.mml'de) PCM (kısmi kredi modeli), PCM2 (ConQuest parametrizasyonu 'madde+madde*adım' ile kısmi kredi modeli) ve RSM (derecelendirme ölçeği modeli; ConQuest parametrizasyonu 'madde+adım') seçenekleri mevcuttur.\n            <br/>\n            Tahmin edilen madde eğimleri için (sadece tam.mml.2pl'de mevcut) seçenekler 2PL (tüm madde kategorilerinin eğimleri tahmin edilir; Nominal Madde Yanıt Modeli), GPCM (her madde için bir ve yalnızca bir eğim parametresi olan genel kısmi kredi modeli) ve 2PL.gruplar (madde alt grupları aynı madde eğimi tahminlerini alır) ve genel kısmi kredi modelinde (GPCM.design, Örnekler için bakınız) madde eğimleri üzerinde bir tasarım matrisi E. Ancak, madde eğimleri, tam.mml.mfr fonksiyonu kullanılarak yüzeysel tasarımlarla tahmin edilemez. Ancak, önceden belirlenmiş tasarım matrislerini kullanmak ve tam.mml.2pl'e bazı kısıtlamalar uygulamak kolaydır.\n            </li>\n            <li>\n            verbose: İterasyonlar sırasında çıktının yazdırılıp yazdırılmayacağını belirten mantıksal bir değer.\n            </li>\n            </ul>\n            <br/><br/>\n            <b>Paketler</b>\n            <br/>\n            TAM, eRm\n            <br/><br/>            \n            <b>Yardım</b>\n            <br/>\n            help(RM, package='eRm')\n            <br/>\n            help(tam.mml, package='TAM')\n"
  }
}