{
  "title": "Katmanlı Bölme",
  "navigation": "Katmanlı Bölme",
  "traindataset": "Eğitim veri kümesinin adını girin",
  "testdataset": "Test veri kümesinin adını girin",
  "split": "Bölme yüzdesini girin",
  "seed": "Tohum ayarla",
  "dependent": "Katmanlı örnekler oluşturmak için değişken",
  "help": {
    "title": "Katmanlı Bölme",
    "r_help": "help(createDataPartition, package=\"caret\")",
    "body": "\n<b>Açıklama</b></br>\ncreateDataPartition kullanılarak bir dizi test/eğitim bölmesi oluşturulur, createResample bir veya daha fazla bootstrap örneği oluşturur. createFolds verileri k gruba bölerken, createTimeSlices zaman serisi verileri için çapraz doğrulama bölmesi oluşturur. groupKFold verileri bir gruplama faktörüne göre böler.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \ncreateDataPartition(y, times = 1, p = 0.5, list = TRUE, groups = min(5,length(y)))<br/>\ncreateFolds(y, k = 10, list = TRUE, returnTrain = FALSE)<br/>\ncreateTimeSlices(y, initialWindow, horizon = 1, fixedWindow = TRUE,skip = 0)<br/>\ngroupKFold(group, k = length(unique(group)))<br/>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\ny: sonuçların bir vektörü. createTimeSlices için, bunlar kronolojik sırada olmalıdır.\n</li>\n<li>\ntimes: oluşturulacak bölme sayısı\n</li>\n<li>\np: eğitime gidecek veri yüzdesi\n</li>\n<li>\nlist: mantıksal - sonuçlar bir listede (TRUE) mi yoksa satır sayısı floor(p * length(y)) olan bir matris mi olmalı ve times sütunları.\n</li>\n<li>\ngroups: sayısal y için, kuantillerdeki kırılma sayısı (aşağıya bakınız)\n</li>\n<li>\nk: katman sayısı için bir tamsayı.\n</li>\n<li>\nreturnTrain: mantıksal. Doğru olduğunda, döndürülen değerler eğitim sırasında kullanılan verilere karşılık gelen örnek pozisyonlarıdır. Bu argüman yalnızca list = TRUE ile birlikte çalışır.\n</li>\n<li>\ninitialWindow: Her eğitim seti örneğindeki ardışık değerlerin başlangıç sayısı\n</li>\n<li>\nhorizon: test seti örneğindeki ardışık değerlerin sayısı\n</li>\n<li>\nfixedWindow: mantıksal, eğer FALSE ise, tüm eğitim örnekleri 1'den başlar\n</li>\n<li>\nskip: tamsayı, toplam miktarı inceltmek için kaç (varsa) yeniden örneklemenin atlanacağı\n</li>\n<li>\ngroup: genel veri setindeki satır sayısına eşit uzunlukta bir grup vektörü.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nBootstrap örnekleri için, basit rastgele örnekleme kullanılır.\nDiğer veri bölme işlemleri için, y bir faktör olduğunda, bölmeler içindeki sınıf dağılımlarını dengelemek amacıyla y'nin seviyeleri içinde rastgele örnekleme yapılır.</br>\nSayısal y için, örnek yüzdeler temelinde gruplara bölünür ve bu alt gruplar içinde örnekleme yapılır. createDataPartition için, yüzdelerin sayısı groups argümanı ile ayarlanır. createFolds ve createMultiFolds için, grup sayısı örnek boyutuna ve k'ya göre dinamik olarak ayarlanır. Daha küçük örnek boyutları için, bu iki işlev katmanlı bölme yapmayabilir ve en fazla verileri dördüncülere böler.</br>\nAyrıca, createDataPartition için, çok küçük sınıf boyutlarında (<= 3) sınıflar hem eğitim hem de test verilerinde görünmeyebilir.</br>\nBirden fazla k-katlı çapraz doğrulama için, tamamen bağımsız katlar oluşturulur. Liste nesnelerinin adları, \"Foldi.Repj\" desenini kullanarak kat üyeliğini belirtecektir; bu, j. çapraz doğrulama setinin (times) i. bölümünü ifade eder. Bu işlev, list = TRUE ve returnTrain = TRUE ile createFolds'u çağırır.</br>\nHyndman ve Athanasopoulos (2013), eğitim ve test setlerini zaman içinde hareket ettiren kaydırmalı tahmin başlangıç tekniklerini tartışmaktadır. createTimeSlices bu tür bir bölme için indeksleri oluşturabilir.</br>\nGrup k-katlı çapraz doğrulama için, veriler, hiçbir grubun hem modelleme hem de tutma setlerinde yer almadığı şekilde bölünür. k'nın değerine bağlı olarak bir veya daha fazla grup dışarıda bırakılabilir.</br>\n<b>Değer</b><br/>\nEğitim verilerine karşılık gelen satır pozisyonu tamsayılarının bir listesi veya matrisidir. createTimeSlices için alt örnekler, her eğitim alt örneğinin son indeksi ile adlandırılır.</br>\n<b>Paket</b></br>\ncaret</br>\nklaR</br>\n<b>Yardım</b></br>\nhelp(createDataPartition, package=\"caret\")\n        "
  }
}