{
  "title": "Konu Eşleştirme",
  "navigation": "Konu Eşleştirme",
  "newdatasetnamelabel": "Eşleşen verileri saklamak için veri seti adı",
  "groupvarlabel": "Durum/kontrol değişkeni (kontrol=daha düşük değer, durum=daha yüksek değer)",
  "notelabel": "Not: Kesin veya kaliper değişkenleri için en az bir değişken belirtmelisiniz",
  "exactvarslabel": "Kesin eşleştirme için değişkenler",
  "calipervarslabel": "Kaliper eşleştirme için değişkenler",
  "caliperslabel": "Kaliper değişkenlerinin virgülle ayrılmış sırasına göre kaliperleri belirtin, örneğin 5, 2",
  "idvarlabel": "Konu ID değişkeni",
  "ratiolabel": "Her durum için kontrol sayısı",
  "help": {
    "title": "Konu Eşleştirme",
    "r_help": "help(matchit, package = 'MatchIt')",
    "body": "\n            Bir dizi durumun 1 veya daha fazla kontrol ile eşleştirildiği en yakın komşu konu eşleştirmesi gerçekleştirir. Bu, durum/kontrol çalışmaları ve eşleştirilmiş kohort çalışmaları için uygundur.\n\t\t\t<br/><br/>\n\t\t\tTam olarak eşleşmesi gereken ve sayısal kaliperler içinde eşleşen değerler desteklenmektedir.\n\t\t\tEşleştirme, değiştirme olmadan yapılır (her konu yalnızca bir kez eşleştirilebilir) ve potansiyel kontroller arasından her durum için veri sırasına göre seçilecektir.\n\t\t\t<br/><br/>\n\t\t\tÇıktı veri seti, orijinal verileri ve iki ek değişken içerecektir: 1) alt sınıf: eşleşen seti tanımlayan bir değişken ve 2) ağırlıklar: istenirse sonraki analizlerde kullanılabilecek bir eşleşme durumu ağırlık değişkeni.\n\t\t\t<br/><br/>\n\t\t\t<b>Eşleşen verileri saklamak için veri seti adı:</b>\n\t\t\t<br/>Eşleşen konu setlerini içeren çıktı veri setinin adı.\n\t\t\t<br/><br/>\n\t\t\t<b>Durum/kontrol değişkeni (kontrol=daha düşük değer, durum=daha yüksek değer):</b>\n\t\t\t<br/>Durumları ve kontrolleri gösteren değişkenin adı. Sayısal, faktör veya karakter olabilir.  \n\t\t\tEğer sayısal bir değişken ise, bu 0=kontrol, 1=durum olarak kodlanmalıdır. Eğer bir faktör değişkeni ise, daha düşük sıralı seviye kontroller ve daha yüksek sıralı seviye durumlar olacaktır.  \n\t\t\tEğer bir karakter değişkeni ise, daha düşük sıralı değer (alfabetik sıraya göre) kontroller ve daha yüksek sıralı değer (alfabetik sıraya göre) durumlar olacaktır.\n\t\t\tBu nedenle daha güvenli olmak için 0=kontrol, 1=durum olarak kodlamayı öneriyoruz.\n\t\t\t</br><br/>\n\t\t\t<b>Kesin eşleştirme için değişkenler:</b>\n\t\t\t<br/>Durum/kontrol setlerinin tam olarak eşleşmesini istediğiniz değişkenleri belirtin.  \n\t\t\tBu, bir eşleşen set içindeki durumların ve kontrollerin bu değişkenler için tam olarak aynı değerlere sahip olduğu anlamına gelir. Bunlar karakter, tarih, sayısal, faktör veya sıralı değişkenler olabilir.\n\t\t\t<br/><br/>\n\t\t\t<b>Kaliper eşleştirme için değişkenler:</b>\n\t\t\t<br/>Durum/kontrol setlerinin sayısal kaliper değerleri üzerinde eşleşmesini istediğiniz değişkenleri belirtin. Kontroller, bu değişkenler için belirtilen kaliper genişliği içinde olacaktır.\n\t\t\tBunlar sayısal veya tarih değişkenleri olabilir. Her kaliper değişkeninin bir kaliper değeri belirtilmelidir.\n\t\t\t<br/><br/>\n\t\t\t<b>Kaliper değişkenlerinin virgülle ayrılmış sırasına göre kaliperleri belirtin:</b>\n\t\t\t<br/>Kaliper değişkenlerinin sırasına göre her bir kaliper değişkeni için sayısal kaliper değerlerini belirtin.  \n\t\t\tÖrneğin, yaş (yıl cinsinden) 5 kaliper ile belirtilmişse, bu, kontrollerin eşleşen durumlarının +/- 5 yıl içinde olması gerektiği anlamına gelir.\n\t\t\tHer kaliper değişkeninin bir kaliper değeri belirtilmelidir. Eğer kaliper değişkeni yoksa, bu alan boş olmalıdır.\n\t\t\t<br/><br/>\n\t\t\t<b>Her durum için kontrol sayısı:</b>\n\t\t\t<br/>Bu, her duruma eşleştirilecek maksimum kontrol sayısıdır. Uygun eşleşmeler tanımlanamazsa, bazı eşleşen setler bu değerden daha az olabilir.\n            <br/><br/>\n            <b>Gerekli R paketleri:</b> dplyr, tidyr, MatchIt\n"
  }
}