{
  "title": "İki Y eksenli Çizgi Grafiği",
  "navigation": "İki Y ekseni",
  "x": "X ekseni",
  "y": "Y1 ekseni, sayısal bir değişken belirtin",
  "y2": "Y2 ekseni, sayısal bir değişken belirtin",
  "y1_sf": "Y1 ölçek faktörü",
  "y2_sf": "Y2 ölçek faktörü",
  "help": {
    "title": "Çizgi Grafiği",
    "r_help": "help(geom_line, package=ggplot2)",
    "body": "\n            <b>Açıklama</b></br>\n            Bir çizgi grafiği (sırasına göre bağlı) veya merdiven adımı grafiği oluşturur veya çizgi grafiğini veri kümesindeki noktaların oluşumuna göre sıralar. İstediğiniz çizgi grafiği türüne karşılık gelen sekmeye tıklayın.</br>\n            Çizgi grafiği (sırasına göre bağlı): Bir çizgi grafiği, x ve y koordinatları tarafından tanımlanan noktalar üzerinden bir çizgi çizer ve bunları x eksenindeki değişkenlerin sırasına göre bağlar. Bir renk bir faktör değişkenine ayarlandığında, noktalar renge göre gruplandırılır ve her renk grubu için ayrı bir çizgi oluşturulur. İsteğe bağlı olarak bir faktör değişkeni belirterek yüzeyler oluşturabilirsiniz. Ayrıca temaları isteğe bağlı olarak belirtebilir ve x ve y eksenleri için bir başlık ve etiketler belirtebilirsiniz.</br>\n            Merdiven adımı grafiği: Bir çizgi grafiği, x ve y koordinatları tarafından tanımlanan noktalar üzerinden bir çizgi çizer ve değişikliklerin tam olarak ne zaman gerçekleştiğini vurgulayan bir merdiven adımı grafiği oluşturur. Bir renk bir faktör değişkenine ayarlandığında, noktalar renge göre gruplandırılır ve her renk grubu için ayrı bir çizgi oluşturulur. İsteğe bağlı olarak bir faktör değişkeni belirterek yüzeyler oluşturabilirsiniz. Ayrıca temaları isteğe bağlı olarak belirtebilir ve x ve y eksenleri için bir başlık ve etiketler belirtebilirsiniz.</br>\n            Oluşuma göre sıralı: Bir çizgi grafiği, x ve y koordinatları tarafından tanımlanan noktalar üzerinden bir çizgi çizer ve bunları veri kümesindeki değişkenlerin oluşum sırasına göre bağlar. Bir renk bir faktör değişkenine ayarlandığında, noktalar renge göre gruplandırılır ve her renk grubu için ayrı bir çizgi oluşturulur. İsteğe bağlı olarak bir faktör değişkeni belirterek yüzeyler oluşturabilirsiniz. Ayrıca temaları isteğe bağlı olarak belirtebilir ve x ve y eksenleri için bir başlık ve etiketler belirtebilirsiniz.</br>\n            <br/>\n            <b>Kullanım</b>\n            <br/>\n            <code> \n            #Çizgi grafiği<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_line( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"... için Çizgi grafiği\")<br/>\n            #Merdiven adımı grafiği<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_step( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"... için Çizgi grafiği\")<br/>\n            #Oluşuma göre sıralı<br/>\n            ggplot(data=Dataset2,aes(x =var1,y =var2)) +\n             geom_path( stat = \"identity\",position = \"identity\",aes (color = var3),alpha=0.5) +\n             labs(x =\"var1\",y =\"var2\",title= \"... için Çizgi grafiği\")\n            </code> <br/>\n            <b>Argümanlar</b><br/>\n            <ul>\n            <li>\n            data: Varsayılan veri kümesi​\n            </li>\n            <li>\n            aes(): Verilerdeki değişkenlerin görsel özelliklere (estetik) nasıl eşlendiğini tanımlayan estetik eşlemeleri oluşturur.​\n            </li>\n            <li>\n            x: Sayısal veya faktör değişkeni\n            </li>\n            <li>\n            y: y ekseninde noktaların çizildiği sayısal/ölçek değişkeni​\n            </li>\n            <li>\n            color: Noktaları gruplamak için isteğe bağlı bir faktör değişkeni (renge göre)​\n            </li>\n            <li>\n            labs(): Eksen etiketlerini ve efsane başlıklarını değiştirir (bu isteğe bağlıdır)​\n            </li>\n            <li>\n            facet_grid(): Panelleri bir ızgarada düzenler (bu isteğe bağlıdır)​\n            </li>\n            <li>\n            theme_calc(): Hesap makinesi temasını belirtir (bu isteğe bağlıdır)​\n            </li>\n            <li>\n            geom_line(): x değerine göre sıralı gözlemleri bağlar, x'e bakın:​\n            </li>\n            <li>\n            coord_flip(): Eksenleri çevirir (bu isteğe bağlıdır)​\n            </li>\n            </ul>\n            <b>Paket</b></br>\n            ggplot2;ggthemes;</br>\n            <b>Yardım</b></br>\n            #Çizgi grafiği\n            help(geom_line, package='ggplot2')\n            #Çizgi grafiği merdiven adımı\n            help(geom_step, package=ggplot2)\n            #Değişken sırası\n            help(geom_path, package='ggplot2')\n            Diğer: Ayrıntılı R yardımı almak için R Yardım düğmesine tıklayın. Ayrıca help(labs), help(geom_line), help(aes), help(facet_grid), help(theme_calc), help(coord_flip) yazabilirsiniz.​            \n    "
  }
}