{
  "title": "Varyans Şişirme Faktörleri",
  "navigation": "VIF",
  "modelselector1": "Aşağıdaki sınıflardan bir model seçin (parantez içindeki sınıf) Doğrusal model (lm), Genelleştirilmiş doğrusal modeller (glm), Sıralı Lojistik veya Probit Regresyon (polr), Çoklu Log-Doğrusal Modeller (multinom), Hayatta Kalma (coxph)",
  "help": {
    "title": "Varyans Şişirme Faktörleri",
    "r_help": "help(vif, package='car')",
    "body": "\n                <b>Açıklama</b></br>\nDoğrusal, genelleştirilmiş doğrusal ve diğer modeller için varyans-şişirme ve genelleştirilmiş varyans-şişirme faktörlerini hesaplar.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code> \nvif(mod, ...)\n## Varsayılan S3 yöntemi:\nvif(mod, ...)\n## 'merMod' sınıfı için S3 yöntemi\nvif(mod, ...)\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nmod: varsayılan yöntem için, coef, vcov ve model.matrix'e yanıt veren bir nesne, örneğin bir lm veya glm nesnesi.\n</li>\n<li>\n... kullanılmaz.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nAğırlıksız bir doğrusal modelde tüm terimlerin 1 df'si varsa, o zaman olağan varyans-şişirme faktörleri hesaplanır.</br>\nAğırlıksız bir doğrusal modelde herhangi bir terimin 1 df'den fazla varsa, o zaman genelleştirilmiş varyans-şişirme faktörleri (Fox ve Monette, 1992) hesaplanır. Bunlar, terimin katsayıları için güven elipsinin veya elipsoidin boyutundaki şişirmeyi, ortogonal verilere göre elde edilecek olanla karşılaştırıldığında yorumlanabilir.</br>\nGenelleştirilmiş vif'ler, modeldeki terimlerin kodlamasına göre değişmez (model matrisinin her terime ait sütunlarının alt uzayı değişmez olduğu sürece). Güven elipsoidi boyutunu ayarlamak için, fonksiyon ayrıca GVIF^[1/(2*df)]'yi yazdırır; burada df, terimle ilişkili serbestlik dereceleridir.</br>\nDaha ileri bir genelleştirme ile, buradaki uygulama, özellikle ağırlıklı doğrusal modeller, genelleştirilmiş doğrusal modeller ve karışık etkili modeller için de geçerlidir.</br>\n<b>Değer</b><br/>\nBir vifs vektörü veya modeldeki her terim için bir satır ve GVIF, df ve GVIF^[1/(2*df)] için sütunlar içeren bir matris.<br/>\n<b>Örnekler</b><br/>\n<code> \n## Saçma bir örnek...\nvif(lm(prestige ~ income + education, data=Duncan))\nvif(lm(prestige ~ income + education + type, data=Duncan))\n</code> <br/>\n<b>Paket</b></br>\ncar</br>\n<b>Yardım</b></br>\nDetaylı yardım için bu diyalog üst katmanının sağ üst köşesindeki R simgesine tıklayın veya R sözdizimi editöründe aşağıdaki komutu çalıştırın help(vif, package=\"car\")\n                "
  }
}