{
  "title": "Wilcoxon İşaretli Sıra Testi, bir örnek",
  "navigation": "Wilcoxon Testi, bir örnek",
  "tvarbox1": "Sonuç",
  "label1": "Alternatif Hipotez",
  "twosided": "Medyan != mu",
  "greater": "Medyan > mu",
  "less": "Medyan < mu",
  "label2": "Test Yöntemi",
  "default": "Varsayılan",
  "exact": "Tam",
  "normal": "Normal Yaklaşım",
  "contingency": "Normal Yaklaşım (Süreklilik düzeltmesi)",
  "textbox1": "Güven aralığı",
  "textbox2": "Null hipotezi (mu)",
  "help": {
    "title": "Wilcoxon Testi, bir örnek",
    "r_help": "help(wilcox.test, package=stats)",
    "body": "\n<b>Açıklama</b></br>\nVeri vektörleri üzerinde bir ve iki örnek Wilcoxon testleri gerçekleştirir; ikincisi aynı zamanda 'Mann-Whitney' testi olarak da bilinir.\n<br/>\n<b>Kullanım</b>\n<br/>\n<code>\nwilcox.test(x, ...)<br/>\n## Varsayılan S3 yöntemi:<br/>\nwilcox.test(x, y = NULL,<br/>\n            alternative = c(\"two.sided\", \"less\", \"greater\"),<br/>\n            mu = 0, paired = FALSE, exact = NULL, correct = TRUE,<br/>\n            conf.int = FALSE, conf.level = 0.95, ...)<br/>\n## 'formül' sınıfı için S3 yöntemi<br/>\nwilcox.test(formula, data, subset, na.action, ...)<br/>\n</code> <br/>\n<b>Argümanlar</b><br/>\n<ul>\n<li>\nx: veri değerlerinin sayısal vektörü. Sonlu olmayan (örneğin, sonsuz veya eksik) değerler hariç tutulacaktır.\n</li>\n<li>\ny: isteğe bağlı bir sayısal veri değerleri vektörü: x ile birlikte sonlu olmayan değerler hariç tutulacaktır.\n</li>\n<li>\nalternative: alternatif hipotezi belirten bir karakter dizesi, \"two.sided\" (varsayılan), \"greater\" veya \"less\" olmalıdır. Sadece ilk harfi belirtebilirsiniz.\n</li>\n<li>\nmu: null hipotezini oluşturmak için kullanılan isteğe bağlı bir parametreyi belirten bir sayı. 'Ayrıntılar'a bakın.\n</li>\n<li>\npaired: eşleştirilmiş bir test isteyip istemediğinizi belirten mantıksal bir değer.\n</li>\n<li>\nexact: tam bir p-değeri hesaplanıp hesaplanmayacağını belirten mantıksal bir değer.\n</li>\n<li>\ncorrect: p-değeri için normal yaklaşımda süreklilik düzeltmesinin uygulanıp uygulanmayacağını belirten mantıksal bir değer.\n</li>\n<li>\nconf.int: bir güven aralığının hesaplanıp hesaplanmayacağını belirten mantıksal bir değer.\n</li>\n<li>\nconf.level: aralığın güven düzeyi.\n</li>\n<li>\nformula: lhs ~ rhs biçiminde bir formül, burada lhs veri değerlerini veren sayısal bir değişken ve rhs karşılık gelen grupları veren iki seviyeli bir faktördür.\n</li>\n<li>\ndata: formül içindeki değişkenleri içeren isteğe bağlı bir matris veya veri çerçevesi (veya benzeri: model.frame'e bakın). Varsayılan olarak değişkenler environment(formula)'dan alınır.\n</li>\n<li>\nsubset: kullanılacak gözlemlerin isteğe bağlı bir alt kümesini belirten bir vektör.\n</li>\n<li>\nna.action: verilerde NAs olduğunda ne olacağını belirten bir işlev. Varsayılan olarak getOption(\"na.action\").\n</li>\n<li>\n...: yöntemlere iletilmek üzere daha fazla argüman.\n</li>\n</ul>\n<b>Ayrıntılar</b></br>\nFormül arayüzü yalnızca 2 örnek testleri için geçerlidir.</br>\nEğer yalnızca x verilirse veya hem x hem de y verilirse ve paired TRUE ise, x'in dağılımının (bir örnek durumunda) veya x - y'nin (eşleştirilmiş iki örnek durumunda) mu etrafında simetrik olduğu null hipotezinin Wilcoxon işaretli sıra testi gerçekleştirilir.</br>\nAksi takdirde, eğer hem x hem de y verilirse ve paired FALSE ise, Wilcoxon sıra toplam testi (Mann-Whitney testine eşdeğer: Not'a bakın) gerçekleştirilir. Bu durumda, null hipotezi x ve y'nin dağılımlarının mu kadar bir konum kayması ile farklı olduğu ve alternatifin başka bir konum kayması ile farklı olduğu (ve tek taraflı alternatif \"greater\" x'in y'nin sağında kaydırıldığı) şeklindedir.</br>\nVarsayılan olarak (eğer exact belirtilmemişse), örnekler 50'den az sonlu değer içeriyorsa ve hiç bağ yoksa tam bir p-değeri hesaplanır. Aksi takdirde, normal bir yaklaşım kullanılır.</br>\nİsteğe bağlı olarak (eğer conf.int argümanı doğruysa), parametrik olmayan bir güven aralığı ve bir tahmin edici hesaplanır (bir örnek durumu) veya konum parametrelerinin x-y farkı için hesaplanır. (Bir dağılım F'nin pseudomedyanı, (u+v)/2 dağılımının medyanıdır, burada u ve v bağımsızdır, her biri F dağılımına sahiptir. Eğer F simetrikse, o zaman pseudomedyan ve medyan örtüşür. Hollander & Wolfe (1973), sayfa 34'e bakın.) İki örnek durumunda, konum parametrelerindeki farkın tahmin edicisi, medyanlardaki farkı tahmin etmez (yaygın bir yanlış anlama) ancak x ve y'den bir örnek ile bir örnek arasındaki farkın medyanını tahmin eder.</br>\nEğer tam p-değerleri mevcutsa, Bauer (1972) tarafından tanımlanan algoritma ile tam bir güven aralığı elde edilir ve Hodges-Lehmann tahmin edicisi kullanılır. Aksi takdirde, döndürülen güven aralığı ve nokta tahmini normal yaklaşımlara dayanmaktadır. Bunlar aralık için süreklilik düzeltmesi uygulanır ancak tahmin için değil (çünkü düzeltme alternatifine bağlıdır).</br>\nKüçük örneklerde çok yüksek güven aralığı kapsama oranlarına ulaşmak mümkün olmayabilir. Eğer bu olursa, bir uyarı verilecektir ve daha düşük kapsama oranına sahip bir aralık ile değiştirilir.</br>\n<b>Değer</b><br/>\n\"htest\" sınıfına sahip bir liste, aşağıdaki bileşenleri içerir:\nistatistik: test istatistiğinin değeri ile onu tanımlayan bir ad.</br>\nparametre: test istatistiğinin tam dağılımı için parametre(ler).</br>\np.değeri: test için p-değeri.</br>\nnull.değeri: konum parametresi mu.</br>\nalternatif: alternatif hipotezi tanımlayan bir karakter dizesi.</br>\nyöntem: uygulanan test türü.</br>\ndata.ismi: verilerin isimlerini veren bir karakter dizesi.</br>\ngüven.aralığı: konum parametresi için bir güven aralığı. (Sadece conf.int = TRUE argümanı varsa mevcuttur.)</br>\ntahmin: konum parametresinin bir tahmini. (Sadece conf.int = TRUE argümanı varsa mevcuttur.)</br>\n<b>Paket</b></br>\nstats</br>\n<b>Yardım</b></br>\nhelp(wilcox.test, package=stats)\n    "
  }
}